Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# BinaryFormatterDeserializeMaybeWithoutBinderSetTitle
source: Ensure BinaryFormatter.Binder is set before calling BinaryFormatter.Deserialize
cs: Než zavoláte BinaryFormatter.Deserialize, ujistěte se, že je nastavený BinaryFormatter.Binder
de: Festlegung von BinaryFormatter.Binder vor dem Aufruf von BinaryFormatter.Deserialize sicherstellen
es: Asegurarse de que BinaryFormatter.Binder se ha establecido antes de llamar a BinaryFormatter.Deserialize
fr: Vérifiez que BinaryFormatter.Binder est défini avant d'appeler BinaryFormatter.Deserialize
it: Assicurarsi che BinaryFormatter.Binder sia impostato prima di chiamare BinaryFormatter.Deserialize
ja: BinaryFormatter.Deserialize を呼び出す前に BinaryFormatter.Binder が設定されていることを確認する
ko: BinaryFormatter.Deserialize를 호출하기 전에 BinaryFormatter.Binder를 설정해야 합니다.
pl: Upewnij się, że właściwość BinaryFormatter.Binder jest ustawiona przed wywołaniem metody BinaryFormatter.Deserialize
pt_br: Verifique se o BinaryFormatter.Binder está definido antes de chamar o BinaryFormatter.Deserialize
ru: Убедитесь, что BinaryFormatter.Binder задан перед вызовом BinaryFormatter.Deserialize
tr: BinaryFormatter.Deserialize çağırmadan önce BinaryFormatter.Binder öğesinin ayarlandığından emin olun
zh_hans: 请确保在调用 BinaryFormatter.Deserialize 之前设置 BinaryFormatter.Binder
zh_hant: 呼叫 BinaryFormatter.Deserialize 之前，請務必先設定 BinaryFormatter.Binder

# BinaryFormatterDeserializeWithoutBinderSetMessage
source: The method '{0}' is insecure when deserializing untrusted data without a SerializationBinder to restrict the type of objects in the deserialized object graph.
cs: Když se deserializují nedůvěryhodná data bez SerializationBinderu, který omezí typ objektu v grafu deserializovaných objektů, není metoda {0} bezpečná.
de: Die Methode "{0}" ist unsicher, wenn nicht vertrauenswürdige Daten deserialisiert werden, ohne dass der Typ von Objekten im deserialisierten Objektgraphen durch einen SerializationBinder beschränkt wird.
es: El método "{0}" no es seguro cuando se deserializan datos que no son de confianza sin un elemento SerializationBinder para restringir el tipo de objetos en el grafo de objetos deserializado.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables sans SerializationBinder pour restreindre le type des objets dans le graphe d'objets désérialisé.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili senza un elemento SerializationBinder per limitare il tipo di oggetti nel grafico di oggetti deserializzato.
ja: SerializationBinder なしで信頼されていないデータを逆シリアル化して、逆シリアル化されたオブジェクト グラフ内でオブジェクトの型を制限する場合、メソッド '{0}' は安全ではありません。
ko: 역직렬화된 개체 그래프에서 개체 형식을 제한하기 위해 SerializationBinder 없이 신뢰할 수 없는 데이터를 역직렬화하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” nie jest bezpieczna podczas deserializowania niezaufanych danych bez użycia elementu SerializationBinder w celu ograniczenia typu obiektów w zdeserializowanym grafie obiektów.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis sem um SerializationBinder para restringir o tipo de objetos no grafo de objetos desserializado.
ru: Метод "{0}" является небезопасным при десериализации ненадежных данных без использования SerializationBinder для ограничения типа объектов в графе десериализованных объектов.
tr: Güvenilmeyen veriler, seri durumdan çıkarılmış nesne grafındaki nesnelerin türünü kısıtlamak için SerializationBinder kullanılmadan seri durumdan çıkarılırken '{0}' yöntemi güvenli değildir.
zh_hans: 在不使用 SerializationBinder 的情况下对不受信任的数据进行反序列化，以限制反序列化对象图中的对象类型时，方法“{0}”不安全。
zh_hant: 將未受信任的資料還原序列化時，若沒有使用 SerializationBinder 來限制已還原序列化物件圖中的物件類型，方法 '{0}' 就不安全。

# BinaryFormatterDeserializeWithoutBinderSetTitle
source: Do not call BinaryFormatter.Deserialize without first setting BinaryFormatter.Binder
cs: Nevolat BinaryFormatter.Deserialize dříve, než se nastaví BinaryFormatter.Binder
de: BinaryFormatter.Deserialize nicht ohne Festlegung von BinaryFormatter.Binder aufrufen
es: No llame a BinaryFormatter.Deserialize sin establecer primero BinaryFormatter.Binder
fr: N'appelez pas BinaryFormatter.Deserialize sans avoir défini d'abord BinaryFormatter.Binder
it: Non chiamare BinaryFormatter.Deserialize senza aver prima impostato BinaryFormatter.Binder
ja: BinaryFormatter.Binder を設定せずに BinaryFormatter.Deserialize を呼び出さない
ko: 먼저 BinaryFormatter.Binder를 설정하지 않고 BinaryFormatter.Deserialize를 호출하지 마세요.
pl: Nie wywołuj metody BinaryFormatter.Deserialize bez uprzedniego ustawienia właściwości BinaryFormatter.Binder
pt_br: Não chame BinaryFormatter.Deserialize sem primeiro definir BinaryFormatter.Binder
ru: Не вызывайте BinaryFormatter.Deserialize, не задав предварительно BinaryFormatter.Binder
tr: İlk olarak BinaryFormatter.Binder öğesini ayarlamadan önce BinaryFormatter.Deserialize çağırmayın
zh_hans: 在未设置 BinaryFormatter.Binder 的情况下，请不要调用 BinaryFormatter.Deserialize
zh_hant: 未先設定 BinaryFormatter.Binder 之前，請勿呼叫 BinaryFormatter.Deserialize

# BinaryFormatterMethodUsedDescription
source: The method '{0}' is insecure when deserializing untrusted data. If you need to instead detect BinaryFormatter deserialization without a SerializationBinder set, then disable rule CA2300, and enable rules CA2301 and CA2302.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná. Pokud místo toho potřebujete zjišťovat deserializaci BinaryFormatteru bez nastaveného SerializationBinderu, zakažte pravidlo CA2300 a povolte pravidla CA2301 a CA2302.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher. Wenn Sie stattdessen die BinaryFormatter-Deserialisierung ohne Festlegung von SerializationBinder erkennen müssen, deaktivieren Sie die Regel "CA2300", und aktivieren Sie die Regeln "CA2301" und "CA2302".
es: El método "{0}" no es seguro cuando se deserializan datos que no son de confianza. Si necesita detectar la deserialización de BinaryFormatter sin establecer un elemento SerializationBinder, deshabilite la regla CA2300 y habilite las reglas CA2301 y CA2302.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables. Si vous devez plutôt détecter la désérialisation BinaryFormatter sans avoir défini SerializationBinder, désactivez la règle CA2300, puis activez les règles CA2301 et CA2302.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili. Se invece è necessario rilevare la deserializzazione di BinaryFormatter senza un elemento SerializationBinder impostato, disabilitare la regola CA2300 e abilitare le regole CA2301 e CA2302.
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません。代わりに、SerializationBinder が設定されていない BinaryFormatter 逆シリアル化を検出する必要がある場合、ルール CA2300 を無効にし、ルール CA2301 と CA2302 を有効にします。
ko: 신뢰할 수 없는 데이터를 deserialize할 경우 '{0}' 메서드는 안전하지 않습니다. SerializationBinder를 설정하지 않고 BinaryFormatter deserialization을 검색해야 하는 경우에는 규칙 CA2300을 사용하지 않도록 설정하고 규칙 CA2301 및 CA2302를 사용하도록 설정합니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializowania niezaufanych danych. Aby zamiast tego wykryć deserializację klasy BinaryFormatter bez ustawionego elementu SerializationBinder, wyłącz regułę CA2300 i włącz reguły CA2301 i CA2302.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis. Se, nesse caso, você precisar detectar a desserialização de BinaryFormatter sem um conjunto de SerializationBinder, desabilite a regra CA2300 e habilite as regras CA2301 e CA2302.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных. Если вместо этого нужно обнаружить десериализацию BinaryFormatter без задания SerializationBinder, отключите правило CA2300 и включите правила CA2301 и CA2302.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil. Bunun yerine SerializationBinder ayarlanmadan BinaryFormatter seri durumdan çıkarma işlemi algılamanız gerekiyorsa, CA2300 kuralını devre dışı bırakıp CA2301 ve CA2302 kurallarını etkinleştirin.
zh_hans: 反序列化不受信任的数据时，方法“{0}”不安全。如果需要在未设置 SerializationBinder 的情况下改为检测 BinaryFormatter 反序列化，则请禁用 CA2300 规则，并启用 CA2301 和 CA2302 规则。
zh_hant: 將不受信任的資料還原序列化時，方法 '{0}' 不安全。如果您需要改為偵測 BinaryFormatter 還原序列化，而不想要設定 SerializationBinder，則請停用規則 CA2300，並啟用規則 CA2301 和 CA2302。

# BinaryFormatterMethodUsedMessage
source: The method '{0}' is insecure when deserializing untrusted data.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili.
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません。
ko: 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil.
zh_hans: 对不受信任的数据进行反序列化时，方法“{0}”不安全。
zh_hant: 將不受信任的資料還原序列化時，方法 '{0}' 不安全。

# BinaryFormatterMethodUsedTitle
source: Do not use insecure deserializer BinaryFormatter
cs: Nepoužívat nezabezpečený deserializátor BinaryFormatter
de: Nicht den unsicheren BinaryFormatter zur Deserialisierung verwenden
es: No usar el deserializador no seguro BinaryFormatter
fr: Ne pas utiliser le désérialiseur non sécurisé BinaryFormatter
it: Non usare il deserializzatore non sicuro BinaryFormatter
ja: 安全でないデシリアライザー BinaryFormatter を使用しない
ko: 안전하지 않은 역직렬 변환기 BinaryFormatter를 사용하지 마세요.
pl: Nie używaj niezabezpieczonego deserializatora BinaryFormatter
pt_br: Não use o desserializador BinaryFormatter não seguro
ru: Не используйте небезопасный десериализатор BinaryFormatter
tr: Güvenli olmayan seri kaldırıcı BinaryFormatter kullanmayın
zh_hans: 请勿使用不安全的反序列化程序 BinaryFormatter
zh_hant: 請勿使用不安全的還原序列化程式 BinaryFormatter

# BufferBlockCopyDescription
source: 'Buffer.BlockCopy' expects the number of bytes to be copied for the 'count' argument. Using 'Array.Length' may not match the number of bytes that needs to be copied.
cs: Buffer.BlockCopy očekává počet bajtů, které se mají zkopírovat pro argument count. Použití array.Length se nemusí shodovat s počtem bajtů, které je potřeba zkopírovat.
de: "Buffer.BlockCopy" erwartet die Anzahl von Bytes, die für das Argument "count" kopiert werden sollen. Die Verwendung von "Array.Length" stimmt möglicherweise nicht mit der Anzahl zu kopierender Bytes überein.
es: 'Buffer.BlockCopy' espera que se copie el número de bytes para el argumento 'count'. El uso de 'Array.Length' puede no coincidir con el número de bytes que se deben copiar.
fr: 'Buffer. BlockCopy’ s’attend à ce que le nombre d’octets soient copiés pour l’argument ’Count'. L’utilisation de’Array. Length’ peut ne pas correspondre au nombre d’octets qui doivent être copiés.
it: Con 'Buffer.BlockCopy' è previsto il numero di byte da copiare per l'argomento 'count'. Se si usa 'Array.Length', il numero di byte da copiare potrebbe non corrispondere.
ja: 'Buffer.BlockCopy' では、'count' 引数にコピーされるバイト数が必要です。'Array.Length' を使用すると、コピーする必要があるバイト数と一致しない可能性があります。
ko: 'Buffer.BlockCopy'는 'count' 인수에 대해 복사할 바이트 수를 예상합니다. 'Array.Length'를 사용하면 복사해야 하는 바이트 수가 일치하지 않을 수 있습니다.
pl: Element „Buffer.BlockCopy” oczekuje, że liczba bajtów zostanie skopiowana dla argumentu „count”. Użycie elementu „Array.Length” może nie odpowiadać liczbie bajtów, które należy skopiować.
pt_br: 'Buffer.BlockCopy' espera o número de bytes a serem copiados para o argumento 'count'. O uso de 'Array.Length' pode não corresponder ao número de bytes que precisam ser copiados.
ru: "Buffer.BlockCopy" ожидает копирования количества байт для аргумента "count". При использовании "Array.Length" может не обеспечиваться соответствие количеству байт, которое требуется скопировать.
tr: 'Buffer.BlockCopy', 'count' bağımsız değişkeni için kopyalanacak bayt sayısını bekler. 'Array.Length' kullanmak, kopyalanması gereken bayt sayısıyla eşleşmeyebilir.
zh_hans: “Buffer.BlockCopy” 需要为 “count” 参数复制字节数。使用 “Array.Length” 可能与需要复制的字节数不匹配。
zh_hant: 'Buffer.BlockCopy' 應該有要針對 'count' 引數複製的位元組數。使用 'Array.Length' 可能不符合需要複製的位元組數。

# BufferBlockCopyLengthMessage
source: 'Buffer.BlockCopy' expects the number of bytes to be copied for the 'count' argument. Using 'Array.Length' may not match the number of bytes that needs to be copied.
cs: Buffer.BlockCopy očekává počet bajtů, které se mají zkopírovat pro argument count. Použití array.Length se nemusí shodovat s počtem bajtů, které je potřeba zkopírovat.
de: "Buffer.BlockCopy" erwartet die Anzahl von Bytes, die für das Argument "count" kopiert werden sollen. Die Verwendung von "Array.Length" stimmt möglicherweise nicht mit der Anzahl zu kopierender Bytes überein.
es: 'Buffer.BlockCopy' espera que se copie el número de bytes para el argumento 'count'. El uso de 'Array.Length' puede no coincidir con el número de bytes que se deben copiar.
fr: 'Buffer. BlockCopy’ s’attend à ce que le nombre d’octets soient copiés pour l’argument ’Count'. L’utilisation de’Array. Length’ peut ne pas correspondre au nombre d’octets qui doivent être copiés.
it: Con 'Buffer.BlockCopy' è previsto il numero di byte da copiare per l'argomento 'count'. Se si usa 'Array.Length', il numero di byte da copiare potrebbe non corrispondere.
ja: 'Buffer.BlockCopy' では、'count' 引数にコピーされるバイト数が必要です。'Array.Length' を使用すると、コピーする必要があるバイト数と一致しない可能性があります。
ko: 'Buffer.BlockCopy'는 'count' 인수에 대해 복사할 바이트 수를 예상합니다. 'Array.Length'를 사용하면 복사해야 하는 바이트 수가 일치하지 않을 수 있습니다.
pl: Element „Buffer.BlockCopy” oczekuje, że liczba bajtów zostanie skopiowana dla argumentu „count”. Użycie elementu „Array.Length” może nie odpowiadać liczbie bajtów, które należy skopiować.
pt_br: 'Buffer.BlockCopy' espera o número de bytes a serem copiados para o argumento 'count'. O uso de 'Array.Length' pode não corresponder ao número de bytes que precisam ser copiados.
ru: "Buffer.BlockCopy" ожидает копирования количества байт для аргумента "count". При использовании "Array.Length" может не обеспечиваться соответствие количеству байт, которое требуется скопировать.
tr: 'Buffer.BlockCopy', 'count' bağımsız değişkeni için kopyalanacak bayt sayısını bekler. 'Array.Length' kullanmak, kopyalanması gereken bayt sayısıyla eşleşmeyebilir.
zh_hans: “Buffer.BlockCopy” 需要为 “count” 参数复制字节数。使用 “Array.Length” 可能与需要复制的字节数不匹配。
zh_hant: 'Buffer.BlockCopy' 應該有要針對 'count' 引數複製的位元組數。使用 'Array.Length' 可能不符合需要複製的位元組數。

# BufferBlockCopyLengthTitle
source: 'Buffer.BlockCopy' expects the number of bytes to be copied for the 'count' argument
cs: Buffer.BlockCopy očekává počet bajtů, které se mají zkopírovat pro argument count.
de: "Buffer.BlockCopy" erwartet die Anzahl von Bytes, die für das Argument "count" kopiert werden sollen
es: 'Buffer.BlockCopy' espera que se copie el número de bytes para el argumento 'count'
fr: 'Buffer. BlockCopy’ s’attend à ce que le nombre d’octets soient copiés pour l’argument’Count'
it: Con 'Buffer.BlockCopy' è previsto il numero di byte da copiare per l'argomento 'count'.
ja: 'Buffer.BlockCopy' では、'count' 引数にコピーされるバイト数が必要です
ko: 'Buffer.BlockCopy'는 'count' 인수에 대해 복사할 바이트 수를 예상합니다.
pl: Element „Buffer.BlockCopy” oczekuje skopiowania liczby bajtów dla argumentu „count”
pt_br: 'Buffer.BlockCopy' espera o número de bytes a serem copiados para o argumento 'count'
ru: "Buffer.BlockCopy" ожидает копирования количества байт для аргумента "count"
tr: 'Buffer.BlockCopy', 'count' bağımsız değişkeni için kopyalanacak bayt sayısını bekliyor
zh_hans: “Buffer.BlockCopy” 需要为 “count” 参数复制字节数
zh_hant: 'Buffer.BlockCopy' 應該有要針對 'count' 引數複製的位元組數

# CallGCSuppressFinalizeCorrectlyDescription
source: A method that is an implementation of Dispose does not call GC.SuppressFinalize; or a method that is not an implementation of Dispose calls GC.SuppressFinalize; or a method calls GC.SuppressFinalize and passes something other than this (Me in Visual Basic).
cs: Metoda, která je implementací metody Dispose, nevolá GC.SuppressFinalize, nebo metoda, která není implementací metody Dispose, volá GC.SuppressFinalize, nebo metoda volá GC.SuppressFinalize a předává něco jiného než this (Me v jazyce Visual Basic).
de: Eine Methode, die eine Implementierung von "Dispose" ist, ruft "GC.SuppressFinalize" nicht auf, oder eine Methode, die keine Implementierung von "Dispose" ist, ruft "GC.SuppressFinalize" auf, oder eine Methode ruft "GC.SuppressFinalize" auf und übergibt etwas anderes als dies ("Me" in Visual Basic).
es: Un método que es una implementación de Dispose no llama a GC.SuppressFinalize, o un método que no es una implementación de Dispose llama a GC.SuppressFinalize, o un método llama a GC.SuppressFinalize y pasa algo distinto de "this" (Me en Visual Basic).
fr: Une méthode qui est une implémentation de Dispose n'appelle pas GC.SuppressFinalize. Ou bien, une méthode qui n'est pas une implémentation de Dispose appelle GC.SuppressFinalize. Ou encore, une méthode appelle GC.SuppressFinalize et passe autre chose que this (Me en Visual Basic).
it: Un metodo che è un'implementazione di Dispose non chiama GC.SuppressFinalize, un metodo che non è un'implementazione di Dispose chiama GC.SuppressFinalize oppure un metodo chiama GC.SuppressFinalize e passa un elemento diverso da this (Me in Visual Basic).
ja: Dispose の実装であるメソッドでは GC.SuppressFinalize を呼び出しません。または、Dispose の実装ではないメソッドでは GC.SuppressFinalize を呼び出します。または、メソッドでは GC.SuppressFinalize を呼び出し、this (Visual Basic では Me) 以外のものを渡します。
ko: Dispose를 구현하는 메서드가 GC.SuppressFinalize를 호출하지 않거나, Dispose를 구현하지 않는 메서드가 GC.SuppressFinalize를 호출하거나, 메서드가 GC.SuppressFinalize를 호출하고 다른 개체(Visual Basic의 경우 Me)를 전달합니다.
pl: Implementacja metody Dispose nie wywołuje metody GC.SuppressFinalize lub metoda niebędąca implementacją metody Dispose wywołuje metodę GC.SuppressFinalize lub metoda wywołuje metodę GC.SuppressFinalize i przekazuje coś innego niż obiekt this (Me w języku Visual Basic).
pt_br: Um método que é uma implementação de Descarte não chama GC.SuppressFinalize; um método que não é uma implementação de Descarte chama GC.SuppressFinalize ou um método chama GC.SuppressFinalize e passa algo diferente disso (Me no Visual Basic).
ru: Метод, являющийся реализацией Dispose, не вызывает GC.SuppressFinalize, метод, не являющийся реализацией Dispose, вызывает GC.SuppressFinalize, либо метод вызывает GC.SuppressFinalize и передает нечто иное (Me в Visual Basic).
tr: Dispose uygulaması olan bir metot GC.SuppressFinalize çağrısı yapmıyor, Dispose uygulaması olmayan bir metot GC.SuppressFinalize çağrısı yapıyor ya da bir metot GC.SuppressFinalize çağrısı yapıyor ve this (Visual Basic’te Me) dışında bir şey geçiriyor.
zh_hans: 表示 Dispose 实现的方法没有调用 GC.SuppressFinalize；或不表示 Dispose 实现的方法调用了 GC.SuppressFinalize；或方法调用了 GC.SuppressFinalize 并传递 this (在 Visual Basic 中是 Me)以外的某个值。
zh_hant: 實作 Dispose 的方法，不會呼叫 GC.SuppressFinalize; 或未實作的 Dispose，會呼叫 GC.SuppressFinalize; 或方法會呼叫 GC.SuppressFinalize，並傳遞 'this' (Visual Basic 中為 Me) 以外的項目。

# CallGCSuppressFinalizeCorrectlyMessageNotCalled
source: Change {0} to call {1}. This will prevent derived types that introduce a finalizer from needing to re-implement 'IDisposable' to call it.
cs: Změňte {0} tak, aby volalo %({1}). Díky tomu odvozené typy, které zavádějí finalizační metodu, nebudou muset znovu implementovat rozhraní IDisposable, aby ji mohly zavolat.
de: Ändern Sie "{0}" in den Aufruf von "{1}". So wird vermieden, dass abgeleitete Typen, die einen Finalizer einführen, "IDisposable" neu implementieren müssen, um ihn aufzurufen.
es: Cambie "{0}" para llamar a {1}. Con esto se evitará que los tipos derivados que introducen un finalizador tengan que volver a implementar "IDisposable" para llamarlo.
fr: Changez {0} pour appeler {1}. Cette opération empêche les types dérivés qui introduisent un finaliseur d'avoir à réimplémenter 'IDisposable' pour l'appeler.
it: Cambiare {0} in modo da chiamare {1}. In questo modo si eviterà che i tipi derivati che introducono un finalizzatore debbano eseguire una nuova implementazione di 'IDisposable' per chiamarlo.
ja: {1} を呼び出すように {0} を変更します。これにより、ファイナライザーを導入する派生型で、その呼び出しのために 'IDisposable' を再実装する必要がなくなります。
ko: {0}을(를) 변경하여 {1}을(를) 호출하세요. 이렇게 하면 종료자를 사용하는 파생 형식에서 'IDisposable'을 호출하기 위해 다시 구현하지 않아도 됩니다.
pl: Zmień wywołanie {0} na wywołanie {1}. Zapobiega to konieczności ponownego implementowania interfejsu „IDisposable” przez typy pochodne wprowadzające finalizator.
pt_br: Altere {0} para chamar {1}. Isso impedirá que tipos derivados que introduzem um finalizador precisem reimplementar 'IDisposable' para chamá-lo.
ru: Замените {0} вызовом {1}. В результате для производных типов, использующих метод завершения, отпадет необходимость в повторной реализации "IDisposable" для вызова этого метода.
tr: {0} öğesini {1} çağrısı yapacak şekilde değiştirin. Bu, bir sonlandırıcı sunan türetilmiş türlerin 'IDisposable' çağrısı yapabilmesi için bunu yeniden uygulamak zorunda kalmasını engeller.
zh_hans: 将 {0} 更改为调用 {1}。这将使引入终结器的派生类型无需重新实现 "IDisposable" 即可调用它。
zh_hant: 將 {0} 變更為呼叫 {1}。如此一來，引進完成項的衍生類型即無須重新實作 'IDisposable' 就可呼叫它。

# CallGCSuppressFinalizeCorrectlyMessageNotCalledWithFinalizer
source: Change {0} to call {1}. This will prevent unnecessary finalization of the object once it has been disposed and it has fallen out of scope.
cs: Změňte {0} tak, aby volalo %({1}). To zabrání zbytečné finalizaci objektu poté, co se uvolnil a už není v oboru.
de: Ändern Sie "{0}" in den Aufruf von "{1}". So wird die unnötige Finalisierung des Objekts vermieden, nachdem es verworfen wurde und außerhalb des relevanten Bereichs liegt.
es: Cambie "{0}" para llamar a {1}. Esto evita la finalización no necesaria del objeto una vez que se ha desechado y ha quedado fuera de ámbito.
fr: Changez {0} pour appeler {1}. Cela empêche une finalisation inutile de l'objet une fois qu'il a été supprimé et qu'il est devenu hors de portée.
it: Cambiare {0} in modo da chiamare {1}. In questo modo si impedirà la finalizzazione non necessaria dell'oggetto dopo che è stato eliminato e risulta esterno all'ambito.
ja: {1} を呼び出すように {0} を変更します。これにより、オブジェクトが破棄されてスコープ外になった場合の、不要な終了処理を回避できます。
ko: {0}을(를) 변경하여 {1}을(를) 호출하세요. 이렇게 하면 개체가 삭제되어 범위 외부로 이동된 후에 불필요하게 종료되지 않습니다.
pl: Zmień wywołanie {0} na wywołanie {1}. Zapobiega to niepotrzebnemu finalizowaniu obiektu po jego likwidacji i wyjściu poza zakres.
pt_br: Altere {0} para chamar {1}. Isso impedirá a finalização desnecessária do objeto assim que ele for descartado e sair do escopo.
ru: Замените {0} вызовом {1}. Это предотвратит ненужное завершение объекта после его высвобождения и выхода из области видимости.
tr: {0} öğesini {1} çağrısı yapacak şekilde değiştirin. Bu, nesne atıldıktan ve kapsam dışı kaldıktan sonra nesnenin gereksiz bir biçimde sonlandırılmasını önler.
zh_hans: 将 {0} 更改为调用 {1}。这样可以防止当对象已释放并超出范围时，对该对象进行不必要的终止。
zh_hant: 將 {0} 變更為呼叫 {1}。如此一來，可避免在物件處置過後或不在範圍內時，產生不必要的完成項。
