Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotCompareSpanToDefaultMessage
source: Comparing a span to 'default' might not do what you intended, make the code more explicit by checking 'IsEmpty'
cs: Porovnání rozsahu s hodnotou default nemusí udělat to, co jste zamýšleli. Udělejte kód explicitnějším zaškrtnutím hodnoty IsEmpty.
de: Wenn Sie eine Spanne mit „default“ vergleichen, wird möglicherweise nicht das gewünschte Ergebnis ausgeführt. Machen Sie den Code expliziter, indem Sie „IsEmpty“ überprüfen.
es: Si se compara un intervalo con "default", es posible que no haga lo que esperaba. Haga el código más explícito marcando "IsEmpty".
fr: La comparaison d’une étendue à « default » peut ne pas faire ce que vous avez prévu, rendre le code plus explicite en vérifiant « IsEmpty »
it: Il confronto di un intervallo con "default" potrebbe non eseguire le operazioni previste. Rendere il codice più esplicito selezionando "IsEmpty"
ja: スパンを 'default' と比較すると、意図したとおりに動作しない可能性があります。'IsEmpty' をチェックして、コードをより明示的にしてください
ko: 범위를 'default'로 비교해도 의도한 대로 수행되지 않을 수 있습니다. 'IsEmpty'를 확인하여 코드를 더 명시적으로 만듭니다.
pl: Porównanie rozpiętości do wartości „domyślne” może nie przynieść zamierzonego efektu, dlatego zwiększ jawność kodu, sprawdzając pozycję „IsEmpty”
pt_br: Comparar um intervalo ao "default" pode não fazer o que você pretendia. Torne o código mais explícito verificando "IsEmpty"
ru: Сравнение диапазона со значением "default" может не выполнить желаемое действие. Сделайте код более явным путем проверки "IsEmpty"
tr: Bir aralığı 'default' ile karşılaştırmak, istediğiniz şeyi gerçekleştiremeyebilir, 'IsEmpty' kullanarak kodu daha açık hale getirin
zh_hans: 将范围与“默认值”进行比较可能不会达到预期，请通过勾选 "IsEmpty" 使代码更加明确
zh_hant: 將範圍與 'default' 進行比較，可能無法達到您預期的效果，請檢查 'IsEmpty'，讓程式碼更加明確

# DoNotCompareSpanToNullIsEmptyCodeFixTitle
source: Use 'IsEmpty'
cs: Použijte IsEmpty
de: „IsEmpty“ verwenden
es: Usar "IsEmpty"
fr: Utiliser 'IsEmpty'
it: Usare"IsEmpty"
ja: 'IsEmpty' の使用
ko: 'IsEmpty' 사용
pl: Użyj elementu „IsEmpty”
ru: Использовать "IsEmpty"
tr: 'IsEmpty' kullanın
zh_hans: 使用 "IsEmpty"
zh_hant: 使用 'IsEmpty'

# DoNotCompareSpanToNullMessage
source: Comparing a span to 'null' might be redundant, the 'null' literal will be implicitly converted to a 'Span<T>.Empty'
cs: Porovnávání rozsahu s hodnotou null může být redundantní. Literál null se implicitně převede na Span<T>.Empty.
de: Der Vergleich einer Spanne mit „null“ ist möglicherweise redundant. Das „null“-Literal wird implizit in ein „Span<T>.Empty“ konvertiert.
es: La comparación de un intervalo con "null" puede ser redundante; el literal "null" se convertirá implícitamente en "Span<T>.Empty"
fr: La comparaison d’une étendue à 'null' peut être redondante. Le littéral 'null' est implicitement converti en 'Span<T>.Vide'
it: Il confronto di un'estensione con 'null' potrebbe essere ridondante. Il valore letterale "null" verrà convertito in modo implicito in un elemento "Span<T>.Empty"
ja: スパンを 'null' と比較すると冗長である可能性があります。'null' リテラルは暗黙的に 'Span<T>.Empty' に変換されます。
ko: 범위를 'null'에 비교하면 중복될 수 있습니다. 'null' 리터럴은 암시적으로 'Span<T>.Empty'로 변환됩니다.
pl: Porównanie zakresu z wartością „null”może być nadmiarowe, literał „null” zostanie niejawnie przekonwertowany na literał „Span<T>.Empty”
pt_br: Comparar um intervalo com "null" pode ser redundante, o literal "null" será convertido implicitamente em um "Span<T>.Empty"
ru: Сравнение диапазона с "null" может быть избыточным. Литерал "null" будет неявно преобразован в "Span<T>.Empty"
tr: Bir aralığı 'null' ile karşılaştırmak gereksiz olabilir, 'null' değişmez değeri örtük olarak 'Span<T>.Empty' değerine dönüştürülür.
zh_hans: 将范围与 "null" 进行比较可能是冗余的，"null" 文本将隐式转换为 "Span<T>.Empty"
zh_hant: 將範圍與 'null' 進行比較可能是多餘的，'null' 常值會隱含轉換為 'Span<T>.Empty'

# DoNotCompareSpanToNullOrDefaultDescription
source: Comparing a span to 'null' or 'default' might not do what you intended. 'default' and the 'null' literal are implicitly converted to 'Span<T>.Empty'. Remove the redundant comparison or make the code more explicit by using 'IsEmpty'.
cs: Porovnávání rozsahu s hodnotou null nebo default nemusí udělat to, co jste zamýšleli. Literál default a null se implicitně převedou na Span<T>.Empty. Odeberte redundantní porovnání nebo nastavte kód explicitněji pomocí IsEmpty.
de: Der Vergleich einer Spanne mit „null“ oder „default“ funktioniert möglicherweise nicht wie gewünscht. “default“ und das „null“-Literal werden implizit in „Span<T>.Empty“ konvertiert. Entfernen Sie den redundanten Vergleich, oder machen Sie den Code mithilfe von „IsEmpty“ expliziter.
es: La comparación de un intervalo con "null" o "default" podría no hacer lo que se esperaba. "default" y el literal "null" se convierten implícitamente en "Span<T>.Empty". Quite la comparación redundante o haga el código más explícito mediante "IsEmpty".
fr: La comparaison d’une étendue à « null » ou « default » peut ne pas faire ce que vous avez prévu. 'default' et le littéral 'null' sont implicitement convertis en 'Span<T>. Vide'. Supprimez la comparaison redondante ou rendez le code plus explicite à l’aide de 'IsEmpty'.
it: Il confronto di un intervallo con "null" o "default" potrebbe non eseguire le operazioni previste. Il valore letterale "default" and "null" vengono convertiti in modo implicito in "Span<T>.Empty". Rimuovere il confronto ridondante o rendere il codice più esplicito usando "IsEmpty".
ja: スパンを 'null' または 'default' と比較しても、意図したとおりにならない場合があります。'default' と 'null' リテラルは暗黙的に 'Span<T>.Empty' に変換されます。冗長な比較を削除するか、'IsEmpty' を使用してコードをより明示的にします。
ko: 범위를 'null' 또는 'default'에 비교해도 의도한 대로 수행되지 않을 수 있습니다. 'default'와 'null' 리터럴은 암시적으로 'Span<T>.Empty'로 변환됩니다. 중복 비교를 제거하거나 'IsEmpty'를 사용하여 코드를 더 명시적으로 만듭니다.
pl: Porównanie zakresu z wartością „null” lub „domyślne” może nie działać zgodnie z oczekiwaniami. Literał „domyślne” i literał „null” są niejawnie konwertowane na wartość „Span<T>.Empty”. Usuń nadmiarowe porównanie lub zwiększ jawność kodu, używając elementu „IsEmpty”.
pt_br: Comparar um intervalo com "null" ou "default" pode não fazer o que você pretendia. "default" e o literal "null" são convertidos implicitamente em "Span<T>.Empty". Remova a comparação redundante ou torne o código mais explícito usando "IsEmpty".
ru: Сравнение диапазона с значением "null" или "default" может не выполнить желаемое действие. Литералы "default" и "null" неявно преобразуются в "Span<T>.Empty". Удалите избыточное сравнение или сделайте код более явным с помощью "isEmpty".
tr: Bir aralığı 'null' veya 'default' ile karşılaştırmak, istediğiniz işlemi gerçekleştirmeyebilir. 'default' ve 'null' sabit değeri örtük olarak 'Span<T>.Empty' değerine dönüştürülür. Gereksiz karşılaştırmayı kaldırın veya 'IsEmpty' kullanarak kodu daha açık hale getirin.
zh_hans: 将范围与 "null "或 "default" 进行比较可能不会达到预期。"default" 和 "null" 文本隐式转换为 "Span<T>.Empty"。删除冗余比较，或使用 "IsEmpty" 使代码更加明确。
zh_hant: 將範圍與 'null' 或 'default' 進行比較，可能無法達到您預期的效果。'default' 和 'null' 常值會隱含轉換為 'Span<T>.Empty'。移除多餘的比較，或使用 'IsEmpty' 讓程式碼更明確。

# DoNotCompareSpanToNullOrDefaultTitle
source: Do not compare Span<T> to 'null' or 'default'
cs: Neporovnávejte rozsah Span<T> s hodnotami null nebo default
de: Vergleichen Sie Span<T> nicht mit „null“ oder „default“.
es: No comparar Span<T> con "null" o "default"
fr: Ne pas comparer Span<T> à 'null' ou 'default'
it: Non confrontare l'intervallo<T> con "null" o "default"
ja: Span<T> を 'null' または 'default' と比較しない
ko: Span<T>을(를) 'null' 또는 'default'와 비교하지 마세요.
pl: Nie porównuj wartości Span<T> z wartością „null” lub „domyślne”
pt_br: Não compare Span<T> a "null" ou "default"
ru: Не сравнивать Span<T> со значением "null" или "default"
tr: Span<T> değerini 'null' veya 'default' ile karşılaştırma
zh_hans: 请勿将 Span<T> 与 "null" 或 "default" 进行比较
zh_hant: 請勿將 Span<T> 與 'null' 或 'default' 進行比較

# DoNotCreateTaskCompletionSourceWithWrongArgumentsDescription
source: TaskCompletionSource has constructors that take TaskCreationOptions that control the underlying Task, and constructors that take object state that's stored in the task. Accidentally passing a TaskContinuationOptions instead of a TaskCreationOptions will result in the call treating the options as state.
cs: TaskCompletionSource má konstruktory, které přijímají možnosti TaskCreationOptions určující příslušnou úlohu, a konstruktory, které přijímají stav objektu uložený v úloze. Když se místo TaskCreationOptions omylem předá TaskContinuationOptions, způsobí to, že volání bude možnosti považovat za stav.
de: TaskCompletionSource verfügt über Konstruktoren, die TaskCreationOptions zum Steuern der zugrunde liegenden Aufgabe akzeptieren, und Konstruktoren, die den in der Aufgabe gespeicherten Objektzustand übernehmen. Das versehentliche Übergeben von TaskContinuationOptions anstelle von TaskCreationOptions führt dazu, dass der Aufruf die Optionen als Zustand behandelt.
es: TaskCompletionSource tiene constructores que toman elementos TaskCreationOption para controlar la tarea subyacente y constructores que toman el estado del objeto que se almacena en la tarea. Si se pasa accidentalmente un elemento TaskContinuationOption en lugar de un objeto TaskCreationOption, la llamada trata las opciones como estado.
fr: TaskCompletionSource a des constructeurs qui prennent des TaskCreationOptions qui contrôlent la tâche sous-jacente, et des constructeurs qui prennent l'état d'objet stocké dans la tâche. La transmission accidentelle de TaskContinuationOptions au lieu de TaskCreationOptions entraîne dans l'appel le traitement des options comme des états.
it: TaskCompletionSource include costruttori che accettano enumerazioni TaskCreationOptions che controllano l'attività sottostante e costruttori che accettano lo stato dell'oggetto archiviato nell'attività. Se si passa accidentalmente un'enumerazione TaskContinuationOptions invece di TaskCreationOptions, la chiamata considererà le opzioni come stato.
ja: TaskCompletionSource には、基になるタスクを制御する TaskCreationOptions を使用するコンストラクターと、そのタスクに格納されているオブジェクトの状態を使用するコンストラクターがあります。TaskCreationOptions の代わりに TaskContinuationOptions を誤って渡すと、呼び出しでオプションが状態として処理されます。
ko: TaskCompletionSource에는 기본 작업을 제어하는 TaskCreationOptions를 사용하는 생성자와 이 작업에 저장된 상태 개체를 사용하는 생성자가 있습니다. 실수로 TaskCreationOptions 대신 TaskContinuationOptions를 전달하면 이 옵션을 상태로 처리하는 호출이 발생합니다.
pl: Element TaskCompletionSource ma konstruktory przyjmujące opcje TaskCreationOptions, które kontrolują podstawowe zadanie, oraz konstruktory, które przyjmują stan obiektu przechowywany w zadaniu. Przypadkowe przekazanie opcji TaskContinuationOptions zamiast opcji TaskCreationOptions spowoduje, że wywołanie potraktuje opcje jako stan.
pt_br: TaskCompletionSource tem construtores que assumem o TaskCreationOptions que controla a Tarefa subjacente e construtores que assumem o estado do objeto armazenado na tarefa. Passar acidentalmente um TaskContinuationOptions em vez de um TaskCreationOptions fará com que a chamada trate as opções como estado.
ru: TaskCompletionSource содержит конструкторы, которые принимают TaskCreationOptions, управляющие базовой задачей, и конструкторы, принимающие состояние объекта, которое хранится в задаче. Случайная передача TaskContinuationOptions вместо TaskCreationOptions приведет к вызову, обрабатывающему параметры как состояние.
tr: TaskCompletionSource, temel alınan görevi denetleyen TaskCreationOptions öğesini ve görevde depolanan nesne durumunu alan oluşturucuları alan oluşturucuları içerir. TaskCreationOptions yerine yanlışlıkla TaskContinuationOptions geçirilmesi, çağrının seçenekleri durum olarak değerlendirmesine neden olur.
zh_hans: TaskCompletionSource 具有采用 TaskCreationOptions 的控制基础任务的构造函数，以及采用任务中存储的对象状态的构造函数。如果意外地传递 TaskContinuationOptions 而不是 TaskCreationOptions，会导致调用将选项视为状态。
zh_hant: TaskCompletionSource 有建構函式會採用控制基礎工作的 TaskCreationOptions，也有會採用儲存在工作內物件狀態的建構函式。不小心傳遞了 TaskContinuationOptions 而非 TaskCreationOptions 時，會導致呼叫將選項視為狀態。

# DoNotCreateTaskCompletionSourceWithWrongArgumentsFix
source: Replace TaskContinuationOptions with TaskCreationOptions.
cs: Nahraďte TaskContinuationOptions za TaskCreationOptions.
de: Ersetzen Sie TaskContinuationOptions durch TaskCreationOptions.
es: Reemplace TaskContinuationOptions por TaskCreationOptions.
fr: Remplacez TaskContinuationOptions par TaskCreationOptions.
it: Sostituire TaskContinuationOptions con TaskCreationOptions.
ja: TaskContinuationOptions を TaskCreationOptions に置き換えてください。
ko: TaskContinuationOptions를 TaskCreationOptions로 대체합니다.
pl: Zamień opcje TaskContinuationOptions na opcje TaskCreationOptions.
pt_br: Substitua TaskContinuationOptions por TaskCreationOptions.
ru: Замените TaskContinuationOptions на TaskCreationOptions.
tr: TaskContinuationOptions öğesini TaskCreationOptions ile değiştirin.
zh_hans: 将 TaskContinuationOptions 替换为 TaskCreationOptions。
zh_hant: 以 TaskCreationOptions 取代 TaskContinuationOptions。

# DoNotCreateTaskCompletionSourceWithWrongArgumentsMessage
source: Argument contains TaskContinuationsOptions enum instead of TaskCreationOptions enum
cs: Argument obsahuje výčet TaskContinuationsOptions místo výčtu TaskCreationOptions.
de: Das Argument enthält die TaskContinuationsOptions-Enumeration anstelle der TaskCreationOptions-Enumeration.
es: El argumento contiene la enumeración TaskContinuationsOptions en lugar de la enumeración TaskCreationOptions.
fr: L'argument contient l'enum TaskContinuationsOptions au lieu de l'enum TaskCreationOptions
it: L'argomento contiene l'enumerazione TaskContinuationsOptions invece dell'enumerazione TaskCreationOptions
ja: 引数には、TaskCreationOptions 列挙型ではなく、TaskContinuationsOptions 列挙型が含まれています
ko: 인수에 TaskCreationOptions 열거형이 아닌 TaskContinuationsOptions 열거형이 포함되어 있습니다.
pl: Argument zawiera wyliczenie opcji TaskContinuationsOptions zamiast wyliczenia opcji TaskCreationOptions
pt_br: O argumento contém a enumeração TaskContinuationsOptions em vez da enumeração TaskCreationOptions
ru: Аргумент содержит перечисление TaskContinuationsOptions вместо TaskCreationOptions.
tr: Bağımsız değişken TaskCreationOptions sabit listesi yerine TaskContinuationsOptions sabit listesini içeriyor
zh_hans: 参数包含 TaskContinuationsOptions 枚举而不是 TaskCreationOptions 枚举
zh_hant: 引數內含 TaskContinuationsOptions 列舉，而非 TaskCreationOptions 列舉

# DoNotCreateTaskCompletionSourceWithWrongArgumentsTitle
source: Argument passed to TaskCompletionSource constructor should be TaskCreationOptions enum instead of TaskContinuationOptions enum
cs: Argument předaný konstruktoru TaskCompletionSource by měl být výčet TaskCreationOptions, nikoli výčet TaskContinuationOptions
de: Anstelle einer TaskContinuationOptions-Enumeration muss eine TaskCreationOptions-Enumeration als Argument an den TaskCompletionSource-Konstruktor übergeben werden
es: El argumento pasado al constructor TaskCompletionSource debe ser una enumeración TaskCreationOptions en lugar de TaskContinuationOptions
fr: L'argument passé au constructeur TaskCompletionSource doit être l'enum TaskCreationOptions au lieu de l'enum TaskContinuationOptions
it: L'argomento passato al costruttore TaskCompletionSource deve essere l'enumerazione TaskCreationOptions invece dell'enumerazione TaskContinuationOptions
ja: TaskCompletionSource コンストラクターに渡される引数は、TaskContinuationOptions 列挙型ではなく TaskCreationOptions 列挙型であることが必要
ko: TaskCompletionSource 생성자로 전달된 인수는 TaskContinuationOptions 열거형이 아닌 TaskCreationOptions 열거형이어야 함
pl: Argument przekazany do konstruktora TaskCompletionSource musi być wyliczeniem opcji TaskCreationOptions, a nie wyliczeniem opcji TaskContinuationOptions
pt_br: O argumento passado para o construtor TaskCompletionSource deve ser a enumeração TaskCreationOptions em vez da enumeração TaskContinuationOptions
ru: Аргумент, переданный в конструктор TaskCompletionSource, должен быть перечислением TaskCreationOptions вместо TaskContinuationOptions
tr: TaskCompletionSource oluşturucusuna geçirilen bağımsız değişken, TaskContinuationOptions sabit listesi yerine TaskCreationOptions sabit listesi olmalıdır
zh_hans: 传递到 TaskCompletionSource 构造函数的参数应为 TaskCreationOptions 枚举，而不是 TaskContinuationOptions 枚举
zh_hant: 傳遞到 TaskCompletionSource 建構函式的引數應為 TaskCreationOptions 列舉，而非 TaskContinuationOptions 列舉

# DoNotCreateTasksWithoutPassingATaskSchedulerDescription
source: Do not create tasks unless you are using one of the overloads that takes a TaskScheduler. The default is to schedule on TaskScheduler.Current, which would lead to deadlocks. Either use TaskScheduler.Default to schedule on the thread pool, or explicitly pass TaskScheduler.Current to make your intentions clear.
cs: Nevytvářejte úlohy, pokud nepoužíváte jedno z přetížení, která využívají Plánovač úloh. Výchozí chování je nastavení plánu u TaskScheduler.Current, což by vedlo ke vzájemnému zablokování. Buď použijte TaskScheduler.Default pro nastavení plánu u fondu vláken, nebo explicitně předejte TaskScheduler.Current, aby bylo zcela jasné, co máte v úmyslu.
de: Erstellen Sie Tasks nur dann, wenn Sie eine der Überladungen verwenden, die einen TaskScheduler akzeptieren. Standardmäßig wird mit TaskScheduler.Current geplant, was zu Deadlocks führt. Verwenden Sie entweder TaskScheduler.Default, um für den Threadpool zu planen, oder übergeben Sie TaskScheduler.Current explizit, um Ihre Absicht zu verdeutlichen.
es: No cree tareas a menos que esté utilizando una de las sobrecargas que toma un TaskScheduler. El valor predeterminado es programar en TaskScheduler.Current, lo cual provocaría interbloqueos. Utilice TaskScheduler.Default para programar en el grupo de subprocesos, o pase explícitamente TaskScheduler.Current para que sus intenciones queden claras.
fr: Ne créez pas de tâches sauf si vous utilisez l'une des surcharges qui acceptent TaskScheduler. La valeur par défaut consiste à planifier TaskScheduler.Current, ce qui entraîne des interblocages. Utilisez TaskScheduler.Default pour planifier le pool de threads, ou passez explicitement TaskScheduler.Current pour clarifier vos intentions.
it: Non creare attività a meno che non si usi uno degli overload che accetta un elemento TaskScheduler. L'impostazione predefinita prevede la pianificazione su TaskScheduler.Current, che comporta deadlock. Usare TaskScheduler.Default per eseguire la pianificazione sul pool di thread oppure passare TaskScheduler.Current in modo esplicito per chiarire le proprie intenzioni.
ja: TaskScheduler を受け取るいずれかのオーバーロードを使用しない限り、タスクを作成しません。既定では、TaskScheduler.Current にスケジュールしますが、デッドロックにつながります。TaskScheduler.Default を使用してスレッド プールにスケジュールするか、明示的に TaskScheduler.Current を渡して、意図を明確にします。
ko: TaskScheduler를 사용하는 오버로드 중 하나를 사용하지 않는 경우 작업을 만들지 마세요. 기본값은 TaskScheduler.Current에 예약하는 것이며 이는 교착 상태를 유발할 수 있습니다. 원하는 결과를 얻으려면 스레드 풀에서 TaskScheduler.Default를 사용하여 예약하거나 TaskScheduler.Current를 명시적으로 전달하세요.
pl: Nie twórz zadań, o ile nie używasz jednego z przeciążeń, które akceptuje klasę TaskScheduler. Domyślne zachowanie to określanie harmonogramu przy użyciu metody TaskScheduler.Current, co może prowadzić do blokad. Użyj metody TaskScheduler.Default, aby określić harmonogram w puli wątków, lub jawnie przekaż metodę TaskScheduler.Current, aby wyraźnie wskazać zamiary.
pt_br: Não crie tarefas, a menos que você esteja usando uma das sobrecargas que aceita um TaskScheduler. O padrão é agendar no TaskScheduler.Current, que levaria a deadlocks. Use TaskScheduler.Default para agendar no pool de threads ou passar explicitamente o TaskScheduler.Current para tornar suas intenções claras.
ru: Не создавайте задачи, если не используете одну из перегрузок, принимающих TaskScheduler. По умолчанию расписание составляется с использованием TaskScheduler.Current, что приведет к взаимоблокировкам. Используйте TaskScheduler.Default при составлении расписания для пула потоков либо явно передайте TaskScheduler.Current, чтобы прояснить свои намерения.
tr: Bir TaskScheduler kabul eden aşırı yüklerden birini kullanmıyorsanız görev oluşturmayın. Varsayılan, TaskScheduler.Current üzerinde zamanlamaktır. Bu kilitlenmelere neden olur. İş parçacığı havuzunda zamanlamak için TaskScheduler.Default kullanın veya amacınızı açıklamak için açıkça TaskScheduler.Current geçirin.
zh_hans: 除非使用具有 TaskScheduler 的任一重载，否则不要创建任务。默认是在 TaskScheduler.Current 上进行调度，但这将导致死锁。可使用 TaskScheduler.Default 在线程池上进行调度，或显示传递 TaskScheduler.Current 以明确表达意图。
zh_hant: 建立工作時，請務必使用採用 TaskScheduler 的其中一個多載。預設會在 TaskScheduler.Current 上排程，但如此會造成死結。您可以使用 TaskScheduler.Default 在執行緒集區上進行排程，或明確傳遞 TaskScheduler.Current 以讓目的更加明確。

# DoNotCreateTasksWithoutPassingATaskSchedulerMessage
source: Do not create tasks without passing a TaskScheduler
cs: Nevytvářejte úlohy bez předání Plánovače úloh
de: Keine Tasks ohne Übergabe eines TaskSchedulers erstellen
es: No crear tareas sin pasar un TaskScheduler
fr: Ne pas créer de tâches sans passer TaskScheduler
it: Non creare attività senza passare un elemento TaskScheduler
ja: TaskScheduler を渡さずにタスクを作成しない
ko: TaskScheduler를 전달하지 않은 상태에서 작업을 만들지 마세요.
pl: Nie twórz zadań bez przekazania klasy TaskScheduler
pt_br: Não crie tarefas sem passar um TaskScheduler
ru: Не создавайте задачи без передачи TaskScheduler
tr: Bir TaskScheduler geçirmeden bir görev oluşturmayın
zh_hans: 不要在未传递 TaskScheduler 的情况下创建任务
zh_hant: 建立工作時請務必傳遞 TaskScheduler

# DoNotCreateTasksWithoutPassingATaskSchedulerTitle
source: Do not create tasks without passing a TaskScheduler
cs: Nevytvářejte úlohy bez předání Plánovače úloh
de: Keine Tasks ohne Übergabe eines TaskSchedulers erstellen
es: No crear tareas sin pasar un TaskScheduler
fr: Ne pas créer de tâches sans passer TaskScheduler
it: Non creare attività senza passare un elemento TaskScheduler
ja: TaskScheduler を渡さずにタスクを作成しない
ko: TaskScheduler를 전달하지 않은 상태에서 작업을 만들지 마세요.
pl: Nie twórz zadań bez przekazania klasy TaskScheduler
pt_br: Não crie tarefas sem passar um TaskScheduler
ru: Не создавайте задачи без передачи TaskScheduler
tr: Bir TaskScheduler geçirmeden bir görev oluşturmayın
zh_hans: 不要在未传递 TaskScheduler 的情况下创建任务
zh_hant: 建立工作時請務必傳遞 TaskScheduler
