Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotLockOnObjectsWithWeakIdentityDescription
source: An object is said to have a weak identity when it can be directly accessed across application domain boundaries. A thread that tries to acquire a lock on an object that has a weak identity can be blocked by a second thread in a different application domain that has a lock on the same object.
cs: Objekt má slabou identitu, když se k němu dá přistoupit přímo přes hranice domény aplikace. Vlákno, které se pokusí získat zámek na objekt se slabou identitou, může být zablokováno jiným vláknem v jiné doméně aplikace, které má zámek na stejný objekt.
de: Ein Objekt besitzt eine schwache Identität, wenn es direkt über Anwendungsdomänengrenzen hinweg zugänglich ist. Ein Thread, der versucht, eine Sperre für ein Objekt mit einer schwachen Identität abzurufen, kann von einem zweiten Thread in einer anderen Anwendungsdomäne blockiert werden, der eine Sperre für dasselbe Objekt besitzt.
es: Se dice que un objeto tiene una identidad débil cuando se puede tener acceso a él directamente a través de los límites del dominio de aplicación. Un subproceso que intenta obtener un bloqueo en un objeto que tiene identidad débil se puede bloquear con un segundo subproceso en un dominio de aplicación diferente que tenga bloqueado el mismo objeto.
fr: Un objet a une identité faible quand il est accessible directement indépendamment des limites d'un domaine d'application. Un thread qui essaie d'acquérir un verrou sur un objet qui affiche une identité faible peut être bloqué par un deuxième thread dans un domaine d'application distinct qui dispose d'un verrou sur le même objet.
it: Un oggetto presenta un'identità debole quando è possibile accedervi direttamente attraverso i confini del dominio dell'applicazione. Un thread che prova ad acquisire un blocco su un oggetto con identità debole può essere bloccato da un secondo thread in un altro dominio dell'applicazione che include un blocco sullo stesso oggetto.
ja: オブジェクトは、アプリケーション ドメイン境界を超えて直接アクセスできる場合に、弱い ID を持つと言われます。弱い ID を持つオブジェクトに対するロックを取得しようとするスレッドが、同じオブジェクトに対するロックを持っている別のアプリケーション ドメイン内の 2 番目のスレッドによってブロックされることがあります。
ko: 개체가 약한 ID를 가진 경우는 애플리케이션 도메인 경계에서 해당 개체에 직접 액세스할 수 있을 때를 말합니다. 약한 ID를 가진 개체에 대한 잠금을 획득하려는 스레드는 동일한 개체에 대한 잠금을 획득한 다른 애플리케이션 도메인의 두 번째 스레드로 인해 차단될 수 있습니다.
pl: Obiekt ma słabą tożsamość, gdy jest bezpośrednio dostępny przez granice domeny aplikacji. Wątek próbujący założyć blokadę na obiekt o słabej tożsamości może zostać zablokowany przez drugi wątek w innej domenie aplikacji, który założył blokadę na ten sam obiekt.
pt_br: Diz-se que um objeto tem uma identidade fraca quando ele pode ser acessado diretamente entre os limites de domínio de aplicativo. Um thread que tenta adquirir um bloqueio em um objeto que tem uma identidade fraca pode ser bloqueado por um segundo thread em um domínio de aplicativo diferente que tenha um bloqueio no mesmo objeto.
ru: Слабо идентифицируемым называется объект, к которому можно обратиться напрямую через границы домена приложения. Поток, пытающийся получить блокировку для слабо идентифицируемого объекта, может быть заблокирован вторым потоком в другом домене приложения, получившим блокировку того же объекта.
tr: Bir nesneye uygulama etki alanı sınırları dışından doğrudan erişilebiliyorsa nesnenin zayıf bir kimliğe sahip olduğu söylenir. Zayıf kimlikli bir nesneyi kilitlemeye çalışan bir iş parçacığı, farklı bir uygulama etki alanında bulunan ve aynı nesneyi kilitlemiş ikinci bir iş parçacığı tarafından engellenebilir.
zh_hans: 当可以跨应用程序域边界直接访问对象时，则认为该对象具有弱标识。如果某线程尝试获取具有弱标识的对象上的锁，则该线程可能会被其他应用程序域中持有同一对象的锁的另一线程阻止。
zh_hant: 若可以跨應用程式定義域界限直接存取某個物件，該物件即為弱式識別。嘗試取得弱式識別物件的鎖定之執行緒，有可能會被具有相同物件鎖定之不同應用程式定義域中的第二個執行緒封鎖。

# DoNotLockOnObjectsWithWeakIdentityMessage
source: Do not lock on objects with weak identity
cs: Nepoužívejte zámky na objekty se slabou identitou
de: Auf Objekten mit schwacher Identität nicht sperren
es: No bloquear objetos con identidad débil
fr: Ne pas définir de verrou sur les objets à identité faible
it: Non bloccare oggetti con identità debole
ja: 弱い ID を伴うオブジェクト上でロックしません
ko: 약한 ID를 가진 개체를 잠그지 마세요.
pl: Nie blokuj obiektów o słabej tożsamości
pt_br: Não bloquear objetos com identidade fraca
ru: Не блокируйте слабо идентифицируемые объекты
tr: Zayıf kimliği olan nesneleri kilitlemeyin
zh_hans: 不要锁定具有弱标识的对象
zh_hant: 請勿鎖定弱式識別的物件

# DoNotLockOnObjectsWithWeakIdentityTitle
source: Do not lock on objects with weak identity
cs: Nepoužívejte zámky na objekty se slabou identitou
de: Auf Objekten mit schwacher Identität nicht sperren
es: No bloquear objetos con identidad débil
fr: Ne pas définir de verrou sur les objets à identité faible
it: Non bloccare oggetti con identità debole
ja: 弱い ID を伴うオブジェクト上でロックしません
ko: 약한 ID를 가진 개체를 잠그지 마세요.
pl: Nie blokuj obiektów o słabej tożsamości
pt_br: Não bloquear objetos com identidade fraca
ru: Не блокируйте слабо идентифицируемые объекты
tr: Zayıf kimliği olan nesneleri kilitlemeyin
zh_hans: 不要锁定具有弱标识的对象
zh_hant: 請勿鎖定弱式識別的物件

# DoNotPassLiteralsAsLocalizedParametersDescription
source: A method passes a string literal as a parameter to a constructor or method in the .NET Framework class library and that string should be localizable. To fix a violation of this rule, replace the string literal with a string retrieved through an instance of the ResourceManager class.
cs: Metoda předává jako parametr do konstruktoru nebo metody v knihovně tříd .NET Framework řetězcový literál, který by měl být lokalizovatelný. Pokud chcete porušení tohoto pravidla opravit, nahraďte řetězcový literál řetězcem načteným přes instanci třídy ResourceManager.
de: Eine Methode übergibt ein Zeichenfolgenliteral als Parameter an einen Konstruktor oder eine Methode in der .NET Framework-Klassenbibliothek, und diese Zeichenfolge muss lokalisierbar sein. Um einen Verstoß gegen diese Regel zu beheben, ersetzen Sie das Zeichenfolgenliteral durch eine Zeichenfolge, die durch eine Instanz der ResourceManager-Klasse abgerufen wird.
es: Un método pasa un literal de cadena como parámetro a un constructor o método en la biblioteca de clases .NET Framework y esa cadena debe ser localizable. Para corregir una infracción de esta regla, reemplace el literal de cadena por una cadena recuperada mediante una instancia de la clase ResourceManager.
fr: Une méthode passe un littéral de chaîne en tant que paramètre à un constructeur ou une méthode dans la bibliothèque de classes .NET Framework, et cette chaîne doit être localisable. Pour corriger toute violation de cette règle, remplacez le littéral de chaîne par une chaîne récupérée via une instance de la classe ResourceManager.
it: Un metodo passa un valore letterale stringa come parametro a un costruttore o a un metodo nella libreria di classi .NET Framework e questa stringa deve essere localizzabile. Per correggere una violazione di questa regola, sostituire la stringa letterale con una stringa recuperata attraverso un'istanza della classe ResourceManager.
ja: メソッドは文字列リテラルをパラメーターとして .NET Framework クラス ライブラリ内のコンストラクターまたはメソッドに渡し、その文字列はローカライズ可能である必要があります。このルールの違反を修正するには、文字列リテラルを、ResourceManager クラスのインスタンスを使用して取得した文字列で置き換えます。
ko: 메서드는 .NET Framework 클래스 라이브러리의 생성자 또는 메서드에 문자열 리터럴을 매개 변수로 전달하고 해당 문자열은 지역화 가능해야 합니다. 이 규칙 위반 문제를 해결하려면 문자열 리터럴을 ResourceManager 클래스의 인스턴스를 통해 검색된 문자열로 바꿉니다.
pl: Metoda przekazuje literał ciągu jako parametr do konstruktora lub metody w bibliotece klas programu .NET Framework i ten ciąg powinien być możliwy do zlokalizowania. Aby naprawić naruszenie tej reguły, zastąp literał ciągu ciągiem pobranym za pomocą wystąpienia klasy ResourceManager.
pt_br: Um método passa um literal de cadeia de caracteres como um parâmetro para um construtor ou um método na biblioteca de classes do .NET Framework e essa cadeia de caracteres deve ser traduzível. Para corrigir uma violação dessa regra, substitua o literal de cadeia de caracteres por uma cadeia de caracteres recuperada por meio de uma instância da classe ResourceManager.
ru: Метод передает строковый литерал в качестве параметра конструктору или методу в библиотеке классов .NET Framework, и эта строка должна быть локализуемой. Чтобы устранить нарушение этого правила, замените строковый литерал строкой, полученной через экземпляр класса ResourceManager.
tr: Bir metot, bir dize sabit değerini .NET Framework sınıf kitaplığında oluşturucuya veya metoda parametre olarak geçiriyor ve bu dize yerelleştirilebilir olmalı. Bu kural ihlalini düzeltmek için dize sabit değerini ResourceManager sınıfı örneği aracılığıyla alınan bir dizeyle değiştirin.
zh_hans: 方法将文本字符串作为参数传递到构造函数或 .NET Framework 类库中的方法，该字符串应该是可本地化字符串。若要修复此规则的违规行为，将文本字符串替换为通过 ResourceManager 类的实例检索到的字符串。
zh_hant: 方法會將字串常值以參數方式傳遞到 .NET Framework 類別庫中的建構函式或方法，且該字串應當地語系化。若要修正此規則的違規，請以透過 ResourceManager 類別的執行個體所擷取的字串，取代字串常值。

# DoNotPassLiteralsAsLocalizedParametersMessage
source: Method '{0}' passes a literal string as parameter '{1}' of a call to '{2}'. Retrieve the following string(s) from a resource table instead: "{3}".
cs: Metoda {0} předává řetězcový literál jako parametr {1} volání {2}. Místo toho načtěte následující řetězce z tabulky prostředků: {3}
de: Die Methode "{0}" übergibt eine Literalzeichenfolge als Parameter "{1}" eines Aufrufs an "{2}". Rufen Sie die folgende(n) Zeichenfolge(n) stattdessen aus einer Ressourcentabelle ab: {3}.
es: El método "{0}" pasa una cadena literal como parámetro "{1}" de una llamada a "{2}". En su lugar, recupere las cadenas siguientes de una tabla de recursos: "{3}".
fr: La méthode '{0}' passe une chaîne littérale en tant que paramètre '{1}' d'un appel à '{2}'. À la place, récupérez les chaînes suivantes à partir d'une table de ressources : "{3}".
it: Il metodo '{0}' passa una stringa letterale come parametro '{1}' di una chiamata a '{2}'. Recuperare le seguenti stringhe da una tabella delle risorse: "{3}".
ja: メソッド '{0}' は、リテラル文字列を '{2}' への呼び出しのパラメーター '{1}' として渡します。これを変更して、リソース テーブルから次の文字列を取得してください: "{3}"
ko: '{0}' 메서드가 리터럴 문자열을 '{2}' 호출의 '{1}' 매개 변수로 전달합니다. 대신 리소스 테이블에서 "{3}" 문자열을 가져오세요.
pl: Metoda {0} przekazuje ciąg literału jako parametr „{1}” wywołania elementu {2}. Zamiast tego pobierz następujące ciągi z tabeli zasobów: „{3}”.
pt_br: O método '{0}' passa uma cadeia de caracteres literal como o parâmetro '{1}' de uma chamada para '{2}'. Nesse caso, recupere as seguintes cadeias de caracteres de uma tabela de recursos: "{3}".
ru: Метод "{0}" передает строку-литерал, как параметр "{1}" при вызове "{2}". Вместо этого выполните поиск следующих строк в таблице ресурсов: "{3}".
tr: '{0}' metodu bir '{2}' çağrısına '{1}' parametresi olarak bir sabit dizesi geçiriyor. Bunun yerine şu dizeleri bir kaynak tablosundan alın: {3}.
zh_hans: 方法“{0}”将文本字符串作为“{2}”的调用的参数“{1}”进行传递。改为从资源表检索以下字符串:“{3}”。
zh_hant: 方法 '{0}' 在呼叫 '{2}' 時傳遞了常值字串做為參數 '{1}'。請改為從資源表格擷取下列字串: "{3}"。

# DoNotPassLiteralsAsLocalizedParametersTitle
source: Do not pass literals as localized parameters
cs: Nepředávejte literály jako lokalizované parametry
de: Literale nicht als lokalisierte Parameter übergeben
es: No pasar cadenas literal como parámetros localizados
fr: Ne pas passer de littéraux en paramètres localisés
it: Non passare valori letterali come parametri localizzati
ja: ローカライズされるパラメーターとしてリテラルを渡さない
ko: 리터럴을 지역화된 매개 변수로 전달하지 마십시오.
pl: Nie przekazuj literałów jako zlokalizowanych parametrów
pt_br: Não passar literais como parâmetros localizados
ru: Не передавать литералы в качестве локализованных параметров
tr: Harfleri yerelleştirilmiş parametreler olarak göndermeyin
zh_hans: 请不要将文本作为本地化参数传递
zh_hant: 不要將常值當做已當地語系化的參數傳遞

# DoNotPassNonNullableValueToArgumentNullExceptionThrowIfNullCodeFixTitle
source: Remove superfluous 'ArgumentNullException.ThrowIfNull' call
cs: Odeberte nadbytečné volání ArgumentNullException.ThrowIfNull
de: Entfernen Sie den überflüssigen Aufruf „ArgumentNullException.ThrowIfNull“
es: Quitar llamada superflua a "ArgumentNullException.ThrowIfNull"
fr: Supprimer l’appel superflu 'ArgumentNullException.ThrowIfNull'
it: Rimuovere la chiamata superflua ad "ArgumentNullException.ThrowIfNull"
ja: 余分な 'ArgumentNullException.ThrowIfNull' 呼び出しを削除する
ko: 불필요한 'ArgumentNullException.ThrowIfNull' 호출 제거
pl: Usuń zbędne wywołanie „ArgumentNullException.ThrowIfNull”
pt_br: Remova a chamada "ArgumentNullException.ThrowIfNull" supérflua
ru: Удалить избыточный вызов "ArgumentNullException.ThrowIfNull"
tr: Gereksiz 'ArgumentNullException.ThrowIfNull' çağrısını kaldırın
zh_hans: 删除多余的 "ArgumentNullException.ThrowIfNull" 调用
zh_hant: 移除非必要的 'ArgumentNullException.ThrowIfNull' 呼叫

# DoNotPassNonNullableValueToArgumentNullExceptionThrowIfNullDescription
source: 'ArgumentNullException.ThrowIfNull' throws when the passed argument is 'null'. Certain constructs like non-nullable structs, 'nameof()' and 'new' expressions are known to never be null, so 'ArgumentNullException.ThrowIfNull' will never throw.
cs: ArgumentNullException.ThrowIfNull použije příkaz throw, pokud je předaný argument null. O některých konstruktorech, jako jsou struktury, které nemohou mít hodnotu null, výrazy nameof() a new, se ví, že nikdy nemají hodnotu null, takže argument ArgumentNullException.ThrowIfNull nikdy nepoužije příkaz throw.
de: “ArgumentNullException.ThrowIfNull“ wird ausgelöst, wenn das übergebene Argument „null“ ist. Bestimmte Konstrukte wie Strukturen, die keine Nullwerte zulassen, „nameof()“ und „new“ sind bekanntermaßen nie NULL, sodass „ArgumentNullException.ThrowIfNull“ nie ausgelöst wird.
es: "ArgumentNullException.ThrowIfNull" se produce cuando el argumento pasado es "null". Se sabe que ciertas construcciones, como las estructuras que no aceptan valores NULL, las expresiones "nameof()" y "new", nunca son null, por lo que "ArgumentNullException.ThrowIfNull" nunca se iniciará.
fr: 'ArgumentNullException.ThrowIfNull' lève lorsque l’argument passé est 'null'. Certaines constructions telles que les structs non nullables, les expressions 'nameof()' et 'new' sont connues pour ne jamais avoir la valeur null, donc 'ArgumentNullException.ThrowIfNull' ne lève jamais.
it: "ArgumentNullException.ThrowIfNull" viene generato quando l'argomento passato è "null". Alcuni costrutti come gli struct che non ammettono i valori Null, le espressioni "nameof()" e "new" non sono mai Null, di conseguenza "ArgumentNullException.ThrowIfNull" non verrà mai generato.
ja: 渡された引数が 'null' の場合、'ArgumentNullException.ThrowIfNull' がスローされます。null 非許容構造体、'nameof()'、'new' 式などの特定のコンストラクトは null になることはないため、'ArgumentNullException.ThrowIfNull' はスローされません。
ko: 전달된 인수가 'null'이면 'ArgumentNullException.ThrowIfNull'이 throw됩니다. null을 허용하지 않는 구조체, 'nameof()' 및 'new' 식과 같은 특정 구문은 null이 아닌 것으로 알려져 있으므로 'ArgumentNullException.ThrowIfNull'은 throw되지 않습니다.
pl: Element „ArgumentNullException.ThrowIfNull” zgłasza, gdy przekazany argument ma wartość „null”. Niektóre konstrukcje, takie jak struktury nie dopuszczające wartości null, wyrażenia „nameof()” i „nowy”, nigdy nie mają wartości null, więc metoda „ArgumentNullException.ThrowIfNull” nigdy nie będzie zgłaszać.
pt_br: "ArgumentNullException.ThrowIfNull" é gerado quando o argumento repassado é "null". Certos constructos, como structs não anuláveis, expressões "nameof()" e "new", nunca são nulos e, portanto, "ArgumentNullException.ThrowIfNull" nunca será gerado.
ru: "ArgumentNullException.ThrowIfNull" возникает, когда переданный аргумент имеет значение "null". Некоторые конструкции, например структуры, не допускающие значения NULL, а также выражения "nameof()" и "new", никогда не имеют значение NULL, поэтому "ArgumentNullException.ThrowIfNull" никогда не возникнет.
tr: Geçirilen bağımsız değişken 'null' olduğunda 'ArgumentNullException.ThrowIfNull' oluşur. Null atanamaz yapılar, 'nameof()' ve 'new' ifadeleri gibi bazı yapılar hiçbir zaman null olmadığı için 'ArgumentNullException.ThrowIfNull' hiçbir zaman oluşmaz.
zh_hans: 当传递的参数为 "null" 时，"ArgumentNullException.ThrowIfNull" 会引发异常。某些构造(如不可为 null 的结构、"nameof()" 和 "new" 表达式)已知永远不会为 null，因此 "ArgumentNullException.ThrowIfNull" 永远不会引发异常。
zh_hant: 傳遞的引數為 'null' 時，會擲回 'ArgumentNullException.ThrowIfNull'。已知某些建構一律不可為 Null，例如不可為 Null 的結構、'nameof()' 和 'new' 運算式，因此 'ArgumentNullException.ThrowIfNull' 永遠不會擲回。

# DoNotPassNonNullableValueToArgumentNullExceptionThrowIfNullMessage
source: Calling 'ArgumentNullException.ThrowIfNull' and passing a non-nullable value is a no-op
cs: Volání argumentu ArgumentNullException.ThrowIfNull a předání hodnoty, která nemůže mít hodnotu null, není možné.
de: Das Aufrufen von „ArgumentNullException.ThrowIfNull“ und das Übergeben eines Werts, der keine Nullwerte zulässt, ist kein Vorgang.
es: Llamar a "ArgumentNullException.ThrowIfNull" y pasar un valor que no acepta valores NULL es una instrucción no-op
fr: L’appel de 'ArgumentNullException.ThrowIfNull' et le passage d’une valeur non nullable est une opération sans opération
it: Chiamare "ArgumentNullException.ThrowIfNull" e passare un valore che non ammette i valori Null non restituisce alcuna operazione
ja: 'ArgumentNullException.ThrowIfNull' を呼び出し、NULL 非許容の値を渡すことは no-op です
ko: 'ArgumentNullException.ThrowIfNull'을 호출하고 null을 허용하지 않는 값을 전달하는 no-op
pl: Wywołanie metody „ArgumentNullException.ThrowIfNull” i przekazanie wartości dopuszczającej wartość null jest operacją bezskuteczną
pt_br: Chamar "ArgumentNullException.ThrowIfNull" e repassar um valor não anulável é uma operação nula
ru: Вызов "ArgumentNullException.ThrowIfNull" и передача значения, не допускающего значения NULL, является холостой командой
tr: 'ArgumentNullException.ThrowIfNull' çağırmak ve null atanamaz bir değer geçirmek işlem yok olur.
zh_hans: 调用 "ArgumentNullException.ThrowIfNull" 并传递不可为 null 的值是无操作
zh_hant: 呼叫 'ArgumentNullException.ThrowIfNull' 且傳遞不可為 Null 的值是無作業

# DoNotPassNonNullableValueToArgumentNullExceptionThrowIfNullTitle
source: Do not pass a non-nullable value to 'ArgumentNullException.ThrowIfNull'
cs: Nepředávejte hodnotu, která nemůže mít hodnotu null, argumentu ArgumentNullException.ThrowIfNull
de: Übergeben Sie keinen Wert, der keine Nullwerte zulässt, an „ArgumentNullException.ThrowIfNull“.
es: No pasar un valor que no acepta valores NULL a "ArgumentNullException.ThrowIfNull"
fr: Ne passez pas de valeur non nullable à 'ArgumentNullException.ThrowIfNull'
it: Non passare uno struct che non ammette i valori Null ad "AgumentNullException.ThrowIfNull"
ja: NULL 非許容値を 'ArgumentNullException.ThrowIfNull' に渡さない
ko: null을 허용하지 않는 값을 'ArgumentNullException.ThrowIfNull'에 전달 금지
pl: Nie przekazuj wartości nie dopuszczającej wartość null do elementu „ArgumentNullException.ThrowIfNull”
pt_br: Não repasse um valor não anulável para "ArgumentNullException.ThrowIfNull"
ru: Не передавать значение, не допускающее значения NULL, в "ArgumentNullException.ThrowIfNull"
tr: Null atanamaz bir değeri 'ArgumentNullException.ThrowIfNull' öğesine geçirme
zh_hans: 不要将不可为 null 的值传递给 "ArgumentNullException.ThrowIfNull"
zh_hant: 請勿將不可為 Null 的值傳遞到 'ArgumentNullException.ThrowIfNull'

# DoNotPassNullableStructToArgumentNullExceptionThrowIfNullCodeFixTitle
source: Replace the 'ArgumentNullException.ThrowIfNull' call with a conditional
cs: Nahraďte volání ArgumentNullException.ThrowIfNull podmíněným výrazem
de: Ersetzen Sie den Aufruf „ArgumentNullException.ThrowIfNull“ durch eine Bedingung
es: Reemplazar la llamada "ArgumentNullException.ThrowIfNull" por una condicional.
fr: Remplacez l’appel 'ArgumentNullException.ThrowIfNull' par une condition
it: Sostituire la chiamata ad "ArgumentNullException.ThrowIfNull" con un elemento condizionale
ja: 'ArgumentNullException.ThrowIfNull' 呼び出しを条件に置き換る
ko: 'ArgumentNullException.ThrowIfNull' 호출을 조건부로 바꾸기
pl: Zastąp wywołanie „ArgumentNullException.ThrowIfNull” wywołaniem warunkowym
pt_br: Substitua a chamada "ArgumentNullException.ThrowIfNull" por uma condicional
ru: Заменить вызов "ArgumentNullException.ThrowIfNull" условным
tr: 'ArgumentNullException.ThrowIfNull' çağrısını bir koşullu değerle değiştirin
zh_hans: 将 "ArgumentNullException.ThrowIfNull" 调用替换为条件
zh_hant: 以條件式取代 'ArgumentNullException.ThrowIfNull' 呼叫

# DoNotPassNullableStructToArgumentNullExceptionThrowIfNullDescription
source: 'ArgumentNullException.ThrowIfNull' accepts an 'object', so passing a nullable struct may cause the value to be boxed.
cs: ArgumentNullException.ThrowIfNull přijímá hodnotu object, takže předání struktury s možnou hodnotou null může způsobit zabalení hodnoty.
de: „ArgumentNullException.ThrowIfNull“ akzeptiert ein Objekt, sodass das Übergeben einer Struktur, die Nullwerte zulässt, dazu führen kann, dass der Wert geschachtelt wird.
es: "ArgumentNullException.ThrowIfNull" acepta un "object", por lo que pasar un struct que admite un valor NULL puede hacer que el valor se encuadre.
fr: 'ArgumentNullException.ThrowIfNull' accepte un 'object', donc le passage d’un struct nullable peut entraîner la mise en boîte de la valeur.
it: "ArgumentNullException.ThrowIfNull" accetta un "object"; di conseguenza, il passaggio di uno struct che ammette i valori Null può causare la conversione boxing del valore.
ja: 'ArgumentNullException.ThrowIfNull' は 'object' を受け入れるので、null 許容の構造体を渡すと値がボックス化される可能性があります。
ko: 'ArgumentNullException.ThrowIfNull'은 'object'를 허용하므로 nullable 구조체를 전달하면 값이 박스 처리될 수 있습니다.
pl: Element „ArgumentNullException.ThrowIfNull” akceptuje element „obiekt”, więc przekazanie struktury dopuszczającej wartość null może spowodować, że wartość zostanie zablokowana.
pt_br: "ArgumentNullException.ThrowIfNull" aceita um "objeto" e, portanto, repassar um struct anulável pode fazer com que o valor passe por conversão boxing.
ru: "ArgumentNullException.ThrowIfNull" принимает "object", поэтому передача структуры, допускающей значение NULL, может привести к упаковке-преобразованию значения.
tr: 'ArgumentNullException.ThrowIfNull' bir 'object' kabul eder, bu nedenle null atanabilir bir yapının geçirilmesi değerin kutulanmasına neden olabilir.
zh_hans: "ArgumentNullException.ThrowIfNull" 接受 "object"，因此传递可为 null 的结构可能导致值装箱。
zh_hant: 'ArgumentNullException.ThrowIfNull' 接受 'object'，所以傳遞可為 Null 的結構可能導致值受到 box 處理。

# DoNotPassNullableStructToArgumentNullExceptionThrowIfNullMessage
source: Passing a nullable struct to 'ArgumentNullException.ThrowIfNull' may cause boxing
cs: Předání struktury s možnou hodnotou null argumentu ArgumentNullException.ThrowIfNull může způsobit zabalení.
de: Das Übergeben einer Struktur, Nullwerte zulässt, an „ArgumentNullException.ThrowIfNull“ kann zu Boxing führen.
es: Pasar una estructura que admite un valor NULL a "ArgumentNullException.ThrowIfNull" puede provocar la conversión boxing
fr: Le passage d’un struct nullable à 'ArgumentNullException.ThrowIfNull' peut provoquer un boxing
it: Il passaggio di uno struct che ammette i valori Null a "ArgumentNullException.ThrowIfNull" può causare la conversione boxing
ja: NULL 許容構造体を 'ArgumentNullException.ThrowIfNull' に渡すと、ボックス化が発生する可能性があります
ko: nullable 구조체를 'ArgumentNullException.ThrowIfNull'에 전달하면 박스 처리가 발생할 수 있음
pl: Przekazanie struktury dopuszczającej wartość null do elementu „ArgumentNullException.ThrowIfNull” może spowodować konwersję boxing
pt_br: Passar um struct anulável para "ArgumentNullException.ThrowIfNull" pode causar boxing
ru: Передача структуры, допускающей значение NULL, в "ArgumentNullException.ThrowIfNull" может привести к упаковке-преобразованию
tr: 'ArgumentNullException.ThrowIfNull' öğesine null atanabilir bir yapının geçirilmesi kutulamaya neden olabilir
zh_hans: 将可为 null 的结构传递到 "ArgumentNullException.ThrowIfNull" 可能会导致装箱
zh_hant: 將可為 Null 的結構傳遞至 'ArgumentNullException.ThrowIfNull' 可能會導致 boxing
