Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotGuardDictionaryRemoveByContainsKeyDescription
source: Do not guard 'Dictionary.Remove(key)' with 'Dictionary.ContainsKey(key)'. The former already checks whether the key exists, and will not throw if it does not.
cs: Nebránit Dictionary.Remove(key) s Dictionary.ContainsKey(key). Předchozí už kontroluje, jestli klíč existuje, a pokud ne, nevyvolá ho.
de: Schützen Sie “Dictionary.Remove(key)” nicht mit “Dictionary.ContainsKey(key)”. Der erste Schlüssel überprüft bereits, ob der Schlüssel vorhanden ist, und gibt keinen Fehler aus, wenn dies nicht der Fall ist.
es: No restrinja 'Dictionary.Remove(key)' con 'Dictionary.ContainsKey(key)'. El primero ya comprueba si la clave existe y no se iniciará si no existe.
fr: Ne protégez pas 'Dictionary.Remove(key)' avec 'Dictionary.ContainsKey(key)'. Le premier vérifie déjà si la clé existe et ne lèvera pas si ce n’est pas le cas.
it: Non proteggere 'Dictionary.Remove(key)' con 'Dictionary.ContainsKey(key)'. Il primo controlla già se la chiave esiste e non verrà generata in caso contrario.
ja: 'Dictionary.ContainsKey(key)' を使用して 'Dictionary.Remove(key)' をガードしないでください。キーが存在するかどうかは、'Dictionary.Remove(key)' で既に確認されています。存在しない場合はスローしません。
ko: 'Dictionary.ContainsKey(key)'를 사용하여 'Dictionary.Remove(key)'를 보호하지 마세요. 전자는 키가 있는지 여부를 이미 확인하고, 있지 않으면 throw하지 않습니다.
pl: Nie należy chronić elementu \"Dictionary.Remove(key)\" za pomocą elementu \"Dictionary.ContainsKey(key)\". Pierwszy element sprawdza, czy klucz istnieje i nie generuje go w przypadku jego braku.
pt_br: Não proteger 'Dictionary.Remove(key)' com 'Dictionary.ContainsKey(key)'. O primeiro já verifica se a chave existe e não lançará se não existir.
ru: Защищать \"Dictionary.Remove(key)\" с помощью \"Dictionary.ContainsKey(key)\" не требуется. Первый элемент уже проверяет существование ключа и не выдаст исключения при его отсутствии.
tr: 'Dictionary.ContainsKey(key)' ile 'Dictionary.Remove(key)' öğesini korumayın. İlki zaten anahtarın mevcut olup olmadığını denetler ve değilse oluşturmaz.
zh_hans: 不要使用 “Dictionary.ContainsKey(key)” 保护 “Dictionary.Remove(key)”。后者已检查密钥是否存在，并且如果不存在则不会引发。
zh_hant: 請勿使用 'Dictionary.ContainsKey(key)' 保護 'Dictionary.Remove(key)'。前者已檢查金鑰是否存在，若沒有，則不會擲回。

# DoNotGuardDictionaryRemoveByContainsKeyMessage
source: Do not guard 'Dictionary.Remove(key)' with 'Dictionary.ContainsKey(key)'
cs: Nechránit Dictionary.Remove(key) s Dictionary.ContainsKey(key)
de: “Dictionary.Remove(key)” nicht mit “Dictionary.ContainsKey(key)” schützen
es: No restrinja 'Dictionary.Remove(key)' con 'Dictionary.ContainsKey(key)'
fr: Ne pas protéger 'Dictionary.Remove(key)' avec 'Dictionary.ContainsKey(key)'
it: Non proteggere 'Dictionary.Remove(key)' con 'Dictionary.ContainsKey(key)'
ja: 'Dictionary.ContainsKey(key)' を使用して 'Dictionary.Remove(key)' をガードしないでください
ko: 'Dictionary.ContainsKey(key)'를 사용하여 'Dictionary.Remove(key)'를 보호하지 마세요.
pl: Nie należy chronić elementu \"Dictionary.Remove(key)\" za pomocą elementu \"Dictionary.ContainsKey(key)\"
pt_br: Não proteger 'Dictionary.Remove(key)' com 'Dictionary.ContainsKey(key)'
ru: Не защищайте \"Dictionary.Remove(key)\" с помощью \"Dictionary.ContainsKey(key)\".
tr: 'Dictionary.ContainsKey(key)' ile 'Dictionary.Remove(key)' öğesini korumayın
zh_hans: 不要使用 “Dictionary.ContainsKey(key)” 保护 “Dictionary.Remove(key)”
zh_hant: 請勿使用 'Dictionary.ContainsKey(key)' 保護 'Dictionary.Remove(key)'

# DoNotGuardDictionaryRemoveByContainsKeyTitle
source: Unnecessary call to 'Dictionary.ContainsKey(key)'
cs: Nepotřebné volání Dictionary.ContainsKey(key)
de: Nicht erforderlicher Aufruf von “Dictionary.ContainsKey(key)”
es: Llamada innecesaria a 'Dictionary.ContainsKey(key)'
fr: Appel inutile à 'Dictionary.ContainsKey(key)'
it: Chiamata non necessaria a 'Dictionary.ContainsKey(key)'
ja: 'Dictionary.ContainsKey(key)' への不要な呼び出し
ko: 'Dictionary.ContainsKey(key)'에 대한 불필요한 호출
pl: Niepotrzebne wywołanie metody \"Dictionary.ContainsKey(key)\"
pt_br: Chamada desnecessária para 'Dictionary.ContainsKey(key)'
ru: Ненужный вызов \"Dictionary.ContainsKey(key)\"
tr: Gereksiz 'Dictionary.ContainsKey(key)' çağrısı
zh_hans: 对 “Dictionary.ContainsKey(key)” 的不必要调用
zh_hant: 不需要呼叫 'Dictionary.ContainsKey(key)'

# DoNotGuardSetAddOrRemoveByContainsDescription
source: Do not guard 'Add(item)' or 'Remove(item)' with 'Contains(item)' for the set. The former two already check whether the item exists and will return if it was added or removed.
cs: Pro sadu nezaměňujte Add(item) ani Remove(item) s Contains(item). Předchozí dva už zkontrolují, jestli položka existuje, a vrátí se, pokud byla přidána nebo odebrána.
de: Schützen Sie "Add(item)" oder "Remove(item)" nicht mit "Contains(item)" für den Satz. Die letzten beiden überprüfen bereits, ob das Element vorhanden ist, und geben zurück, wenn es hinzugefügt oder entfernt wurde.
es: No restrinja "Add(item)" o "Remove(item)" con "Contains(item)" para el conjunto. Los dos anteriores ya comprueban si el elemento existe y devolverán si se agregó o quitó.
fr: Ne protégez pas « Add(item) » ou « Remove(item) » avec « Contains(item) » pour l’ensemble. Les deux premiers case activée déjà si l’élément existe et s’il a été ajouté ou supprimé.
it: Non proteggere 'Add(item)' o 'Remove(item)' con 'Contains(item)' per il set. I due elementi precedenti verificano già se l'elemento esiste e verranno restituiti se sono stati aggiunti o rimossi.
ja: 一連の 'Contains(item)' を含む 'Add(item)' または 'Remove(item)' を保護しないでください。前の 2 つは、アイテムが存在するかどうかを既に確認しており、アイテムが追加または削除された場合に返されます。
ko: 세트에 대해 '포함(항목)'으로 '추가(항목)' 또는 '제거(항목)'을 보호하지 마세요. 앞의 두 개는 이미 항목이 존재하는지 확인하고 추가 또는 제거된 경우 반환합니다.
pl: Nie chroń elementów „Add(item)” ani „Remove(item)” za pomocą elementu „Contains(item)” dla zestawu. Dwa poprzednie już sprawdzają, czy element istnieje, i zwrócą informację, czy został on dodany lub usunięty.
pt_br: Não guarde 'Adicionar(item)' ou 'Remover(item)' com 'Contém(item)' para o conjunto. Os dois primeiros já verificam se o item existe e retornarão se foi adicionado ou removido.
ru: Не защищайте "Add(item)" или "Remove(item)" с помощью "Contains(item)" для набора. Первые два уже проверяют, существует ли элемент, и вернут отклик о его добавлении или удалении.
tr: Küme için 'Add(item)' veya 'Remove(item)' parametresini 'Contains(item)' ile korumayın. Önceki ikisi zaten öğenin var olup olmadığını denetler ve öğenin eklendiği veya kaldırıldığı bilgisini döndürür.
zh_hans: 对于集，不要使用 "Contains(item)" 来保护 "Add(item)" 或 "Remove(item)"。前两者已检查是否存在项，并将在添加或移除项时返回。
zh_hant: 請勿為集合使用 'Contains(item)' 來防護 'Add(item)' 或 'Remove(item)'。前兩者已檢查項目是否存在，並將在新增或移除項目時退回。

# DoNotGuardSetAddOrRemoveByContainsMessage
source: Do not guard '{0}' with '{1}'
cs: Nezachovat {0} pomocí {1}
de: Schützen Sie "{0}" nicht mit "{1}"
es: No restrinja "{0}" con "{1}"
fr: Ne pas protéger les '{0}' avec '{1}'
it: Non proteggere '{0}' con '{1}'
ja: '{1}' を含む '{0}' を保護しない
ko: '{1}'(으)로 '{0}'을(를) 보호하지 마세요.
pl: Nie chroń elementu „{0}” za pomocą elementu „{1}”
pt_br: Não proteger '{0}' com '{1}'
ru: Не защищайте "{0}" с помощью "{1}"
tr: '{0}' parametresini '{1}' ile korumayın
zh_hans: 不使用“{1}”保护“{0}”
zh_hant: 不要使用 '{1}' 來防護 '{0}'

# DoNotGuardSetAddOrRemoveByContainsTitle
source: Unnecessary call to 'Contains(item)'
cs: Nepotřebné volání Contains(item)
de: Unnötiger Aufruf von "Contains(item)"
es: Llamada innecesaria a "Contains(item)"
fr: Appel inutile à 'Contains(item)'
it: Chiamata non necessaria a 'Contains(item)'
ja: 'Contains(item)' に対する不要な呼び出し
ko: 'Contains(item)'에 대한 불필요한 호출
pl: Niepotrzebne wywołanie elementu „Contains(item)”
pt_br: Chamada desnecessária para 'Contém(item)'
ru: Ненужный вызов "Contains(item)"
tr: 'Contains(item)' parametresine gereksiz çağrı
zh_hans: 对 "Contains(item)" 的不必要调用
zh_hant: 對 'Contains(item)' 的不必要呼叫

source: Do not hard-code certificate
cs: Nepoužívejte pevně zakódovaný certifikát
de: Keine Hartcodierung von Zertifikaten
es: No codificar el certificado de forma rígida
fr: Ne pas coder en dur le certificat
it: Non impostare il certificato come hardcoded
ja: 証明書をハードコーディングしない
ko: 인증서 하드 코딩 안 함
pl: Nie zapisuj certyfikatu na stałe w kodzie
pt_br: Não embutir o certificado em código
ru: Не используйте жестко заданный сертификат.
tr: Sertifikayı sabit olarak kodlama
zh_hans: 请勿硬编码证书
zh_hant: 不要硬式編碼憑證

# DoNotHardCodeCertificateDescription
source: Hard-coded certificates in source code are vulnerable to being exploited.
cs: Pevně zakódované certifikáty ve zdrojovém kódu jsou zranitelné vůči zneužití.
de: Hartcodierte Zertifikate im Quellcode sind anfällig für Exploits.
es: Los certificados codificados de forma rígida en el código fuente son vulnerables a un uso abusivo.
fr: Les certificats codés en dur dans le code source sont vulnérables aux attaques.
it: I certificati hardcoded nel codice sorgente sono vulnerabili agli exploit.
ja: ソース コード内のハードコーディングされた証明書は、悪用される可能性があります。
ko: 소스 코드의 하드 코딩된 인증서는 악용될 수 있습니다.
pl: Certyfikaty zapisane na stałe w kodzie źródłowym są podatne na wykorzystanie.
pt_br: Os certificados embutidos em código no código-fonte são suscetíveis à exploração.
ru: Жестко задаваемые сертификаты в исходном коде представляют собой уязвимость, которой может воспользоваться злоумышленник.
tr: Kaynak kodundaki sabit olarak kodlanmış sertifikalar, güvenlik açığından yararlanmaya karşı savunmasızdır.
zh_hans: 源代码中的硬编码证书易受攻击。
zh_hant: 原始程式碼中的硬式編碼憑證容易受到攻擊。

# DoNotHardCodeCertificateMessage
source: Potential security vulnerability was found where '{0}' in method '{1}' may be tainted by hard-coded certificate from '{2}' in method '{3}'
cs: Našlo se potenciální ohrožení zabezpečení, kde {0} v metodě {1} je možné poškodit pevně zakódovaným certifikátem z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko ermittelt. "{0}" in Methode "{1}" wurde möglicherweise durch einen hartcodierten Schlüssel aus "{2}" in Methode "{3}" verfälscht.
es: Se encontró una posible vulnerabilidad de seguridad por la que podría contaminarse "{0}" en el método "{1}" con un certificado codificado de forma rígida de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à la sécurité a été détectée. '{0}' dans la méthode '{1}' peut être souillé par un certificat codé en dur en provenance de '{2}' dans la méthode '{3}'
it: È stata trovata una potenziale vulnerabilità di sicurezza in cui '{0}' nel metodo '{1}' può essere contaminato dal certificato hardcoded di '{2}' nel metodo '{3}'
ja: 潜在的なセキュリティの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのハードコーディングされた証明書によって汚染される可能性があります
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 하드 코딩된 인증서에 의해 오염될 수 있는 잠재적인 보안 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę w zabezpieczeniach. Element „{0}” w metodzie „{1}” może zostać zanieczyszczony zapisanym na stałe w kodzie certyfikatem z elementu „{2}” w metodzie „{3}”
pt_br: Foi localizada uma possível vulnerabilidade de segurança na qual '{0}' no método '{1}' pode ter sido afetado pelo certificado embutido em código de '{2}' no método '{3}'
ru: Обнаружена потенциальная уязвимость безопасности, заключающаяся в том, что "{0}" в методе "{1}" может быть испорчен с использованием жестко заданного сертификата из "{2}" в методе "{3}"
tr: '{1}' metodundaki '{0}' öğesinin, '{3}' metodundaki '{2}' öğesinde bulunan sabit kodlanmış sertifika nedeniyle zarar görmüş olabileceği olası güvenlik açığı bulundu
zh_hans: 找到了潜在安全漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的硬编码证书污染。
zh_hant: 發現潛在的安全性弱點，方法 '{1}' 中的 '{0}' 可能受來自方法 '{3}' 中 '{2}' 由硬式編碼的憑證所感染

source: Do not hard-code encryption key
cs: Nepoužívejte pevně zakódovaný šifrovací klíč
de: Keine Hartcodierung von Verschlüsselungsschlüsseln
es: No codificar la clave de cifrado de forma rígida
fr: Ne pas coder en dur la clé de chiffrement
it: Non impostare la chiave di crittografia come hardcoded
ja: 暗号化キーをハードコーディングしない
ko: 암호화 키 하드 코딩 안 함
pl: Nie zapisuj klucza szyfrowania na stałe w kodzie
pt_br: Não embutir a chave de criptografia em código
ru: Не используйте жестко заданный ключ шифрования.
tr: Şifreleme anahtarını sabit olarak kodlama
zh_hans: 请勿编码加密密钥
zh_hant: 不要硬式編碼加密金鑰

# DoNotHardCodeEncryptionKeyDescription
source: SymmetricAlgorithm's .Key property, or a method's rgbKey parameter, should never be a hard-coded value.
cs: Vlastnost .Key objektu SymmetricAlgorithm ani parametr rgbKey metody by nikdy neměly mít pevně zakódované hodnoty.
de: Die .Key-Eigenschaft von SymmetricAlgorithm oder der rgbKey-Parameter einer Methode darf niemals ein hartcodierter Wert sein.
es: La propiedad .Key de SymmetricAlgorithm o el parámetro rgbKey de un método no deben ser nunca un valor codificado de forma rígida.
fr: La propriété .Key de SymmetricAlgorithm ou le paramètre rgbKey d'une méthode ne doivent jamais correspondre à une valeur codée en dur.
it: La proprietà .Key di SymmetricAlgorithm o il parametro rgbKey di un metodo non deve essere mai essere un valore hardcoded.
ja: SymmetricAlgorithm の .Key プロパティまたはメソッドの rgbKey パラメーターをハードコーディングされた値にすることはできません。
ko: SymmetricAlgorithm의 .Key 속성 또는 메서드의 rgbKey 매개 변수는 하드 코딩된 값이어서는 안 됩니다.
pl: Właściwość .Key elementu SymmetricAlgorithm lub parametr rgbKey metody nigdy nie powinny być wartością zapisaną na stałe w kodzie.
pt_br: A propriedade .Key de SymmetricAlgorithm ou o parâmetro rgbKey de um método nunca devem ser um valor embutido em código.
ru: Свойство .Key симметричного алгоритма и параметр rgbKey метода не могут быть жестко заданными значениями.
tr: SymmetricAlgorithm'in .Key özelliği veya bir metodun rgbKey parametresi hiçbir zaman sabit kodlanmış bir değer olamaz.
zh_hans: SymmetricAlgorithm 的 .Key 属性或方法的 rgbKey 参数永远都不得是硬编码值。
zh_hant: SymmetricAlgorithm 的 .Key 屬性，或方法的 rgbKey 參數不應為硬式編碼值。

# DoNotHardCodeEncryptionKeyMessage
source: Potential security vulnerability was found where '{0}' in method '{1}' may be tainted by hard-coded key from '{2}' in method '{3}'
cs: Našlo se potenciální ohrožení zabezpečení, kde {0} v metodě {1} je možné poškodit pevně zakódovaným klíčem z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko ermittelt. "{0}" in der Methode "{1}" wurde möglicherweise durch einen hartcodierten Schlüssel aus "{2}" in Methode "{3}" verfälscht.
es: Se encontró una posible vulnerabilidad de seguridad por la que podría contaminarse "{0}" en el método "{1}" con una clave codificada de forma rígida de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à la sécurité a été détectée. '{0}' dans la méthode '{1}' peut être souillé par une clé codée en dur en provenance de '{2}' dans la méthode '{3}'
it: È stata trovata una potenziale vulnerabilità di sicurezza in cui '{0}' nel metodo '{1}' può essere contaminato dalla chiave hardcoded di '{2}' nel metodo '{3}'
ja: 潜在的なセキュリティの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのハードコーディングされたキーによって汚染される可能性があります
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 하드 코딩된 키에 의해 오염될 수 있는 잠재적인 보안 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę w zabezpieczeniach. Element „{0}” w metodzie „{1}” może zostać zanieczyszczony zapisanym na stałe w kodzie kluczem z elementu „{2}” w metodzie „{3}”
pt_br: Foi localizada uma possível vulnerabilidade de segurança na qual '{0}' no método '{1}' pode ter sido afetado pela chave embutida em código de '{2}' no método '{3}'
ru: Обнаружена потенциальная уязвимость безопасности, заключающаяся в том, что "{0}" в методе "{1}" может быть испорчен с использованием жестко заданного ключа из "{2}" в методе "{3}"
tr: '{1}' metodundaki '{0}' öğesinin, '{3}' metodundaki '{2}' öğesinde bulunan sabit kodlanmış anahtar nedeniyle zarar görmüş olabileceği olası güvenlik açığı bulundu
zh_hans: 找到了潜在安全漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的硬编码密钥污染。
zh_hant: 發現潛在的安全性弱點，方法 '{1}' 中的 '{0}' 可能受來自方法 '{3}' 中 '{2}' 由硬式編碼的金鑰所感染。

# DoNotInstallRootCertDescription
source: By default, the Trusted Root Certification Authorities certificate store is configured with a set of public CAs that has met the requirements of the Microsoft Root Certificate Program. Since all trusted root CAs can issue certificates for any domain, an attacker can pick a weak or coercible CA that you install by yourself to target for an attack - and a single vulnerable, malicious or coercible CA undermines the security of the entire system. To make matters worse, these attacks can go unnoticed quite easily.
cs: Standardně je úložiště certifikátů důvěryhodných kořenových certifikačních autorit nakonfigurované na sadu veřejných CA, které splnily požadavky programu Microsoft Root Certificate Program. Vzhledem k tomu, že všechny důvěryhodné kořenové CA můžou vystavovat certifikáty pro libovolnou doménu, útočník si může vybrat slabou nebo zranitelnou CA, kterou si sami nainstalujete na cíl útoku – a jedna ohrožená, škodlivá nebo zranitelná CA ohrožuje zabezpečení celého systému. A co je horší, tyto útoky se dají vcelku snadno skrýt.
de: Standardmäßig ist der Zertifikatspeicher der vertrauenswürdigen Stammzertifizierungsstellen mit einem Satz öffentlicher Zertifizierungsstellen konfiguriert, die die Anforderungen des Microsoft-Programms für Stammzertifikate erfüllen. Da alle vertrauenswürdigen Stammzertifizierungsstellen Zertifikate für eine beliebige Domäne ausstellen können, kann ein Angreifer eine schwache oder zwingende Zertifizierungsstelle, die Sie selbst installieren, als Ziel für einen Angriff auswählen. Auf diese Weise kann eine einzelne unsichere, schädliche oder zwingende Zertifizierungsstelle die Sicherheit des gesamten Systems untergraben. Hinzu kommt, dass diese Angriffe leicht unbemerkt bleiben können.
es: De forma predeterminada, el almacén de certificados de entidades de certificación raíz de confianza está configurado con un conjunto de entidades de certificación públicas que cumplen los requisitos del programa de certificados raíz de Microsoft. Dado que todas las entidades de certificación raíz de confianza pueden emitir certificados para cualquier dominio, un atacante puede elegir una entidad de certificación coaccionable o débil que instale por su cuenta para destinar un ataque, y una única entidad de certificación vulnerable, malintencionada o convertible socava la seguridad de todo el sistema. Para empeorar las cosas, estos ataques pueden pasar desapercibidos con bastante facilidad.
fr: Par défaut, le magasin de certificats Autorités de certification racines de confiance est configuré avec un ensemble d'autorités de certification publiques qui répond aux exigences du programme de certificat racine Microsoft. Comme toutes les autorités de certification racines de confiance peuvent émettre des certificats pour n'importe quel domaine, un attaquant peut choisir une autorité de certification faible ou coercible que vous installez par vous-même, or une seule autorité de certification vulnérable, malveillante ou coercible compromet la sécurité de l'ensemble du système. Pour compliquer la situation, ces attaques passent facilement inaperçues.
it: Per impostazione predefinita, l'archivio certificati di Autorità di certificazione radice disponibile nell'elenco locale è configurato con un set di CA pubbliche che soddisfa i requisiti del programma Microsoft Root Certificate. Dal momento che tutte le CA radice attendibili possono rilasciare certificati per qualsiasi dominio, un utente malintenzionato può selezionare come destinazione di attacco una CA debole o coercibile installata dall'utente. Una CA vulnerabile, dannosa o coercibile compromette la sicurezza dell'intero sistema, senza contare che questi attacchi possono passare inosservati abbastanza facilmente.
ja: 既定では、信頼されたルート証明機関の証明書ストアは、Microsoft ルート証明書プログラムの要件を満たす一連の公的 CA で構成されています。すべての信頼されたルート CA は任意のドメインの証明書を発行できますが、攻撃者はユーザー自身がインストールする脆弱な CA または制御可能な CA を攻撃対象として選択できます。脆弱な CA、悪意のあるCA、制御可能な CA が 1 つでもあると、システム全体のセキュリティが弱体化します。さらに悪いことに、こうした攻撃はまったく気付かずに、しかも簡単に行うことができます。
ko: 기본적으로 신뢰할 수 있는 루트 인증 기관 인증서 저장소는 Microsoft 루트 인증서 프로그램의 요구 사항을 준수하는 공용 CA 세트로 구성됩니다. 모든 신뢰할 수 있는 루트 CA는 모든 도메인에 대한 인증서를 발급할 수 있으므로 공격자는 사용자가 직접 설치한 약하거나 강제할 수 있는 CA를 선택하여 공격 대상으로 지정할 수 있으며, 취약하거나 악의적이거나 강제할 수 있는 CA 하나가 전체 시스템의 보안을 약화시킵니다. 설상가상으로 이러한 공격자는 상당히 쉽게 눈에 띄지 않고 넘어갈 수 있습니다.
pl: Domyślnie magazyn certyfikatów Zaufanych głównych urzędów certyfikacji jest skonfigurowany przy użyciu zbioru publicznych urzędów certyfikacji, który spełniają wymagania programu certyfikatów głównych firmy Microsoft. Ponieważ wszystkie Zaufane główne urzędy certyfikacji mogą wystawiać certyfikaty dla dowolnej domeny, osoba atakująca może wybrać słaby lub wymuszony urząd certyfikacji zainstalowany przez Ciebie, aby zainicjować atak — a jeden narażony na ataki, złośliwy lub wymuszony urząd certyfikacji osłabia bezpieczeństwo całego systemu. Co gorsza, tego typu ataki, w łatwy sposób mogą nawet zostać niezauważone.
pt_br: Por padrão, o repositório de certificados de Autoridades de Certificação Raiz Confiáveis é configurado com um conjunto de CAs públicas que atendem aos requisitos do Programa de Certificação Raiz da Microsoft. Como todas as CAs raiz confiáveis podem emitir certificados para qualquer domínio, um invasor pode escolher uma CA fraca ou coercível que você mesmo instala para atacar - e uma única CA vulnerável, maliciosa ou coercível prejudica a segurança de todo o sistema. Para piorar a situação, esses ataques podem passar despercebidos com bastante facilidade.
ru: По умолчанию в хранилище сертификатов Доверенных корневых центров сертификации настроен набор общедоступных центров сертификации, удовлетворяющих требованиям программы корневых сертификатов Майкрософт. Поскольку все доверенные корневые ЦС могут создавать сертификаты для любого домена, злоумышленник может выбрать слабозащищенный или обязательный центр сертификации, который вы устанавливали для отражения атаки. Всего один слабозащищенный, вредоносный или обязательный ЦС может скомпрометировать всю систему. Что еще хуже, эти атаки могут пройти незамеченными.
tr: Varsayılan olarak, Güvenilen Kök Sertifika Yetkilileri sertifika depolama alanı, Microsoft Kök Sertifika Programı gereksinimlerini karşılayan bir genel CA kümesiyle yapılandırılır. Tüm güvenilen kök CA'lar herhangi bir etki alanı için sertifika verebileceği için, bir saldırgan yüklediğiniz savunmasız veya zorlanabilir bir CA'yı saldırı için seçebilir ve tek bir zayıf, kötü amaçlı ya da zorlanabilir CA tüm sistemin güvenliğini tehlikeye atabilir. Daha da kötüsü, bu saldırıların gözden kaçırılması oldukça kolaydır.
zh_hans: 默认情况下，“受信任的根证书颁发机构”证书存储配置有一组符合 Microsoft 根证书程序的公共 CA。由于所有受信任的根 CA 都可为任意域颁发证书，因此攻击者可能会选择你自行安装的某个安全性较弱或可强迫的 CA 进行攻击 - 易受攻击、恶意或可强迫的 CA 会降低整个系统的安全性。更糟糕的是，这些攻击者可能很难被察觉。
zh_hant: 根據預設，信任的根憑證授權單位的憑證存放區，設定有一組符合 Microsoft 根憑證計劃需求的公開 CA。因為所有信任的根 CA，都可以為任何所有發出憑證，所以攻擊者可以挑選一個您自行安裝的弱式 CA 或強迫式 CA 來攻擊，而只要一個弱式、惡意或強迫式 CA，就會侵害整個系統的安全性。而且，這些攻擊還很可能輕易地就被忽略，而讓事情變得更糟。
