Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DynamicInterfaceCastableImplementationUnsupportedDescription
source: Providing a functional 'DynamicInterfaceCastableImplementationAttribute'-attributed interface requires the Default Interface Members feature, which is unsupported in Visual Basic.
cs: Poskytnutí funkčního rozhraní DynamicInterfaceCastableImplementationAttribute s atributem vyžaduje funkci Výchozí členové rozhraní, kterou Visual Basic nepodporuje.
de: Für die Bereitstellung einer funktionalen Schnittstelle mit dem Attribut "DynamicInterfaceCastableImplementationAttribute" ist das Feature der Standardschnittstellenmember erforderlich, das in Visual Basic nicht unterstützt wird.
es: Proporcionar una interfaz con atributos "DynamicInterfaceCastableImplementationAttribute" funcional requiere la característica Miembros de interfaz predeterminada, que no se admite en Visual Basic.
fr: La fourniture d’une interface fonctionnelle « DynamicInterfaceCastableImplementationAttribute' » nécessite la fonctionnalité membres d’interface par défaut, qui n’est pas prise en charge dans Visual Basic.
it: Se si specifica un'interfaccia funzionale alla quale è stato applicato l'attributo 'DynamicInterfaceCastableImplementationAttribute', è richiesta la funzionalità dei membri di interfaccia predefinita che non è supportata in Visual Basic.
ja: 機能的な 'DynamicInterfaceCastableImplementationAttribute' 属性インターフェイスを指定するには、既定のインターフェイス メンバー機能が必要です。これは、Visual Basic ではサポートされていません。
ko: 기능적인 'DynamicInterfaceCastableImplementationAttribute' 속성 인터페이스를 제공하려면 Visual Basic에서 지원되지 않는 기본 인터페이스 멤버 기능이 필요합니다.
pl: Udostępnienie funkcjonalnego atrybutu „DynamicInterfaceCastableImplementationAttribute” wymaga funkcji Domyślne składowe interfejsu, która nie jest obsługiwana w języku Visual Basic.
pt_br: Fornecer uma interface funcional atribuída a 'DynamicInterfaceCastableImplementationAttribute' requer o recurso Membros da Interface Padrão, que não tem suporte no Visual Basic.
ru: Для обеспечения функционального интерфейса с атрибутом "DynamicInterfaceCastableImplementationAttribute" требуется функция стандартных элементов интерфейса, которая не поддерживается в Visual Basic.
tr: İşlevsel bir 'DynamicInterfaceCastableImplementationAttribute'-öznitelikli arabirim sağlamak için Visual Basic’te desteklenmeyen Varsayılan Arabirim Üyeleri özelliği gereklidir.
zh_hans: 提供功能 “DynamicInterfaceCastableImplementationAttribute” 特性化接口需要默认接口成员功能，这在 Visual Basic 中不受支持。
zh_hant: 提供功能性 'DynamicInterfaceCastableImplementationAttribute' 屬性介面需要預設的介面成員功能，但 Visual Basic 不支援此功能。

# DynamicInterfaceCastableImplementationUnsupportedMessage
source: Providing a 'DynamicInterfaceCastableImplementation' interface in Visual Basic is unsupported
cs: Poskytování rozhraní DynamicInterfaceCastableImplementation se ve Visual Basic nepodporuje.
de: Die Bereitstellung einer DynamicInterfaceCastableImplementation-Schnittstelle in Visual Basic wird nicht unterstützt.
es: No se admite el suministro de una interfaz "DynamicInterfaceCastableImplementation" en Visual Basic
fr: La fourniture d’une interface ’DynamicInterfaceCastableImplementation’ dans Visual Basic n’est pas prise en charge.
it: In Visual Basic non è supportata la specifica di un'interfaccia 'DynamicInterfaceCastableImplementation'
ja: Visual Basic での 'DynamicInterfaceCastableImplementation' インターフェイスの指定はサポートされていません
ko: Visual Basic에서 'DynamicInterfaceCastableImplementation' 인터페이스 제공은 지원되지 않습니다.
pl: Udostępnianie interfejsu „DynamicInterfaceCastableImplementation” w języku Visual Basic nie jest obsługiwane
pt_br: Não há suporte para o fornecimento de uma interface 'DynamicInterfaceCastableImplementation' Visual Basic suporte
ru: Предоставление интерфейса "DynamicInterfaceCastableImplementation" не поддерживается в Visual Basic
tr: Visual Basic içinde 'DynamicInterfaceCastableImplementation' arabirimi sağlama desteklenmiyor
zh_hans: 不支持在 Visual Basic 中提供 “DynamicInterfaceCastableImplementation” 接口
zh_hant: 不支援在 Visual Basic 中提供 'DynamicInterfaceCastableImplementation' 介面

# DynamicInterfaceCastableImplementationUnsupportedTitle
source: Providing a 'DynamicInterfaceCastableImplementation' interface in Visual Basic is unsupported
cs: Poskytování rozhraní DynamicInterfaceCastableImplementation se ve Visual Basic nepodporuje.
de: Die Bereitstellung einer DynamicInterfaceCastableImplementation-Schnittstelle in Visual Basic wird nicht unterstützt
es: No se admite el suministro de una interfaz "DynamicInterfaceCastableImplementation" en Visual Basic
fr: La fourniture d’une interface ’DynamicInterfaceCastableImplementation’ dans Visual Basic n’est pas prise en charge.
it: In Visual Basic non è supportata la specifica di un'interfaccia 'DynamicInterfaceCastableImplementation'
ja: Visual Basic での 'DynamicInterfaceCastableImplementation' インターフェイスの指定はサポートされていません
ko: Visual Basic에서 'DynamicInterfaceCastableImplementation' 인터페이스 제공은 지원되지 않습니다.
pl: Udostępnianie interfejsu „DynamicInterfaceCastableImplementation” w języku Visual Basic nie jest obsługiwane
pt_br: Não há suporte para o fornecimento de uma interface 'DynamicInterfaceCastableImplementation' Visual Basic suporte
ru: Предоставление интерфейса "DynamicInterfaceCastableImplementation" не поддерживается в Visual Basic
tr: Visual Basic içinde 'DynamicInterfaceCastableImplementation' arabirimi sağlama desteklenmiyor
zh_hans: 不支持在 Visual Basic 中提供 “DynamicInterfaceCastableImplementation” 接口
zh_hant: 不支援在 Visual Basic 中提供 'DynamicInterfaceCastableImplementation' 介面

# FeatureUnsupportedWhenRuntimeMarshallingDisabledDescription
source: Using features that require runtime marshalling when runtime marshalling is disabled will result in runtime exceptions.
cs: Používání funkcí, které vyžadují zařazování modulu runtime, když je zařazování modulu runtime zakázané, bude mít za následek výjimky modulu runtime.
de: Die Verwendung von Features, die Runtime-Marshalling erfordern, wenn das Runtime-Marshalling deaktiviert ist, führt zu Runtime-Ausnahmen.
es: El uso de características que requieren marshalling en tiempo de ejecución cuando el marshalling en tiempo de ejecución está deshabilitada producirá excepciones en tiempo de ejecución.
fr: L’utilisation de fonctionnalités qui nécessitent le marshaling du runtime lorsque le marshaling du runtime est désactivé entraîne des exceptions d’exécution.
it: L'uso di funzionalità che richiedono il marshalling di runtime quando il marshalling di runtime è disabilitato genererà eccezioni di runtime.
ja: ランタイム マーシャリングが無効な場合にランタイム マーシャリングを必要とする機能を使用すると、ランタイム例外が発生します。
ko: 런타임 마샬링이 비활성화된 경우 런타임 마샬링이 필요한 기능을 사용하면 런타임 예외가 발생합니다.
pl: Użycie funkcji, które wymagają kierowania środowiska uruchomieniowego, gdy kierowanie środowiska uruchomieniowego jest wyłączone, spowoduje wyjątki środowiska uruchomieniowego.
pt_br: O uso de recursos que exigem marshalling em tempo de execução quando o marshalling de tempo de execução está desabilitado resultará em exceções de tempo de execução.
ru: Использование функций, для которых требуется маршалирование среды выполнения, когда оно отключено, приведет к исключениям среды выполнения.
tr: Çalışma zamanı sıralaması devre dışı bırakıldığında çalışma zamanı sıralamasını gerektiren özelliklerin kullanılması, çalışma zamanı istisnalarına neden olur.
zh_hans: 在禁用运行时封送时使用需要运行时封送的功能将导致运行时异常。
zh_hant: 停用執行階段封送處理時，使用需要執行階段封送處理的功能會導致執行階段例外狀況。

# FeatureUnsupportedWhenRuntimeMarshallingDisabledMessageAutoLayoutTypes
source: Types with '[StructLayout(LayoutKind.Auto)]' require runtime marshalling to be enabled
cs: Typy s „[StructLayout(LayoutKind.Auto)]“ vyžadují, aby bylo povoleno zařazování modulu runtime
de: Für Typen mit „[StructLayout(LayoutKind.Auto)]“ muss das Runtime-Marshalling aktiviert sein.
es: Los tipos con \"[StructLayout(LayoutKind.Auto)]\" requieren que se habilite el marshalling en tiempo de ejecución.
fr: Les types avec « [StructLayout(LayoutKind.Auto)] » nécessitent l’activation du marshaling d’exécution
it: I tipi con '[StructLayout(LayoutKind.Auto)]' richiedono l'abilitazione del marshalling di runtime
ja: '[StructLayout(LayoutKind.Auto)]' を持つ型では、ランタイム マーシャリングを有効にする必要があります
ko: '[StructLayout(LayoutKind.Auto)]' 유형은 런타임 마샬링을 활성화해야 합니다.
pl: Typy z elementem „[StructLayout(LayoutKind.Auto)]“ wymagają włączenia kierowania środowiska uruchomieniowego
pt_br: Tipos com '[StructLayout(LayoutKind.Auto)]' exigem que o marshalling em tempo de execução esteja habilitado
ru: Для типов с \"[StructLayout(LayoutKind.Auto)]\" требуется включить маршалирование среды выполнения
tr: “[StructLayout(LayoutKind.Auto)]” içeren türler, çalışma zamanı sıralamasının etkinleştirilmesini gerektirir
zh_hans: 具有 “[StructLayout(LayoutKind.Auto)]” 的类型需要启用运行时封送
zh_hant: 具有 '[StructLayout(LayoutKind.Auto)]' 的類型需要啟用執行階段封送處理

# FeatureUnsupportedWhenRuntimeMarshallingDisabledMessageByRefParameters
source: By-ref parameters require runtime marshalling to be enabled
cs: Parametry By-ref vyžadují, aby bylo povoleno zařazování modulu runtime
de: „By-ref“-Parameter erfordern die Aktivierung von Runtime-Marshalling.
es: Los parámetros por referencia requieren que se habilite el marshalling en tiempo de ejecución.
fr: Les paramètres by-ref nécessitent l’activation du marshaling d’exécution
it: I parametri by-ref richiedono l'abilitazione del marshalling di runtime
ja: 参照によるパラメーターでは、ランタイム マーシャリングを有効にする必要があります
ko: By-ref 매개 변수는 런타임 마샬링을 활성화해야 합니다.
pl: Parametry by-ref wymagają włączenia kierowania środowiska uruchomieniowego
pt_br: Os parâmetros por referência exigem que o marshalling em tempo de execução esteja habilitado
ru: Для параметров by-ref требуется включение маршалирования среды выполнения
tr: By-ref parametreleri, çalışma zamanı sıralamasının etkinleştirilmesini gerektirir
zh_hans: By-ref 参数需要启用运行时封送
zh_hant: By-ref 參數需要啟用執行階段封送處理

# FeatureUnsupportedWhenRuntimeMarshallingDisabledMessageDelegateUsage
source: Delegates with managed types as parameters or the return type require runtime marshalling to be enabled in the assembly where the delegate is defined
cs: Delegáti se spravovanými typy jako parametry nebo návratovým typem vyžadují povolení zařazování modulu runtime v sestavení, kde je definován delegát.
de: Delegates mit verwalteten Typen als Parameter oder der Rückgabetyp erfordern, dass das Marshalling der Runtime in der Assembly aktiviert ist, in der das Delegat definiert ist.
es: Los delegados con tipos administrados como parámetros o el tipo de retorno requieren que se habilite el marshalling en tiempo de ejecución en el ensamblaje donde se define el delegado
fr: Les délégués dont les paramètres ou le type de retour sont des types gérés nécessitent l'activation du marshalling à l'exécution dans l'assembly où le délégué est défini
it: I delegati con tipi gestiti come parametri o con tipo restituito richiedono l'abilitazione del marshalling di runtime nell'assembly in cui è definito il delegato.
ja: パラメーターまたは戻り値の型としてマネージド型を持つデリゲートでは、デリゲートが定義されているアセンブリでランタイム マーシャリングを有効にする必要があります。
ko: 관리되는 형식을 매개 변수로 사용하거나 반환 형식을 사용하는 대리자는 대리자가 정의된 어셈블리에서 런타임 마샬링을 사용하도록 설정해야 합니다
pl: Pełnomocnicy z typami zarządzanymi jako parametrami lub zwracanym typem wymagają włączenia kierowania środowiska uruchomieniowego w zestawie, w którym zdefiniowano pełnomocnika.
pt_br: Os delegados com tipos gerenciados como parâmetros ou o tipo de retorno exigem que o empacotamento de tempo de execução seja habilitado no assembly em que o delegado está definido
ru: Для делегатов с управляемыми типами в качестве параметров и с возвращаемыми типами требуется, чтобы в сборке, где определен делегат, был включен маршалинг среды выполнения.
tr: Parametre veya dönüş türü olarak yönetilen türlere sahip temsilciler, temsilcinin tanımlandığı derlemede çalışma zamanı sıralamasının etkinleştirilmesini gerektirir.
zh_hans: 以托管类型作为参数或返回类型的委派需要在定义该委派的程序集中启用运行时封送
zh_hant: 若委派受管理的類型為參數或傳回型別，則需要在定義委派的組件中啟用執行階段封送處理

# FeatureUnsupportedWhenRuntimeMarshallingDisabledMessageHResultSwapping
source: HResult-swapping requires runtime marshalling to be enabled
cs: HResult-swapping vyžaduje, aby bylo povoleno zařazování modulu runtime
de: Für den HResult-Austausch muss das Runtime-Marshalling aktiviert sein
es: El intercambio de HResult requiere que se habilite el marshalling en tiempo de ejecución.
fr: HResult-swapping nécessite l’activation du marshaling d’exécution
it: Per lo scambio di HResult è necessario abilitare il marshalling di runtime
ja: HResult スワップでは、ランタイム マーシャリングを有効にする必要があります
ko: HResult-swapping은 런타임 마샬링을 활성화해야 합니다.
pl: Zamiana HResult wymaga włączenia kierowania środowiska uruchomieniowego
pt_br: A troca de HResult requer que o marshalling em tempo de execução esteja habilitado
ru: Для переключения HResult требуется включить маршалирование среды выполнения
tr: HResult-swapping, çalışma zamanı sıralamasının etkinleştirilmesini gerektirir
zh_hans: HResult-swapping 需要启用运行时封送
zh_hant: HResult-swapping 需要啟用執行階段封送處理

# FeatureUnsupportedWhenRuntimeMarshallingDisabledMessageLCIDConversionAttribute
source: Using 'LCIDConversionAttribute' requires runtime marshalling to be enabled
cs: Používání „LCIDConversionAttribute“ vyžadují, aby bylo povoleno zařazování modulu runtime
de: Für die Verwendung von „LCIDConversionAttribute“ muss das Runtime-Marshalling aktiviert sein.
es: El uso de \"LCIDConversionAttribute\" requiere que se habilite el marshalling en tiempo de ejecución.
fr: L’utilisation de « LCIDConversionAttribute » nécessite l’activation du marshaling d’exécution
it: L'uso di 'LCIDConversionAttribute' richiede l'abilitazione del marshalling di runtime
ja: 'LCIDConversionAttribute' を使用するには、ランタイム マーシャリングを有効にする必要があります
ko: 'LCIDConversionAttribute'를 사용하려면 런타임 마샬링을 활성화해야 합니다.
pl: Użycie atrybutu „LCIDConversionAttribute“ wymaga włączenia kierowania środowiska uruchomieniowego
pt_br: O uso de 'LCIDConversionAttribute' requer que o marshalling em tempo de execução esteja habilitado
ru: Для использования LCIDConversionAttribute требуется включить маршалирование среды выполнения
tr: “LCIDConversionAttribute” kullanımı, çalışma zamanı sıralamasının etkinleştirilmesini gerektirir
zh_hans: 使用 “LCIDConversionAttribute” 需要启用运行时封送
zh_hant: 使用 'LCIDConversionAttribute' 需要啟用執行階段封送處理

source: Managed parameter or return types require runtime marshalling to be enabled
cs: Spravovaný parametr nebo typy vratek vyžadují, aby bylo povoleno zařazování modulu runtime
de: Für verwaltete Parameter oder Rückgabetypen muss das Runtime-Marshalling aktiviert sein
es: Los tipos de parámetros administrados o de valor devuelto requieren que se habilite el mashalling en tiempo de ejecución.
fr: Les types de paramètres managés ou de retour nécessitent l’activation du marshaling au moment de l’exécution
it: I tipi restituiti o di parametro gestiti richiedono l'abilitazione del marshalling di runtime
ja: マネージド パラメーターまたは戻り値の型では、ランタイム マーシャリングを有効にする必要があります
ko: 관리되는 매개 변수 또는 반환 유형은 런타임 마샬링을 활성화해야 합니다.
pl: Typy parametrów zarządzanych lub zwracanych wymagają włączenia kierowania środowiska uruchomieniowego
pt_br: Os tipos de parâmetro gerenciado ou retorno exigem que o marshalling em tempo de execução esteja habilitado
ru: Для управляемых параметров или типов возвращаемых значений требуется включить маршалирование среды выполнения
tr: Yönetilen parametre veya dönüş türleri, çalışma zamanı sıralamasının etkinleştirilmesini gerektirir
zh_hans: 托管参数或返回类型需要启用运行时封送
zh_hant: 受控參數或傳回類型需要啟用執行階段封送處理

# FeatureUnsupportedWhenRuntimeMarshallingDisabledMessageSetLastError
source: Setting SetLastError to 'true' requires runtime marshalling to be enabled
cs: Nastavení SetLastError na „true“ vyžaduje, aby bylo povoleno zařazování modulu runtime
de: Wenn „SetLastError“ auf TRUE festgelegt wird, muss das Runtime Marshalling aktiviert sein.
es: Establecer SetLastError en \"true\" requiere que el marshalling en tiempo de ejecución esté habilitado
fr: La définition de SetLastError sur « true » nécessite l’activation du marshaling d’exécution
it: L'impostazione di SetLastError su 'true' richiede l'abilitazione del marshalling di runtime
ja: SetLastError を 'true' に設定するには、ランタイム マーシャリングを有効にする必要があります
ko: SetLastError를 'true'로 설정하려면 런타임 마샬링을 활성화해야 합니다.
pl: Ustawienie wartości SetLastError na wartość „True“ wymaga włączenia kierowania środowiska uruchomieniowego
pt_br: Definir SetLastError como 'true' requer que o marshalling em tempo de execução esteja habilitado
ru: Чтобы задать значение true для SetLastError, необходимо включить маршалирование среды выполнения
tr: SetLastError'ın “true” olarak ayarlanması, çalışma zamanı sıralamasının etkinleştirilmesini gerektirir
zh_hans: 将 SetLastError 设置为 “true” 需要启用运行时封送
zh_hant: 將 SetLastError 設定為 'true' 需要啟用執行階段封送處理

# FeatureUnsupportedWhenRuntimeMarshallingDisabledMessageVarargPInvokes
source: Varadic P/Invoke signatures require runtime marshalling to be enabled
cs: Varadic P/Invoke signatures vyžaduje, aby bylo povoleno zařazování modulu runtime
de: Für Varadic-P/Invoke-Signaturen muss das Runtime-Marshalling aktiviert sein
es: Las firmas Varadic P/Invoke en tiempo de ejecución requieren que se habilite el marshalling en tiempo de ejecución.
fr: Les signatures P/Invoke Varadic nécessitent l’activation du marshaling d’exécution
it: Le firme P/Invoke varadic richiedono l'abilitazione del marshalling di runtime
ja: 一定の P/Invoke 署名を使用するには、ランタイム マーシャリングを有効にする必要があります
ko: Varadic P/Invoke 서명은 런타임 마샬링을 활성화해야 합니다.
pl: Sygnatury Varadic P/Invoke wymagają włączenia kierowania środowiska uruchomieniowego
pt_br: As assinaturas varadic P/Invoke exigem que o marshalling em tempo de execução esteja habilitado
ru: Для подписей Varadic P/Invoke требуется включить маршалирование среды выполнения
tr: Varadic P/Invoke imzaları, çalışma zamanı sıralamasının etkinleştirilmesini gerektirir
zh_hans: Varadic P/Invoke 签名需要启用运行时封送
zh_hant: Varadic P/Invoke 簽章需要啟用執行階段封送處理

# FeatureUnsupportedWhenRuntimeMarshallingDisabledTitle
source: Property, type, or attribute requires runtime marshalling
cs: Vlastnost, typ nebo atribut vyžaduje zařazování modulu runtime
de: Eigenschaft, Typ oder Attribut erfordert Runtime-Marshalling.
es: La propiedad, el tipo o el atributo requiere marshalling en tiempo de ejecución
fr: La propriété, le type ou l’attribut nécessite un marshaling au moment de l’exécution
it: La proprietà, il tipo o l'attributo richiede il marshalling di runtime
ja: プロパティ、型、または属性にはランタイム マーシャリングが必要です
ko: 속성, 유형 또는 특성에는 런타임 마샬링이 필요합니다.
pl: Właściwość, typ lub atrybut wymaga kierowania środowiska uruchomieniowego
pt_br: Propriedade, tipo ou atributo requer marshalling de tempo de execução
ru: Для свойства, типа или атрибута требуется маршалирование среды выполнения
tr: Özellik, tür veya öznitelik, çalışma zamanı sıralamasını gerektirir
zh_hans: 属性、类型或特性需要运行时封送
zh_hant: 屬性、類型或屬性需要執行階段封送處理

# FieldIsPreviewTypeMessage
source: '{0}''s type contains the preview type '{1}' and requires opting into preview features. See {2} for more information.
cs: Typ {0} obsahuje typ preview {1} a vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: Der Typ von „{0}“ enthält den Vorschautyp „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: '{0}''s type contiene el tipo de vista previa '{1}' y requiere la participación en las características en versión preliminar. Consulte {2} para obtener más información.
fr: Le type de « {0} » contient le type d’aperçu « {1} » et requiert l’option préverser les fonctionnalités en préversion. Pour plus d’informations, consultez {2}.
it: Il tipo di '{0}' contiene il tipo di anteprima '{1}' e richiede il consenso esplicito per le funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: '{0}' の型には、プレビューの種類 '{1}' が含まれており、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: '{0}'의 유형에 미리 보기 유형 '{1}'이(가) 포함되어 있으며 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}을(를) 참조하세요.
pl: Typ elementu „{0}” zawiera typ w wersji zapoznawczej „{1}” i wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: O tipo de “{0}” contém o tipo de visualização “{1}” ' e requer a aceitação dos recursos de visualização. Consulte {2} para obter mais informações.
ru: Тип "{0}" содержит предварительную версию типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: '{0}' türü '{1}' önizleme türünü içerdiğinden önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: “{0}”类型包含预览类型“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: '{0}' 的類型包含預覽類型 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# FieldIsPreviewTypeMessageWithCustomMessagePlaceholder
source: {3} '{0}''s type contains the preview type '{1}' and requires opting into preview features. See {2} for more information.
cs: Typ {3}{0} obsahuje typ preview {1} a vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: {3} Der Typ von „{0}“ enthält den Vorschautyp „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: {3} '{0}''' contiene el tipo de vista previa '{1}' y requiere la participación en las características en versión preliminar. Consulte {2} para obtener más información.
fr: Le type de « {3}{0} » contient le type d’aperçu « {1} » et requiert l’option préverser les fonctionnalités en préversion. Pour plus d’informations, consultez {2}.
it: Il tipo di '{3} '{0}' contiene il tipo di anteprima '{1}' e richiede il consenso esplicito per le funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: {3} '{0}' の型には、プレビューの種類 '{1}' が含まれており、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: {3} '{0}'의 유형에 '{1}' 미리 보기 유형이 포함되어 있으며 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}(을)를 참조하세요.
pl: {3} „{0}” — typ tego elementu zawiera typ w wersji zapoznawczej „{1}” i wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: {3}O tipo de “{0}” contém o tipo de visualização “{1}” e requer a aceitação dos recursos de visualização. Consulte {2} para obter mais informações.
ru: Тип "{0}" {3} содержит предварительную версию типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: {3} '{0}' türü, '{1}' önizleme türünü içerdiğinden önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: {3}.“{0}”类型包含预览类型“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: {3} '{0}' 的類型包含預覽類型 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。
