Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ReviewCodeForDllInjectionVulnerabilitiesMessage
source: Potential DLL injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží knihovny DLL, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch DLL-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de DLL en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de DLL a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo DLL injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な DLL インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 DLL 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie biblioteki DLL, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de DLL, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению DLL, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası DLL ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在的 DLL 注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入 DLL 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForDllInjectionVulnerabilitiesTitle
source: Review code for DLL injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží knihovny DLL v kódu
de: Code auf Sicherheitsrisiken durch DLL-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de DLL en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de DLL
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo DLL injection
ja: コードをレビューし、DLL インジェクションの脆弱性を確認する
ko: 코드에서 DLL 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie biblioteki DLL
pt_br: Revisão de código quanto a vulnerabilidades de injeção de DLL
ru: Проверьте код на наличие уязвимостей к внедрению DLL
tr: Kodu DLL ekleme güvenlik açıkları için inceleyin
zh_hans: 查看 DLL 注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有 DLL 插入弱點

# ReviewCodeForFilePathInjectionVulnerabilitiesMessage
source: Potential file path injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží cesty k souboru, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Dateipfadeinschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de rutas de acceso de archivos en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de chemin de fichier a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo file path injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なファイル パス インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 파일 경로 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie ścieżki pliku, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de caminho, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению пути к файлу, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası dosya yolu ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在的文件路径注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入檔案路徑弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForFilePathInjectionVulnerabilitiesTitle
source: Review code for file path injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží cesty k souboru v kódu
de: Code auf Sicherheitsrisiken durch Dateipfadeinschleusung überprüfen
es: Revisar vulnerabilidades de inyección de rutas de acceso de archivos en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de chemin de fichier
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo file path injection
ja: コードをレビューし、ファイル パス インジェクションの脆弱性を確認する
ko: 코드에서 파일 경로 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie ścieżki pliku
pt_br: Revisão de código quanto a vulnerabilidades de injeção de caminho
ru: Проверьте код на наличие уязвимостей к внедрению пути к файлу
tr: Kodu dosya yolu ekleme güvenlik açıkları için inceleyin
zh_hans: 查看文件路径注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入檔案路徑弱點

# ReviewCodeForInformationDisclosureVulnerabilitiesMessage
source: Potential information disclosure vulnerability was found where '{0}' in method '{1}' may contain unintended information from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení zpřístupněním informací, kde {0} v metodě {1} může neúmyslně obsahovat informace z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Informationsoffenlegung gefunden. "{0}" in der Methode "{1}" enthält möglicherweise nicht beabsichtigte Informationen aus "{2}" in Methode "{3}".
es: Se encontró una vulnerabilidad potencial de divulgación de información en la que "{0}" en el método "{1}" puede contener información no deseada de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à la divulgation d'informations a été détectée. '{0}' dans la méthode '{1}' peut contenir des informations non souhaitées en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo diffusione di informazioni in cui '{0}' nel metodo '{1}' può contenere informazioni non intenzionali di '{2}' nel metodo '{3}'.
ja: 潜在的な情報漏えいの脆弱性が見つかりました。メソッド '{1}' の '{0}' に、メソッド '{3}' の '{2}' からの意図しない情報が含まれる可能性があります。
ko: '{1}' 메서드의 '{0}'에 '{3}' 메서드에 있는 '{2}'의 의도하지 않은 데이터가 포함될 수 있는 잠재적인 정보 공개 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą ujawnienie informacji, gdzie element „{0}” w metodzie „{1}” może zawierać niezamierzone informacje z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de divulgação não autorizada de informação, em que o '{0}' no método '{1}' pode conter informações não intencionais de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к раскрытию информации, где "{0}" в методе "{1}" может содержать нежелательные сведения из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan istenmeyen bilgileri içeriyor olabileceği, bilgilerin açığa çıkmasına yönelik olası bir güvenlik açığı bulundu.
zh_hans: 找到了潜在信息泄露漏洞，其中方法“{1}”中的“{0}”可能包含方法“{3}”中“{2}”的意外信息。
zh_hant: 發現潛在的資訊洩漏弱點，方法 '{1}' 中的 '{0}' 可能包含來自方法 '{3}' 中 '{2}' 誤用的資訊

# ReviewCodeForInformationDisclosureVulnerabilitiesTitle
source: Review code for information disclosure vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení zpřístupněním informací
de: Code auf Sicherheitsrisiken durch Informationsoffenlegung überprüfen
es: Revisar vulnerabilidades de divulgación de información en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une divulgation d'informations
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo diffusione di informazioni
ja: コードをレビューし、情報漏えいの脆弱性を確認する
ko: 코드에서 정보 공개 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających ujawnienie informacji
pt_br: Revisão de código quanto a vulnerabilidades de divulgação não autorizada de informação
ru: Проверьте код на наличие уязвимостей к раскрытию информации
tr: Kodu bilgilerin açığa çıkması güvenlik açıkları için inceleyin
zh_hans: 查看信息泄露漏洞的代码
zh_hant: 檢閱程式碼以了解是否有資訊洩漏弱點

# ReviewCodeForLdapInjectionVulnerabilitiesMessage
source: Potential LDAP injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží protokolu LDAP, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch LDAP-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de LDAP en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection LDAP a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo LDAP injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な LDAP インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 LDAP 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie protokołu LDAP, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de LDAP, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению LDAP, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası LDAP ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在 LDAP 注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入 LDAP 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForLdapInjectionVulnerabilitiesTitle
source: Review code for LDAP injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží protokolu LDAP v kódu
de: Code auf Sicherheitsrisiken durch LDAP-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de LDAP en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection LDAP
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo LDAP injection
ja: コードをレビューし、LDAP インジェクションの脆弱性を確認する
ko: 코드에서 LDAP 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie protokołu LDAP
pt_br: Revisão de código quanto a vulnerabilidades de injeção de LDAP
ru: Проверьте код на наличие уязвимостей к внедрению LDAP
tr: Kodu LDAP ekleme güvenlik açıkları için inceleyin
zh_hans: 查看 LDAP 注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入 LDAP 弱點

# ReviewCodeForOpenRedirectVulnerabilitiesMessage
source: Potential open redirect vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení otevřeným přesměrováním, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch offene Umleitung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de redireccionamiento abierto en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une redirection ouverte a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo reindirizzamento aperto in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なオープン リダイレクトの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 오픈 리디렉션 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą istnienie otwartego przekierowania, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de redirecionamento aberto, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к открытому перенаправлению, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası açık yeniden yönlendirme güvenlik açığı bulundu.
zh_hans: 找到了潜在开放重定向漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的開啟重新導向弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForOpenRedirectVulnerabilitiesTitle
source: Review code for open redirect vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení otevřeným přesměrováním
de: Code auf Sicherheitsrisiken durch offene Umleitung überprüfen
es: Revisar vulnerabilidades de redireccionamiento abierto en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une redirection ouverte
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo reindirizzamento aperto
ja: コードをレビューし、オープン リダイレクトの脆弱性を確認する
ko: 코드에서 오픈 리디렉션 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających otwarcie przekierowania
pt_br: Revisão de código quanto a vulnerabilidades de redirecionamento aberto
ru: Проверьте код на наличие уязвимостей к открытому перенаправлению
tr: Kodu açık yeniden yönlendirme güvenlik açıkları için inceleyin
zh_hans: 查看开放重定向漏洞的代码
zh_hant: 檢閱程式碼以了解是否有開啟重新導向弱點

# ReviewCodeForProcessCommandInjectionVulnerabilitiesMessage
source: Potential process command injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží příkazu procesu, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Prozessbefehlseinschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de comandos de proceso en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de commande de processus a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo process command injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なプロセス コマンド インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 프로세스 명령 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie polecenia procesu, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de comando de processo, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению команд процесса, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası işlem komutu ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在进程命令注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入處理序命令弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForProcessCommandInjectionVulnerabilitiesTitle
source: Review code for process command injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží příkazu procesu v kódu
de: Code auf Sicherheitsrisiken durch Prozessbefehlseinschleusung überprüfen
es: Revisar vulnerabilidades de inyección de comandos de proceso en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de commande de processus
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo process command injection
ja: コードをレビューし、プロセス コマンド インジェクションの脆弱性を確認する
ko: 코드에서 프로세스 명령 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie polecenia procesu
pt_br: Revisão de código quanto a vulnerabilidades de injeção de comando de processo
ru: Проверьте код на наличие уязвимостей к внедрению команд процесса
tr: Kodu işlem komutu ekleme güvenlik açıkları için inceleyin
zh_hans: 查看进程命令注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入處理序命令弱點

# ReviewCodeForRegexInjectionVulnerabilitiesMessage
source: Potential regex injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží regulárního výrazu, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Einschleusung regulärer Ausdrücke gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de expresiones regulares en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection regex a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo regex injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な正規表現インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 regex 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie wyrażenia regularnego, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de regex, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению регулярных выражений, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası normal ifade ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在正则表达式注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入 regex 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForRegexInjectionVulnerabilitiesTitle
source: Review code for regex injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží regulárního výrazu v kódu
de: Code auf Sicherheitsrisiken durch Einschleusung regulärer Ausdrücke überprüfen
es: Revisar vulnerabilidades de inyección de expresiones regulares en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection regex
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo regex injection
ja: コードをレビューし、正規表現インジェクションの脆弱性を確認する
ko: 코드에서 regex 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie wyrażenia regularnego
pt_br: Revisão de código quanto a vulnerabilidades de injeção de regex
ru: Проверьте код на наличие уязвимостей к внедрению регулярных выражений
tr: Kodu normal ifade ekleme güvenlik açıkları için inceleyin
zh_hans: 查看正则表达式注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入 regex 弱點
