Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AvoidSingleUseOfLocalJsonSerializerOptionsDescription
source: Avoid creating a new 'JsonSerializerOptions' instance for every serialization operation. Cache and reuse instances instead. Single use 'JsonSerializerOptions' instances can substantially degrade the performance of your application.
cs: Vyhněte se vytvoření nové instance JsonSerializerOptions pro každou operaci serializace. Místo toho ukládejte instance do mezipaměti a znovu je používejte. Instance JsonSerializerOptions pro jedno použití můžou výrazně snížit výkon vaší aplikace.
de: Erstellen Sie für Serialisierungsvorgänge nicht jeweils eine neue JsonSerializerOptions-Instanz. Speichern Sie stattdessen Instanzen zwischen, und verwenden Sie sie wieder. Die einmalige Verwendung von JsonSerializerOptions-Instanzen kann die Leistung Ihrer Anwendung erheblich beeinträchtigen.
es: Evite crear una nueva instancia de "JsonSerializerOptions" para cada operación de serialización. En su lugar, almacene en caché y reutilice instancias. Las instancias "JsonSerializerOptions" de uso único pueden degradar considerablemente el rendimiento de la aplicación.
fr: Évitez de créer une instance « JsonSerializerOptions » pour chaque opération de sérialisation. Mettez en cache et réutilisez les instances à la place. Les instances « JsonSerializerOptions » à usage unique peuvent considérablement dégrader les performances de votre application.
it: Evitare di creare una nuova istanza di 'JsonSerializerOptions' per ogni operazione di serializzazione. Memorizzare nella cache le istanze e riutilizzarle. Le istanze monouso di 'JsonSerializerOptions' possono ridurre notevolmente le prestazioni dell'applicazione.
ja: シリアル化操作ごとに新しい 'JsonSerializerOptions' インスタンスを作成しないでください。代わりにインスタンスをキャッシュして再利用します。'JsonSerializerOptions' インスタンスの単独使用では、アプリケーションのパフォーマンスが大幅に低下する可能性があります。
ko: 모든 직렬화 작업에 대해 새 'JsonSerializerOptions' 인스턴스를 만들지 마세요. 대신 인스턴스를 캐시하고 다시 사용합니다. 단일 사용 'JsonSerializerOptions' 인스턴스는 애플리케이션의 성능을 크게 저하시킬 수 있습니다.
pl: Unikaj tworzenia nowego wystąpienia „JsonSerializerOptions” dla każdej operacji serializacji. Zamiast tego buforuj i ponownie wykorzystuj wystąpienia. Jednorazowe użycie wystąpienia „JsonSerializerOptions” może znacznie obniżyć wydajność aplikacji.
pt_br: Evite criar uma nova instância 'JsonSerializerOptions' para cada operação de serialização. Em vez disso, armazene em cache e reutilize instâncias. Instâncias 'JsonSerializerOptions' de uso único podem degradar substancialmente o desempenho de seu aplicativo.
ru: Избегайте создания нового экземпляра "JsonSerializerOptions" для каждой операции сериализации. Выполняйте кэширование и повторно используйте экземпляры. Однократное использование экземпляров "JsonSerializerOptions" может значительно снизить производительность приложения.
tr: Her serileştirme işlemi için yeni bir 'JsonSerializerOptions' örneği oluşturmaktan kaçının. Bunun yerine örnekleri önbelleğe alıp yeniden kullanın. Tek kullanımlık 'JsonSerializerOptions' örnekleri uygulamanızın performansını önemli ölçüde düşürebilir.
zh_hans: 避免为每个序列化操作创建新的“JsonSerializerOptions”实例。请改为缓存和重用实例。仅使用“JsonSerializerOptions”实例可能会显著降低应用程序的性能。
zh_hant: 避免為每個序列化作業建立新的 'JsonSerializerOptions' 執行個體。改為快取並重新使用執行個體。單一使用 'JsonSerializerOptions' 執行個體可能會大幅降低應用程式的效能。

# AvoidSingleUseOfLocalJsonSerializerOptionsMessage
source: Avoid creating a new 'JsonSerializerOptions' instance for every serialization operation. Cache and reuse instances instead.
cs: Vyhněte se vytvoření nové instance JsonSerializerOptions pro každou operaci serializace. Místo toho ukládejte instance do mezipaměti a znovu je používejte.
de: Erstellen Sie für Serialisierungsvorgänge nicht jeweils eine neue JsonSerializerOptions-Instanz. Speichern Sie stattdessen Instanzen zwischen, und verwenden Sie sie wieder.
es: Evite crear una nueva instancia de "JsonSerializerOptions" para cada operación de serialización. En su lugar, almacene en caché y reutilice instancias.
fr: Évitez de créer une instance « JsonSerializerOptions » pour chaque opération de sérialisation. Mettez en cache et réutilisez les instances à la place.
it: Evitare di creare una nuova istanza di 'JsonSerializerOptions' per ogni operazione di serializzazione. Memorizzare nella cache le istanze e riutilizzarle.
ja: シリアル化操作ごとに新しい 'JsonSerializerOptions' インスタンスを作成しないでください。代わりにインスタンスをキャッシュして再利用します。
ko: 모든 직렬화 작업에 대해 새 'JsonSerializerOptions' 인스턴스를 만들지 마세요. 대신 인스턴스를 캐시하고 다시 사용하세요.
pl: Unikaj tworzenia nowego wystąpienia „JsonSerializerOptions” dla każdej operacji serializacji. Zamiast tego buforuj i ponownie używaj wystąpień.
pt_br: Evite criar uma nova instância 'JsonSerializerOptions' para cada operação de serialização. Em vez disso, armazene em cache e reutilize instâncias.
ru: Избегайте создания нового экземпляра "JsonSerializerOptions" для каждой операции сериализации. Выполняйте кэширование и повторно используйте экземпляры.
tr: Her serileştirme işlemi için yeni bir 'JsonSerializerOptions' örneği oluşturmaktan kaçının. Bunun yerine örnekleri önbelleğe alıp yeniden kullanın.
zh_hans: 避免为每个序列化操作创建新的“JsonSerializerOptions”实例。请改为缓存和重用实例。
zh_hant: 避免為每個序列化作業建立新的 'JsonSerializerOptions' 執行個體。改為快取並重新使用執行個體。

# AvoidSingleUseOfLocalJsonSerializerOptionsTitle
source: Cache and reuse 'JsonSerializerOptions' instances
cs: Ukládání instancí JsonSerializerOptions do mezipaměti a jejich opakované používání
de: JsonSerializerOptions-Instanzen zwischenspeichern und wiederverwenden
es: Almacenamiento en caché y reutilización de instancias de "JsonSerializerOptions"
fr: Mettre en cache et réutiliser les instances « JsonSerializerOptions »
it: Memorizza nella cache e riutilizza le istanze di 'JsonSerializerOptions'
ja: 'JsonSerializerOptions' インスタンスをキャッシュして再利用する
ko: 'JsonSerializerOptions' 인스턴스 캐시 및 다시 사용
pl: Buforuj i ponownie używaj wystąpień „JsonSerializerOptions”
pt_br: Armazenar em cache e reutilizar instâncias 'JsonSerializerOptions'
ru: Кэширование и повторное использование экземпляров "JsonSerializerOptions"
tr: 'JsonSerializerOptions' örneklerini önbelleğe alıp yeniden kullanma
zh_hans: 缓存并重用“JsonSerializerOptions”实例
zh_hant: 快取並重新使用 'JsonSerializerOptions' 執行個體

# AvoidStringBuilderPInvokeParametersDescription
source: Marshalling of 'StringBuilder' always creates a native buffer copy, resulting in multiple allocations for one marshalling operation.
cs: Zařazením parametru StringBuilder se vždy vytvoří kopie nativní vyrovnávací paměti, která bude mít za následek vícenásobné přidělení pro jednu operaci zařazování.
de: Beim Marshalling von "StringBuilder" wird immer eine native Pufferkopie erstellt, sodass mehrere Zuordnungen für einen Marshallingvorgang vorhanden sind.
es: Al serializar "StringBuilder" siempre se crea una copia del búfer nativo, lo que da lugar a varias asignaciones para una operación de serialización.
fr: Le marshaling de 'StringBuilder' crée toujours une copie de la mémoire tampon native, ce qui entraîne plusieurs allocations pour une seule opération de marshaling.
it: Il marshalling di 'StringBuilder' crea sempre una copia del buffer nativo, di conseguenza vengono generate più allocazioni per una singola operazione di marshalling.
ja: 'StringBuilder' をマーシャリングすると、ネイティブ バッファーのコピーが常に作成され、1 回のマーシャリング操作に対して複数の割り当てが発生します。
ko: 'StringBuilder'를 마샬링하는 경우 항상 네이티브 버퍼 복사본이 만들어지므로 하나의 마샬링 작업에 대해 할당이 여러 번 이루어집니다.
pl: Marshalling elementu „StringBuilder” zawsze tworzy natywną kopię buforu, co powoduje powstanie wielu alokacji dla jednej operacji marshallingu.
pt_br: O marshaling de 'StringBuilder' sempre cria uma cópia de buffer nativo, resultando em várias alocações para uma operação de marshalling.
ru: При маршалировании "StringBuilder" всегда создается собственная копия буфера, что приводит к множественным выделениям для одной операции маршалирования.
tr: 'StringBuilder' öğesinin hazırlanması her zaman, bir hazırlama işlemi için birden çok ayırmaya neden olan yerel arabellek kopyası oluşturur.
zh_hans: "StringBuilder" 的封送处理总是会创建一个本机缓冲区副本，这导致一个封送处理操作出现多次分配。
zh_hant: 封送處理 'StringBuilder' 一律都會建立原生緩衝區複本，因而導致單一封送處理作業出現多重配置。

# AvoidStringBuilderPInvokeParametersMessage
source: Avoid 'StringBuilder' parameters for P/Invokes. Consider using a character buffer instead.
cs: Nepoužívejte parametry StringBuilder pro volání nespravovaného kódu (P/Invokes). Místo toho zvažte možnost použít vyrovnávací paměť znaků.
de: Vermeiden Sie StringBuilder-Parameter für "P/Invokes". Erwägen Sie stattdessen die Verwendung eines Zeichenpuffers.
es: Evite los parámetros "StringBuilder" para los elementos P/Invoke. Considere la posibilidad de usar un búfer de caracteres en su lugar.
fr: Évitez les paramètres 'StringBuilder' pour les P/Invoke. À la place, utilisez une mémoire tampon de caractères.
it: Evitare i parametri 'StringBuilder' per i metodi P/Invoke. In alternativa, provare a usare un buffer di caratteri.
ja: P/Invoke に 'StringBuilder' パラメーターを使用しないでください。代わりに、文字バッファーを使用することをご検討ください。
ko: P/Invokes에는 'StringBuilder' 매개 변수를 사용하지 마세요. 대신 문자 버퍼를 사용해 보세요.
pl: Unikaj parametrów „StringBuilder” dla elementów P/Invoke. Zamiast tego rozważ użycie bufora znaku.
pt_br: Evite os parâmetros 'StringBuilder' para P/Invokes. Nesse caso, considere usar um buffer de caractere.
ru: Старайтесь не использовать параметры StringBuilder для P/Invokes. Вместо этого используйте символьный буфер.
tr: P/Invoke'lar için 'StringBuilder' parametreleri kullanmaktan kaçının. Bunun yerine bir karakter arabelleği kullanabilirsiniz.
zh_hans: 不要对 P/Invoke 使用 "StringBuilder" 参数。请考虑改用字符缓冲区。
zh_hant: 請勿對 P/Invoke 使用 'StringBuilder' 參數。請考慮改用字元緩衝區。

# AvoidStringBuilderPInvokeParametersTitle
source: Avoid 'StringBuilder' parameters for P/Invokes
cs: Nepoužívejte parametry StringBuilder pro volání nespravovaného kódu
de: StringBuilder-Parameter für "P/Invokes" vermeiden
es: Evitar los parámetros "StringBuilder" para los elementos P/Invoke
fr: Éviter les paramètres 'StringBuilder' pour les P/Invoke
it: Evitare i parametri 'StringBuilder' per i metodi P/Invoke
ja: P/Invoke の 'StringBuilder' パラメーターを使用しないでください
ko: P/Invokes에는 'StringBuilder' 매개 변수를 사용하지 마세요.
pl: Unikaj parametrów „StringBuilder” dla elementów P/Invoke
pt_br: Evite os parâmetros 'StringBuilder' para P/Invokes
ru: Избегайте использования параметров "StringBuilder" для P/Invokes
tr: P/Invoke'lar için 'StringBuilder' parametreleri kullanmaktan kaçının
zh_hans: 不要对 P/Invoke 使用 "StringBuilder" 参数
zh_hant: 請勿對 P/Invoke 使用 'StringBuilder' 參數

# AvoidUnreliableStreamReadCodeFixTitle
source: Use 'Stream.ReadExactly'
cs: Použít Stream.ReadExactly
de: Verwenden von „Stream.ReadExactly“
es: Usar "Stream.ReadExactly"
fr: Utiliser 'Stream.ReadExactly'
it: Usare "Stream. ReadExactly"
ja: 'Stream.ReadExactly' を使用
ko: 'Stream.ReadExactly' 사용
pl: Użyj elementu „Stream.ReadExactly”
pt_br: Usar 'Stream.ReadExactly'
ru: Используйте "Stream.ReadExactly"
tr: 'Stream.ReadExactly' kullan
zh_hans: 使用 "Stream.ReadExactly"
zh_hant: 使用 'Stream.ReadExactly'

# AvoidUnreliableStreamReadDescription
source: A call to 'Stream.Read' may return fewer bytes than requested, resulting in unreliable code if the return value is not checked.
cs: Volání Stream.Read může vrátit méně bajtů, než bylo požadováno, což vede k nespolehlivé kódu, pokud není vrácená hodnota zkontrolována.
de: Ein Aufruf von „Stream.Read“ gibt möglicherweise weniger Bytes als angefordert zurück, was zu unzuverlässigem Code führt, wenn der Rückgabewert nicht überprüft wird.
es: Una llamada a "Stream.Read" puede devolver menos bytes de los solicitados, lo que da lugar a código no confiable si no se comprueba el valor devuelto.
fr: Un appel à « Stream.Read » peut retourner moins d’octets que demandé, ce qui entraîne un code non fiable si la valeur de retour n’est pas vérifiée.
it: Una chiamata a "Stream. Read" può restituire un numero di byte inferiore a quello richiesto. Se il valore restituito non è selezionato, il codice non è affidabile.
ja: 'Stream.Read' の呼び出しでは、要求されたバイト数よりも少ないバイト数が返される可能性があります。戻り値がチェックされていない場合は、コードの信頼性が低くなります。
ko: 'Stream.Read'에 대한 호출은 요청된 바이트보다 적은 바이트를 반환할 수 있으므로 반환 값을 확인하지 않으면 신뢰할 수 없는 코드가 됩니다.
pl: Wywołanie „Stream.Read” może zwrócić mniej bajtów niż żądano, powodując niewiarygodny kod, jeśli wartość zwracana nie jest zaznaczona.
pt_br: Uma chamada para 'Stream.Read' pode retornar menos bytes do que o solicitado, resultando em código não confiável se o valor retornado não estiver marcado.
ru: Вызов "Stream.Read" может возвращать меньшее количество байтов, чем было запрошено. Это может сделать код ненадежным, если не проверять возвращаемое значение.
tr: 'Stream.Read' çağrısı istenenden daha az bayt döndürerek dönüş değeri denetlenmezse güvenilir olmayan koda neden olabilir.
zh_hans: 对 "Stream.Read" 的调用返回的字节数可能少于请求的字节数，如果未选中返回值，则会导致代码不可靠。
zh_hant: 呼叫 'Stream.Read' 傳回的位元組數可能少於要求的位元組，如果未檢查值，將導致程式碼不可靠。

# AvoidUnreliableStreamReadMessage
source: Avoid inexact read with '{0}'
cs: Vyhněte se nepřesnému čtení pomocí {0}.
de: Ungenaues Lesen mit „{0}“ vermeiden
es: Evitar la lectura inexacta con "{0}"
fr: Éviter les lectures incorrectes avec '{0}'
it: Evitare la lettura inesatta con "{0}"
ja: '{0}' による不正確な読み取りを避ける
ko: ‘{0}’(으)로 부정확한 읽기 방지
pl: Unikaj niedokładnego odczytu za pomocą „{0}”
pt_br: Evitar leitura inexata com '{0}'
ru: Избегайте неточного чтения с помощью "{0}"
tr: '{0}' ile doğru olmayan okumalardan kaçının
zh_hans: 避免使用“{0}”进行不准确读取
zh_hant: 避免使用 '{0}' 進行不精確的讀取

# AvoidUnreliableStreamReadTitle
source: Avoid inexact read with 'Stream.Read'
cs: Vyhněte se nepřesnému čtení pomocí Stream.Read.
de: Ungenaues Lesen mit „Stream.Read“ vermeiden
es: Evite la lectura inexacta con "Stream.Read"
fr: Éviter les lectures incorrectes avec « Stream.Read »
it: Evita la lettura inesatta con "Stream.Read"
ja: 'Stream.Read' による不正確な読み取りを避ける
ko: 'Stream.Read'로 부정확한 읽기 방지
pl: Unikaj niedokładnego odczytu za pomocą „Stream.Read”
pt_br: Evitar leitura inexata com 'Stream.Read'
ru: Избегайте неточного чтения с помощью "Stream.Read"
tr: 'Stream.Read' ile doğru olmayan okumalardan kaçının
zh_hans: 避免使用 "Stream.Read" 进行不准确读取
zh_hant: 避免使用 'Stream.Read' 行不精確的讀取。

# AvoidUnsealedAttributesDescription
source: The .NET Framework class library provides methods for retrieving custom attributes. By default, these methods search the attribute inheritance hierarchy. Sealing the attribute eliminates the search through the inheritance hierarchy and can improve performance.
cs: Knihovna tříd .NET Framework poskytuje metody pro načítání vlastních atributů. Ve výchozím nastavení tyto metody prohledávají hierarchii dědičnosti atributů. Zapečetění atributu eliminuje prohledávání hierarchie dědičnosti a může zvýšit výkon.
de: Die .NET Framework-Klassenbibliothek stellt Methoden zum Abrufen benutzerdefinierter Attribute bereit. Standardmäßig durchsuchen diese Methoden die Attributvererbungshierarchie. Durch das Versiegeln des Attributs entfällt das Durchsuchen der Vererbungshierarchie, und die Leistung kann gesteigert werden.
es: La biblioteca de clases de .NET Framework proporciona los métodos para recuperar los atributos personalizados. De forma predeterminada, estos métodos buscan la jerarquía de herencia del atributo. Al sellar el atributo, se elimina la búsqueda a través de la jerarquía de herencia y puede mejorarse el rendimiento.
fr: La bibliothèque de classes .NET Framework fournit des méthodes pour récupérer les attributs personnalisés. Par défaut, ces méthodes effectuent des recherches dans la hiérarchie d'héritage des attributs. Le scellement de l'attribut permet d'éviter les recherches dans la hiérarchie d'héritage et contribue à l'amélioration des performances.
it: La libreria di classi .NET Framework fornisce i metodi per recuperare gli attributi personalizzati. Per impostazione predefinita, questi metodi eseguono ricerche nella gerarchia di ereditarietà degli attributi. L'uso di attributi sealed consente di evitare ricerche nella gerarchia di ereditarietà e può migliorare le prestazioni.
ja: .NET Framework クラス ライブラリには、カスタム属性を取得するためのメソッドが用意されています。既定では、これらのメソッドは属性継承階層を検索します。属性をシールすると、継承階層全体を検索しなくなるため、パフォーマンスが向上します。
ko: .NET Framework 클래스 라이브러리에서 사용자 지정 특성을 검색하기 위한 메서드를 제공합니다. 기본적으로 이 메서드는 특성 상속 계층 구조를 검색합니다. 특성을 봉인하면 상속 계층 구조를 통한 검색을 중단하여 성능을 향상시킬 수 있습니다.
pl: Biblioteka klas programu .NET Framework udostępnia metody umożliwiające pobieranie atrybutów niestandardowych. Domyślnie te metody przeszukują hierarchię dziedziczenia atrybutów. Zapieczętowanie atrybutu eliminuje potrzebę przeszukiwania hierarchii dziedziczenia i może podwyższyć wydajność.
pt_br: A biblioteca de classes .NET Framework oferece métodos para recuperar atributos personalizados. Por padrão, esses métodos pesquisam a hierarquia de herança de atributos. Selar o atributo elimina a pesquisa por meio da hierarquia de herança e pode melhorar o desempenho.
ru: Эта библиотека классов платформы .NET Framework предоставляет методы для извлечения настраиваемых атрибутов. По умолчанию эти методы выполняют поиск по иерархии наследования атрибутов. Запечатывание атрибута устраняет поиск по иерархии наследования и позволяет повысить производительность.
tr: .NET Framework sınıf kitaplığı, özel öznitelikleri almaya yönelik yöntemler sağlar. Varsayılan olarak bu yöntemler öznitelik devralma hiyerarşisinde arama yapar. Özniteliğin mühürlenmesi, devralma hiyerarşisinde arama yapılmasını engeller ve performansı artırabilir.
zh_hans: .NET Framework 类库提供用于检索自定义特性的方法。默认情况下，这些方法搜索特性继承层次结构。通过密封特性，将无需搜索继承层次结构并可提高性能。
zh_hant: .NET Framework 類別庫可提供擷取自訂屬性的方法。根據預設，這些方法會搜尋屬性繼承階層。使用密封屬性可免於搜尋整個繼承階層，因而能提升效能。

# AvoidUnsealedAttributesMessage
source: Avoid unsealed attributes
cs: Vyhněte se nezapečetěným atributům
de: Nicht versiegelte Attribute vermeiden
es: Evitar atributos no sellados
fr: Éviter les attributs unsealed
it: Evitare attributi unsealed
ja: アンシールド属性を使用しません
ko: 봉인되지 않은 특성을 사용하지 마세요.
pl: Unikaj niezapieczętowanych atrybutów
pt_br: Evitar atributos não selados
ru: Избегайте незапечатанных атрибутов
tr: Mühürsüz öznitelikleri kullanmayın
zh_hans: 避免使用非密封特性
zh_hant: 避免非密封屬性

# AvoidUnsealedAttributesTitle
source: Avoid unsealed attributes
cs: Vyhněte se nezapečetěným atributům
de: Nicht versiegelte Attribute vermeiden
es: Evitar atributos no sellados
fr: Éviter les attributs unsealed
it: Evitare attributi unsealed
ja: アンシールド属性を使用しません
ko: 봉인되지 않은 특성을 사용하지 마세요.
pl: Unikaj niezapieczętowanych atrybutów
pt_br: Evitar atributos não selados
ru: Избегайте незапечатанных атрибутов
tr: Mühürsüz öznitelikleri kullanmayın
zh_hans: 避免使用非密封特性
zh_hant: 避免非密封屬性

# AvoidZeroLengthArrayAllocationsMessage
source: Avoid unnecessary zero-length array allocations. Use {0} instead.
cs: Vyhněte se nepotřebným alokacím polí s nulovou délkou. Použijte místo toho {0}.
de: Vermeiden Sie unnötige Arrayzuordnungen mit einer Länge von null. Warten Sie stattdessen auf "{0}".
es: Evite las asignaciones de matriz de longitud cero innecesarias. Use {0} en su lugar.
fr: Évitez les allocations inutiles de tableaux dont la longueur est égale à zéro. Utilisez {0} à la place.
it: Evitare allocazioni di matrice di lunghezza zero non necessarie. In alternativa, usare {0}.
ja: 不要な長さ 0 の配列の割り当てを避けます。代わりに {0} を使用してください。
ko: 길이가 0인 불필요한 배열 할당을 사용하지 마세요. 대신 {0}을(를) 사용하세요.
pl: Unikaj niepotrzebnego alokowania tablic o długości zero. Zamiast tego użyj elementu {0}.
pt_br: Evite alocações de matriz de comprimento zero desnecessárias. Use {0} em vez disso.
ru: Старайтесь не выделять массивы нулевой длины без необходимости. Вместо этого используйте {0}.
tr: Gereksiz sıfır uzunluklu dizi ayırmaları kullanmayın. Bunun yerine {0} kullanın.
zh_hans: 避免不必要的长度为零的数组分配。改用 {0}。
zh_hant: 避免非必要長度為零的陣列配置。改為使用 {0}。

# AvoidZeroLengthArrayAllocationsTitle
source: Avoid zero-length array allocations
cs: Vyhněte se alokacím polí s nulovou délkou
de: Arrayzuordnungen mit einer Länge von null vermeiden
es: Evite las asignaciones de matriz de longitud cero
fr: Évitez les allocations de tableaux dont la longueur est égale à zéro
it: Evitare allocazioni di matrice di lunghezza zero
ja: 長さ 0 の配列は割り当て不可
ko: 길이가 0인 배열 할당을 사용하면 안 됨
pl: Unikaj alokowania tablic o długości zero
pt_br: Evite alocações de matriz de comprimento zero
ru: Нежелательность выделения массивов нулевой длины
tr: Sıfır uzunluklu dizi ayırmaları kullanmaktan kaçının
zh_hans: 避免长度为零的数组分配
zh_hant: 避免長度為零的陣列配置

# BinaryFormatterDeserializeMaybeWithoutBinderSetMessage
source: The method '{0}' is insecure when deserializing untrusted data without a SerializationBinder to restrict the type of objects in the deserialized object graph.
cs: Když se deserializují nedůvěryhodná data bez SerializationBinderu, který omezí typ objektu v grafu deserializovaných objektů, není metoda {0} bezpečná.
de: Die Methode "{0}" ist unsicher, wenn nicht vertrauenswürdige Daten deserialisiert werden, ohne dass der Typ von Objekten im deserialisierten Objektgraphen durch einen SerializationBinder beschränkt wird.
es: El método "{0}" no es seguro cuando se deserializan datos que no son de confianza sin un elemento SerializationBinder para restringir el tipo de objetos en el grafo de objetos deserializado.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables sans SerializationBinder pour restreindre le type des objets dans le graphe d'objets désérialisé.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili senza un elemento SerializationBinder per limitare il tipo di oggetti nel grafico di oggetti deserializzato.
ja: SerializationBinder なしで信頼されていないデータを逆シリアル化して、逆シリアル化されたオブジェクト グラフ内でオブジェクトの型を制限する場合、メソッド '{0}' は安全ではありません。
ko: 역직렬화된 개체 그래프에서 개체 형식을 제한하기 위해 SerializationBinder 없이 신뢰할 수 없는 데이터를 역직렬화하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” nie jest bezpieczna podczas deserializowania niezaufanych danych bez użycia elementu SerializationBinder w celu ograniczenia typu obiektów w zdeserializowanym grafie obiektów.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis sem um SerializationBinder para restringir o tipo de objetos no grafo de objetos desserializado.
ru: Метод "{0}" является небезопасным при десериализации ненадежных данных без использования SerializationBinder для ограничения типа объектов в графе десериализованных объектов.
tr: Güvenilmeyen veriler, seri durumdan çıkarılmış nesne grafındaki nesnelerin türünü kısıtlamak için SerializationBinder kullanılmadan seri durumdan çıkarılırken '{0}' yöntemi güvenli değildir.
zh_hans: 在不使用 SerializationBinder 的情况下对不受信任的数据进行反序列化，以限制反序列化对象图中的对象类型时，方法“{0}”不安全。
zh_hant: 將未受信任的資料還原序列化時，若沒有使用 SerializationBinder 來限制已還原序列化物件圖中的物件類型，方法 '{0}' 就不安全。
