Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseRSAWithSufficientKeySizeMessage
source: Asymmetric encryption algorithm {0}'s key size is less than 2048. Switch to an RSA with at least 2048 key size, ECDH or ECDSA algorithm instead.
cs: Velikost klíče algoritmu asymetrického šifrování {0} je menší než 2048. Použijte radši algoritmus RSA s velikostí klíče alespoň 2048, ECDH nebo ECDSA.
de: Die Schlüsselgröße des asymmetrischen Verschlüsselungsalgorithmus "{0}" beträgt weniger als 2048. Wechseln Sie stattdessen zu einer RSA-Verschlüsselung mit ECDH- oder ECDSA-Algorithmus mit einer Schlüsselgröße von mindestens 2048.
es: El tamaño de clave del algoritmo de cifrado asimétrico {0} es inferior a 2048. Cambie a un algoritmo de ECDSA o ECDH con RSA que tenga un tamaño de clave mínimo de 2048.
fr: La taille de clé de l'algorithme de chiffrement asymétrique {0} est inférieure à 2 048 bits. Passez plutôt à un algorithme RSA avec une taille de clé d'au moins 2 048 bits, à un algorithme ECDH ou à un algorithme ECDSA.
it: La dimensione di chiave dell'algoritmo di crittografia asimmetrica {0} è minore di 2048. Passare a un algoritmo RSA con dimensione di chiave minima pari a 2048 oppure a un algoritmo ECDH o ECDSA.
ja: 非対称暗号化アルゴリズム {0} のキー サイズが 2048 未満です。キー サイズが少なくとも 2048 の RSA、ECDH、または ECDSA アルゴリズムに切り替えてください。
ko: 비대칭 암호화 알고리즘 {0}의 키 크기가 2048보다 작습니다. 최소 2048 키 크기, ECDH 또는 ECDSA 알고리즘이 포함된 RSA로 전환하세요.
pl: Rozmiar klucza algorytmu szyfrowania asymetrycznego {0} jest mniejszy niż 2048. Przełącz się na algorytm RSA z kluczem o rozmiarze co najmniej 2048, algorytm ECDH lub algorytm ECDSA.
pt_br: O tamanho de chave do algoritmo de criptografia assimétrica {0} é menor que 2048. Alterne para um RSA com um tamanho de chave de pelo menos 2048 ou para um algoritmo ECDH ou ECDSA.
ru: Размер ключа для алгоритма асимметричного шифрования {0} меньше 2048 бит. Перейдите на алгоритм RSA с размером ключа не менее 2048 бит или на алгоритмы ECDH или ECDSA.
tr: Asimetrik şifreleme algoritması {0} anahtar boyutu 2048'den az. Bunun yerine en az 2048 anahtar boyutuna, ECDH veya ECDSA algoritmasına sahip bir RSA'ya geçiş yapın.
zh_hans: 非对称加密算法 {0} 的密钥大小小于 2048 位。请转而切换到至少具有 2048 位密钥大小的 RSA、ECDH 或者 ECDSA 算法。
zh_hant: 非對稱式加密演算法 {0} 的金鑰大小小於 2048。請改為切換成至少有 2048 金鑰大小的 RSA、ECDH 或 ECDSA 演算法。

# UseRegexCountDescription
source: 'Regex.Count' is simpler and faster than 'Regex.Matches(...).Count'.
cs: Regex.Count je jednodušší a rychlejší než Regex.Matches(...).Count.
de: „Regex.Count“ ist einfacher und schneller als „Regex.Matches(...).Count“.
es: 'Regex.Count' es más sencillo y rápido que 'Regex.Matches(...). Count'.
fr: « Regex.Count » est plus simple et plus rapide que « Regex.Matches(...).Count ».
it: 'Regex.Count' è più semplice e veloce di 'Regex.Matches(...).Count'.
ja: 'Regex.Count' は 'Regex.Matches(...).Count' よりもシンプルで高速です。
ko: 'Regex.Count'는 'Regex.Matches(...)'보다 간단하고 빠릅니다.
pl: Wyrażenie „Regex.Count” jest prostsze i szybsze niż „Regex.Matches(...).Count”.
pt_br: ''Regex.Count'' é mais simples e mais rápido do que ''Regex.Matches(...).Count''.
ru: "Regex.Count" проще и быстрее, чем "Regex.Matches(...).Count".
tr: "Regex.Count", "Regex.Matches(...).Count"a kıyasla daha basit ve hızlıdır.
zh_hans: 与 'Regex.Matches(...).Count' 相比，'Regex.Count' 更简单且速度更快。
zh_hant: 'Regex.Count' 比 'Regex.Matches(...).Count' 更簡單、更快速。

# UseRegexCountFix
source: Use 'Regex.Count'
cs: Použijte Regex.Count
de: „Regex.Count“ verwenden
es: Usar "Regex.Count"
fr: Utilisez « Regex.Count »
it: Usa 'Regex.Count'
ja: 'Regex.Count' を使用する
ko: 'Regex.Count' 사용
pl: Używanie wyrażenia „Regex.Count”
ru: Использовать "Regex.Count"
tr: "Regex.Count" kullanın
zh_hans: 使用 'Regex.Count'
zh_hant: 使用 'Regex.Count'

# UseRegexCountMessage
source: Use 'Regex.Count' instead of 'Regex.Matches(...).Count'
cs: Místo regex.Matches(...).Count použijte Regex.Count.
de: „Regex.Count“ anstelle von „Regex.Matches(...).Count“ verwenden
es: Usar 'Regex.Count' en lugar de 'Regex.Matches(...).Count'
fr: Utilisez « Regex.Count » au lieu de « Regex.Matches(...).Count »
it: Usare 'Regex.Count' invece di 'Regex.Matches(...).Count'
ja: 'Regex.Count' を 'Regex.Matches(...).Count' の代わりに使用してください
ko: 'Regex.Matches(...)' 대신 'Regex.Count'를 사용하세요.
pl: Użyj wyrażenia „Regex.Count” zamiast „Regex.Matches(...).Count”
pt_br: Use ''Regex.Count'' em vez de ''Regex.Matches(...).Count''
ru: Используйте "Regex.Count" вместо "Regex.Matches(...).Count"
tr: "Regex.Matches(...).Count" yerine "Regex.Count" kullanın
zh_hans: 使用 'Regex.Count' 而不是 'Regex.Matches(...).Count'
zh_hant: 使用 'Regex.Count' 而不是 'Regex.Matches(...).Count'

# UseRegexCountTitle
source: Use 'Regex.Count'
cs: Použijte Regex.Count
de: „Regex.Count“ verwenden
es: Usar "Regex.Count"
fr: Utilisez « Regex.Count »
it: Usa 'Regex.Count'
ja: 'Regex.Count' を使用する
ko: 'Regex.Count' 사용
pl: Używanie wyrażenia „Regex.Count”
ru: Использовать "Regex.Count"
tr: "Regex.Count" kullanın
zh_hans: 使用 'Regex.Count'
zh_hant: 使用 'Regex.Count'

# UseRegexIsMatchDescription
source: 'Regex.IsMatch' is simpler and faster than 'Regex.Match(...).Success'.
cs: Regex.IsMatch je jednodušší a rychlejší než Regex.Match(...).Success.
de: „Regex.IsMatch“ ist einfacher und schneller als „Regex.Match(...).Success.“.
es: 'Regex.IsMatch' es más sencillo y rápido que 'Regex.Match(...). Correcto'.
fr: « Regex.IsMatch » est plus simple et plus rapide que « Regex.Match(...).Success ».
it: 'Regex.IsMatch' è più semplice e veloce di 'Regex.Match(...).Success'.
ja: 'Regex.IsMatch' は 'Regex.Match(...).Success' よりもシンプルで高速です。
ko: 'Regex.IsMatch'는 'Regex.Match(...)'보다 간단하고 빠릅니다.
pl: Wyrażenie „Regex.IsMatch” jest prostsze i szybsze niż „Regex.Match(...).Success”.
pt_br: ''Regex.IsMatch'' é mais simples e mais rápido do que ''Regex.Match(...).Success''.
ru: "Regex.IsMatch" проще и быстрее, чем "Regex.Match(...).Success".
tr: "Regex.IsMatch", "Regex.Match(...).Success"e kıyasla daha basit ve hızlıdır.
zh_hans: 与 'Regex.Match(...).Success' 相比，'Regex.IsMatch' 更简单且速度更快。
zh_hant: 'Regex.IsMatch' 比 'Regex.Match(...).Success' 更簡單、更快速。

# UseRegexIsMatchFix
source: Use 'Regex.IsMatch'
cs: Použijte Regex.IsMatch.
de: „Regex.IsMatch“ verwenden
es: Usar "Regex.IsMatch"
fr: Utilisez « Regex.IsMatch »
it: Usare 'Regex.IsMatch'
ja: 'Regex.IsMatch' を使用する
ko: 'Regex.IsMatch'를 사용하세요.
pl: Użyj wyrażenia „Regex.IsMatch”
ru: Использовать "Regex.IsMatch"
tr: "Regex.IsMatch" kullanın
zh_hans: 使用 'Regex.IsMatch'
zh_hant: 使用 'Regex.IsMatch'

# UseRegexIsMatchMessage
source: Use 'Regex.IsMatch' instead of 'Regex.Match(...).Success'
cs: Místo Regex.Match(...) použijte Regex.IsMatch.
de: „Regex.IsMatch“ anstelle von „Regex.Match(...).Success“
es: Usar 'Regex.IsMatch' en lugar de 'Regex.Match(...).Success'
fr: Utilisez « Regex.IsMatch » au lieu de « Regex.Match(...).Success »
it: Usare 'Regex.IsMatch' invece di 'Regex.Match(...).Success'
ja: 'Regex.IsMatch' を 'Regex.Match(...).Success' の代わりに使用してください
pl: Użyj wyrażenia „Regex.IsMatch” zamiast „Regex.Match(...).Success”
pt_br: Use ''Regex.IsMatch'' em vez de ''Regex.Match(...).Sucsess''
ru: Используйте "Regex.IsMatch" вместо "Regex.Match(...).Success"
tr: "Regex.Match(...).Success" yerine "Regex.IsMatch" kullanın
zh_hans: 使用 'Regex.IsMatch' 而不是 'Regex.Match(...).Success'
zh_hant: 使用 'Regex.IsMatch' 而不是 'Regex.Match(...).Success'

# UseRegexIsMatchTitle
source: Use 'Regex.IsMatch'
cs: Použijte Regex.IsMatch.
de: „Regex.IsMatch“ verwenden
es: Usar "Regex.IsMatch"
fr: Utilisez « Regex.IsMatch »
it: Usare 'Regex.IsMatch'
ja: 'Regex.IsMatch' を使用する
ko: 'Regex.IsMatch'를 사용하세요.
pl: Użyj wyrażenia „Regex.IsMatch”
ru: Использовать "Regex.IsMatch"
tr: "Regex.IsMatch" kullanın
zh_hans: 使用 'Regex.IsMatch'
zh_hant: 使用 'Regex.IsMatch'

# UseSearchValuesCodeFixTitle
source: Use 'SearchValues'
cs: Používat SearchValues
de: "SearchValues" verwenden
es: Usar "SearchValues"
fr: Utiliser « SearchValues »
it: Usare 'SearchValues'
ja: 'SearchValues' を使用する
ko: 'SearchValues' 사용
pl: Użyj elementu „SearchValues”
pt_br: Usar 'SearchValues'
ru: Использовать "SearchValues"
tr: 'SearchValues' kullan
zh_hans: 使用 "SearchValues"
zh_hant: 使用 'SearchValues'

# UseSearchValuesDescription
source: Using a cached 'SearchValues' instance is more efficient than passing values to 'IndexOfAny'/'ContainsAny' directly.
cs: Použití instance SearchValues uložené v mezipaměti je efektivnější než přímé předávání hodnot do funkcí IndexOfAny nebo ContainsAny.
de: Die Verwendung einer zwischengespeicherten SearchValues-Instanz ist effizienter als die direkte Übergabe von Werten an "IndexOfAny"/"ContainsAny".
es: El uso de una instancia de "SearchValues" en caché es más eficaz que pasar valores a "IndexOfAny"/"ContainsAny" directamente.
fr: L’utilisation d’un instance 'SearchValues' mis en cache est plus efficace que de passer directement des valeurs à 'IndexOfAny'/'ContainsAny'.
it: L'uso di un'istanza 'SearchValues' memorizzata nella cache è più efficiente del passaggio diretto di valori a 'IndexOfAny'/'ContainsAny'.
ja: 値を 'IndexOfAny'/'ContainsAny'' に直接渡すよりも、キャッシュされた 'SearchValues' インスタンスを使用する方が効率的です。
ko: 'IndexOfAny'/'ContainsAny'에 직접 값을 전달하는 것보다 캐시된 'SearchValues' 인스턴스를 사용하는 것이 더 효율적입니다.
pl: Użycie buforowanego wystąpienia „SearchValues” jest bardziej wydajne niż bezpośrednie przekazywanie wartości do elementu „IndexOfAny”/”ContainsAny”.
pt_br: Usar uma instância 'SearchValues' em cache é mais eficiente do que passar valores diretamente para 'IndexOfAny'/'ContainsAny'.
ru: Использование кэшированного экземпляра "SearchValues" более эффективно, чем передача значений непосредственно в "IndexOfAny"/"ContainsAny".
tr: Önbelleğe alınmış bir 'SearchValues' örneğinin kullanımı, değerleri doğrudan 'IndexOfAny'/'ContainsAny' değerine geçmekten daha verimlidir.
zh_hans: 使用缓存的 "SearchValues" 实例比直接将值传递到 "IndexOfAny"/"ContainsAny" 效率更高。
zh_hant: 使用快取的 'SearchValues' 執行個體比直接將值傳遞至 'IndexOfAny'/'ContainsAny' 更有效率。

# UseSearchValuesMessage
source: Use a cached 'SearchValues' instance for improved searching performance
cs: Používat instanci SearchValues v mezipaměti pro lepší výkon vyhledávání
de: Verwenden sie eine zwischengespeicherte SearchValues-Instanz, um die Suchleistung zu verbessern.
es: Usar una instancia de "SearchValues" almacenada en caché para mejorar el rendimiento de la búsqueda
fr: Utiliser une instance « SearchValues » mis en cache pour améliorer les performances de recherche
it: Usare un'istanza di 'SearchValues' memorizzata nella cache per migliorare le prestazioni di ricerca
ja: キャッシュされた 'SearchValues' インスタンスを使用して検索パフォーマンスを向上させる
ko: 향상된 검색 성능을 위해 캐시된 'SearchValues' 인스턴스 사용
pl: Używanie buforowanego wystąpienia „SearchValues” w celu zwiększenia wydajności wyszukiwania
pt_br: Use uma instância 'SearchValues' em cache para melhorar o desempenho da pesquisa
ru: Используйте кэшированный экземпляр SearchValues для повышения производительности поиска
tr: Gelişmiş arama performansı için önbelleğe alınmış 'SearchValues' örneğini kullanın
zh_hans: 使用缓存的 "SearchValues" 实例改进搜索性能
zh_hant: 使用快取的 'SearchValues' 執行個體改善搜尋效能

# UseSearchValuesTitle
source: Use a cached 'SearchValues' instance
cs: Používat instanci SearchValues v mezipaměti
de: Zwischengespeicherte SearchValues-Instanz verwenden
es: Usar una instancia de "SearchValues" almacenada en caché
fr: Utiliser une instance « SearchValues » mis en cache
it: Usare un'istanza di 'SearchValues' memorizzata nella cache
ja: キャッシュされた 'SearchValues' インスタンスを使用する
ko: 캐시된 'SearchValues' 인스턴스 사용
pl: Używanie buforowanego wystąpienia „SearchValues”
pt_br: Usar uma instância 'SearchValues' em cache
ru: Использовать кэшированный экземпляр "SearchValues"
tr: Önbelleğe alınmış bir 'SearchValues' örneği kullan
zh_hans: 使用缓存的 "SearchValues" 实例
zh_hant: 使用快取的 'SearchValues' 執行個體

# UseSecureCookiesASPNetCoreDescription
source: Applications available over HTTPS must use secure cookies.
cs: Aplikace, které jsou k dispozici přes HTTPS, musí používat zabezpečené soubory cookie.
de: Anwendungen, die über HTTPS verfügbar sind, müssen sichere Cookies verwenden.
es: Las aplicaciones disponibles a través de HTTPS deben usar cookies seguras.
fr: Les applications disponibles via HTTPS doivent utiliser des cookies sécurisés.
it: Le applicazioni disponibili tramite HTTPS devono usare cookie protetti.
ja: HTTPS 経由で使用できるアプリケーションは、セキュリティで保護された Cookie を使用する必要があります。
ko: HTTPS를 통해 사용할 수 있는 애플리케이션은 보안 쿠키를 사용해야 합니다.
pl: Aplikacje dostępne za pośrednictwem protokołu HTTPS muszą korzystać z bezpiecznych plików cookie.
pt_br: Os aplicativos disponíveis via HTTPS devem usar cookies seguros.
ru: Приложения, доступные через HTTPS, должны использовать защищенные файлы cookie.
tr: HTTPS üzerinden kullanılabilen uygulamalar güvenli tanımlama bilgileri kullanmalıdır.
zh_hans: 通过 HTTPS 提供的应用程序必须使用安全 Cookie。
zh_hant: 透過 HTTPS 使用的應用程式必須使用安全 Cookie。

source: Use SharedAccessProtocol HttpsOnly
cs: Použít SharedAccessProtocol HttpsOnly
de: SharedAccessProtocol.HttpsOnly verwenden
es: Usar HttpsOnly con SharedAccessProtocol
fr: Utiliser SharedAccessProtocol HttpsOnly
it: Usa SharedAccessProtocol.HttpsOnly
ja: SharedAccessProtocol HttpsOnly を使用する
ko: SharedAccessProtocol HttpsOnly 사용
pl: Użyj właściwości SharedAccessProtocol HttpsOnly
pt_br: Usar SharedAccessProtocol HttpsOnly
ru: Использовать SharedAccessProtocol HttpsOnly
tr: SharedAccessProtocol HttpsOnly Kullan
zh_hans: 使用 SharedAccessProtocol HttpsOnly
zh_hant: 使用 SharedAccessProtocol HttpsOnly

# UseSharedAccessProtocolHttpsOnlyDescription
source: HTTPS encrypts network traffic. Use HttpsOnly, rather than HttpOrHttps, to ensure network traffic is always encrypted to help prevent disclosure of sensitive data.
cs: Protokol HTTPS šifruje síťový provoz. Pokud chcete zajistit, aby byl síťový přenos vždy zašifrovaný, aby se zabránilo odhalení citlivých dat, použijte HttpsOnly, ne HttpOrHttps.
de: HTTPS verschlüsselt den Netzwerkdatenverkehr. Verwenden Sie HttpsOnly anstelle von HttpOrHttps, um sicherzustellen, dass der Netzwerkdatenverkehr immer verschlüsselt ist. So können Sie die Offenlegung vertraulicher Daten verhindern.
es: HTTPS cifra el tráfico de red. Use HttpsOnly, en lugar de HttpOrHttps, para asegurarse de que el tráfico de red se cifra siempre y ayudar a evitar la divulgación de información confidencial.
fr: Le protocole HTTPS chiffre le trafic réseau. Utilisez HttpsOnly, à la place de HttpOrHttps, pour garantir le chiffrement permanent du trafic réseau et éviter la divulgation de données sensibles.
it: HTTPS crittografa il traffico di rete. Usare HttpsOnly, invece di HttpOrHttps, per garantire che il traffico di rete sia sempre crittografato ed evitare la divulgazione di dati sensibili.
ja: HTTPS はネットワークトラフィックを暗号化します。ネットワークトラフィックが常に暗号化されるようにするには、HttpsOnly を HttpOrHttps ではなくを使用します。
ko: HTTPS는 네트워크 트래픽을 암호화합니다. 중요한 데이터가 공개되지 않도록 하려면 HttpOrHttps 대신 HttpsOnly를 사용하여 네트워크 트래픽을 상시 암호화하도록 합니다.
pl: Protokół HTTPS szyfruje ruch sieciowy. Użyj właściwości HttpsOnly, a nie HttpOrHttps, aby ruch sieciowy był zawsze szyfrowany i aby zapobiec ujawnieniu poufnych danych.
pt_br: O HTTPS criptografa o tráfego de rede. Use HttpsOnly, em vez de HttpOrHttps, para garantir que o tráfego de rede sempre seja criptografado para ajudar a impedir a divulgação de dados confidenciais.
ru: При использовании HTTPS сетевой трафик шифруется. Чтобы гарантировать, что сетевой трафик всегда будет зашифрован, а конфиденциальные данные не будут раскрыты, используйте HttpsOnly, а не HttpOrHttps.
tr: HTTPS ağ trafiğini şifreler. Hassas verilerin açıklanmasını önlemeye yardımcı olmak için, ağ trafiğinin her zaman şifrelenmesini sağlamak amacıyla HttpOrHttps yerine HttpsOnly kullanın.
zh_hans: HTTPS 对网络流量加密。请使用 HttpsOnly (而不是 HttpOrHttps)确保网络流量始终加密，从而帮助防止敏感数据泄露。
zh_hant: HTTPS 會加密網路流量。請使用 HttpsOnly 而非 HttpOrHttps，以確保網路流量一律會經過加密來避免敏感性資料洩漏。

# UseSharedAccessProtocolHttpsOnlyMessage
source: Consider using Azure's role-based access control instead of a Shared Access Signature (SAS) if possible. If you still need to use a SAS, specify SharedAccessProtocol.HttpsOnly.
cs: Pokud je to možné, zvažte použití řízení přístupu Azure na základě role namísto sdíleného přístupového podpisu (SAS). Pokud i přesto potřebujete používat sdílený přístupový podpis, zadejte SharedAccessProtocol.HttpsOnly.
de: Erwägen Sie (sofern möglich) die Verwendung der rollenbasierten Zugriffssteuerung von Azure anstelle einer Shared Access Signature (SAS). Wenn Sie weiterhin eine SAS benötigen, verwenden Sie "SharedAccessProtocol.HttpsOnly".
es: Considere la posibilidad de usar el control de acceso basado en rol de Azure en lugar de una firma de acceso compartido (SAS), si es posible. Si tiene que usar una firma de acceso compartido, especifique SharedAccessProtocol.HttpsOnly.
fr: Si possible, utilisez le contrôle d'accès en fonction du rôle d'Azure à la place d'une signature d'accès partagé. Si vous devez quand même utiliser une signature d'accès partagé, spécifiez SharedAccessProtocol.HttpsOnly.
it: Se possibile, provare a usare il controllo degli accessi in base al ruolo di Azure, invece della firma di accesso condiviso. Se è necessario usare una firma di accesso condiviso, specificare SharedAccessProtocol.HttpsOnly.
ja: 可能な場合は、Shared Access Signature (SAS) の代わりに、Azure のロールベースのアクセス制御を使用することを検討してください。依然として SAS を使用する必要がある場合は、SharedAccessProtocol.HttpsOnly を指定します。
ko: 가능한 경우 SAS(공유 액세스 서명) 대신 Azure의 역할 기반 액세스 제어를 사용하는 것이 좋습니다. 계속 SAS를 사용해야 하는 경우 SharedAccessProtocol.HttpsOnly를 지정하세요.
pl: Jeśli to możliwe, rozważ użycie kontroli dostępu opartej na rolach platformy Azure zamiast sygnatury dostępu współdzielonego (SAS). Jeśli nadal chcesz używać sygnatury SAS, określ właściwość SharedAccessProtocol.HttpsOnly.
pt_br: Se possível, considere usar o controle de acesso baseado em função do Azure em vez de uma SAS (Assinatura de Acesso Compartilhado). Se você ainda precisar usar uma SAS, especifique SharedAccessProtocol.HttpsOnly.
ru: Если возможно, попробуйте использовать управление доступом на основе ролей Azure, а не подписанный URL-адрес (SAS). Если все-таки требуется использовать SAS, укажите SharedAccessProtocol.HttpsOnly.
tr: Mümkünse Paylaşılan Erişim İmzası (SAS) yerine Azure'un rol tabanlı erişim denetimini kullanmayı düşünün. Yine de SAS kullanmanız gerekiyorsa, SharedAccessProtocol.HttpsOnly belirtin.
zh_hans: 如果可能，请考虑使用 Azure 基于角色的访问控制，而不是共享访问签名(SAS)。如果仍需使用 SAS，请指定 SharedAccessProtocol.HttpsOnly。
zh_hant: 如果可行的話，請考慮從共用存取簽章 (SAS) 改為使用 Azure 的角色型存取控制。如果您仍需要使用 SAS，請指定 SharedAccessProtocol.HttpsOnly。

# UseSpanBasedStringConcatCodeFixTitle
source: Use 'AsSpan' with 'string.Concat'
cs: Použít AsSpan se string.Concat
de: "AsSpan" mit "string.Concat" verwenden
es: Use 'AsSpan' con 'string.Concat'
fr: Utilisez ’AsSpan’ avec ’String. Concat
it: Usare 'AsSpan' con 'string.Concat'
ja: 'AsSpan' を 'string.Concat' と共に使用します。
ko: 'string.Concat'과 함께 'AsSpan' 사용
pl: Użyj ciągu „AsSpan” z ciągiem „String.Concat”
pt_br: Use 'AsSpan' com 'string. Concat'
ru: Использовать "AsSpan" с "string.Concat"
tr: 'string.Concat' ile 'AsSpan' kullanın
zh_hans: 将 “AsSpan” 与 “string.Concat” 配合使用
zh_hant: 請將 'AsSpan' 與 'string.Concat' 一起使用

# UseSpanBasedStringConcatDescription
source: It is more efficient to use 'AsSpan' and 'string.Concat', instead of 'Substring' and a concatenation operator.
cs: Je efektivnější místo Subsrting a operátoru zřetězení používat AsSpan a String.Concat.
de: Die Verwendung von "AsSpan" und "string.Concat" ist effizienter als "Substring" und ein Verkettungsoperator.
es: Es más eficaz usar "AsSpan" y "string.Concat, en lugar de 'Substring' y un operador de concatenación.
fr: Il est plus efficace d’utiliser ’AsSpan’ et ’String. Concat', à la place de ’Substring’ et d’un opérateur de concaténation.
it: È più efficace usare 'AsSpan' e 'String.Concat' invece di 'Substring' e un operatore di concatenazione.
ja: 'Substring' と連結演算子を使うよりも 'AsSpan' と 'string.Concat' を使用する方が効率的です。
ko: 'Substring' 및 연결 연산자 대신 'AsSpan' 및 'string.Concat'을 사용하는 것이 더 효율적입니다.
pl: Bardziej wydajne jest użycie ciągów „AsSpan” i "string.Concat", zamiast ciągu „Substring” i operatora złączenia.
pt_br: É mais eficiente usar 'AsSpan' e 'string'. Concat', em vez de 'Substring' e um operador de concatenação.
ru: Использование "AsSpan" и "string.Concat" более эффективно, чем применение "Substring" и оператора объединения.
tr: 'Substring' ve birleştirme işleci yerine 'AsSpan' ve 'string.Concat' kullanmak daha verimlidir.
zh_hans: 使用 “AsSpan” 和 “string.Concat” 效率高于使用 “Substring” 和串联运算符。
zh_hant: 使用 'AsSpan' 和 'string.Concat' 比 'Substring' 和串連運算子更有效率。

# UseSpanBasedStringConcatMessage
source: Use span-based 'string.Concat' and 'AsSpan' instead of 'Substring'
cs: Použijte výraz založený na rozsahu string.Concat a AsSpan místo Substring
de: Verwenden Sie "string.Concat" und "AsSpan" auf span-Basis anstelle von "Substring".
es: Use la cadena basada en 'string.Concat' y "AsSpan" en lugar de 'Substring'
fr: Utilisez une chaîne de type span. Concat’ et ’AsSpan’ à la place de ’Substring'
it: Usare 'string.Concat' e 'AsSpan' basati su span invece di 'Substring'
ja: 'Substring' ではなく、スパンベースの 'string.Concat' と 'AsSpan' を使用します。
ko: 'Substring' 대신 스팬 기반 'string.Concat' 및 'AsSpan' 사용
pl: Użyj ciągu „string.Concat” opartego na zakresie i ciągu „AsSpan” zamiast ciągu „Substring”
pt_br: Use a 'cadeia de caracteres' baseada em intervalo. Concat' e 'AsSpan' em vez de 'Substring'
ru: Использовать "string.Concat" и "AsSpan" на основе интервалов вместо "Substring"
tr: 'Substring' yerine yayılma tabanlı 'string.Concat' ve 'AsSpan' kullanın
zh_hans: 使用基于跨度的 “string.Concat” 和 “AsSpan” 而不是 “Substring”
zh_hant: 請使用範圍型的 'string.Concat' 和 'AsSpan'，而非 'Substring'

# UseSpanBasedStringConcatTitle
source: Use span-based 'string.Concat'
cs: Použít řetězec založený na rozsahu string.Concat
de: "string.Concat" auf span-Basis verwenden
es: Use la cadena basada en 'string.Concat'
fr: Utilisez une chaîne de type span. Concat
it: Usare 'string.Concat' basato su span
ja: スパンベースの 'string.Concat' を使用します。
ko: 범위 기반 'string.Concat' 사용
pl: Użyj ciągu „string.Concat” opartego na zakresie.
pt_br: Use a 'cadeia de caracteres' baseada em intervalo. Concat'
ru: Использовать "string.Concat" на основе интервалов
tr: Yayılma tabanlı 'string.Concat' kullanın
zh_hans: 使用基于跨度的 “string.Concat”
zh_hant: 請使用範圍型的 'string.Concat'

# UseSpanClearInsteadOfFillCodeFixTitle
source: Use 'Clear()'
cs: Použít Clear()
de: Verwenden von „Clear()“
es: Usar "Clear()"
fr: Utilisez 'Effacer()'
it: Usare 'Clear()'
ja: 'Clear()' を使用する
ko: 'Clear()' 사용
pl: Użyj polecenia „Clear()”
pt_br: Usar 'Clear()'
ru: Использовать "Clear()"
tr: 'Clear()' kullan
zh_hans: 使用“Clear()”
zh_hant: 使用 'Clear()'

# UseSpanClearInsteadOfFillDescription
source: It is more efficient to use 'Clear', instead of 'Fill' with default value.
cs: Použití možnosti Vymazat místo možnosti Vyplnit výchozí hodnotou je efektivnější.
de: Es ist effizienter, „Clear“ anstelle von „Fill“ mit dem Standardwert zu verwenden.
es: Es más eficaz usar "Clear", en lugar de 'Fill' con el valor predeterminado.
fr: Il est plus efficace d’utiliser 'Effacer', au lieu de 'Remplissage' avec la valeur par défaut.
it: È più efficiente usare 'Clear', invece di 'Fill' con il valore predefinito.
ja: 既定値で 'Fill' ではなく、'Clear' を使用する方が効率的です。
ko: 기본값으로 'Fill' 대신 'Clear'를 사용하는 것이 더 효율적입니다.
pl: Użycie opcji „Wyczyść” zamiast opcji „Wypełnij” z wartością domyślną jest efektywniejsze.
pt_br: É mais eficiente usar 'Clear', em vez de 'Fill' com valor padrão.
ru: Эффективнее использовать "Clear" вместо "Fill" со значением по умолчанию.
tr: Varsayılan değerle 'Fill' yerine 'Clear' kullanmak daha verimlidir.
zh_hans: 使用“清除”(而不是具有默认值的“填充”)效率更高。
zh_hant: 使用 'Clear' 比使用預設值的 'Fill' 更有效率。
