Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NetDataContractSerializerMethodUsedTitle
source: Do not use insecure deserializer NetDataContractSerializer
cs: Nepoužívat nezabezpečený deserializátor NetDataContractSerializer
de: Nicht den unsicheren NetDataContractSerializer zur Deserialisierung verwenden
es: No usar el deserializador no seguro NetDataContractSerializer
fr: Ne pas utiliser le désérialiseur non sécurisé NetDataContractSerializer
it: Non usare il deserializzatore non sicuro NetDataContractSerializer
ja: 安全でないデシリアライザー NetDataContractSerializer を使用しない
ko: 안전하지 않은 역직렬 변환기 NetDataContractSerializer를 사용하지 마세요.
pl: Nie używaj niezabezpieczonego deserializatora NetDataContractSerializer
pt_br: Não use o desserializador NetDataContractSerializer não seguro
ru: Не используйте небезопасный десериализатор NetDataContractSerializer
tr: Güvenli olmayan seri kaldırıcı NetDataContractSerializer kullanmayın
zh_hans: 请勿使用不安全的反序列化程序 NetDataContractSerializer
zh_hant: 請勿使用不安全的還原序列化程式 NetDataContractSerializer

# NormalizeStringsToUppercaseDescription
source: Strings should be normalized to uppercase. A small group of characters cannot make a round trip when they are converted to lowercase. To make a round trip means to convert the characters from one locale to another locale that represents character data differently, and then to accurately retrieve the original characters from the converted characters.
cs: Řetězce by se měly normalizovat na velká písmena. Pro určitou malou skupinu znaků nejde po převodu na malá písmena provést dvojí převod. Dvojí převod znamená, že se znaky převedou z jednoho národního prostředí do jiného, které reprezentuje data znaků jinak, a pak se z těchto převedených znaků správně získají zpět původní znaky.
de: Zeichenfolgen müssen in Großbuchstaben normalisiert werden. Eine kleine Gruppe von Zeichen kann keinen Roundtrip durchführen, wenn sie in Kleinbuchstaben konvertiert wird. Bei einem Roundtrip werden die Zeichen von einem Gebietsschema in ein anderes konvertiert, in dem die Zeichen anders dargestellt werden. Anschließend werden die ursprünglichen Zeichen exakt aus den konvertierten Zeichen abgerufen.
es: Las cadenas se deberían normalizar para que se escriban en letras mayúsculas. Hay un grupo reducido de caracteres que no pueden realizar un recorrido de ida y vuelta cuando se convierten a minúsculas. Realizar un recorrido de ida y vuelta significa convertir los caracteres de una configuración regional a otra configuración regional que representa los datos de caracteres de manera diferente y, a continuación, recuperar con precisión los caracteres originales de los caracteres convertidos.
fr: Les chaînes doivent être normalisées en majuscules. En cas de conversion en minuscules, un petit groupe de caractères ne peut pas faire d'aller-retour. Faire un aller-retour signifie convertir les caractères d'un ensemble de paramètres régionaux vers un autre ensemble de paramètres régionaux représentant les données caractères de manière distincte, puis récupérer avec précision les caractères d'origine à partir des caractères convertis.
it: Le stringhe devono essere normalizzate in maiuscolo. Un piccolo gruppo di caratteri non è in grado di completare un round trip in caso di conversione in minuscolo. Completare un round trip significa convertire i caratteri da determinate impostazioni locali ad altre che rappresentano i dati dei caratteri in modo diverso e quindi recuperare in modo accurato i caratteri originali da quelli convertiti.
ja: 文字列は、大文字に標準化する必要があります。一部の文字は、小文字に変換した場合、ラウンド トリップできなくなります。ラウンド トリップとは、文字をあるロケールから、文字データを異なる方式で表す別のロケールに変換した後、変換された文字から元の文字を正確に取得することを意味します。
ko: 문자열이 대문자로 정규화되어야 합니다. 소규모의 문자가 소문자로 변환되면 왕복 작업을 수행할 수 없습니다. 왕복 작업은 문자를 하나의 로캘에서 문자 데이터가 다르게 표시되는 다른 로캘로 변환한 다음 변환된 문자에서 원래 문자를 정확하게 검색하는 것을 의미합니다.
pl: Ciągi powinny być znormalizowane do wielkich liter. Nie można wykonać dwustronnej konwersji dla małej grupy znaków podczas konwertowania na małe litery. Wykonanie dwustronnej konwersji oznacza tutaj przekonwertowanie znaków z jednych ustawień regionalnych na inne, które reprezentują dane w inny sposób, a następnie dokładne pobranie oryginalnych znaków z przekonwertowanych znaków.
pt_br: As cadeias de caracteres devem ser normalizadas em maiúsculas. Um pequeno grupo de caracteres não podem fazer uma viagem de ida e volta quando são convertidos em minúsculas. Fazer uma viagem de ida e volta significa converter os caracteres de uma localidade em outra localidade que representa os dados de caractere de maneira diferente e, em seguida, recuperar de forma precisa os caracteres originais dos caracteres convertidos.
ru: Строки следует нормализовать до прописных букв. Небольшая группа символов не может выполнить круговой путь, если они преобразованы в нижний регистр. Круговой путь заключается в преобразовании символов из одного языкового стандарта в другой, где символьные данные представлены иначе, и последующем точном извлечении исходных символов из преобразованных.
tr: Dizeler büyük harf olacak şekilde normalleştirilmelidir. Küçük bir karakter grubu küçük harfe dönüştürüldüğünde gidiş-dönüş gerçekleştiremez. Gidiş-dönüş gerçekleştirme, karakterlerin bir yerel ayardan karakterleri farklı temsil eden başka bir yerel ayara dönüştürülmesi, sonra da dönüştürülen karakterlerden özgün karakterlerin doğru bir şekilde alınması anlamına gelir.
zh_hans: 字符串应规范化为大写。有少量字符在转换为小写后不能转换回来。往返转换是指将字符从一个区域设置转换为按其他方式表示字符数据的另一区域设置，然后准确地从转换后的字符中检索到原始字符。
zh_hant: 字串應標準化為大寫。如果有一小組的字元轉換為小寫，這些字元就無法再轉換回來。進行來回行程即表示會將字元從某個地區設定轉換成其他地區設定 (以不同的方式呈現字元資料)，然後精確地擷取來自轉換字元的原始字元。

# NormalizeStringsToUppercaseMessageToUpper
source: In method '{0}', replace the call to '{1}' with '{2}'
cs: V metodě {0} nahraďte volání {1} voláním {2}.
de: Ersetzen Sie in der Methode "{0}" den Aufruf von "{1}" durch "{2}".
es: En el método "{0}", reemplace la llamada a "{1}" por "{2}".
fr: Dans la méthode '{0}', remplacez l'appel à '{1}' par '{2}'
it: Nel metodo '{0}' sostituire la chiamata a '{1}' con '{2}'
ja: メソッド '{0}' で、'{1}' の呼び出しを '{2}' に置き換えてください
ko: '{0}' 메서드에서 '{1}' 호출을 '{2}'(으)로 바꾸세요.
pl: W metodzie „{0}” zastąp wywołanie metody „{1}” wywołaniem „{2}”
pt_br: No método '{0}', substitua a chamada para '{1}' por '{2}'
ru: В методе "{0}" замените вызов "{1}" на "{2}".
tr: '{0}' metodunda '{1}' çağrısını '{2}' ile değiştirin
zh_hans: 在方法“{0}”中，将对“{1}”的调用替换为“{2}”
zh_hant: 在方法 '{0}' 中，以 '{2}' 取代對 '{1}' 的呼叫

# NormalizeStringsToUppercaseTitle
source: Normalize strings to uppercase
cs: Normalizujte řetězce na velká písmena
de: Zeichenfolgen in Großbuchstaben normalisieren
es: Normalizar las cadenas en mayúsculas
fr: Normaliser les chaînes en majuscules
it: Normalizzare le stringhe in maiuscolo
ja: 文字列を大文字に標準化します
ko: 대문자로 문자열 정규화
pl: Znormalizuj ciągi do wielkich liter
pt_br: Normalizar cadeias de caracteres em maiúsculas
ru: Нормализуйте строки до прописных букв
tr: Dizeleri büyük harf olacak şekilde normalleştirin
zh_hans: 将字符串规范化为大写
zh_hant: 將字串標準化為大寫

# ObjectStateFormatterMethodUsedMessage
source: The method '{0}' is insecure when deserializing untrusted data.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili.
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません。
ko: 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil.
zh_hans: 对不受信任的数据进行反序列化时，方法“{0}”不安全。
zh_hant: 將不受信任的資料還原序列化時，方法 '{0}' 不安全。

# ObjectStateFormatterMethodUsedTitle
source: Do not use insecure deserializer ObjectStateFormatter
cs: Nepoužívat nezabezpečený deserializátor ObjectStateFormatter
de: Nicht den unsicheren ObjectStateFormatter zur Deserialisierung verwenden
es: No usar el deserializador no seguro ObjectStateFormatter
fr: Ne pas utiliser le désérialiseur non sécurisé ObjectStateFormatter
it: Non usare il deserializzatore non sicuro ObjectStateFormatter
ja: 安全でないデシリアライザー ObjectStateFormatter を使用しない
ko: 안전하지 않은 역직렬 변환기 ObjectStateFormatter를 사용하지 마세요.
pl: Nie używaj niezabezpieczonego deserializatora ObjectStateFormatter
pt_br: Não use o desserializador ObjectStateFormatter não seguro
ru: Не используйте небезопасный десериализатор ObjectStateFormatter
tr: Güvenli olmayan seri kaldırıcı ObjectStateFormatter kullanmayın
zh_hans: 请勿使用不安全的反序列化程序 ObjectStateFormatter
zh_hant: 請勿使用不安全的還原序列化程式 ObjectStateFormatter

# OverridesPreviewMethodMessage
source: '{0}' overrides the preview method '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {0} přepíše metodu preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: „{0}“ überschreibt die Vorschaumethode „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: '{0}' invalida el método de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{0}' contourne la méthode de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: '{0}' sovrascrive il metodo di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: '{0}' はプレビュー メソッド '{1}' を上書きするため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: '{0}'은(는) 미리 보기 방법 '{1}'을(를) 재정의하므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}을(를) 참조하세요.
pl: „{0}” przesłania metodę w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: “{0}” substitui o método de visualização “{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2}para obter mais informações.
ru: "{0}" переопределяет предварительную версию метода "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: '{0}', '{1}' önizleme yöntemini geçersiz kıldığından önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: “{0}”覆盖预览方法“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: '{0}' 會覆寫預覽方法 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# OverridesPreviewMethodMessageWithCustomMessagePlaceholder
source: {3} '{0}' overrides the preview method '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {3}{0} přepíše metodu preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: {3} „{0}“ überschreibt die Vorschaumethode „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: {3} '{0}' invalida el método de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{3}'{0} contourne la méthode de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: '{3} '{0}' sorvrascrive il metodo di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: {3} '{0}' はプレビュー メソッド '{1}' を上書きするため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: {3} '{0}'은(는) 미리 보기 방법 '{1}'을(를) 재정의하므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}(을)를 참조하세요.
pl: {3} „{0}” przesłania metodę w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: {3}“{0}” substitui o método de visualização “{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2}para obter mais informações.
ru: "{0}" {3} переопределяет предварительную версию метода "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: {3} '{0}', '{1}' önizleme yöntemini geçersiz kıldığından önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: {3}.“{0}”覆盖预览方法“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: {3} '{0}' 會覆寫預覽方法 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# PInvokesShouldNotBeVisibleDescription
source: A public or protected method in a public type has the System.Runtime.InteropServices.DllImportAttribute attribute (also implemented by the Declare keyword in Visual Basic). Such methods should not be exposed.
cs: Veřejná nebo chráněná metoda ve veřejném typu má atribut System.Runtime.InteropServices.DllImportAttribute (také implementovaný klíčovým slovem Declare ve Visual Basicu). Tyto metody by neměly být vystaveny.
de: Eine öffentliche oder geschützte Methode in einem öffentlichen Typ weist das Attribut "System.Runtime.InteropServices.DllImportAttribute" auf (auch durch das Declare-Schlüsselwort in Visual Basic implementiert). Solche Methoden dürfen nicht verfügbar gemacht werden.
es: Un método público o protegido en un tipo público tiene el atributo System.Runtime.InteropServices.DllImportAttribute (también se implementa por la palabra clave Declare en Visual Basic). Estos métodos no deben exponerse.
fr: Une méthode publique ou protégée dans un type public a l'attribut System.Runtime.InteropServices.DllImportAttribute (également implémenté par le mot clé Declare en Visual Basic). De telles méthodes ne doivent pas être exposées.
it: Un metodo public o protected in un tipo public contiene l'attributo System.Runtime.InteropServices.DllImportAttribute (implementato anche dalla parola chiave Declare in Visual Basic). Questi metodi non devono essere esposti.
ja: パブリック型にあるパブリック メソッドまたは保護されたメソッドには、System.Runtime.InteropServices.DllImportAttribute 属性 (Visual Basic では、Declare キーワードによっても実装されています) があります。このようなメソッドは公開しないでください。
ko: public 형식의 public 또는 protected 메서드에 System.Runtime.InteropServices.DllImportAttribute 특성(Visual Basic의 선언 키워드에서 구현함)이 있습니다. 이러한 메서드는 노출할 수 없습니다.
pl: Metoda publiczna lub chroniona w typie publicznym ma atrybut System.Runtime.InteropServices.DllImportAttribute (implementowany również przez słowo kluczowe Declare w języku Visual Basic). Takie metody nie powinny być ujawniane.
pt_br: Um método público ou protegido em um tipo público tem o atributo System.Runtime.InteropServices.DllImportAttribute (implementado também pela palavra-chave Declare no Visual Basic). Esses métodos não devem ser expostos.
ru: Общий или защищенный метод в общем типе имеет атрибут System.Runtime.InteropServices.DllImportAttribute (также реализуемый ключевым словом Declare в Visual Basic). Предоставлять такие методы не следует.
tr: Ortak bir türdeki ortak veya korumalı bir yöntem System.Runtime.InteropServices.DllImportAttribute özniteliğine sahip (ayrıca Visual Basic içinde Declare anahtar sözcüğü tarafından uygulanır). Bu tür yöntemler açığa çıkarılmamalıdır.
zh_hans: 公共类型中的公共方法或受保护的方法具有 System.Runtime.InteropServices.DllImportAttribute 属性(在 Visual Basic 中也由 Declare 关键字实现)。不应公开此类方法。
zh_hant: 公用類型中的公用方法或受保護方法，具有 System.Runtime.InteropServices.DllImportAttribute 屬性 (也由 Visual Basic 中的 Declare 關鍵字實作)。這類方法不應公開。

# PInvokesShouldNotBeVisibleMessage
source: P/Invoke method '{0}' should not be visible
cs: Metoda P/Invoke {0} by neměla být viditelná
de: Die P/Invoke-Methode "{0}" darf nicht sichtbar sein.
es: El método P/Invoke "{0}" no debe ser visible
fr: La méthode P/Invoke '{0}' ne doit pas être visible
it: Il metodo P/Invoke '{0}' non deve essere visibile
ja: P/Invoke メソッド '{0}' は参照可能にすることはできません
ko: P/Invoke 메서드 '{0}'을(를) 표시하지 않아야 합니다.
pl: Metoda P/Invoke {0} nie powinna być widoczna.
pt_br: O método P/Invoke '{0}' não deve ser visível
ru: Метод P/Invoke "{0}" не должен быть видимым
tr: P/Invoke yöntemi '{0}' görünür olmamalıdır
zh_hans: P/Invoke 方法“{0}”应该是不可见的
zh_hant: 不應看得見 P/Invokes 方法 '{0}'

# PInvokesShouldNotBeVisibleTitle
source: P/Invokes should not be visible
cs: Metody P/Invoke nemají být viditelné
de: P/Invokes dürfen nicht sichtbar sein
es: Los elementos P/Invoke no deben estar visibles
fr: Les P/Invoke ne doivent pas être visibles
it: I metodi P/Invoke non devono essere visibili
ja: P/Invokes は参照可能にすることはできません
ko: P/Invokes를 표시하지 않아야 합니다.
pl: Elementy P/Invoke nie powinny być widoczne
pt_br: P/Invokes não deve ser visível
ru: Методы P/Invoke не должны быть видимыми
tr: P/Invokes görünür olmamalıdır
zh_hans: P/Invokes 应该是不可见的
zh_hant: 不應看得見 P/Invoke

# PlatformCompatibilityAllPlatforms
source: and all other platforms
cs: a všechny ostatní platformy
de: und alle anderen Plattformen
es: y el resto de plataformas
fr: et toutes les autres plateformes
it: e tutte le altre piattaforme
ja: およびその他すべてのプラットフォーム
ko: 및 다른 모든 플랫폼
pl: i wszystkie inne platformy
pt_br: e todas as outras plataformas
ru: и на всех остальных платформах
tr: ve diğer tüm platformlar
zh_hans: 和其他所有平台
zh_hant: 及所有其他平台

# PlatformCompatibilityAllVersions
source: '{0}' all versions
cs: Všechny verze {0}
de: {0}, alle Versionen
es: Todas las versiones de "{0}"
fr: '{0}' toutes versions
it: '{0}' - tutte le versioni
ja: すべてのバージョンの '{0}'
ko: '{0}' 모든 버전
pl: wszystkie wersje systemu „{0}”
pt_br: '{0}' todas as versões
ru: все версии "{0}"
tr: '{0}' tüm sürümler
zh_hans: "{0}" 所有版本
zh_hant: '{0}' 所有版本

# PlatformCompatibilityDescription
source: Using platform dependent API on a component makes the code no longer work across all platforms.
cs: Když se pro komponentu použije závislé rozhraní API, kód už nebude fungovat na všech platformách.
de: Durch die Verwendung einer plattformabhängigen API für eine Komponente funktioniert der Code nicht mehr auf allen Plattformen.
es: El uso de una API dependiente de la plataforma en un componente hace que el código deje de funcionar en todas las plataformas.
fr: L'utilisation d'une API dépendante de la plateforme sur un composant empêche le code de fonctionner sur l'ensemble des plateformes.
it: Se si usa un'API dipendente dalla piattaforma su un componente, il codice non funziona più in tutte le piattaforme.
ja: プラットフォーム依存 API をコンポーネント上で使用すると、一部のプラットフォームでコードが動作しなくなります。
ko: 구성 요소에서 플랫폼 종속 API를 사용하면 모든 플랫폼에서 코드가 더 이상 작동하지 않습니다.
pl: Użycie w składniku interfejsu API zależnego od platformy powoduje, że kod nie działa na różnych platformach.
pt_br: O uso de uma API dependente da plataforma em um componente faz com que o código não funcione mais em todas as plataformas.
ru: При использовании в компоненте API, зависящего от платформы, код больше не будет работать на всех платформах.
tr: Bileşen üzerinde platforma bağımlı API kullanmak, kodun artık tüm platformlarda çalışmamasına neden olur.
zh_hans: 在组件上使用依赖于平台的 API 会使代码无法用于所有平台。
zh_hant: 在元件上使用相依於平台的 API，會使程式碼無法繼續在所有平台上運作。

# PlatformCompatibilityFromVersionToVersion
source: '{0}' from version {1} to {2}
cs: {0} od verze {1} do {2}
de: {0}, Version {1} bis {2}
es: "{0}" de la versión {1} a la {2}
fr: '{0}' de la version {1} à {2}
it: '{0}' dalla versione {1} alla versione {2}
ja: バージョン {1} から {2} の '{0}'
ko: '{0}' 버전 {1}~007E;{2}
pl: system „{0}” w wersji od {1} do {2}
pt_br: '{0}' da versão {1} à {2}
ru: "{0}" с версии {1} до {2}
tr: '{0}' {1} sürümünden {2} sürümüne kadar
zh_hans: "{0}" 版本 {1} 到 {2}。
zh_hant: '{0}' 從 {1} 至 {2} 的版本

# PlatformCompatibilityObsoletedCsAllPlatformMessage
source: This call site is reachable on all platforms. '{0}' is obsoleted on: {1}.
cs: Toto místo volání je k dispozici na všech platformách. {0} je zastaralé na {1}.
de: Diese Aufrufsite ist auf allen Plattformen erreichbar. „{0}“ ist veraltet für: {1}.
es: Este sitio de llamada es accesible en todas las plataformas. '{0}' está obsoleto en: {1}.
fr: Ce site d’appel est accessible sur toutes les plateformes. '{0}' est obsolète sur : {1}.
it: Questo sito di chiamata è raggiungibile su tutte le piattaforme. '{0}' è obsoleto in: {1}.
ja: この呼び出しサイトはすべてのプラットフォームで到達可能です。'{0}' は {1} で廃止されました。
ko: 이 통화 사이트는 모든 플랫폼에서 연결할 수 있습니다. '{0}'은(는) {1}에서 사용되지 않습니다.
pl: To miejsce wywołania jest osiągalne na wszystkich platformach. „{0}” jest przestarzałe na: {1}.
pt_br: Este site de chamadas pode ser acessado em todas as plataformas. "{0}" está obsoleto em: {1}.
ru: Этот сайт вызова доступен на всех платформах. Параметр "{0}" устарел в {1}.
tr: Bu çağrı sitesine tüm platformlarda ulaşılabilir. '{0}' şurada kullanım dışıdır: {1}.
zh_hans: 可在所有平台上访问此调用站点。"{0}" 在 {1} 上过时。
zh_hant: 可在所有平台上連線到此呼叫網站。'{0}' 已在 {1} 上淘汰。

# PlatformCompatibilityObsoletedCsReachableMessage
source: This call site is reachable on: {2}. '{0}' is obsoleted on: {1}.
cs: Toto místo volání je k dispozici na {2}. {0} je zastaralé na {1}.
de: Diese Aufrufsite ist erreichbar für: {2}. „{0}“ ist veraltet für: {1}.
es: Este sitio de llamada es accesible en: {2}. '{0}' está obsoleto en: {1}.
fr: Ce site d’appel est accessible sur : {2}. '{0}' est obsolète sur : {1}.
it: Questo sito di chiamata è raggiungibile su: {2}. '{0}' è obsoleto su: {1}.
ja: この呼び出しサイトは {2} で到達可能です。'{0}' は {1} で廃止されました。
ko: 이 통화 사이트는 {2}에서 연결할 수 있습니다. '{0}'은(는) {1}에서 사용되지 않습니다.
pl: To miejsce wywołania jest osiągalne na platformie: {2}. „{0}” jest przestarzałe na następujących platformach: {1}.
pt_br: Este site de chamadas é acessível em: {2}. "{0}" está obsoleto em: {1}.
ru: Этот сайт вызова доступен в {2}. Параметр "{0}" устарел в {1}.
tr: Bu çağrı sitesine şurada ulaşılabilir: {2}. '{0}' şurada kullanım dışıdır: {1}.
zh_hans: 此调用站点可在以下位置访问:{2}。“{0}”在以下位置过时:{1}。
zh_hant: 可在 {2} 上連線到此呼叫網站。'{0}' 已在 {1} 上淘汰。

# PlatformCompatibilityOnlySupportedCsAllPlatformMessage
source: This call site is reachable on all platforms. '{0}' is only supported on: {1}.
cs: Toto místo volání je k dispozici na všech platformách. {0} se podporuje jen na {1}.
de: Diese Aufrufsite ist auf allen Plattformen erreichbar. "{0}" nur unterstützt für: {1}.
es: Se puede acceder a este sitio de llamada en todas las plataformas. "{0}" solo se admite en {1}.
fr: Ce site d'appel est accessible sur toutes les plateformes. '{0}' est uniquement pris en charge sur {1}.
it: Questo sito di chiamata è raggiungibile da tutte le piattaforme. '{0}' è supportato solo in {1}.
ja: この呼び出しサイトはすべてのプラットフォームで到達可能です。'{0}' は {1} でのみサポートされています。
ko: 이 호출 사이트에는 모든 플랫폼에서 연결할 수 있습니다. '{0}'은(는) {1}에서만 지원됩니다.
pl: To miejsce wywołania jest osiągalne na wszystkich platformach. Metoda „{0}” jest obsługiwana tylko na następujących platformach: {1}.
pt_br: Este site de chamada pode ser acessado em todas as plataformas. Só há suporte para '{0}' em: {1}.
ru: Этот сайт вызова доступен на всех платформах. "{0}" поддерживается только в {1}.
tr: Bu çağrı sitesine tüm platformlarda ulaşılabilir. '{0}' yalnızca şurada desteklenir: {1}.
zh_hans: 可在所有平台上访问此调用站点。"{0}" 仅在 {1} 上受支持。
zh_hant: 可在所有平台上連線到此呼叫網站。只有 {1} 支援 '{0}'。
