Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseInsecureRandomnessMessage
source: {0} is an insecure random number generator. Use cryptographically secure random number generators when randomness is required for security.
cs: {0} je nezabezpečený generátor náhodných čísel. Pokud se pro zabezpečení vyžaduje náhodnost, používejte kryptograficky zabezpečené generátory náhodných čísel.
de: "{0}" ist ein unsicherer Zufallszahlen-Generator. Verwenden Sie kryptografisch sichere Zufallszahlen-Generatoren, wenn Zufallszahlen für die Sicherheit erforderlich sind.
es: {0} es un generador de números aleatorios no seguro. Use generadores de números aleatorios que sean criptográficamente seguros cuando se requiera aleatoriedad por seguridad.
fr: {0} est un générateur de nombres aléatoires non sécurisé. Utilisez des générateurs de nombres aléatoires sécurisés de manière chiffrée quand une sélection aléatoire est nécessaire pour la sécurité.
it: {0} è un generatore di numeri casuali non sicuro. Usare generatori di numeri casuali sicuri dal punto di vista della crittografia quando per motivi di sicurezza è richiesta la casualità.
ja: {0} は安全でない乱数ジェネレーターです。セキュリティにランダム度が必要な場合に、暗号化によってセキュリティで保護された乱数ジェネレーターを使用します。
ko: {0}은(는) 비보안 난수 생성기입니다. 보안을 위해 임의성이 필요한 경우 암호화된 보안 난수 생성기를 사용하세요.
pl: {0} to niezabezpieczony generator liczb losowych. Użyj kryptograficznie zabezpieczonego generatora liczb losowych, gdy losowość jest wymagana ze względów bezpieczeństwa.
pt_br: {0} é um gerador de números aleatórios não seguro. Use geradores de números aleatórios criptograficamente seguros quando a aleatoriedade for necessária para segurança.
ru: {0} является небезопасным генератором случайных чисел. Если случайные числа требуются для обеспечения безопасности, используйте криптографически безопасные генераторы случайных чисел.
tr: {0}, güvenli olmayan bir rastgele sayı üreticidir. Güvenlik için rastgelelik gerekli olduğunda şifreli olarak güvenli rastgele sayı üreticileri kullanın.
zh_hans: {0} 是不安全的随机数生成器。当需要随机性以确保安全性时，请使用加密的安全随机数生成器。
zh_hant: {0} 是不安全的亂數產生器。當安全性需要隨機性時，請使用密碼編譯安全性亂數產生器。

# DoNotUseObsoleteKDFAlgorithm
source: Do not use obsolete key derivation function
cs: Nepoužívat zastaralou funkci pro odvození klíče
de: Keine veraltete Schlüsselableitungsfunktion verwenden
es: No utilizar la función de derivación de claves obsoleta
fr: Ne pas utiliser de fonction de dérivation de clés obsolète
it: Non usare la funzione di derivazione di chiave obsoleta
ja: 非推奨のキー派生関数を使用しないでください
ko: 사용되지 않는 키 파생 함수 사용 안 함
pl: Nie używaj przestarzałej funkcji wyprowadzenia klucza
pt_br: Não use a função de derivação de chave obsoleta
ru: Не используйте устаревшую функцию формирования ключа.
tr: Artık kullanılmayan anahtar türetme işlevini kullanma
zh_hans: 请勿使用已过时的密钥派生功能
zh_hant: 請勿使用已淘汰的金鑰衍生函數

# DoNotUseObsoleteKDFAlgorithmDescription
source: Password-based key derivation should use PBKDF2 with SHA-2. Avoid using PasswordDeriveBytes since it generates a PBKDF1 key. Avoid using Rfc2898DeriveBytes.CryptDeriveKey since it doesn't use the iteration count or salt.
cs: Odvození klíče na bázi hesla by mělo používat PBKDF2 s SHA-2. Nepoužívejte PasswordDeriveBytes, protože generuje klíč PBKDF1. Nepoužívejte Rfc2898DeriveBytes.CryptDeriveKey, protože nepoužívá počet iterací nebo řetězec salt.
de: Die kennwortbasierte Schlüsselableitung sollte PBKDF2 mit SHA-2 verwenden. Verwenden Sie nicht PasswordDeriveBytes, da hierbei ein PBKDF1-Schlüssel generiert wird. Verwenden Sie nicht Rfc2898DeriveBytes.CryptDeriveKey, da hierbei weder Iterationszählung noch Salt verwendet werden.
es: La derivación de claves basada en contraseña debe utilizar PBKDF2 con SHA-2. Evite usar PasswordDeriveBytes ya que genera una clave PBKDF1. Evite usar Rfc2898DeriveBytes.CryptDeriveKey puesto que no utiliza el recuento de iteración o salt.
fr: La dérivation de clés basée sur un mot de passe doit utiliser PBKDF2 avec SHA-2. Évitez d'utiliser PasswordDeriveBytes puisqu'il génère une clé PBKDF1. Évitez d'utiliser Rfc2898DeriveBytes.CryptDeriveKey car il n'utilise ni le nombre d'itérations ni de valeur salt.
it: La derivazione di chiave basata su password deve usare PBKDF2 con SHA-2. Evitare di usare PasswordDeriveBytes perché genera una chiave PBKDF1. Evitare di usare Rfc2898DeriveBytes.CryptDeriveKey perché non usa il salting o il conteggio delle iterazioni.
ja: パスワードベースのキーの派生では、PBKDF2 を SHA-2 と一緒に使用してください。PBKDF1 キーが生成されてしまうため、PasswordDeriveBytes を使用しないでください。反復カウントまたは salt を使用していないため、Rfc2898DeriveBytes.CryptDeriveKey を使用しないでください。
ko: 암호 기반 키 파생은 PBKDF2와 SHA-2를 사용해야 합니다. PasswordDeriveBytes는 PBKDF1 키를 생성하므로 사용하지 마세요. Rfc2898DeriveBytes.CryptDeriveKey는 반복 횟수 또는 솔트를 사용하지 않으므로 사용하지 마세요.
pl: Wyprowadzenie klucza oparte na haśle powinno używać funkcji PBKDF2 z algorytmem SHA-2. Unikaj używania klasy PasswordDeriveBytes, ponieważ generuje ona klucz PBKDF1. Unikaj używania klasy Rfc2898DeriveBytes.CryptDeriveKey, ponieważ nie używa ona liczby iteracji ani wartości zaburzającej.
pt_br: A derivação de chave com base em senha deve usar PBKDF2 com SHA-2. Evite usar PasswordDeriveBytes, pois ele gera uma chave PBKDF1. Evite usar Rfc2898DeriveBytes.CryptDeriveKey, pois ele não usa contagem de iteração nem salt.
ru: При формировании ключа на основе пароля должен использоваться стандарт PBKDF2 с SHA-2. Не используйте метод PasswordDeriveBytes, так как он формирует ключ PBKDF1. Также не используйте метод Rfc2898DeriveBytes.CryptDeriveKey, так как он не использует счетчик итераций и соль.
tr: Parola tabanlı anahtar türetme SHA-2 ile PBKDF2 kullanmalıdır. Bir PBKDF1 anahtarı ürettiğinden PasswordDeriveBytes kullanmaktan kaçının. Yineleme sayısı veya güvenlik dizisi kullanmadığından Rfc2898DeriveBytes.CryptDeriveKey kullanmaktan kaçının.
zh_hans: 基于密码的密钥派生应结合使用 PBKDF2 和 SHA-2。请避免使用 PasswordDeriveBytes，因为它会生成 PBKDF1 密钥。还需避免使用 Rfc2898DeriveBytes.CryptDeriveKey，因为它不使用迭代计数或加盐。
zh_hant: 以密碼為基礎的金鑰衍生應搭配 SHA-2 使用 PBKDF2。請避免使用 PasswordDeriveBytes，因為這會產生 PBKDF1 金鑰。請避免使用 Rfc2898DeriveBytes.CryptDeriveKey，因為其未使用反覆運算次數或 Salt。

# DoNotUseObsoleteKDFAlgorithmMessage
source: Call to obsolete key derivation function {0}.{1}
cs: Volání zastaralé funkce pro odvození klíče {0}.{1}
de: Aufruf der veralteten Schlüsselableitungsfunktion {0}.{1}
es: Llamada a la función de derivación de claves obsoleta {0}.{1}
fr: Appel à la fonction de dérivation de clés obsolète {0}.{1}
it: Chiamata alla funzione di derivazione di chiave obsoleta {0}.{1}
ja: 非推奨のキー派生関数 {0}.{1} への呼び出し
ko: 사용되지 않는 키 파생 함수 {0}.{1}에 대한 호출
pl: Wywołanie przestarzałej funkcji wyprowadzania klucza {0}.{1}
pt_br: Chamar a função de derivação de chave obsoleta {0}.{1}
ru: Вызов устаревшей функции формирования ключа {0}.{1}
tr: Artık kullanılmayan {0}.{1} anahtar türetme işlevine çağrı
zh_hans: 调用已过时的密钥派生功能 {0}。{1}
zh_hant: 呼叫已淘汰的金鑰衍生函數 {0}.{1}

# DoNotUseOutAttributeStringPInvokeParametersDescription
source: String parameters passed by value with the 'OutAttribute' can destabilize the runtime if the string is an interned string.
cs: Parametry řetězce předané do OutAttribute hodnotou můžou omezit správnou funkci modulu runtime, pokud řetězec bude interní.
de: Mit dem Wert "OutAttribute" übergebene Zeichenfolgenparameter können die Runtime destabilisieren, wenn die Zeichenfolge eine internalisierte Zeichenfolge ist.
es: Los parámetros de cadena pasados por valor con "OutAttribute" pueden desestabilizar el tiempo de ejecución si la cadena es una cadena interna.
fr: Les paramètres de chaîne passés par valeur avec 'OutAttribute' peuvent déstabiliser le runtime si la chaîne est une chaîne centralisée.
it: I parametri di stringa passati per valore con 'OutAttribute' possono destabilizzare il runtime se la stringa è centralizzata.
ja: 値渡しされる文字列パラメーターで 'OutAttribute' を指定すると、文字列がインターン処理された文字列である場合にランタイムが不安定になる可能性があります。
ko: 'OutAttribute'를 사용하여 값으로 전달된 문자열 매개 변수는 문자열이 인턴 지정된 문자열인 경우 런타임을 불안정하게 만들 수 있습니다.
pl: Parametry ciągu przekazywane przez wartość przy użyciu elementu „OutAttribute” mogą destabilizować środowisko uruchomieniowe, jeśli ciąg jest ciągiem internalizowanym.
pt_br: Os parâmetros de cadeia de caracteres passados por valor com 'OutAttribute' podem desestabilizar o runtime quando a cadeia de caracteres é interna.
ru: Строковые параметры, передаваемые по значению с "OutAttribute", могут дестабилизировать среду выполнения, если эта строка является интернированной.
tr: 'OutAttribute' ile değer tarafından geçirilen dize parametreleri, dizeye intern uygulanmışsa çalışma zamanının kararsız hale gelmesine neden olabilir.
zh_hans: 如果字符串是暂存的字符串，则具有 "OutAttribute" 的值传递的字符串参数可能使运行时不稳定。
zh_hant: 如果字串是暫留字串，則使用 'OutAttribute' 以值傳遞的字串參數可能會造成執行階段不穩定。

# DoNotUseOutAttributeStringPInvokeParametersMessage
source: Do not use the 'OutAttribute' for string parameter '{0}' which is passed by value. If marshalling of modified data back to the caller is required, use the 'out' keyword to pass the string by reference instead.
cs: Nepoužívejte OutAttribute pro parametr řetězce {0}, který se předává hodnotou. Pokud je zapotřebí předat upravená data zpět volajícímu, použijte klíčové slovo out, pomocí kterého se řetězec předá odkazem.
de: Verwenden Sie "OutAttribute" nicht für den Zeichenfolgenparameter "{0}", der als Wert übergeben wird. Wenn ein Marshalling geänderter Daten zurück an den Aufrufer erforderlich ist, verwenden Sie das Schlüsselwort "out", um die Zeichenfolge stattdessen als Verweis zu übergeben.
es: No use "OutAttribute" en el parámetro de cadena "{0}", que se pasa por valor. Si se necesita serializar los datos modificados para el autor de la llamada, utilice la palabra clave "out" para pasar mejor la cadena por referencia
fr: N'utilisez pas 'OutAttribute' pour le paramètre de chaîne '{0}' qui est passé par valeur. Si le marshaling des données modifiées vers l'appelant est nécessaire, utilisez le mot clé 'out' pour passer la chaîne par référence à la place.
it: Non usare 'OutAttribute' per il parametro di stringa '{0}' che viene passato per valore. Se è richiesto il marshalling dei dati modificati al chiamante, usare la parola chiave 'out' per passare la stringa per riferimento.
ja: 値渡しされる文字列パラメーター '{0}' には、'OutAttribute' を使用しないでください。変更されたデータを呼び出し元にマーシャリングする必要がある場合は、代わりに 'out' キーワードを使用して文字列を参照渡ししてください。
ko: 값으로 전달된 문자열 매개 변수 '{0}'에는 'OutAttribute'를 사용하지 마세요. 수정된 데이터를 다시 호출자에 마샬링해야 하는 경우 대신 'out' 키워드를 사용하여 참조로 문자열을 전달하세요.
pl: Nie używaj elementu „OutAttribute” dla parametru ciągu „{0}”, który jest przekazywany przez wartość. Jeśli jest wymagane kierowanie zmodyfikowanych danych z powrotem do obiektu wywołującego, użyj słowa kluczowego „out”, aby zamiast tego przekazać ciąg przez odwołanie.
pt_br: Não use 'OutAttribute' para o parâmetro de cadeia de caracteres '{0}' que é passado por valor. Caso seja necessário retornar o marshaling de dados modificados ao chamador, use a palavra-chave 'out' para passar a cadeia de caracteres por referência.
ru: Не используйте "OutAttribute" для строкового параметра "{0}", который передается по значению. Если требуется маршалинг измененных данных обратно в вызывающий объект, используйте вместо этого ключевое слово "out" для передачи строки по ссылке.
tr: Değerle geçirilen '{0}' dize parametresi için 'OutAttribute' kullanmayın. Değiştirilmiş verilerin yeniden çağırana yönelik olarak hazırlanması gerekirse, dizeyi başvuruyla geçirmek için 'out' anahtar sözcüğünü kullanın.
zh_hans: 不要将 "OutAttribute" 用于通过值传递的字符串参数“{0}”。如果需要将已修改的数据整理回调用方，请改用 " out" 关键字通过引用传递字符串。
zh_hant: 請勿對以值傳遞的字串參數 '{0}' 使用 'OutAttribute'。如果需要將已修改的資料封送處理至呼叫者，請改用 'out' 關鍵字以傳址方式傳遞字串。

# DoNotUseOutAttributeStringPInvokeParametersTitle
source: Do not use 'OutAttribute' on string parameters for P/Invokes
cs: Nepoužívat OutAttribute v parametrech řetězce pro volání nespravovaného kódu
de: "OutAttribute" nicht für Zeichenfolgenparameter für P/Invokes verwenden
es: No usar "OutAttribute" en los parámetros de cadena de P/Invokes
fr: N'utilisez pas 'OutAttribute' sur les paramètres de chaîne pour les P/Invoke
it: Non usare 'OutAttribute' su parametri di stringa per metodi P/Invoke
ja: P/Invoke の文字列パラメーターに 'OutAttribute' を使用しない
ko: P/Invokes에 대한 문자열 매개 변수에는 'OutAttribute'를 사용하지 마세요.
pl: Nie używaj elementu „OutAttribute” w przypadku parametrów ciągu dla elementów P/Invoke
pt_br: Não use 'OutAttribute' em parâmetros de cadeia de caracteres para P/Invocações
ru: Запрет на использование "OutAttribute" в строковых параметрах для вызовов P/Invoke
tr: P/Invokes için dize parametrelerinde 'OutAttribute' kullanmayın
zh_hans: 请勿对 P/Invokes 的字符串参数使用 "OutAttribute"
zh_hant: 請勿在 P/Invoke 的字串參數上使用 'OutAttribute'

# DoNotUseReferenceEqualsWithValueTypesComparerMessage
source: Do not pass an argument with value type '{0}' to the 'Equals' method on 'ReferenceEqualityComparer'. Due to value boxing, this call to 'Equals' can return an unexpected result. Consider using 'EqualityComparer' instead, or pass reference type arguments if you intend to use 'ReferenceEqualityComparer'.
cs: Nepředávejte argument s hodnotou {0} metodě Equals u třídy ReferenceEqualityComparer. Z důvodu zabalení hodnoty může toto volání Equals vrátit neočekávaný výsledek. Zvažte použití EqualityComparer nebo předejte argumenty odkazu, pokud chcete použít ReferenceEqualityComparer.
de: Übergeben Sie kein Argument mit dem Werttyp „{0}“ an die „Equals“-Methode für „ReferenceEqualityComparer“. Aufgrund des Boxings der Werte kann dieser Aufruf von „Equals“ ein unerwartetes Ergebnis zurückgeben. Verwenden Sie stattdessen „EqualityComparer“, oder übergeben Sie Argumente mit einem Verweistyp, wenn Sie „ReferenceEqualityComparer“ verwenden möchten.
es: No pase un argumento con el tipo de valor "{0}" al método "Equals" en "ReferenceEqualityComparer". Debido a la conversión boxing de valores, esta llamada a "Equals" puede devolver un resultado inesperado. Considere la posibilidad de usar "EqualityComparer" en su lugar, o pase argumentos de tipo de referencia si tiene pensado usar "ReferenceEqualityComparer".
fr: Ne passez pas d’argument avec le type valeur '{0}' à la méthode 'Equals' sur 'ReferenceEqualityComparer'. En raison du boxing de valeur, cet appel à « Equals » peut retourner un résultat inattendu. Envisagez plutôt d’utiliser « EqualityComparer » ou passez des arguments de type référence si vous envisagez d’utiliser « ReferenceEqualityComparer ».
it: Non passare un argomento con tipo valore '{0}' al metodo 'Equals' in 'ReferenceEqualityComparer'. A causa del boxing dei valori, questa chiamata a 'Equals' può restituire un risultato imprevisto. Provare a usare 'EqualityComparer' o passare argomenti di tipo riferimento se si intende usare 'ReferenceEqualityComparer'.
ja: 値型 '{0}' の引数を 'ReferenceEqualityComparer' の 'Equals' メソッドに渡さないでください。値のボックス化が原因で、'Equals' へのこの呼び出しによって予期しない結果が返される可能性があります。代わりに 'EqualityComparer' を使用するか、'ReferenceEqualityComparer' を使用する場合は参照型引数を渡すことを検討してください。
ko: 값 형식이 '{0}'인 인수를 'ReferenceEqualityComparer'의 'Equals' 메소드에 전달하지 마세요. 값 boxing으로 인해 'Equals'에 대한 이 호출은 예기치 않은 결과를 반환할 수 있습니다. 대신 'EqualityComparer'를 사용하거나 'ReferenceEqualityComparer'를 사용하려는 경우 참조 형식 인수를 전달하세요.
pl: Nie przekazuj argumentu o typie wartości „{0}” do metody „Equals” w elemencie „ReferenceEqualityComparer”. Ze względu na boxing wartości to wywołanie „Equals” może zwrócić nieoczekiwany wynik. Zamiast tego rozważ użycie elementu „EqualityComparer” lub przekaż argumenty typu odwołania, jeśli zamierzasz użyć elementu „ReferenceEqualityComparer”.
pt_br: Não passe um argumento com tipo de valor '{0}' para o método 'Equals' em 'ReferenceEqualityComparer'. Devido ao boxing de valor, esta chamada para 'Equals' pode retornar um resultado inesperado. Considere usar 'EqualityComparer' em vez disso, ou passar argumentos de tipo de referência se você pretende usar 'ReferenceEqualityComparer'.
ru: Не передавайте аргумент с типом значения '{0}' в метод 'Equals' в 'ReferenceEqualityComparer'. Из-за упаковки-преобразования значения этот вызов 'Equals' может вернуть непредвиденный результат. Рассмотрите возможность использования 'EqualityComparer' или передавайте аргументы ссылочного типа, если предполагается использовать 'ReferenceEqualityComparer'.
tr: 'ReferenceEqualityComparer' üzerinde 'Equals' metoduna '{0}' değer türünde bir bağımsız değişken geçirmeyin. Değer kutulama nedeniyle bu 'Equals' çağrısı beklenmeyen bir sonuç döndürebilir. Yerine 'EqualityComparer' kullanmayı düşünün veya 'ReferenceEqualityComparer' kullanmayı amaçlıyorsanız başvuru türünde bağımsız değişkenler geçirin.
zh_hans: 不要将值类型为 '{0}' 的参数传递到 'ReferenceEqualityComparer' 上的 'Equals' 方法。由于数据封装，此对 'Equals' 的调用可能会返回意外的结果。如果打算使用 'ReferenceEqualityComparer'，请考虑改用 'EqualityComparer' 或传递引用类型参数。
zh_hant: 請勿將數值型別為 '{0}' 的引數傳遞至 'ReferenceEqualityComparer' 上的 'Equals' 方法。由於值 Boxing，這個對 'Equals' 的呼叫可能會返回未預期的結果。如果您想要使用 'ReferenceEqualityComparer'，請考慮改為使用 'EqualityComparer'，或傳遞參考型別引數。

# DoNotUseReferenceEqualsWithValueTypesDescription
source: Value type typed arguments are uniquely boxed for each call to this method, therefore the result can be unexpected.
cs: Argumenty typu hodnoty se jedinečně balí pro každé volání této metody, proto může být výsledek neočekávaný.
de: Für mit einem Werttyp typisierte Argumente erfolgt für jeden Aufruf dieser Methode ein eindeutiges Boxing, daher kann ein unerwartet Ergebnis auftreten.
es: A los argumentos con tipo de valor se les aplica la conversión boxing de forma única para cada llamada a este método, por lo que el resultado puede ser inesperado.
fr: Les arguments typés de type valeur sont mis en boîte de manière unique pour chaque appel à cette méthode. Par conséquent, le résultat peut être inattendu.
it: Gli argomenti di tipo valore digitati vengono inseriti in un box univoco per ogni chiamata a questo metodo, pertanto il risultato può essere imprevisto.
ja: 値の型に型指定された引数は、このメソッドの呼び出しごとに一意にボックス化されるため、結果が予期しないものになる可能性があります。
ko: 값 형식 형식 인수는 이 메소드에 대한 각 호출에 대해 고유하게 boxing되므로 예상하지 못한 결과가 나올 수 있습니다.
pl: Argumenty wpisane w typie wartości są unikatowo blokowane dla każdego wywołania tej metody, dlatego wynik może być nieoczekiwany.
pt_br: Os argumentos digitados por tipo de valor são colocados exclusivamente em caixas para cada chamada para esse método, portanto, o resultado pode ser inesperado.
ru: При каждом вызове этого метода отдельно выполняется упаковка-преобразование типизированных аргументов типа значения. Поэтому результат может быть непредвиденным.
tr: Değer türü kullanan bağımsız değişkenler bu metoda yönelik her çağrı için benzersiz şekilde kutulandığından beklenmeyen sonuçlar alınabilir.
zh_hans: 每次调用此方法时，值类型的类型化参数都唯一装箱，因此结果可能是意外的。
zh_hant: 每次呼叫此方法時，實值型別所輸入的引數，都是經過 Box 的唯一值，因此其結果可以是未預期的。

# DoNotUseReferenceEqualsWithValueTypesMethodMessage
source: Do not pass an argument with value type '{0}' to 'ReferenceEquals'. Due to value boxing, this call to 'ReferenceEquals' can return an unexpected result. Consider using 'Equals' instead, or pass reference type arguments if you intend to use 'ReferenceEquals'.
cs: Nepředávejte argument s hodnotou {0} do metody ReferenceEquals. Z důvodu zabalení hodnoty může toto volání ReferenceEquals vrátit neočekávaný výsledek. Zvažte použití Equals nebo předejte argumenty odkazu, pokud chcete použít ReferenceEquals.
de: Übergeben Sie kein Argument mit dem Werttyp „{0}“ an „ReferenceEqualityComparer“. Aufgrund des Boxings der Werte kann dieser Aufruf von „Equals“ ein unerwartetes Ergebnis zurückgeben. Verwenden Sie stattdessen „EqualityComparer“, oder übergeben Sie Argumente mit einem Verweistyp, wenn Sie „ReferenceEqualityComparer“ verwenden möchten.
es: No pase un argumento con el tipo de valor "{0}" a "ReferenceEquals". Debido a la conversión boxing de valores, esta llamada a "ReferenceEquals" puede devolver un resultado inesperado. Considere la posibilidad de usar "Equals" en su lugar, o pase argumentos de tipo de referencia si tiene pensado usar "ReferenceEquals".
fr: Ne passez pas d’argument avec le type valeur '{0}' à 'ReferenceEquals'. En raison du boxing de valeur, cet appel à « ReferenceEquals » peut retourner un résultat inattendu. Envisagez d’utiliser 'Equals' à la place, ou passez des arguments de type référence si vous envisagez d’utiliser 'ReferenceEquals'.
it: Non passare un argomento con tipo valore '{0}' a 'ReferenceEquals'. A causa del boxing dei valori, questa chiamata a 'ReferenceEquals' può restituire un risultato imprevisto. Provare a usare 'Equals' o passare argomenti di tipo riferimento se si intende usare 'ReferenceEquals'.
ja: 値型 '{0}' の引数を 'ReferenceEquals' に渡さないでください。値のボックス化が原因で、'ReferenceEquals' へのこの呼び出しによって予期しない結果が返される可能性があります。代わりに 'Equals' を使用するか、'ReferenceEquals' を使用する場合は参照型引数を渡すことを検討してください。
ko: 값 형식이 '{0}'인 인수를 'ReferenceEquals'에 전달하지 마세요. 값 boxing으로 인해 'ReferenceEquals'에 대한 이 호출은 예기치 않은 결과를 반환할 수 있습니다. 대신 'Equals'를 사용하거나 'ReferenceEquals'를 사용하려는 경우 참조 형식 인수를 전달하세요.
pl: Nie przekazuj argumentu o typie wartości „{0}” do elementu „ReferenceEquals”. Ze względu na boxing wartości to wywołanie elementu „ReferenceEquals” może zwrócić nieoczekiwany wynik. Zamiast tego rozważ użycie elementu „Equals” lub przekaż argumenty typu odwołania, jeśli zamierzasz użyć elementu „ReferenceEquals”.
pt_br: Não passe um argumento com tipo de valor '{0}' para 'ReferenceEquals'. Devido ao boxing de valor, esta chamada para 'ReferenceEquals' pode retornar um resultado inesperado. Considere usar 'Equals' em vez disso, ou passar argumentos de tipo de referência se você pretende usar 'ReferenceEquals'.
ru: Не передавайте аргумент с типом значения '{0}' в 'ReferenceEquals'. Из-за упаковки-преобразования значения этот вызов 'ReferenceEquals' может вернуть непредвиденный результат. Рассмотрите возможность использования 'Equals' или передавайте аргументы ссылочного типа, если предполагается использовать 'ReferenceEquals'.
tr: 'ReferenceEqualitys' metoduna '{0}' değer türünde bir bağımsız değişken geçirmeyin. Değer kutulama nedeniyle bu 'ReferenceEquals' çağrısı beklenmeyen bir sonuç döndürebilir. Yerine 'Equals' kullanmayı düşünün veya 'ReferenceEqualitys' kullanmayı amaçlıyorsanız başvuru türünde bağımsız değişkenler geçirin.
zh_hans: 请勿将值类型为 '{0}' 的参数传递到 'ReferenceEquals'。由于数据封装，此对 'ReferenceEquals' 的调用可能会返回意外的结果。如果打算使用 'ReferenceEquals'，请考虑改用 'Equals' 或传递引用类型参数。
zh_hant: 請勿將數值型別為 '{0}' 的引數傳遞至 'ReferenceEquals'。由於值 Boxing，這個對 'Equals' 的呼叫可能會返回未預期的結果。如果您想要使用 'ReferenceEquals'，請考慮改為使用 'Equals'，或傳遞參考型別引數。

# DoNotUseReferenceEqualsWithValueTypesTitle
source: Do not use ReferenceEquals with value types
cs: Nepoužívejte ReferenceEquals s typy hodnot
de: ReferenceEquals nicht mit Werttypen verwenden
es: No use ReferenceEquals con tipos de valor
fr: Ne pas utiliser ReferenceEquals avec des types valeur
it: Non usare ReferenceEquals con tipi valore
ja: 値の型で ReferenceEquals を使用しない
ko: 값 형식이 있는 ReferenceEquals를 사용하면 안 됨
pl: Nie używaj metody ReferenceEquals z typami wartości
pt_br: Não use ReferenceEquals com tipos de valor
ru: Не используйте ReferenceEquals с типами значений
tr: ReferenceEquals metodunu değer türleriyle birlikte kullanmayın
zh_hans: 不要使用具有值类型的 ReferenceEquals
zh_hant: 請勿使用有實值型別的 ReferenceEquals
