Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ForwardCancellationTokenToInvocationsDescription
source: Forward the 'CancellationToken' parameter to methods to ensure the operation cancellation notifications gets properly propagated, or pass in 'CancellationToken.None' explicitly to indicate intentionally not propagating the token.
cs: Přepošlete parametr CancellationToken do metod, aby se zajistilo, že se správně rozšíří oznámení o zrušení operací. Nebo můžete předat explicitně CancellationToken.None a označit tak, že se token záměrně nebude šířit.
de: Hiermit wird der Parameter "CancellationToken" an Methoden weitergeleitet. So stellen Sie sicher, dass Benachrichtigungen zum Abbruch des Vorgangs ordnungsgemäß verteilt werden. Alternativ dazu können Sie explizit "CancellationToken.None" übergeben, um festzulegen, dass das Token nicht verteilt werden soll.
es: Reenvíe el parámetro "CancellationToken" a los métodos para garantizar que las notificaciones de cancelación de operaciones se propagan correctamente, o bien pase "CancellationToken.None" explícitamente para indicar que no se propagará el token intencionalmente.
fr: Transférez le paramètre 'CancellationToken' aux méthodes appropriées pour avoir la garantie que les notifications d'annulation d'opération sont correctement propagées, ou passez explicitement 'CancellationToken.None' pour indiquer clairement de ne pas propager le jeton.
it: Inoltrare il parametro 'CancellationToken' ai metodi per assicurare la corretta propagazione delle notifiche di annullamento dell'operazione oppure passare 'CancellationToken.None' in modo esplicito per indicare che il token non viene propagato intenzionalmente.
ja: 'CancellationToken' パラメーターをメソッドに転送して操作のキャンセル通知が適切に伝達されるようにするか、または 'CancellationToken.None' を明示的に渡して意図的にトークンを伝達しないことを指定します。
ko: 'CancellationToken' 매개 변수를 메서드로 전달하여 작업 취소 알림이 올바르게 전파되도록 하거나, 명시적으로 'CancellationToken.None'을 전달하여 의도적으로 토큰을 전파하지 않음을 나타냅니다.
pl: Prześlij dalej parametr „CancellationToken” do metod, aby upewnić się, że powiadomienia o anulowaniu operacji zostaną prawidłowo rozpropagowane, lub przekaż element „CancellationToken.None” jawnie, aby wskazać celowe niepropagowanie tokenu.
pt_br: Encaminhe o parâmetro 'CancellationToken' para os métodos para garantir que as notificações de cancelamento da operação sejam propagadas corretamente ou passe o 'CancellationToken.None' explicitamente para indicar que ele está intencionalmente não propagando o token.
ru: Перенаправьте параметр "CancellationToken" в методы, чтобы обеспечить правильное распространение уведомлений об отмене операции, или передайте "CancellationToken.None" явным образом, чтобы намеренно указать запрет на распространение маркера.
tr: İşlem iptali bildirimlerinin doğru yayılmasını sağlamak için 'CancellationToken' parametresini metotlara iletin veya belirtecin kasıtlı olarak yayılmayacağını belirtmek için 'CancellationToken.None' ifadesini açıkça geçirin.
zh_hans: 将 "CancellationToken" 参数转发给方法来确保操作取消通知得到正确传播，或者在 "CancellationToken.None" 中显式传递，以指示有意不传播令牌。
zh_hant: 將 'CancellationToken' 參數轉送給方法，以確保作業取消通知能正確地散佈，或明確地傳入 'CancellationToken.None'，以表示刻意不散佈權杖。

# ForwardCancellationTokenToInvocationsMessage
source: Forward the '{0}' parameter to the '{1}' method or pass in 'CancellationToken.None' explicitly to indicate intentionally not propagating the token
cs: Přepošlete parametr {0} metodě {1}, nebo předejte explicitně CancellationToken.None a označte tak, že se token záměrně nebude šířit.
de: Leiten Sie den Parameter "{0}" an die Methode "{1}" weiter, oder übergeben Sie explizit "CancellationToken.None", um festzulegen, dass das Token nicht verteilt werden soll.
es: Reenviar el parámetro "{0}" al método "{1}" o pasar "CancellationToken.None" de forma explícita para indicar que no se propagó el token intencionalmente
fr: Transférer le paramètre '{0}' à la méthode '{1}' ou passer explicitement 'CancellationToken.None' pour indiquer clairement de ne pas propager le jeton
it: Inoltrare il parametro '{0}' al metodo '{1}' oppure passare 'CancellationToken.None' in modo esplicito per indicare che il token non viene propagato intenzionalmente
ja: '{0}' パラメーターを '{1}' メソッドに転送するか、または 'CancellationToken.None' を明示的に渡して、意図的にトークンを伝達しないことを明示的に指定します
ko: '{0}' 매개 변수를 '{1}' 메서드로 전달하거나, 명시적으로 'CancellationToken.None'을 전달하여 의도적으로 토큰을 전파하지 않음을 나타내세요.
pl: Prześlij dalej parametr „{0}” do metody „{1}” lub przekaż element „CancellationToken.None” jawnie, aby wskazać celowe niepropagowanie tokenu
pt_br: Encaminhe o parâmetro '{0}' para o método '{1}' ou passe o 'CancellationToken.None' explicitamente para indicar que ele está intencionalmente não propagando o token
ru: Перенаправьте параметр "{0}" в метод "{1}" или передайте "CancellationToken.None" явным образом, чтобы намеренно указать запрет на распространение токена.
tr: '{0}' parametresini '{1}' metoduna iletin veya kasıtlı olarak belirteci yaymadığını açıkça belirtmek için 'CancellationToken.None' içinde geçirin
zh_hans: 将“{0}”参数转发给“{1}”方法，或在 "CancellationToken.None" 中显式传递以指示有意不传播令牌
zh_hant: 將 '{0}' 參數傳遞給 '{1}' 方法，或明確傳遞 'CancellationToken.None'，以表示有意不散佈權杖

# ForwardCancellationTokenToInvocationsTitle
source: Forward the 'CancellationToken' parameter to methods
cs: Přeposlat parametr CancellationToken do metod
de: Parameter "CancellationToken" an Methoden weiterleiten
es: Reenviar el parámetro "CancellationToken" a los métodos
fr: Transférer le paramètre 'CancellationToken' aux méthodes appropriées
it: Inoltrare il parametro 'CancellationToken' ai metodi
ja: 'CancellationToken' パラメーターをメソッドに転送する
ko: 'CancellationToken' 매개 변수를 메서드로 전달
pl: Prześlij dalej parametr „CancellationToken” do metod
pt_br: Encaminhe o parâmetro 'CancellationToken' para os métodos
ru: Перенаправьте параметр "CancellationToken" в методы
tr: 'CancellationToken' parametresini metotlara ilet
zh_hans: 将 "CancellationToken" 参数转发给方法
zh_hant: 將 'CancellationToken' 參數轉送給方法

# HardCodedSecurityProtocolMessage
source: Avoid hardcoding SecurityProtocolType {0}, and instead use SecurityProtocolType.SystemDefault to allow the operating system to choose the best Transport Layer Security protocol to use.
cs: Vyhněte se pevnému zakódování hodnoty SecurityProtocolType {0}. Místo toho použijte SecurityProtocolType.SystemDefault, aby mohl operační systém sám zvolit nejlepší protokol TLS (Transport Layer Security), který se má použít.
de: Vermeiden Sie eine Hartcodierung von SecurityProtocolType "{0}", und verwenden Sie stattdessen "SecurityProtocolType.SystemDefault", um dem Betriebssystem die Auswahl des besten TLS-Protokolls (Transport Layer Security) zu ermöglichen.
es: Evite codificar SecurityProtocolType {0} de forma rígida y, en su lugar, use SecurityProtocolType.SystemDefault para permitir que el sistema operativo elija el mejor protocolo de Seguridad de la capa de transporte que se puede usar.
fr: Évitez tout codage en dur du SecurityProtocolType {0}, et utilisez plutôt SecurityProtocolType.SystemDefault pour permettre au système d'exploitation de choisir le meilleur protocole TLS à utiliser.
it: Evitare di impostare SecurityProtocolType {0} come hardcoded e usare SecurityProtocolType.SystemDefault per consentire al sistema operativo di scegliere il migliore protocollo Transport Layer Security da usare.
ja: SecurityProtocolType {0} をハードコードしないでください。代わりに、SecurityProtocolType.SystemDefault を使用して、オペレーティング システムが使用する最適なトランスポート層セキュリティ プロトコルを選択できるようにします。
ko: 운영 체제에서 사용할 최상의 전송 계층 보안 프로토콜을 선택할 수 있게 하려면 SecurityProtocolType {0}을(를) 하드 코딩하지 말고 대신 SecurityProtocolType.SystemDefault를 사용하세요.
pl: Unikaj kodowania na stałe wartości SecurityProtocolType {0} i zamiast tego użyj wartości SecurityProtocolType.SystemDefault, aby umożliwić systemowi operacyjnemu wybranie najlepszego protokołu Transport Layer Security do użycia.
pt_br: Evite codificar SecurityProtocolType {0}. Em vez disso, use SecurityProtocolType.SystemDefault para permitir que o sistema operacional escolha o melhor protocolo TLS a ser usado.
ru: Не встраивайте SecurityProtocolType {0}. Используйте SecurityProtocolType.SystemDefault, чтобы операционная система выбрала оптимальный протокол TSL.
tr: SecurityProtocolType {0} değerini sabit kodlamaktan kaçının ve bunun yerine işletim sisteminin kullanılacak en iyi Aktarım Katmanı Güvenlik protokolünü seçmesine izin vermek için SecurityProtocolType.SystemDefault kullanın.
zh_hans: 避免 hardcoding SecurityProtocolType {0}, 转而使用 SecurityProtocolType. SystemDefault 允许操作系统选择要使用的最佳传输层安全性协议。
zh_hant: 請避免對 SecurityProtocolType {0} 進行硬式編碼，並改為使用 SecurityProtocolType.SystemDefault 以便作業系統針對要使用的傳輸層安全性通訊協定進行最佳選擇。

# HardCodedSecurityProtocolTitle
source: Avoid hardcoding SecurityProtocolType value
cs: Vyhněte se pevnému zakódování hodnoty SecurityProtocolType
de: Hartcodierung des SecurityProtocolType-Werts vermeiden
es: Evitar codificar el valor SecurityProtocolType de forma rígida
fr: Éviter tout codage en dur de la valeur de SecurityProtocolType
it: Evitare di impostare il valore SecurityProtocolType come hardcoded
ja: SecurityProtocolType の値をハードコードしない
ko: SecurityProtocolType 값 하드 코딩 방지
pl: Unikaj kodowania na stałe wartości SecurityProtocolType
pt_br: Evite codificar o valor SecurityProtocolType
ru: Не встраивайте значение SecurityProtocolType.
tr: SecurityProtocolType değerini sabit kodlamaktan kaçının
zh_hans: 避免 hardcoding SecurityProtocolType 值
zh_hant: 請避免對 SecurityProtocolType 值進行硬式編碼

# HardcodedSslProtocolsDescription
source: Current Transport Layer Security protocol versions may become deprecated if vulnerabilities are found. Avoid hardcoding SslProtocols values to keep your application secure. Use 'None' to let the Operating System choose a version.
cs: Po zjištění ohrožení zabezpečení můžou aktuální verze protokolu TLS (Transport Layer Security) zastarat. Aby aplikace zůstala zabezpečená, nepoužívejte pevně zakódované hodnoty SslProtocols. Pokud chcete, aby operační systém mohl zvolit verzi, použijte možnost None.
de: Aktuelle Transport Layer Security-Protokollversionen werden möglicherweise als veraltet markiert, wenn Sicherheitsrisiken gefunden werden. Vermeiden Sie das Hartcodieren von SslProtocols-Werten, um Ihre Anwendung zu schützen. Verwenden Sie "None", um dem Betriebssystem die Auswahl einer Version zu ermöglichen.
es: Las versiones actuales del protocolo Seguridad de la capa de transporte pueden dejar de usarse si se encuentran vulnerabilidades. No codifique los valores de SslProtocols de forma rígida para mantener la aplicación segura. Use "None" para permitir que el sistema operativo elija una versión.
fr: Les versions actuelles du protocole TLS (Transport Layer Security) peuvent être dépréciées si des vulnérabilités sont détectées. Évitez de coder en dur les valeurs de SslProtocols pour que votre application reste sécurisée. Utilisez 'None' pour laisser le système d'exploitation choisir une version.
it: Le versioni correnti del protocollo Transport Layer Security potrebbero diventare deprecate se vengono trovate vulnerabilità. Per garantire la protezione dell'applicazione, evitare di impostare i valori SslProtocols come hardcoded. Usare 'None' per consentire al sistema operativo di scegliere una versione.
ja: 現在のトランスポート層セキュリティ プロトコルのバージョンに脆弱性が見つかると、非推奨になる可能性があります。アプリケーションのセキュリティを維持するために、SslProtocols の値をハードコードしないでください。オペレーティング システムがバージョンを選択できるようにするには、'None' を使用します。
ko: 취약성이 발견되면 현재 전송 계층 보안 프로토콜 버전이 사용되지 않을 수 있습니다. 애플리케이션을 안전하게 유지하려면 SslProtocols 값을 하드 코딩하지 않습니다. 운영 체제에서 버전을 선택하도록 하려면 '없음'을 사용합니다.
pl: Bieżące wersje protokołu Transport Layer Security mogą zostać uznane za przestarzałe w przypadku znalezienia luk w zabezpieczeniach. Unikaj kodowania na stałe wartości SslProtocols, aby zachować bezpieczeństwo aplikacji. Użyj opcji „Brak”, aby umożliwić systemowi operacyjnemu wybranie wersji.
pt_br: As versões atuais do protocolo TLS poderão ser preteridas se forem localizadas vulnerabilidades. Evite codificar valores de SslProtocols para manter o seu aplicativo seguro. Use 'None' para permitir que o Sistema Operacional escolha uma versão.
ru: Текущие версии протокола TLS могут стать нерекомендуемыми при обнаружении уязвимостей. Не следует жестко задавать значения параметра SslProtocols, чтобы в будущем приложение также оставалось безопасным. Используйте значение "None", чтобы операционная система самостоятельно выбрала версию протокола.
tr: Güvenlik açıkları bulunursa, geçerli Aktarım Katmanı Güvenliği protokol sürümleri kullanımdan kaldırılmış olabilir. Uygulamanızın güvenliğini sağlamak için sabit kodlanmış SslProtocols değerleri kullanmaktan kaçının. İşletim Sisteminin bir sürüm seçmesi için 'Yok' seçeneğini belirleyin.
zh_hans: 如果发现漏洞，则当前传输层安全协议版本可能会被弃用。请避免硬编码 SslProtocols 值，以确保应用程序安全。请使用“无”，让操作系统选择一个版本。
zh_hant: 若發現弱點，則目前的傳輸層安全性通訊協定版本可能會受到淘汰。請避免硬式編碼 SslProtocols 值來確保應用程式安全。請使用 'None' 讓作業系統選擇版本。

# HardcodedSslProtocolsMessage
source: Avoid hardcoding SslProtocols '{0}' to ensure your application remains secure in the future. Use 'None' to let the Operating System choose a version.
cs: Abyste zajistili, že aplikace zůstane v budoucnu zabezpečená, nepoužívejte pevně zakódované hodnoty SslProtocols {0}. Pokud chcete, aby operační systém mohl zvolit verzi, použijte možnost None.
de: Vermeiden Sie die Hartcodierung von SslProtocols "{0}", um sicherzustellen, dass Ihre Anwendung in Zukunft sicher bleibt. Verwenden Sie "None", um dem Betriebssystem die Auswahl einer Version zu ermöglichen.
es: Evite codificar el valor "{0}" de SslProtocols de forma rígida para que la aplicación se mantenga segura en el futuro. Use "None" para permitir que el sistema operativo elija una versión.
fr: Évitez de coder en dur les valeurs '{0}' de SslProtocols pour que votre application reste sécurisée de manière durable. Utilisez 'None' pour laisser le système d'exploitation choisir une version.
it: Evitare di impostare i valori '{0}' di SslProtocols come hardcoded per garantire che l'applicazione rimanga protetta in futuro. Usare 'None' per consentire al sistema operativo di scegliere una versione.
ja: 今後のアプリケーションのセキュリティを確保するため、SslProtocols '{0}' をハードコードしないでください。オペレーティング システムがバージョンを選択できるようにするには、'None' を使用します。
ko: 앞으로 애플리케이션을 안전하게 유지하려면 SslProtocols '{0}'을(를) 하드 코딩하지 마세요. 운영 체제에서 버전을 선택하도록 하려면 '없음'을 사용하세요.
pl: Unikaj kodowania na stałe wartości SslProtocols „{0}”, aby zapewnić bezpieczeństwo aplikacji w przyszłości. Użyj opcji „Brak”, aby umożliwić systemowi operacyjnemu wybranie wersji.
pt_br: Evite codificar SslProtocols '{0}' para garantir que o seu aplicativo permaneça seguro no futuro. Use 'None' para permitir que o Sistema Operacional escolha uma versão.
ru: Не следует жестко задавать значение параметра SslProtocols "{0}", чтобы в будущем приложение также оставалось безопасным. Используйте значение "None", чтобы операционная система самостоятельно выбрала версию протокола.
tr: Uygulamanızın ileride de güvenli kalmasını sağlamak için sabit kodlanmış SslProtocols '{0}' kullanmaktan kaçının. İşletim Sisteminin bir sürüm seçmesi için 'Yok' seçeneğini belirleyin.
zh_hans: 请避免硬编码 SslProtocols“{0}”，以确保应用程序在将来保持安全。请使用“无”，让操作系统选择一个版本。
zh_hant: 請避免硬式編碼 SslProtocols '{0}'，以確保應用程式在未來的安全性。請使用 'None' 讓作業系統選擇版本。

# HardcodedSslProtocolsTitle
source: Avoid hardcoded SslProtocols values
cs: Nepoužívat pevně zakódované hodnoty SslProtocols
de: Hartcodierte SslProtocols-Werte vermeiden
es: Evitar valores de SslProtocols codificados de forma rígida
fr: Évitez de coder en dur les valeurs de SslProtocols
it: Evitare di impostare i valori di SslProtocols come hardcoded
ja: ハードコードされた SslProtocols の値を使用しない
ko: 하드 코딩된 SslProtocols 값 방지
pl: Unikaj kodowania na stałe wartości SslProtocols
pt_br: Evitar valores SslProtocols codificados
ru: Не следует жестко задавать значение параметра SslProtocols
tr: Sabit kodlanmış SslProtocols değerlerinden kaçının
zh_hans: 避免硬编码的 SslProtocols 值
zh_hant: 避免硬式編碼 SslProtocols 值

# ImplementGenericMathInterfacesCorrectlyDescription
source: Generic math interfaces require the derived type itself to be used for the self recurring type parameter.
cs: Obecná matematická rozhraní vyžadují, aby se pro parametr typu s vlastním opakováním použil samotný odvozený typ.
de: Generische mathematische Schnittstellen erfordern, dass der abgeleitete Typ selbst für den sich wiederholenden Typparameter verwendet wird.
es: Las interfaces matemáticas genéricas requieren que se use el tipo derivado para el parámetro de tipo periódico.
fr: Les interfaces mathématiques génériques nécessitent que le type dérivé lui-même soit utilisé pour le paramètre de type auto-récurrent.
it: Le interfacce matematiche generiche richiedono l'uso del tipo derivato stesso per il parametro di tipo ricorrente.
ja: 汎用的な数式インターフェイスでは、派生型自体を自己反復する種類のパラメーターに使用する必要があります。
ko: 제네릭 수학 인터페이스를 사용하려면 파생 형식 자체를 자체 되풀이 형식 매개 변수에 사용해야 합니다.
pl: Ogólne interfejsy matematyczne wymagają, aby sam typ pochodny był używany dla parametru typu cyklicznego.
pt_br: As interfaces matemáticas genéricas exigem que o próprio tipo derivado seja usado no parâmetro de tipo recorrente.
ru: Универсальные математические интерфейсы требуют, чтобы сам производный тип использовался для параметра самоповторяющегося типа.
tr: Genel matematik arabirimleri, türetilmiş türün kendi kendini yineleyen tür parametresi için kullanılmasını gerektirir.
zh_hans: 泛型数学接口要求将派生类型本身用于自重复类型参数。
zh_hant: 泛型數學介面需要衍生型別本身，才能用於自我週期性類型參數。

# ImplementGenericMathInterfacesCorrectlyMessage
source: The '{0}' requires the '{1}' type parameter to be filled with the derived type '{2}'
cs: {0} vyžaduje, aby parametr typu {1} byl vyplněn odvozeným typem {2}.
de: Für "{0}" muss der Typparameter "{1}" mit dem abgeleiteten Typ "{2}" gefüllt werden
es: El "{0}" requiere que el parámetro de tipo "{1}" se rellene con el tipo derivado "{2}"
fr: Le '{0}' requiert que le paramètre de type '{1}' soit rempli avec le type dérivé '{2}'.
it: Il '{0}' richiede che il parametro di tipo '{1}' sia compilato con il tipo derivato '{2}'
ja: '{0}' では、'{1}' の種類のパラメーターに派生型の '{2}' を入力する必要があります
ko: '{0}'을(를) 사용하려면 '{1}' 형식 매개 변수를 파생 형식 '{2}'(으)로 채워야 합니다.
pl: Element „{0}” wymaga wypełnienia parametru typu „{1}” typem pochodnym „{2}”
pt_br: O '{0}' requer que o parâmetro de tipo '{1}' seja preenchido com o tipo derivado '{2}'
ru: Для "{0}" требуется, чтобы параметр типа "{1}" был заполнен производным типом "{2}"
tr: '{0}', '{1}' tipi parametresinin türetilmiş '{2}' tipi ile doldurulmasını gerektirir.
zh_hans: "{0}" 需要使用派生类型 "{2}" 填充 "{1}" 类型参数。
zh_hant: '{0}' 需要 '{1}' 類型參數，以填入衍生類型 '{2}'

# ImplementGenericMathInterfacesCorrectlyTitle
source: Use correct type parameter
cs: Použít správný parametr typu
de: Richtigen Typparameter verwenden
es: Use el parámetro de tipo correcto
fr: Utiliser le paramètre de type correct
it: Usare il parametro di tipo corretto
ja: 正しい種類のパラメーターを使用する
ko: 올바른 형식 매개 변수 사용
pl: Użyj poprawnego parametru typu
pt_br: Usar o parâmetro de tipo correto
ru: Используйте правильный параметр типа
tr: Doğru tür parametresini kullanın
zh_hans: 使用正确的类型参数
zh_hant: 使用正確的類型參數

# ImplementInterfacesOnDynamicCastableImplementation
source: Implement inherited interfaces
cs: Implementace zděděných rozhraní
de: Geerbte Schnittstellen implementieren
es: Implementación de interfaces heredadas
fr: Implémenter les interfaces héritées
it: Implementare interfacce ereditate
ja: 継承されたインターフェイスを実装する
ko: 상속된 인터페이스 구현
pl: Implementuj interfejsy dziedziczone
pt_br: Implementar interfaces herdadas
ru: Реализация унаследованных интерфейсов
tr: Devralınan arabirimleri uygulayın
zh_hans: 实现继承的接口
zh_hant: 實作繼承的介面

# ImplementsPreviewInterfaceMessage
source: '{0}' implements the preview interface '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {0} je implementuje rozhraní preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: „{0}“ implementiert die Vorschauschnittstelle „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: '{0}' implementa la interfaz de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{0}' met en œuvre l’interface de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: '{0}' implementa l’interfaccia di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: '{0}' はプレビュー インターフェイス '{1}' を実装しているため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: '{0}'은(는) 미리 보기 인터페이스 '{1}'를 구현하므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}을(를) 참조하세요.
pl: „{0}” ma zaimplementowany interfejs w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: “{0}” implementa a interface de visualização “{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2} para obter mais informações.
ru: "{0}" реализует предварительную версию интерфейса "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: '{0}', '{1}' önizleme arabirimini uyguladığından önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: “{0}”实现预览界面“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: '{0}' 會實作預覽介面 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# ImplementsPreviewInterfaceMessageWithCustomMessagePlaceholder
source: {3} '{0}' implements the preview interface '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {3}{0} implementuje rozhraní preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: {3} „{0}“ implementiert die Vorschauschnittstelle „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: {3} '{0}' implementa la interfaz de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{3}'{0} met en œuvre l’interface de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: {3} '{0}' implementa l’interfaccia di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: {3} '{0}' はプレビュー インターフェイス '{1}' を実装しているため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: {3} '{0}'은(는) 미리 보기 인터페이스 '{1}'을(를) 구현하므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}(을)를 참조하세요.
pl: {3} „{0}” ma zaimplementowany interfejs w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: {3}“{0}” implementa a interface de visualização “{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2} para obter mais informações.
ru: "{0}" {3} реализует предварительную версию интерфейса "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: {3} '{0}', '{1}' önizleme arabirimini uyguladığından önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: {3}.“{0}”实现预览界面“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: {3} '{0}' 會實作預覽介面 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。
