Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseAsSpanReadOnlyInsteadOfArrayRangeIndexerDescription
source: The Range-based indexer on array values produces a copy of requested portion of the array. This copy is usually unnecessary when it is implicitly used as a ReadOnlySpan or ReadOnlyMemory value. Use the AsSpan method to avoid the unnecessary copy.
cs: Indexer hodnot pole založený na rozsahu vytváří kopii požadované části pole. Když se implicitně používá jako hodnota ReadOnlySpan nebo ReadOnlyMemory, je tato kopie obvykle zbytečná. Pokud se jí chcete vyhnout, použijte metodu AsSpan.
de: Der Range-basierte Indexer für Arraywerte erzeugt eine Kopie des angeforderten Teils des Arrays. Diese Kopie ist bei der impliziten Verwendung als ReadOnlySpan- oder ReadOnlyMemory-Wert in der Regel nicht notwendig. Verwenden Sie die AsSpan-Methode, um die nicht benötigte Kopie zu vermeiden.
es: El indizador basado en intervalos en los valores de matriz genera una copia de la parte solicitada de la matriz. Esta copia suele ser innecesaria cuando se usa implícitamente como valor ReadOnlySpan o ReadOnlyMemory. Use el método AsSpan para evitar la copia innecesaria.
fr: L'indexeur basé sur Range pour les valeurs de tableau produit une copie de la partie demandée du tableau. Cette copie est généralement inutile quand elle est implicitement utilisée en tant que valeur ReadOnlySpan ou ReadOnlyMemory. Utilisez la méthode AsSpan pour éviter toute copie inutile.
it: Con l'indicizzatore basato su Range su valori di matrice viene prodotta una copia della porzione richiesta della matrice. Questa copia è in genere non necessaria quando viene usata in modo implicito come valore di ReadOnlySpan o ReadOnlyMemory. Per evitare la copia non necessaria, usare il metodo AsSpan.
ja: 配列値に対して範囲ベースのインデクサーを使用すると、要求された配列の部分のコピーが作成されます。ReadOnlySpan または ReadOnlyMemory 値として暗黙的に使用される場合、このコピーは不要であることが少なくありません。不要なコピーを回避するには、AsSpan メソッドをご使用ください。
ko: 배열 값에 대한 범위 기반 인덱서는 배열의 요청된 부분의 복사본을 생성합니다. 이 복사본은 암시적으로 ReadOnlySpan 또는 ReadOnlyMemory 값으로 사용될 경우 대개 필요하지 않습니다. 불필요한 복사본이 생성되지 않도록 하려면 AsSpan 메서드를 사용하세요.
pl: Użycie indeksatora opartego na zakresie w przypadku wartości tablicy powoduje utworzenie kopii żądanej części tablicy. Ta kopia jest zwykle niepotrzebna, gdy jest niejawnie używana jako wartość ReadOnlySpan lub ReadOnlyMemory. Użyj metody AsSpan, aby uniknąć zbędnego kopiowania.
pt_br: O Indexador baseado em intervalo em valores de matriz produz uma cópia da porção solicitada da matriz. Essa cópia normalmente é desnecessária quando é usada implicitamente como um valor de ReadOnlySpan ou de ReadOnlyMemory. Use o método AsSpan para evitar a cópia desnecessária.
ru: Основанный на диапазонах индексатор для значений массива создает копию запрошенной части массива. Эта копия обычно не требуется, если она неявно используется в качестве значения ReadOnlySpan или ReadOnlyMemory. Используйте метод AsSpan, чтобы избежать ненужного копирования.
tr: Dizi değerleri üzerindeki Aralık tabanlı dizin oluşturucu, dizinin istenen kısmının bir kopyasını üretir. Bu kopya, örtük olarak bir ReadOnlySpan veya ReadOnlyMemory değeri olarak kullanıldığında genellikle gerekli değildir. Kopya oluşturmamak için AsSpan metodunu kullanın.
zh_hans: 数组值的基于范围的索引器生成数组所请求部分的副本。此副本在隐式用作 ReadOnlySpan 或 ReadOnlyMemory 值时常常是不需要的。使用 AsSpan 方法可避免使用不必要的副本。
zh_hant: 陣列值中以 Range 為基礎的索引子會產生陣列中要求部分的複本。隱含使用此複本作為 ReadOnlySpan 或 ReadOnlyMemory 值時，通常不需此複本。請使用 AsSpan 方法來避免使用不必要的複本。

# UseAsyncMethodInAsyncContextDescription
source: When inside a Task-returning method, use the async version of methods, if they exist.
cs: Když se nacházíte v metodě vracející Task, použijte asynchronní verzi metod (pokud existují).
de: Verwenden Sie innerhalb einer Methode, die einen Task zurückgibt, die asynchrone Version von Methoden (sofern vorhanden).
es: Cuando esté dentro de un método de devolución de Task, use la versión asincrónica de los métodos, si existen.
fr: Lorsque vous êtes dans une méthode Task-returning, utilisez la version asynchrone des méthodes, si elle existe.
it: All'interno di un metodo che restituisce Task, utilizzare la versione asincrona dei metodi, se presenti.
ja: Task-returning メソッド内にメソッドが存在する場合は、メソッドの非同期バージョンを使用します。
ko: Task 반환 메서드 내부에서 메서드의 비동기 버전이 있는 경우 이를 사용합니다.
pl: W metodzie zwracającej Task użyj asynchronicznej wersji metod, jeśli istnieją.
pt_br: Quando estiver dentro de um método de retorno Task, use a versão assíncrona dos métodos, se eles existirem.
ru: Внутри метода, возвращающего Task, используйте асинхронные версии методов, если они существуют.
tr: Task döndüren bir yöntemin içindeyken, varsa yöntemlerin zaman uyumsuz sürümünü kullanın.
zh_hans: 在返回 Task 的方法中时，使用方法的异步版本(如果存在)。
zh_hant: 在 Task-returning 方法內時，請使用方法的非同步版本 (如果存在)。

# UseAsyncMethodInAsyncContextMessage
source: '{0}' synchronously blocks. Await '{1}' instead.
cs: {0} provádí synchronní blokování. Místo toho použít Await {1}.
de: "{0}" synchron blockiert. Verwenden Sie stattdessen "await" für "{1}".
es: {0} bloquea sincrónicamente.'Await '{1} en su lugar.
fr: {0} bloque de façon synchrone. Attendez {1} à la place.
it: '{0}' si blocca in modalità sincrona. In alternativa, usare await '{1}'.
ja: '{0}' は同期的にブロックを実行します。代わりに '{1}' を待機します。
ko: '{0}'은(는) 동기적으로 차단됩니다. 대신 '{1}'을(를) 기다리세요.
pl: Metoda „{0}” powoduje blokowanie synchroniczne. Zamiast tego używaj operatora await „{1}”.
pt_br: '{0}' blocos de forma síncrona. Em vez disso, aguarde '{1}'.
ru: "{0}" осуществляет синхронную блокировку. Вместо этого ожидайте "{1}".
tr: '{0}' zaman uyumlu olarak engeller. Bunun yerine '{1}' bekleyin.
zh_hans: “{0}”同步阻止。改为等待“{1}”。
zh_hant: '{0}' 會同步封鎖。請改用 Await '{1}'。

# UseAsyncMethodInAsyncContextMessage_NoAlternative
source: '{0}' synchronously blocks. Use await instead.
cs: {0} provádí synchronní blokování. Místo toho použijte await.
de: "{0}" führt zu einer synchronen Blockierung. Verwenden Sie stattdessen "await".
es: {0} bloquea sincrónicamente. Use await en su lugar.
fr: '{0}' bloque de façon synchrone. Utilisez await à la place
it: '{0}' si blocca in modalità sincrona. In alternativa, usare await.
ja: '{0}' は同期的にブロックを実行します。代わりに await を使用してください。
ko: '{0}'은(는) 동기적으로 차단됩니다. 대신 대기를 사용하세요.
pl: Metoda „{0}” powoduje blokowanie synchroniczne. Zamiast tego używaj operatora await.
pt_br: '{0}' blocos de forma síncrona. Em vez disso, use await.
ru: "{0}" осуществляет синхронную блокировку. Вместо этого используйте await.
tr: '{0}' zaman uyumlu olarak engeller. Bunun yerine await kullanın.
zh_hans: “{0}”同步阻止。请改用 await。
zh_hant: '{0}' 會同步封鎖。請改用 await。

# UseAsyncMethodInAsyncContextTitle
source: Call async methods when in an async method
cs: Volání asynchronních metod v asynchronní metodě
de: Asynchrone Methoden in einer asynchronen Methode aufrufen
es: Llame a métodos asincrónicos cuando esté en un método asincrónico
fr: Appeler des méthodes async dans une méthode async
it: Chiamare metodi asincroni in un metodo asincrono
ja: 非同期メソッドの場合に非同期メソッドを呼び出す
ko: 비동기 메서드에 있을 때 비동기 메서드 호출
pl: Wywoływanie metod asynchronicznych w metodzie asynchronicznej
pt_br: Chame métodos assíncronos quando estiver em um método assíncrono
ru: Вызов асинхронных методов в методе async
tr: Zaman uyumsuz metottayken zaman uyumsuz metotlar çağırın
zh_hans: 当在异步方法中时，调用异步方法
zh_hant: 在使用非同步方法時呼叫非同步方法

# UseAutoValidateAntiforgeryToken
source: Use antiforgery tokens in ASP.NET Core MVC controllers
cs: Používat tokeny proti padělkům v kontrolerech MVC ASP.NET Core
de: Fälschungssicherheitstoken in ASP.NET Core MVC-Controllern verwenden
es: Usar tokens antifalsificación en los controladores de ASP.NET Core MVC
fr: Utilisez des jetons antifalsification dans les contrôleurs ASP.NET Core MVC
it: Usare token antifalsificazione nei controller MVC ASP.NET Core
ja: ASP.NET Core MVC コントローラーで偽造防止トークンを使用する
ko: ASP.NET Core MVC 컨트롤러에서 위조 방지 토큰 사용
pl: Użyj tokenów zabezpieczających przed fałszerstwem w kontrolerach MVC ASP.NET Core
pt_br: Usar tokens antifalsificação em controladores MVC do ASP.NET Core
ru: Используйте маркеры для защиты от подделки в контроллерах MVC ASP.NET Core.
tr: ASP.NET Core MVC denetleyicilerinde sahtecilik önleme belirteçleri kullanın
zh_hans: 在 ASP.NET Core MVC 控制器中使用防伪造令牌
zh_hant: 使用 ASP.NET Core MVC 控制器中的 antiforgery 權杖

# UseAutoValidateAntiforgeryTokenDescription
source: Handling a POST, PUT, PATCH, or DELETE request without validating an antiforgery token may be vulnerable to cross-site request forgery attacks. A cross-site request forgery attack can send malicious requests from an authenticated user to your ASP.NET Core MVC controller.
cs: Zpracování požadavku POST, PUT, PATCH nebo DELETE bez ověřování tokenu proti padělkům může představovat ohrožení zabezpečení vůči útokům CSRF. Útok CSRF může odesílat na váš kontroler MVC ASP.NET Core škodlivé požadavky od ověřeného uživatele.
de: Die Verarbeitung einer POST-, PUT-, PATCH- oder DELETE-Anforderung ohne Überprüfung eines Fälschungssicherheitstokens ist möglicherweise anfällig für Angriffe durch websiteübergreifende Anforderungsfälschung. Bei einem Angriff durch websiteübergreifende Anforderungsfälschung können schädliche Anforderungen von einem authentifizierten Benutzer an den ASP.NET Core MVC-Controller gesendet werden.
es: Controlar una solicitud POST, PUT, PATCH o DELETE sin validar un token antifalsificación puede suponer una vulnerabilidad a los ataques de falsificación de solicitudes entre sitios. En este tipo de ataques, se pueden enviar solicitudes malintencionadas de un usuario autenticado al controlador de ASP.NET Core MVC.
fr: Le traitement d'une requête POST, PUT, PATCH ou DELETE sans validation d'un jeton antifalsification peut être vulnérable aux attaques par falsification de requête intersites. Une attaque par falsification de requête intersites peut envoyer des requêtes malveillantes de la part d'un utilisateur authentifié à votre contrôleur ASP.NET Core MVC.
it: La gestione di una richiesta POST, PUT, PATCH o DELETE senza la convalida di un token antifalsificazione può essere vulnerabile ad attacchi di tipo richiesta intersito falsa. In un attacco di questo tipo vengono inviate richieste dannose da un utente autenticato al controller MVC ASP.NET Core.
ja: 偽造防止トークンを検証せずに POST、PUT、PATCH、DELETE 要求を処理すると、クロスサイト リクエスト フォージェリ攻撃に対して脆弱になる可能性があります。クロスサイト リクエスト フォージェリ攻撃では、認証されたユーザーから ASP.NET Core MVC コントローラーに悪意のある要求が送信される可能性があります。
ko: 위조 방지 토큰의 유효성을 검사하지 않고 POST, PUT, PATCH 또는 DELETE 요청을 처리하면 교차 사이트 요청 위조 공격에 취약할 수 있습니다. 교차 사이트 요청 위조 공격은 인증된 사용자의 악성 요청을 ASP.NET Core MVC 컨트롤러로 보낼 수 있습니다.
pl: Obsługa żądania POST, PUT, PATCH lub DELETE bez weryfikacji tokenu zabezpieczającego przed fałszerstwem może prowadzić do podatności na ataki z wykorzystaniem fałszerstwa żądania międzywitrynowego. Atak z wykorzystaniem fałszerstwa żądania międzywitrynowego może wysyłać złośliwe żądania od uwierzytelnionego użytkownika do kontrolera MVC ASP.NET Core.
pt_br: A manipulação de uma solicitação de POST, PUT, PATCH ou DELETE sem a validação de um token antifalsificação pode ser vulnerável a ataques de falsificação de solicitações intersite. Um ataque de falsificação de solicitações intersite pode enviar solicitações mal-intencionadas de um usuário autenticado para o seu controlador MVC ASP.NET Core.
ru: Обработка запроса POST, PUT, PATCH или DELETE без проверки маркера для защиты от подделки может стать уязвимой для атак с использованием подделки межсайтовых запросов. Атаки с использованием подделки межсайтовых запросов позволяют отправлять вредоносные запросы от пользователя, прошедшего проверку подлинности, в контроллер MVC ASP.NET Core.
tr: POST, PUT, PATCH veya DELETE isteğini sahtecilik önleme belirtecini doğrulamadan işlemek, sizi siteler arası istek sahteciliği saldırılarına karşı savunmasız bırakır. Siteler arası istek sahteciliği saldırısı, kimliği doğrulanmamış kullanıcıdan ASP.NET Core MVC denetleyicinize kötü amaçlı istekler gönderebilir.
zh_hans: 在未验证防伪造令牌的情况下处理 POST、PUT、PATCH 或 DELETE 请求可能易受跨站点请求伪造攻击。跨站点请求伪造攻击可将来自已通过身份验证的用户的恶意请求发送到 ASP.NET Core MVC 控制器。
zh_hant: 在不驗證 antiforgery 權杖的情況下處理 POST、PUT、PATCH 或 DELETE 要求，可能會容易受到跨站台偽造要求攻擊。跨站台偽造要求攻擊可將惡意要求從已驗證的使用者傳送到 ASP.NET Core MVC 控制器。

# UseAutoValidateAntiforgeryTokenMessage
source: Method {0} handles a {1} request without performing antiforgery token validation. You also need to ensure that your HTML form sends an antiforgery token.
cs: Metoda {0} zpracovává požadavek {1} bez ověřování tokenu proti padělkům. Je potřeba také zajistit, aby váš formulář HTML odesílal tokeny proti padělkům.
de: Die Methode "{0}" verarbeitet eine {1}-Anforderung ohne Überprüfung eines Fälschungssicherheitstokens. Sie müssen außerdem sicherstellen, dass Ihr HTML-Formular ein Fälschungssicherheitstoken sendet.
es: El método {0} controla una solicitud de {1} sin validar un token antifalsificación. También debe asegurarse de que el formulario HTML envíe un token antifalsificación.
fr: La méthode {0} traite une requête {1} sans validation de jeton antifalsification. Vous devez également vérifier que votre formulaire HTML envoie un jeton antifalsification.
it: Il metodo {0} gestisce una richiesta {1} senza eseguire la convalida del token antifalsificazione. È necessario assicurarsi anche che il modulo HTML invii un token antifalsificazione.
ja: メソッド {0} では、偽造防止トークンの検証を実行せずに {1} 要求が処理されます。また、HTML フォームで偽造防止トークンが送信されるようにする必要もあります。
ko: {0} 메서드는 위조 방지 토큰 유효성 검사를 수행하지 않고 {1} 요청을 처리합니다. 또한 HTML 양식이 위조 방지 토큰을 보내는지 확인해야 합니다.
pl: Metoda {0} obsługuje żądanie {1} bez przeprowadzania weryfikacji tokenu zabezpieczającego przed fałszerstwem. Należy również upewnić się, że formularz HTML wysyła token zabezpieczający przed fałszerstwem.
pt_br: O método {0} lida com uma solicitação de {1} sem executar a validação de token antifalsificação. Também é necessário garantir que o seu formulário em HTML envie um token antifalsificação.
ru: Метод {0} обрабатывает запрос {1} без проверки маркера для защиты от подделки. Также убедитесь в том, что HTML-форма отправляет маркер для защиты от подделки.
tr: {0} metodu, {1} isteğini sahtecilik önleme belirtecini doğrulamadan işler. Ayrıca HTML formunuzun sahtecilik önleme belirteci gönderdiğinden emin olmanız gerekir.
zh_hans: 方法 {0} 在不执行防伪造令牌验证的情况下处理 {1} 请求。你还需要确保 HTML 窗体发送防伪造令牌。
zh_hant: 方法 {0} 會在不驗證 antiforgery 權杖的情況下處理 {1} 要求。您也必須確保 HTML 表單傳送 antiforgery 權杖。

# UseCancellationTokenThrowIfCancellationRequestedCodeFixTitle
source: Replace with 'CancellationToken.ThrowIfCancellationRequested'
cs: Nahradit výrazem CancellationToken.ThrowIfCancellationRequested
de: Durch "CancellationToken.ThrowIfCancellationRequested" ersetzen
es: Reemplazar por "CancellationToken.ThrowIfCancellationRequested"
fr: Remplacer par « CancellationToken. ThrowIfCancellationRequested »
it: Sostituire con 'CancellationToken.ThrowIfCancellationRequested'
ja: 'CancellationToken.ThrowIfCancellationRequested' で置き換えます
ko: 'CancellationToken.ThrowIfCancellationRequested'로 교체
pl: Zamień na element „CancellationToken.ThrowIfCancellationRequested”
pt_br: Substituir por 'CancellationToken.ThrowIfCancellationRequested'
ru: Заменить на "CancellationToken.ThrowIfCancellationRequested"
tr: 'CancellationToken.ThrowIfCancellationRequested' ile değiştirin
zh_hans: 替换为 “CancellationToken.ThrowIfCancellationRequested”
zh_hant: 請以 'CancellationToken.ThrowIfCancellationRequested' 取代

# UseCancellationTokenThrowIfCancellationRequestedDescription
source: 'ThrowIfCancellationRequested' automatically checks whether the token has been canceled, and throws an 'OperationCanceledException' if it has.
cs: ThrowIfCancellationRequested automaticky kontroluje, jestli se token zrušil, a pokud ano, vyvolá výjimku OperationCanceledException.
de: "ThrowIfCancellationRequested" überprüft automatisch, ob das Token storniert wurde, und löst in diesem Fall "OperationCanceledException" aus.
es: "ThrowIfCancellationRequested" comprueba automáticamente si el token se ha cancelado y produce una excepción "OperationCanceledException" si lo ha hecho.
fr: 'ThrowIfCancellationRequested’ vérifie automatiquement si le jeton a été annulé, et lève un ’OperationCanceledException’ le cas.
it: 'ThrowIfCancellationRequested' controlla automaticamente se il token è stato annullato e, in tal caso, genera un'eccezione 'OperationCanceledException'.
ja: 'ThrowIfCancellationRequested' は、トークンが取り消されたかどうかを自動的にチェックし、取り消されていた場合には、'OperationCanceledException' をスローします。
ko: 'ThrowIfCancellationRequested'는 토큰이 취소되었는지 자동으로 확인하고 취소된 경우 'OperationCanceledException'을 발생시킵니다.
pl: Polecenie „ThrowIfCancellationRequested” automatycznie sprawdza, czy token został anulowany, i zgłasza wyjątek „OperationCanceledException”, jeśli go ma.
pt_br: 'ThrowIfCancellationRequested' verifica automaticamente se o token foi cancelado e gera uma 'OperationCanceledException' se tiver.
ru: "ThrowIfCancellationRequested" автоматически проверяет, был ли маркер отменен, и создает "OperationCanceledException", если это так.
tr: 'ThrowIfCancellationRequested', belirtecin iptal edilip edilmediğini otomatik olarak denetler ve iptal edilmişse 'OperationCanceledException' oluşturur.
zh_hans: “ThrowIfCancellationRequested” 自动检查是否已取消令牌，如果已取消，则引发 “OperationCanceledException”。
zh_hant: 'ThrowIfCancellationRequested' 會自動檢查是否已取消權杖，如果是，則會擲回 'OperationCanceledException'。

# UseCancellationTokenThrowIfCancellationRequestedMessage
source: Use 'ThrowIfCancellationRequested' instead of checking 'IsCancellationRequested' and throwing 'OperationCanceledException'
cs: Místo kontroly IsCancellationRequested a vyvolání operationCanceledException použijte ThrowIfCancellationRequested.
de: Verwenden Sie "ThrowIfCancellationRequested", anstatt "IsCancellationRequested" zu überprüfen und "OperationCanceledException" auszulösen.
es: Use "ThrowIfCancellationRequested" en lugar de comprobar "IsCancellationRequested" y producir "OperationCanceledException".
fr: Utilisez ’ThrowIfCancellationRequested’ au lieu de vérifier ’IsCancellationRequested’ et de lever ’OperationCanceledException'
it: Usare 'ThrowIfCancellationRequested' invece di selezionare 'IsCancellationRequested' e generare 'OperationCanceledException'
ja: 'IsCancellationRequested' をチェックして 'OperationCanceledException' をスローするのではなく、'ThrowIfCancellationRequested' を使用します
ko: 'IsCancellationRequested'를 확인하고 'OperationCanceledException'을 발생시키는 대신 'ThrowIfCancellationRequested'를 사용하세요.
pl: Użyj polecenia „ThrowIfCancellationRequested” zamiast sprawdzania elementu „IsCancellationRequested” i zgłaszania wyjątku „OperationCanceledException”
pt_br: Use 'ThrowIfCancellationRequested' em vez de verificar 'IsCancellationRequested' e lançar 'OperationCanceledException'
ru: Использовать "ThrowIfCancellationRequested" вместо проверки "IsCancellationRequested" и вызова "OperationCanceledException"
tr: 'IsCancellationRequested'i kontrol etmek ve 'OperationCanceledException' oluşturmak yerine 'ThrowIfCancellationRequested' kullanın
zh_hans: 使用 “ThrowIfCancellationRequested”，而不是检查 “IsCancellationRequested” 并引发 “OperationCanceledException”
zh_hant: 請使用 'ThrowIfCancellationRequested'，而不是檢查 'IsCancellationRequested' 並擲回 'OperationCanceledException'

# UseCancellationTokenThrowIfCancellationRequestedTitle
source: Use 'ThrowIfCancellationRequested'
cs: Použijte ThrowIfCancellationRequested
de: "ThrowIfCancellationRequested()" verwenden
es: Usar "ThrowIfCancellationRequested"
fr: Appeler ThrowIfCancellationRequested()
it: Usare 'ThrowIfCancellationRequested'
ja: 'ThrowIfCancellationRequested' を呼び出す
ko: 'ThrowIfCancellationRequested' 사용
pl: Użyj polecenia „ThrowIfCancellationRequested”
ru: Использовать "ThrowIfCancellationRequested"
tr: 'ThrowIfCancellationRequested' kullanın
zh_hans: 使用 “ThrowIfCancellationRequested”
zh_hant: 請使用 'ThrowIfCancellationRequested'

# UseCompositeFormatDescription
source: Cache and use a 'CompositeFormat' instance as the argument to this formatting operation, rather than passing in the original format string. This reduces the cost of the formatting operation.
cs: Namísto předání původního řetězce formátu umožňuje zapsat a použít instanci CompositeFormat jako argument této operace formátování. Tím se sníží náklady na operaci formátování.
de: Zwischenspeichern und Verwenden einer CompositeFormat-Instanz als Argument für diesen Formatierungsvorgang, anstatt die ursprüngliche Formatzeichenfolge zu übergeben. Dies reduziert die Kosten für den Formatierungsvorgang.
es: Almacene en caché y use una instancia de "CompositeFormat" como argumento de esta operación de formato, en lugar de pasar la cadena de formato original. Esto reduce el costo de la operación de formato.
fr: Mettez en cache et utilisez une instance « CompositeFormat » comme argument pour cette opération de mise en forme, au lieu de transmettre la chaîne de format d’origine. Cela réduit le coût de l’opération de mise en forme.
it: Memorizza nella cache e usa un'istanza 'CompositeFormat' come argomento di questa operazione di formattazione, anziché passare la stringa di formato originale. In questo modo si riduce il costo dell'operazione di formattazione.
ja: このフォーマット操作の引数には、元のフォーマット文字列を渡すのではなく、'CompositeFormat' インスタンスをキャッシュして渡すようにしてください。フォーマット操作のコストが軽減されます。
ko: 원래 형식 문자열을 전달하는 대신 이 서식 작업에 대한 인수로 'CompositeFormat' 인스턴스를 캐시하고 사용합니다. 이렇게 하면 서식 작업 비용이 절감됩니다.
pl: Umieść wystąpienie „CompositeFormat” w pamięci podręcznej i użyj go jako argumentu tej operacji formatowania zamiast przekazywania oryginalnego ciągu formatu. Zmniejsza to koszt operacji formatowania.
pt_br: Armazene em cache e use uma instância 'CompositeFormat' como argumento para esta operação de formatação, em vez de passar a cadeia de caracteres de formato original. Isso reduz o custo da operação de formatação.
ru: Кэшируйте и используйте экземпляр "CompositeFormat" в качестве аргумента для этой операции форматирования вместо передачи в исходной строке формата. Это сокращает затраты на операцию форматирования.
tr: Orijinal biçim dizesini geçirmek yerine, bir 'CompositeFormat' örneğini önbelleğe alın ve bu biçimlendirme işleminde bağımsız değişken olarak kullanın. Bu, biçimlendirme işleminin maliyetini azaltır.
zh_hans: 缓存并使用 "CompositeFormat" 实例作为此格式化操作的参数，而不是传入原始格式字符串。这会降低格式化操作的成本。
zh_hant: 快取並使用 'CompositeFormat' 執行個體做為此格式化作業的引數，而不是傳遞原始格式字串。這樣可降低格式化作業的成本。

# UseCompositeFormatMessage
source: Cache a 'CompositeFormat' for repeated use in this formatting operation
cs: Zapsat CompositeFormat do mezipaměti pro opakované použití v této operaci formátování
de: "CompositeFormat" zur wiederholten Verwendung in diesem Formatierungsvorgang zwischenspeichern
es: Almacene en caché un objeto "CompositeFormat" para usarlo de forma repetida en esta operación de formato
fr: Mettre en cache une instance « CompositeFormat » pour une utilisation répétée dans cette opération de mise en forme
it: Memorizza nella cache un 'CompositeFormat' per l'uso ripetuto in questa operazione di formattazione
ja: このフォーマット操作で繰り返し使用するために 'CompositeFormat' をキャッシュしてください
ko: 이 서식 지정 작업에서 반복적으로 사용할 수 있도록 'CompositeFormat'을 캐시합니다.
pl: Buforuj element „CompositeFormat” w celu wielokrotnego użycia w tej operacji formatowania
pt_br: Armazenar em cache um 'CompositeFormat' para uso repetido nesta operação de formatação
ru: Кэшировать "CompositeFormat" для многократного использования в этой операции форматирования
tr: Bu biçimlendirme işleminde tekrarlanan kullanım için bir 'CompositeFormat' örneğini önbelleğe alın
zh_hans: 缓存 "CompositeFormat" 以在此格式化操作中重复使用
zh_hant: 在此格式化作業中，針對重複使用的 'CompositeFormat' 進行緩存

# UseCompositeFormatTitle
source: Use 'CompositeFormat'
cs: Použít CompositeFormat
de: "CompositeFormat" verwenden
fr: Utiliser « CompositeFormat »
it: Usa 'CompositeFormat'
ja: 'CompositeFormat' を使用してください
ko: 'CompositeFormat' 사용
pl: Użyj elementu „CompositeFormat”
ru: Использовать "CompositeFormat"
tr: 'CompositeFormat' örneğini kullanın
zh_hans: 使用 "CompositeFormat"
zh_hant: 使用 'CompositeFormat'
