Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PlatformCompatibilityOnlySupportedCsReachableMessage
source: This call site is reachable on: {2}. '{0}' is only supported on: {1}.
cs: Toto místo volání je k dispozici na {2}. {0} se podporuje jen na {1}.
de: Diese Aufrufsite ist erreichbar für: {2}. "{0}" nur unterstützt für: {1}.
es: Se puede acceder a este sitio de llamada en {2}. "{0}" solo se admite en {1}.
fr: Ce site d'appel est accessible sur {2}. '{0}' est uniquement pris en charge sur {1}.
it: Questo sito di chiamata è raggiungibile da {2}. '{0}' è supportato solo in {1}.
ja: この呼び出しサイトは {2} で到達可能です。'{0}' は {1} でのみサポートされています。
ko: 이 호출 사이트에는 {2}에서 연결할 수 있습니다. '{0}'은(는) {1}에서만 지원됩니다.
pl: To miejsce wywołania jest osiągalne na platformie: {2}. Metoda „{0}” jest obsługiwana tylko na następujących platformach: {1}.
pt_br: Este site de chamada pode ser acessado em: {2}. Só há suporte para '{0}' em: {1}.
ru: Этот сайт вызова доступен в {2}. "{0}" поддерживается только в {1}.
tr: Bu çağrı sitesine şurada ulaşılabilir: {2}. '{0}' yalnızca şurada desteklenir: {1}.
zh_hans: 可在 {2} 上访问此调用站点。"{0}" 仅在 {1} 上受支持。
zh_hant: 可在 {2} 上連線到此呼叫網站。只有 {1} 支援 '{0}'。

# PlatformCompatibilityOnlySupportedCsUnreachableMessage
source: This call site is unreachable on: {2}. '{0}' is only supported on: {1}.
cs: Toto místo volání není k dispozici na {2}. {0} se podporuje jen na {1}.
de: Diese Aufrufsite ist nicht erreichbar für: {2}. "{0}" nur unterstützt für: {1}.
es: No se puede acceder a este sitio de llamada en {2}. "{0}" solo se admite en {1}.
fr: Ce site d'appel est inaccessible sur {2}. '{0}' est uniquement pris en charge sur {1}.
it: Questo sito di chiamata non è raggiungibile da {2}. '{0}' è supportato solo in {1}.
ja: この呼び出しサイトは {2} で到達できません。'{0}' は {1} でのみサポートされています。
ko: 이 호출 사이트에는 {2}에서 연결할 수 없습니다. '{0}'은(는) {1}에서만 지원됩니다.
pl: To miejsce wywołania jest nieosiągalne na platformie: {2}. Metoda „{0}” jest obsługiwana tylko na następujących platformach: {1}.
pt_br: Este site de chamada está inacessível em: {2}. Só há suporte para '{0}' em: {1}.
ru: Этот сайт вызова недоступен в {2}. "{0}" поддерживается только в {1}.
tr: Bu çağrı sitesine şurada ulaşılamaz: {2}. '{0}' yalnızca şurada desteklenir: {1}.
zh_hans: 无法在 {2} 上访问此调用站点。"{0}" 仅在 {1} 上受支持。
zh_hant: 無法在下列位置連線到此呼叫網站: {2}。只有 {1} 支援 '{0}'。

# PlatformCompatibilitySupportedCsAllPlatformMessage
source: This call site is reachable on all platforms. '{0}' is supported on: {1}.
cs: Toto místo volání je k dispozici na všech platformách. {0} se podporuje na {1}.
de: Diese Aufrufsite ist auf allen Plattformen erreichbar. "{0}" unterstützt für: {1}.
es: Se puede acceder a este sitio de llamada en todas las plataformas. "{0}" se admite en {1}.
fr: Ce site d'appel est accessible sur toutes les plateformes. '{0}' est pris en charge sur {1}.
it: Questo sito di chiamata è raggiungibile da tutte le piattaforme. '{0}' è supportato in {1}.
ja: この呼び出しサイトはすべてのプラットフォームで到達可能です。'{0}' は {1} でサポートされています。
ko: 이 호출 사이트에는 모든 플랫폼에서 연결할 수 있습니다. '{0}'은(는) {1}에서 지원됩니다.
pl: To miejsce wywołania jest osiągalne na wszystkich platformach. Metoda „{0}” jest obsługiwana na następujących platformach: {1}.
pt_br: Este site de chamada pode ser acessado em todas as plataformas. Há suporte para '{0}' em: {1}.
ru: Этот сайт вызова доступен на всех платформах. "{0}" поддерживается в {1}.
tr: Bu çağrı sitesine tüm platformlarda ulaşılabilir. '{0}' şurada desteklenir: {1}.
zh_hans: 可在所有平台上访问此调用站点。"{0}" 在 {1} 上受支持。
zh_hant: 可在所有平台上連線到此呼叫網站。{1} 支援 '{0}'。

# PlatformCompatibilitySupportedCsReachableMessage
source: This call site is reachable on: {2}. '{0}' is supported on: {1}.
cs: Toto místo volání je k dispozici na {2}. {0} se podporuje na {1}.
de: Diese Aufrufsite ist erreichbar für: {2}. "{0}" unterstützt für: {1}.
es: Se puede acceder a este sitio de llamada en {2}. "{0}" se admite en {1}.
fr: Ce site d'appel est accessible sur {2}. '{0}' est pris en charge sur {1}.
it: Questo sito di chiamata è raggiungibile da {2}. '{0}' è supportato in {1}.
ja: この呼び出しサイトは {2} で到達可能です。'{0}' は {1} でサポートされています。
ko: 이 호출 사이트에는 {2}에서 연결할 수 있습니다. '{0}'은(는) {1}에서 지원됩니다.
pl: To miejsce wywołania jest osiągalne na platformie: {2}. Metoda „{0}” jest obsługiwana na następujących platformach: {1}.
pt_br: Este site de chamada pode ser acessado em: {2}. Há suporte para '{0}' em: {1}.
ru: Этот сайт вызова доступен в {2}. "{0}" поддерживается в {1}.
tr: Bu çağrı sitesine şurada ulaşılabilir: {2}. '{0}' şurada desteklenir: {1}.
zh_hans: 可在 {2} 上访问此调用站点。"{0}" 在 {1} 上受支持。
zh_hant: 可在 {2} 上連線到此呼叫網站。{1} 支援 '{0}'。

# PlatformCompatibilityTitle
source: Validate platform compatibility
cs: Ověřit kompatibilitu platformy
de: Plattformkompatibilität überprüfen
es: Validar la compatibilidad de la plataforma
fr: Valider la compatibilité de la plateforme
it: Convalida compatibilità della piattaforma
ja: プラットフォームの互換性を検証
ko: 플랫폼 호환성 유효성 검사
pl: Walidacja zgodności z platformą
pt_br: Validar a compatibilidade da plataforma
ru: Проверка совместимости платформы
tr: Platform uyumluluğunu doğrula
zh_hans: 验证平台兼容性
zh_hant: 驗證平台相容性

# PlatformCompatibilityUnsupportedCsAllPlatformMessage
source: This call site is reachable on all platforms. '{0}' is unsupported on: {1}.
cs: Toto místo volání je k dispozici na všech platformách. {0} se nepodporuje na {1}.
de: Diese Aufrufsite ist auf allen Plattformen erreichbar. "{0}" nicht unterstützt für: {1}.
es: Se puede acceder a este sitio de llamada en todas las plataformas. "{0}" no se admite en {1}.
fr: Ce site d'appel est accessible sur toutes les plateformes. '{0}' n'est pas pris en charge sur {1}.
it: Questo sito di chiamata è raggiungibile da tutte le piattaforme. '{0}' non è supportato in {1}.
ja: この呼び出しサイトはすべてのプラットフォームで到達可能です。'{0}' は {1} でサポートされていません。
ko: 이 호출 사이트에는 모든 플랫폼에서 연결할 수 있습니다. '{0}'은(는) {1}에서 지원되지 않습니다.
pl: To miejsce wywołania jest osiągalne na wszystkich platformach. Metoda „{0}” nie jest obsługiwana na następujących platformach: {1}.
pt_br: Este site de chamada pode ser acessado em todas as plataformas. Não há suporte para '{0}' em: {1}.
ru: Этот сайт вызова доступен на всех платформах. "{0}" не поддерживается в {1}.
tr: Bu çağrı sitesine tüm platformlarda ulaşılabilir. '{0}' şurada desteklenmez: {1}.
zh_hans: 可在所有平台上访问此调用站点。"{0}" 在 {1} 上不受支持。
zh_hant: 可在所有平台上連線到此呼叫網站。{1} 不支援 '{0}'。

# PlatformCompatibilityUnsupportedCsReachableMessage
source: This call site is reachable on: {2}. '{0}' is unsupported on: {1}.
cs: Toto místo volání je k dispozici na {2}. {0} se nepodporuje na {1}.
de: Diese Aufrufsite ist erreichbar für: {2}. "{0}" nicht unterstützt für: {1}.
es: Se puede acceder a este sitio de llamada en {2}. "{0}" no se admite en {1}.
fr: Ce site d'appel est accessible sur {2}. '{0}' n'est pas pris en charge sur {1}.
it: Questo sito di chiamata è raggiungibile da {2}. '{0}' non è supportato in {1}.
ja: この呼び出しサイトは {2} で到達可能です。'{0}' は {1} でサポートされていません。
ko: 이 호출 사이트에는 {2}에서 연결할 수 있습니다. '{0}'은(는) {1}에서 지원되지 않습니다.
pl: To miejsce wywołania jest osiągalne na platformie: {2}. Metoda „{0}” nie jest obsługiwana na następujących platformach: {1}.
pt_br: Este site de chamada pode ser acessado em: {2}. Não há suporte para '{0}' em: {1}.
ru: Этот сайт вызова доступен в {2}. "{0}" не поддерживается в {1}.
tr: Bu çağrı sitesine şurada ulaşılabilir: {2}. '{0}' şurada desteklenmez: {1}.
zh_hans: 可在 {2} 上访问此调用站点。"{0}" 在 {1} 上不受支持。
zh_hant: 可在 {2} 上連線到此呼叫網站。{1} 不支援 '{0}'。

# PlatformCompatibilityVersionAndBefore
source: '{0}' {1} and before
cs: {0} {1} a starších
de: {0}, {1} und vorherige Versionen
es: "{0}" {1} y versiones anteriores
fr: '{0}' {1} et les versions antérieures
it: '{0}' {1} e versioni precedenti
ja: '{0}' {1} 以前
ko: '{0}' {1} 이하
pl: system „{0}” w wersji {1} lub wcześniejszej
pt_br: '{0}' {1} e anteriores
ru: "{0}" {1} и более ранних версий
tr: '{0}' {1} ve öncesi
zh_hans: "{0}" {1} 及之前版本
zh_hant: '{0}' {1} 及之前的版本

# PlatformCompatibilityVersionAndLater
source: '{0}' {1} and later
cs: {0} {1} a novějších
de: {0}, {1} und höhere Versionen
es: "{0}" {1} y versiones posteriores
fr: '{0}' {1} et les versions ultérieures
it: '{0}' {1} e versioni successive
ja: '{0}' {1} 以降
ko: '{0}' {1} 이상
pl: system „{0}” w wersji {1} lub nowszej
pt_br: '{0}' {1} e posteriores
ru: "{0}" {1} и более поздних версий
tr: '{0}' {1} ve sonrası
zh_hans: "{0}" {1} 及更高版本
zh_hant: '{0}' {1} 及之後的版本

# PotentialReferenceCycleInDeserializedObjectGraphDescription
source: Review code that processes untrusted deserialized data for handling of unexpected reference cycles. An unexpected reference cycle should not cause the code to enter an infinite loop. Otherwise, an unexpected reference cycle can allow an attacker to DOS or exhaust the memory of the process when deserializing untrusted data.
cs: Zkontrolujte kód, který zpracovává nedůvěryhodná deserializovaná data pro zpracování neočekávaných cyklů odkazů. Neočekávaný cyklus odkazů by neměl způsobit, aby se kód zasekl do nekonečné smyčky. V opačném případě může neočekávaný cyklus odkazů při deserializaci nedůvěryhodných dat umožnit útočníkovi útok typu odepření služby (DOS) nebo vyčerpání paměti procesu.
de: Überprüfen Sie, auf welche Weise der Code zum Verarbeiten von nicht vertrauenswürdigen deserialisierten Daten unerwartete Verweiszyklen behandelt. Ein unerwarteter Verweiszyklus sollte nicht dazu führen, dass der Code in eine Endlosschleife eintritt. Andernfalls kann ein unerwarteter Verweiszyklus durch einen Angreifer für einen DoS-Angriff oder eine Arbeitsspeicherüberlastung des Prozesses genutzt werden, während nicht vertrauenswürdige Daten deserialisiert werden.
es: Revise el código que procesa datos deserializados que no son de confianza para controlar ciclos de referencia inesperados. Un ciclo de referencia inesperado no debe hacer que el código entre en un bucle infinito. De lo contrario, este tipo de ciclo puede permitir un ataque a DOS o agotar la memoria del proceso al deserializar datos que no son de confianza.
fr: Passez en revue le code qui traite les données désérialisées non approuvées pour gérer les cycles de référence inattendus. Un cycle de référence inattendu ne doit pas entraîner l'entrée du code dans une boucle infinie. Sinon, le cycle de référence inattendu risque de permettre à une personne de lancer une attaque DoS ou de saturer la mémoire du processus pendant la désérialisation des données non approuvées.
it: Rivedere il codice che elabora dati deserializzati non attendibili per la gestione di cicli di riferimento imprevisti. Un ciclo di riferimento imprevisto non deve causare un ciclo infinito del codice. Un ciclo di riferimento imprevisto può invece consentire attacchi di tipo DoS da parte di un utente malintenzionato o l'esaurimento della memoria del processo durante la deserializzazione di dati non attendibili.
ja: 信頼されていない逆シリアル化データを処理するコードで、予期しない参照サイクルの処理を確認してください。予期しない参照サイクルが原因でコードが無限ループに入ることのないようにしてください。そうしないと、信頼されていないデータを逆シリアル化するときに、予期しない参照サイクルのせいで攻撃者が DoS 攻撃をしたり、プロセスのメモリを使い果たしたりできるようになりかねません。
ko: 신뢰할 수 없는 역직렬화된 데이터를 처리하는 코드를 검토하여 예기치 않은 참조 주기를 처리합니다. 예기치 않은 참조 주기로 인해 코드의 무한 루프가 시작되어서는 안 됩니다. 참조 주기를 처리하지 않으면 공격자가 신뢰할 수 없는 데이터를 역직렬화할 때 프로세스의 메모리를 고갈시키거나 DOS를 수행할 수 있습니다.
pl: Przejrzyj kod, który przetwarza zdeserializowane niezaufane dane, pod kątem obsługi nieoczekiwanych cykli odwołań. Nieoczekiwany cykl odwołań nie powinien powodować wejścia kodu w nieskończoną pętlę. W przeciwnym razie nieoczekiwany cykl odwołań może pozwolić osobie atakującej na przeprowadzenie ataku DoS lub wyczerpanie pamięci procesu podczas deserializacji niezaufanych danych.
pt_br: Examine o código que processa dados desserializados não confiáveis para o tratamento de ciclos de referência inesperados. Um ciclo de referência inesperado não deve fazer com que o código entre em um loop infinito. Caso contrário, um ciclo de referência inesperado pode permitir um invasor do DOS ou esgotar a memória do processo ao desserializar dados não confiáveis.
ru: Проверьте код, который обрабатывает недоверенные десериализованные данные, на наличие обработки непредвиденного зацикливания ссылок. Непредвиденное зацикливание ссылок не должно приводить к переводу кода в бесконечный цикл. В противном случае непредвиденное зацикливание ссылок может позволить злоумышленнику провести атаку типа "отказ в обслуживании" или исчерпать память процесса при десериализации недоверенных данных.
tr: Beklenmeyen başvuru döngülerinin işlenmesi için, seri durumdan çıkarılmış güvenilmeyen verileri işleyen kodu inceleyin. Beklenmeyen başvuru döngüsü, kodun sonsuz bir döngüye girmesine neden olmamalıdır. Buna neden olursa beklenmeyen başvuru döngüsü, güvenilmeyen veriler seri durumdan çıkarılırken saldırganın DOS'a erişmesine izin verebilir veya işlem belleğini tüketebilir.
zh_hans: 查看处理不受信任的反序列化数据(为了处理意外引用循环)的代码。意外引用循环不应导致代码进入无限循环。否则，当反序列化不受信任的数据时，意外的引用循环可能导致攻击者 DOS 或耗尽进程的内存。
zh_hant: 檢閱會處理未受信任之還原序列化資料的程式碼，以處理未預期的參考迴圈。未預期的參考迴圈不應導致程式碼進入無限迴圈，否則，未預期的參考週期可能讓攻擊者得以 DOS，或在將未受信任的資料還原序列化時耗盡處理序的記憶體。

# PotentialReferenceCycleInDeserializedObjectGraphMessage
source: {0} participates in a potential reference cycle
cs: {0} se účastní potenciálního cyklu odkazů.
de: {0} ist Teil eines potenziellen Verweiszyklus
es: {0} participa en un ciclo de referencia potencial
fr: {0} participe à un cycle de référence potentiel
it: {0} fa parte di un potenziale ciclo di riferimento
ja: {0} で潜在的な参照サイクルが生じています
ko: {0}이(가) 잠재적 참조 순환에 참여합니다.
pl: Element {0} należy do potencjalnego cyklu odwołań
pt_br: {0} participa de um ciclo de referência potencial
ru: {0} участвует в потенциальном ссылочном цикле
tr: {0}, olası bir başvuru döngüsünde yer alıyor
zh_hans: {0} 参与潜在的引用周期
zh_hant: {0} 參與了可能的參照循環

# PotentialReferenceCycleInDeserializedObjectGraphTitle
source: Potential reference cycle in deserialized object graph
cs: Potenciální cyklus odkazů v deserializovaném grafu objektů
de: Potenzieller Verweiszyklus in deserialisiertem Objektgraph
es: Posible ciclo de referencia en el gráfico de objetos deserializados
fr: Cycle de référence potentiel dans un graphe d'objet désérialisé
it: Potenziale ciclo di riferimento nel grafico di oggetti deserializzati
ja: 逆シリアル化されたオブジェクト グラフ内の参照サイクルの可能性
ko: 역직렬화된 개체 그래프의 잠재적 참조 주기
pl: Potencjalny cykl odwołań w deserializowanym grafie obiektów
pt_br: Ciclo de referência potencial em grafo de objeto desserializado
ru: Потенциальное зацикливание ссылок в графе десериализованного объекта
tr: Seri durumdan çıkarılan nesne grafındaki olası başvuru döngüsü
zh_hans: 反序列化对象图中的潜在引用循环
zh_hant: 還原序列化物件圖中的潛在參考迴圈

# PreferAsSpanOverSubstringCodefixTitle
source: Replace 'Substring' with 'AsSpan'
cs: Nahradit Substring hodnotou AsSpan.
de: "Substring" durch "AsSpan" ersetzen
es: Reemplazar "Substring" por "AsSpan"
fr: Remplacer « Substring » par « AsSpan »
it: Sostituire 'Substring' con 'AsSpan'
ja: 'Substring' を 'AsSpan' に置き換える
ko: 'Substring'을 'AsSpan'으로 바꿉니다.
pl: Zamień ciąg „Substring” na „AsSpan”
pt_br: Substituir 'Subcadeia de caracteres' por 'AsSpan'
ru: Заменить "Substring" на "AsSpan"
tr: 'Substring'i 'AsSpan' ile değiştirin
zh_hans: 将 “Substring” 替换为 “AsSpan”
zh_hant: 請以 'AsSpan' 取代 'Substring'

# PreferAsSpanOverSubstringDescription
source: 'AsSpan' is more efficient than 'Substring'. 'Substring' performs an O(n) string copy, while 'AsSpan' does not and has a constant cost.
cs: AsSpan je efektivnější než Substring. Substring provádí kopírování řetězce O(n), zatímco AsSpan ho neprovádí a má konstantní náklady.
de: "AsSpan" ist effizienter als "Substring". Im Gegensatz zu "Substring" führt "AsSpan" keine O(n)-Zeichenfolgenkopie durch und bietet daher konstante Kosten.
es: "AsSpan" es más eficaz que "Substring". "Substring" realiza una copia de cadena O(n), mientras que "AsSpan" no lo hace y tiene un coste constante.
fr: L’option « AsSpan » est plus efficace que l’option « Substring ». « Substring » effectue une copie de chaîne O (n), alors que « AsSpan » ne possède pas un coût constant.
it: 'AsSpan' è più efficiente di 'Substring'. 'Substring' esegue una copia della stringa O(n), mentre 'AsSpan' non la esegue e ha un costo costante.
ja: 'AsSpan' の方が 'Substring' より効率的です。'Substring' は O(n) 文字列コピーを実行しますが、'AsSpan' はこれを実行せず、固定コストがあります。
ko: 'AsSpan'은 'Substring'보다 효율적입니다. 'Substring'은 O(n) 문자열 복사를 수행하는 반면 'AsSpan'은 수행하지 않으며 일정한 비용이 듭니다.
pl: Ciąg „AsSpan” jest bardziej wydajny niż ciąg „Substring”. Ciąg „Substring” wykonuje kopię ciągu O(n), natomiast ciąg „AsSpan” nie wykonuje i ponadto ma stały koszt.
pt_br: “AsSpan” é mais eficiente do que “Substring”. “Substring” executa uma cópia de cadeia de caracteres O(n), enquanto “AsSpan” não o faz e tem um custo constante.
ru: "AsSpan" более эффективен, чем "Substring". "Substring" выполняет копирование строки O(n), тогда как "AsSpan" не имеет постоянных затрат.
tr: 'AsSpan', 'Substring' değerinden daha verimlidir. 'Substring' bir O(n) dizesi kopyası oluşturur ama 'AsSpan' bunu yapmaz ve sabit bir maliyeti vardır.
zh_hans: “AsSpan”比“Substring”效率更高。“Substring”执行 O(n) 字符串复制，而“AsSpan”不执行且具有固定成本。
zh_hant: 'AsSpan' 比 'Substring' 更有效率。'Substring' 會執行 O(n) 字串複製，而 'AsSpan' 不會且有固定成本。

# PreferAsSpanOverSubstringMessage
source: Prefer 'AsSpan' over 'Substring' when span-based overloads are available
cs: Pokud jsou k dispozici přetížení založená na rozsahu, upřednostňujte AsSpan před Substring.
de: Bevorzugen Sie "AsSpan" gegenüber "Substring", wenn span-basierte Überladungen verfügbar sind.
es: Preferir "AsSpan" a "Substring" cuando hay sobrecargas basadas en intervalos disponibles
fr: Préférer ’AsSpan’ à ’Substring’ lorsque les surcharges de type span sont disponibles
it: Preferire 'AsSpan' a 'Substring' quando sono disponibili overload basati su span
ja: スパンベースのオーバーロードが使用可能な場合は、'Substring' よりも 'AsSpan' を優先する
ko: 범위 기반 오버로드를 사용할 수 있는 경우 'Substring'보다 'AsSpan'을 우선적으로 사용합니다.
pl: Preferuj ciąg „AsSpan” niż „Substring”, gdy są dostępne przeciążenia oparte na zakresie
pt_br: Preferir 'AsSpan' em vez de 'Substring' quando sobrecargas baseadas em intervalo estão disponíveis
ru: Предпочтительное использование "AsSpan" вместо "Substring", если доступны перегрузки на основе интервалов
tr: Yayılma tabanlı aşırı yüklemeler kullanılabilir olduğunda 'Substring' yerine 'AsSpan' tercih edin
zh_hans: 当基于跨度的重载可用时，首选 “AsSpan” 而不是 “Substring”
zh_hant: 當範圍型的多載可用時，建議使用 'AsSpan' 而不是 'Substring'

# PreferAsSpanOverSubstringTitle
source: Prefer 'AsSpan' over 'Substring'
cs: Preferovat AsSpan místo Substring
de: "AsSpan" gegenüber "Substring" bevorzugen
es: Preferir "AsSpan" a "Substring"
fr: Préférer ’AsSpan’ à ’Substring'
it: Preferire 'AsSpan' a 'Substring'
ja: 'Substring' よりも 'AsSpan' を優先します
ko: ''Substring'보다 'AsSpan' 우선적으로 사용
pl: Preferuj ciąg „AsSpan” niż „Substring”
pt_br: Preferir 'AsSpan' em vez de 'Subcadeia de caracteres'
ru: Предпочтительное использование "AsSpan" вместо "Substring"
tr: 'Substring' yerine 'AsSpan' tercih edin
zh_hans: 首选 “AsSpan” 而不是 “Substring”
zh_hant: 建議使用 'AsSpan' 而不是 'Substring'

# PreferConstCharOverConstUnitStringInStringBuilderDescription
source: 'StringBuilder.Append(char)' is more efficient than 'StringBuilder.Append(string)' when the string is a single character. When calling 'Append' with a constant, prefer using a constant char rather than a constant string containing one character.
cs: Když je string jen jeden znak, je StringBuilder.Append(char) efektivnější než StringBuilder.Append(string). Při volání Append s konstantou dávejte přednost možnosti použít konstantní typ char namísto konstantního typu string, který bude obsahovat jen jeden znak.
de: "StringBuilder.Append(char)" ist effizienter als "StringBuilder.Append(string)", wenn die Zeichenfolge ein einzelnes Zeichen enthält. Wenn "Append" mit einer Konstante aufgerufen wird, verwenden Sie eher ein konstantes Zeichen anstelle einer konstanten Zeichenfolge, die nur ein Zeichen enthält.
es: "StringBuilder.Append(char)" es más eficaz que "StringBuilder.Append(string)" cuando la cadena es de un solo carácter. Cuando se llama a "Append" con una constante, es preferible usar una constante char en lugar de una cadena de constante que contenga un carácter.
fr: 'StringBuilder.Append(char)' est plus efficace que 'StringBuilder.Append(string)' quand la chaîne correspond à un seul caractère. Quand vous appelez 'Append' avec une constante, utilisez de préférence une constante char à la place d'une constante string contenant un caractère.
it: 'StringBuilder.Append(char)' è più efficace di 'StringBuilder.Append(string)' quando la stringa è un carattere singolo. Se si chiama 'Append' con una costante, è preferibile usare un tipo di dati char costante invece di uno stringa contenente un solo carattere.
ja: 文字列が単一文字の場合、'StringBuilder.Append(char)' のほうが 'StringBuilder.Append(string)' よりも効率的です。定数を指定して 'Append' を呼び出す場合は、単一文字を含む定数文字列ではなく、定数 char を使用することをお勧めします。
ko: 문자열이 단일 문자인 경우 'StringBuilder.Append(char)'가 'StringBuilder.Append(string)'보다 효율적입니다. 상수를 사용하여 'Append'를 호출하는 경우 한 문자를 포함하는 상수 문자열 대신 상수 문자를 사용하세요.
pl: Element „StringBuilder.Append(char)” jest bardziej wydajny niż element „StringBuilder.Append(string)”, gdy ciąg jest pojedynczym znakiem. W przypadku wywołania elementu „Append” ze stałą, preferuj użycie stałego znaku, a nie ciągu stałego zawierającego jeden znak.
pt_br: 'StringBuilder.Append(char)' é mais eficiente do que 'StringBuilder.Append(string)' quando a cadeia de caracteres é um único caractere. Ao chamar 'Append' com uma constante, prefira usar um caractere constante em vez de uma cadeia de caracteres constante contendo um caractere.
ru: Если строка представляет собой одиночный символ, то метод "StringBuilder.Append(char)" более эффективен по сравнению с методом "StringBuilder.Append(string)". При вызове метода "Append" с константой рекомендуется использовать символьную константу, а не строковую константу, содержащую один символ.
tr: Dize tek bir karakter olduğunda 'StringBuilder.Append(char)', 'StringBuilder.Append(string)' öğesinden daha verimlidir. 'Append' bir sabit değer ile çağrıldığında, bir karakter içeren sabit bir dize yerine sabit bir karakter kullanmayı tercih edin.
zh_hans: 当字符串是单个字符时，"StringBuilder.Append(char)" 比 "StringBuilder.Append(string)" 更高效。使用常量调用 "Append" 时，请首选使用常量字符，而不是包含一个字符的常量字符串。
zh_hant: 當字串是單一字元時，'StringBuilder.Append(char)' 比 'StringBuilder.Append(string)' 更有效率。當以常數呼叫 'Append' 時，建議使用常數字元，而不要使用包含一個字元的常數字串。
