Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ProvideCorrectArgumentsToFormattingMethodsMessage
source: Provide correct arguments to formatting methods
cs: Poskytněte metodám formátování správné argumenty
de: Geeignete Argumente für Formatierungsmethoden angeben
es: Proporcionar argumentos correctos para los métodos de formato
fr: Indiquer le nombre correct d'arguments dans les méthodes de mise en forme
it: Fornire gli argomenti corretti ai metodi di formattazione
ja: 書式設定メソッドに正しい引数を指定します
ko: 서식 지정 메서드에 올바른 인수를 제공하세요.
pl: Określ poprawne argumenty dla metod formatujących
pt_br: Fornecer os argumentos corretos para métodos de formatação
ru: Задайте правильные аргументы для методов форматирования
tr: Biçimlendirme yöntemlerine doğru bağımsız değişkenleri sağlayın
zh_hans: 为格式化方法提供正确的参数
zh_hant: 為格式化方法提供正確的引數

# ProvideCorrectArgumentsToFormattingMethodsTitle
source: Provide correct arguments to formatting methods
cs: Poskytněte metodám formátování správné argumenty
de: Geeignete Argumente für Formatierungsmethoden angeben
es: Proporcionar argumentos correctos para los métodos de formato
fr: Indiquer le nombre correct d'arguments dans les méthodes de mise en forme
it: Fornire gli argomenti corretti ai metodi di formattazione
ja: 書式設定メソッドに正しい引数を指定します
ko: 서식 지정 메서드에 올바른 인수를 제공하세요.
pl: Określ poprawne argumenty dla metod formatujących
pt_br: Fornecer os argumentos corretos para métodos de formatação
ru: Задайте правильные аргументы для методов форматирования
tr: Biçimlendirme yöntemlerine doğru bağımsız değişkenleri sağlayın
zh_hans: 为格式化方法提供正确的参数
zh_hant: 為格式化方法提供正確的引數

# ProvideHttpClientHandlerMaxResponseHeaderLengthValueCorrectlyDescription
source: The property 'MaxResponseHeadersLength' is measured in kilobytes, not in bytes. The provided value is multiplied by 1024, which might be greater than your intended maximum length.
cs: Vlastnost MaxResponseHeadersLength se měří v kilobajtech, nikoli v bajtech. Zadaná hodnota se vynásobí hodnotou 1024, která může být větší než zamýšlená maximální délka.
de: Die Eigenschaft „MaxResponseHeadersLength“ wird in Kilobytes und nicht in Bytes gemessen. Der angegebene Wert wird mit 1024 multipliziert, was möglicherweise größer als die beabsichtigte maximale Länge ist.
es: La propiedad "MaxResponseHeadersLength" se mide en kilobytes, no en bytes. El valor proporcionado se multiplica por 1024, que puede ser mayor que la longitud máxima prevista.
fr: La propriété « MaxResponseHeadersLength » est mesurée en kilo-octets, et non en octets. La valeur fournie est multipliée par 1024, ce qui peut être supérieur à la longueur maximale prévue.
it: La proprietà "MaxResponseHeadersLength" viene misurata in kilobyte, non in byte. Il valore fornito è moltiplicato per 1024, quindi potrebbe superare la lunghezza massima prevista.
ja: プロパティ 'MaxResponseHeadersLength' がバイト単位ではなくキロバイト単位で測定されています。指定された値に 1024 を乗算します。これは、意図した最大長を超える可能性があります。
ko: 'MaxResponseHeadersLength' 속성은 바이트가 아닌 킬로바이트 단위로 측정됩니다. 제공된 값에 1024를 곱합니다. 이 값은 의도한 최대 길이보다 클 수 있습니다.
pl: Właściwość „MaxResponseHeadersLength” jest mierzona w kilobajtach, a nie w bajtach. Podana wartość jest mnożona przez 1024, co może być wartością większą niż zamierzona maksymalna długość.
pt_br: A propriedade “MaxResponseHeadersLength” é medida em quilobytes, não em bytes. O valor fornecido é multiplicado por 1024, que pode ser maior que o comprimento máximo pretendido.
ru: Свойство "MaxResponseHeadersLength" измеряется в килобайтах, а не байтах. Указанное значение умножается на 1024, что может быть больше, чем предполагаемая максимальная длина.
tr: 'MaxResponseHeadersLength' bayt cinsinden değil, kilobayt cinsinden ölçülür. Sağlanan değer 1024 ile çarpılır ve bu, istediğiniz maksimum uzunluktan büyük olabilir.
zh_hans: 属性 "MaxResponseHeadersLength" 以千字节为单位而不是以字节为单位。提供的值乘以 1024，这可能大于预期的最大长度。
zh_hant: 屬性 'MaxResponseHeadersLength' 以 KB 為衡量單位，而不是以位元組為衡量單位。提供的值會乘以 1024，這可能大於您預期的最大長度。

# ProvideHttpClientHandlerMaxResponseHeaderLengthValueCorrectlyMessage
source: Make sure the value '{0}' is correct. This value is measured in kilobytes, not bytes.
cs: Ujistěte se, že hodnota {0} je správná. Tato hodnota se měří v kilobajtech, nikoli v bajtech.
de: Stellen Sie sicher, dass der Wert „{0}“ richtig ist. Dieser Wert wird in Kilobytes und nicht in Bytes gemessen.
es: Asegúrese de que el valor "{0}" es correcto. Este valor se mide en kilobytes, no en bytes.
fr: Vérifiez que la valeur «{0}» est correcte. Cette valeur est mesurée en kilo-octets, et non en octets.
it: Assicurarsi che il valore "{0}" sia corretto. Questo valore viene misurato in kilobyte, non in byte.
ja: 値 '{0}' が正しいことを確認します。この値はバイト単位ではなくキロバイト単位で測定されます。
ko: '{0}' 값이 올바른지 확인합니다. 이 값은 바이트가 아닌 킬로바이트 단위로 측정됩니다.
pl: Upewnij się, że wartość „{0}” jest poprawna. Ta wartość jest mierzona w kilobajtach, a nie w bajtach.
pt_br: Verifique se o valor "{0}" está correto. Esse valor é medido em quilobytes e não em bytes.
ru: Убедитесь, что значение "{0}" верно. Это значение измеряется в килобайтах, а не байтах.
tr: '{0}' değerinin doğru olduğundan emin olun. Bu değer bayt değil, kilobayt cinsinden ölçülür.
zh_hans: 确保值“{0}”正确。此值以千字节为单位而不是字节为单位。
zh_hant: 請確定值 '{0}' 正確無誤。此值以 KB 為衡量單位，而不是以位元組為衡量單位。

# ProvideHttpClientHandlerMaxResponseHeaderLengthValueCorrectlyTitle
source: Set 'MaxResponseHeadersLength' properly
cs: Nastavte MaxResponseHeadersLength správně
de: "MaxResponseHeadersLength" richtig festlegen
es: Establecer "MaxResponseHeadersLength" correctamente
fr: Définir « MaxResponseHeadersLength » correctement
it: Impostare 'MaxResponseHeadersLength' correttamente
ja: 'MaxResponseHeadersLength' を正しく設定する
ko: 'MaxResponseHeadersLength'를 올바르게 설정
pl: Ustaw poprawnie parametr „MaxResponseHeadersLength”
pt_br: Definir “MaxResponseHeadersLength” corretamente
ru: Настройте "MaxResponseHeadersLength" правильно
tr: 'MaxResponseHeadersLength' değerini uygun şekilde ayarlayın
zh_hans: 正确设置“MaxResponseHeadersLength”
zh_hant: 正確設定 'MaxResponseHeadersLength'

# ProvidePublicParameterlessSafeHandleConstructorDescription
source: Providing a parameterless constructor that is as visible as the containing type for a type derived from 'System.Runtime.InteropServices.SafeHandle' enables better performance and usage with source-generated interop solutions.
cs: Poskytnutí konstruktoru bez parametrů, který je viditelný jako nadřazený typ pro typ odvozený od System.Runtime.InteropServices.SafeHandle, umožňuje lepší výkon a využití s řešeními spolupráce generovanými zdroji.
de: Indem Sie für einen von "System.Runtime.InteropServices.SafeHandle" abgeleiteten Typ einen parameterlosen Konstruktor bereitstellen, der ebenso sichtbar ist wie der enthaltende Typ, erzielen Sie eine bessere Leistung und Nutzung mit aus der Quelle generierten Interop-Lösungen.
es: Proporcionar un constructor sin parámetros tan visible como el tipo contenedor para un tipo derivado de 'System.Runtime.InteropServices.SafeHandle' permite un mejor rendimiento y uso con soluciones de interoperabilidad generadas por el origen.
fr: La fourniture d’un constructeur sans paramètre qui est aussi visible que le type conteneur pour un type dérivé de ’System. Runtime. InteropServices. SafeHandle’ permet d’améliorer les performances et l’utilisation des solutions d’interopérabilité générées par le code source.
it: La specifica di un costruttore senza parametri visibile come tipo che lo contiene per un tipo derivato da 'System.Runtime.InteropServices.SafeHandle' offre prestazioni migliori e ne consente l'utilizzo in soluzioni di interoperabilità generate da origini.
ja: 'System.Runtime.InteropServices.SafeHandle' から派生した型の包含型と同じように見えるパラメーターなしのコンストラクターを指定すると、ソース生成相互運用ソリューションのパフォーマンスと使用方法が向上します。
ko: 'System.Runtime.InteropServices.SafeHandle'에서 파생된 형식에 대한 포함 형식만큼 표시되는 매개 변수 없는 생성자를 제공하면 원본 생성 interop 솔루션의 성능과 사용이 향상됩니다.
pl: Udostępnienie konstruktora bez parametrów, który jest tak widoczny jak typ zawierający dla typu pochodzącego z elementu „System.Runtime.InteropServices.SafeHandle”, zapewnia lepszą wydajność i użycie dzięki wygenerowanym przez źródło rozwiązaniom międzyoperacyjnym.
pt_br: Fornecer um construtor sem parâmetros que é tão visível quanto o tipo que contém um tipo derivado de 'System.Runtime.InteropServices.SafeHandle' permite um melhor desempenho e uso com soluções de interoperabilidade geradas pela origem.
ru: Предоставление конструктора без параметров, который отображается как содержащий тип для типа, производного от "System.Runtime.InteropServices.SafeHandle", обеспечивает улучшенную производительность и использование в решениях взаимодействия, созданных источником.
tr: 'System.Runtime.InteropServices.SafeHandle'dan türetilmiş bir tür için kapsayan tür kadar görülebilen parametresiz bir oluşturucu sağlamak, kaynak tarafından oluşturulan birlikte çalışma çözümleriyle daha iyi performans ve kullanım olanağı sağlar.
zh_hans: 提供与派生自 “System.Runtime.InteropServices.SafeHandle” 的类型的包含类型一样可见的无参数构造函数可改进源生成的互操作解决方案的性能和使用情况。
zh_hant: 提供一種無參數的建構函式，與衍生自 'System.Runtime.InteropServices.SafeHandle' 之類型的包含類型一樣可見，使用原始檔產生的 interop 解決方案可提高效能及使用量。

# ProvidePublicParameterlessSafeHandleConstructorMessage
source: Provide a parameterless constructor that is as visible as the containing type for the '{0}' type that is derived from 'System.Runtime.InteropServices.SafeHandle'
cs: Zadejte konstruktor bez parametrů, kkterý je viditelný jako nadřazený typ pro typ {0}, který je odvozen od třídy System.Runtime.InteropServices.SafeHandle.
de: Stellen Sie für den Typ "{0}", der von "System.Runtime.InteropServices.SafeHandle" abgeleitet wird, einen parameterlosen Konstruktor bereit, der ebenso sichtbar ist wie der enthaltende Typ.
es: Proporcione un constructor sin parámetros que sea tan visible como el tipo contenedor para el tipo '{0}' derivado de 'System.Runtime.InteropServices.SafeHandle'
fr: Fournir un constructeur sans paramètre qui est aussi visible que le type contenant le type '{0}' qui est dérivé de 'System.Runtime.InteropServices.SafeHandle'.
it: Specificare un costruttore senza parametri visibile come il tipo che lo contiene per il tipo '{0}' derivato da 'System.Runtime.InteropServices.SafeHandle'
ja: 'System.Runtime.InteropServices.SafeHandle' から派生した '{0}' 型の包含型と同じように表示されるパラメーターなしのコンストラクターを指定します。
ko: 'System.Runtime.InteropServices.SafeHandle'에서 파생된 '{0}' 형식에 대한 포함 형식만큼 표시되는 매개 변수 없는 생성자를 제공합니다.
pl: Podaj konstruktora bez parametrów, który jest tak widoczny jak typ zawierający dla typu „{0}” pochodzącego z elementu „System.Runtime.InteropServices.SafeHandle”
pt_br: Forneça um construtor sem parâmetros que seja tão visível quanto o tipo que contém o tipo '{0}' derivado de 'System.Runtime.InteropServices.SafeHandle'
ru: Предоставить конструктор без параметров, который отображается как содержащий тип для типа "{0}", производного от "System.Runtime.InteropServices.SafeHandle"
tr: 'System.Runtime.InteropServices.SafeHandle'dan türetilen '{0}' türü için kapsayan tür kadar görülebilen parametresiz bir oluşturucu belirtin
zh_hans: 提供与派生自 “System.Runtime.InteropServices.SafeHandle” 的“{0}”类型的包含类型一样可见的无参数构造函数
zh_hant: 提供一種無參數的建構函式，與衍生自 'System.Runtime.InteropServices.SafeHandle' 之 '{0}' 類型的包含類型一樣可見

# ProvidePublicParameterlessSafeHandleConstructorTitle
source: Provide a parameterless constructor that is as visible as the containing type for concrete types derived from 'System.Runtime.InteropServices.SafeHandle'
cs: Zadejte konstruktor bez parametrů, který je viditelný jako nadřazený typ pro konkrétní typy odvozené od třídy System.Runtime.InteropServices.SafeHandle.
de: Für konkrete Typen, die von "System.Runtime.InteropServices.SafeHandle" abgeleitet werden, einen parameterlosen Konstruktor bereitstellen, der ebenso sichtbar ist wie der enthaltende Typ
es: Proporcione un constructor sin parámetros que sea tan visible como el tipo contenedor para los tipos concretos derivados de "System.Runtime.InteropServices.SafeHandle".
fr: Fournissez un constructeur sans paramètre qui est aussi visible que le type conteneur pour les types concrets dérivés de ’System. Runtime. InteropServices. SafeHandle'
it: Specificare un costruttore senza parametri visibile come il tipo che lo contiene per i tipi concreti derivati da 'System.Runtime.InteropServices.SafeHandle'
ja: 'System.Runtime.InteropServices.SafeHandle' から派生した具象型の包含型と同じように表示されるパラメーターなしのコンストラクターを指定します
ko: 'System.Runtime.InteropServices.SafeHandle'에서 파생된 구체적인 형식에 대한 포함 형식만큼 표시되는 매개 변수 없는 생성자를 제공합니다.
pl: Podaj konstruktora bez parametrów, który jest tak widoczny jak typ zawierający dla konkretnych typów pochodzących z elementu „System.Runtime.InteropServices.SafeHandle”
pt_br: Forneça um construtor sem parâmetros que seja tão visível quanto o tipo que contém tipos concretos derivados de 'System.Runtime.InteropServices.SafeHandle'
ru: Предоставить конструктор без параметров, который отображается как содержащий тип для конкретных типов, производных от "System.Runtime.InteropServices.SafeHandle"
tr: 'System.Runtime.InteropServices.SafeHandle'dan türetilen somut türler için kapsayan tür kadar görülebilen parametresiz bir oluşturucu belirtin
zh_hans: 提供与派生自 “System.Runtime.InteropServices.SafeHandle” 的具体类型的包含类型一样可见的无参数构造函数
zh_hant: 提供一種無參數的建構函式，與衍生自 'System.Runtime.InteropServices.SafeHandle' 之具體類型的包含類型一樣可見

# ProvideStreamMemoryBasedAsyncOverridesDescription
source: To improve performance, override the memory-based async methods when subclassing 'Stream'. Then implement the array-based methods in terms of the memory-based methods.
cs: Pokud chcete zvýšit výkon, přepište asynchronní metody založené na paměti při vytvoření podtříd Stream. Potom implementujte metody založené na poli z hlediska metod založených na paměti.
de: Um die Leistung zu verbessern, setzen Sie die arbeitsspeicherbasierten Async-Methoden beim Erstellen von Unterklassen von "Stream" außer Kraft. Implementieren Sie dann die arraybasierten Methoden im Sinne der arbeitsspeicherbasierten Methoden.
es: Para mejorar el rendimiento, invalide los métodos asincrónicos basados en memoria al crear subclases "Stream". A continuación, implemente los métodos basados en matrices en términos de los métodos basados en memoria.
fr: Pour améliorer les performances, remplacez les méthodes Async basées sur la mémoire lors de l’exécution du sous-classement de ’Stream'. Implémentez ensuite les méthodes basées sur un tableau en fonction des méthodes basées sur la mémoire.
it: Per migliorare le prestazioni, eseguire l'override dei metodi asincroni basati sulla memoria durante la creazione di una sottoclasse 'Stream'. Implementare quindi i metodi basati su matrice nei termini dei metodi basati sulla memoria.
ja: パフォーマンスを向上させるには、'Stream' をサブクラス化するときにメモリベースの非同期メソッドをオーバーライドします。次に、メモリベースのメソッドの観点から配列ベースのメソッドを実装します。
ko: 성능을 향상시키려면 'Stream'의 서브클래스를 지정할 때 메모리 기반 비동기 메서드를 재정의하세요. 그런 다음 메모리 기반 방법의 관점에서 배열 기반 방법을 구현합니다.
pl: Aby zwiększyć wydajność, zastąp metody asynchroniczne oparte na pamięci podczas tworzenia podklasy „Stream”. Następnie zaimplementuj metody oparte na tablicy w zakresie metod opartych na pamięci.
pt_br: Para melhorar o desempenho, substitua os métodos assíncronos baseados em memória ao fazer a subclasse 'Stream'. Em seguida, implemente os métodos baseados em matriz em termos dos métodos baseados em memória.
ru: Чтобы повысить производительность, переопределите асинхронные методы на основе памяти при создании подкласса "Stream". Затем реализуйте методы на основе массивов в условиях методов на основе памяти.
tr: Performansı artırmak için, 'Stream'i alt sınıflandırması yaparken bellek tabanlı zaman uyumsuz yöntemleri geçersiz kılın. Daha sonra, dizi tabanlı yöntemleri bellek tabanlı metotlara göre uygulayın.
zh_hans: 若要提高性能，请在子类化“Stream”时重写基于内存的异步方法。然后，根据基于内存的方法实现基于数组的方法。
zh_hant: 若要提升效能，請在加入子類別 'Stream' 時，覆寫記憶體型的非同步方法，然後以記憶體型方法的方式實作陣列型的方法。

# ProvideStreamMemoryBasedAsyncOverridesMessage
source: '{0}' overrides array-based '{1}' but does not override memory-based '{2}'. Consider overriding memory-based '{2}' to improve performance.
cs: {0} přepisuje {1} založené na poli ale nepřepisuje{2} na základě paměti. Pokud chcete zlepšit výkon, zvažte možnost přepsání {2} na základě paměti.
de: "{0}" überschreibt die arraybasierte Methode "{1}", aber nicht die arbeitsspeicherbasierte Methode "{2}". Sie sollten die arbeitsspeicherbasierte Methode "{2}" außer Kraft setzen, um die Leistung zu verbessern.
es: '{0}' invalida '' basada en matriz, {1} pero no invalida '{2}' basada en memoria. Considere la posibilidad de invalidar "" basado en memoria {2} para mejorar el rendimiento.
fr: ' {0} 'se substitue à' {1} 'basé sur un tableau mais ne remplace pas' {2} 'basé sur la mémoire. Pensez à remplacer «{2}» basé sur la mémoire pour améliorer les performances.
it: '{0}' esegue l'override di '{1}' basato su matrice, ma non di '{2}' basato sulla memoria. Per migliorare le prestazioni, provare a eseguire l'override di '{2}' basato sulla memoria.
ja: '{0}' は、配列ベースの '{1}' をオーバーライドしますが、メモリベースの '{2}' はオーバーライドしません。パフォーマンスを向上させるために、メモリベースの '{2}' をオーバーライドすることを検討してください。
ko: '{0}'은(는) 배열 기반 '{1}'을 재정의하지만 메모리 기반 '{2}'은(는) 재정의하지 않습니다. 성능을 향상시키려면 메모리 기반 '{2}'을(를) 재정의하는 것이 좋습니다.
pl: Metoda „{0}” przesłania metodę „{1}” opartą na tablicy, ale nie przesłania metody opartej na pamięci „{2}”. Rozważ zastąpienie metody opartej na pamięci „{2}”, aby zwiększyć wydajność.
pt_br: '{0}' substitui '{1}', mas não substitui '{2}' baseado em memória. Considere substituir baseado em memória '{2}' para melhorar o desempenho.
ru: "{0}" переопределяет "{1}" на основе массивов, но не переопределяет "{2}" на основе памяти. Для повышения производительности рассмотрите возможность переопределения "{2}" на основе памяти.
tr: '{0}', dizi tabanlı '{1}' öğesini geçersiz kılıyor ancak bellek tabanlı '{2}' öğesini geçersiz kılmıyor. Performansı artırmak için bellek tabanlı '{2}' öğesini geçersiz kılmayı düşünün.
zh_hans: “{0}”重写基于数组的“{1}”，但不会重写基于内存的“{2}”，请考虑重写基于内存的“{2}”以提高性能。
zh_hant: '{0}' 會覆寫陣列型的 '{1}'，但不會覆寫記憶體型的 '{2}'。請考慮覆寫記憶體型的 '{2}' 以提升效能。

# ProvideStreamMemoryBasedAsyncOverridesTitle
source: Provide memory-based overrides of async methods when subclassing 'Stream'
cs: Poskytněte přepisování asynchronních metod na základě paměti při podtřídování Stream.
de: Arbeitsspeicherbasierte asynchrone Methoden beim Erstellen von Unterklassen von „Stream“ außer Kraft setzen
es: Proporcionar invalidaciones basadas en memoria de métodos asincrónicos al crear subclases de 'Stream'
fr: Fournir des remplacements basés sur la mémoire des méthodes Async lors du sous-classer « Stream »
it: Specificare override basati sulla memoria dei metodi asincroni durante la creazione di una sottoclasse 'Stream'
ja: 'Stream' をサブクラス化するときに非同期メソッドのメモリ ベースのオーバーライドを指定する
ko: 'Stream’의 서브클래스를 지정할 때 비동기 메서드의 메모리 기반 재정의 제공
pl: Podaj oparte na pamięci przesłonięcia metod asynchronicznych podczas tworzenia podklasy „Stream”
pt_br: Fornecer substituições baseadas em memória de métodos assíncronos ao subclasse 'Stream'
ru: Указать переопределения асинхронных методов на основе памяти при создании подкласса "Stream"
tr: 'Stream' alt sınıflandırması yapılırken olduğunda zaman uyumsuz yöntemlerin bellek tabanlı geçersiz kılmalarını sağlayın
zh_hans: 在子类化 “Stream” 时提供异步方法的基于内存的重写
zh_hant: 加入子類別 'Stream' 時，提供非同步方法的記憶體型覆寫
