Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseCountWhenAnyCanBeUsedMessage
source: {0}() is used where Any() could be used instead to improve performance
cs: {0}() se používá tam, kde se dá kvůli zvýšení výkonu použít Any().
de: "{0}()" wird verwendet, obwohl "Any()" stattdessen verwendet werden kann, um die Leistung zu verbessern.
es: Se usa {0}() donde podría usarse Any() para mejorar el rendimiento.
fr: {0}() est utilisé alors que Any() peut être utilisé à la place pour améliorer le niveau de performance
it: Si usa {0}() in un punto in cui sarebbe possibile usare Any() per migliorare le prestazioni
ja: パフォーマンスを向上させるために Any() を代わりに使用できるところで {0}() が使用されています
ko: {0}()은(는) 성능 개선을 위해 Any()를 대신 사용할 수 있는 경우에 사용됩니다.
pl: Funkcja {0}() jest używana w miejscach, w których można użyć funkcji Any() w celu zwiększenia wydajności
pt_br: {0}() é usado onde Any() poderia ser usado para melhorar o desempenho
ru: {0}() используется там, где можно было бы использовать Any() для повышения производительности.
tr: Performansı artırmak için Any() metodu kullanılabilecekken bunun yerine {0}() kullanılıyor
zh_hans: 如果可以使用 Any()，请改为使用 {0}() 来提高性能
zh_hant: 會在可使用 Any() 的地方改用 {0}() 來提升效能

# DoNotUseCountWhenAnyCanBeUsedTitle
source: Do not use Count() or LongCount() when Any() can be used
cs: Nepoužívat Count() nebo LongCount(), pokud se dá použít Any()
de: Count() oder LongCount() nicht verwenden, wenn Any() verwendet werden kann
es: No usar Count() ni LongCount() si se puede usar Any()
fr: N'utilisez pas Count() ou LongCount() quand Any() peut être utilisé
it: Non usare Count() o LongCount() se è possibile usare Any()
ja: Any() を使用できる場合は、Count() または LongCount() を使用しない
ko: Any()를 사용할 수 있는 경우 Count() 또는 LongCount() 사용 안 함
pl: Nie używaj funkcji Count() ani LongCount(), gdy można użyć funkcji Any()
pt_br: Não usar Count() ou LongCount() quando Any() puder ser usado
ru: Не используйте методы Count() и LongCount(), если можно использовать метод Any()
tr: Any() kullanılabiliyorsa Count() veya LongCount() kullanma
zh_hans: 如果可以使用 Any() 则不使用 Count() 或 LongCount()
zh_hant: 若可以使用 Any()，就不要使用 Count() 來提高效能

# DoNotUseCreateEncryptorWithNonDefaultIVDescription
source: Symmetric encryption should always use a non-repeatable initialization vector to prevent dictionary attacks.
cs: Symetrické šifrování by mělo vždy používat inicializační vektor, který nelze opakovat, aby se zabránilo slovníkovým útokům.
de: Für die symmetrische Verschlüsselung muss immer ein nicht wiederholbarer Initialisierungsvektor verwendet werden, um Wörterbuchangriffe zu verhindern.
es: La clave de cifrado simétrica debe usar siempre un vector de inicialización que no se repita para evitar los ataques por diccionario.
fr: Le chiffrement symétrique doit toujours utiliser un vecteur d'initialisation non répétable pour empêcher les attaques par dictionnaire.
it: La crittografia simmetrica deve usare sempre un vettore di inizializzazione non ripetibile per impedire attacchi con dizionario.
ja: 対称暗号化では、辞書攻撃を防ぐために、反復不能な初期化ベクトルを常に使用する必要があります。
ko: 대칭형 암호화는 항상 반복할 수 없는 초기화 벡터를 사용하여 사전 공격을 방지해야 합니다.
pl: Szyfrowanie symetryczne powinno zawsze używać wektora inicjowania, który nie jest powtarzalny, aby zapobiec atakom słownikowym.
pt_br: A criptografia simétrica sempre deve usar um vetor de inicialização que não possa ser repetido para evitar ataques de dicionário.
ru: Для предотвращения атак перебором по словарю в симметричном шифровании всегда нужно использовать невоспроизводимый вектор инициализации.
tr: Simetrik şifrelemenin, sözlük saldırılarını önlemek için her zaman yinelenemeyen bir başlatma vektörü kullanması gerekir.
zh_hans: 对称加密应始终使用非可重复的初始化向量，以防止字典攻击。
zh_hant: 對稱式加密應永遠使用不可重複的初始化向量以防止字典攻擊。

# DoNotUseDSA
source: Do Not Use Digital Signature Algorithm (DSA)
cs: Nepoužívejte algoritmus DSA (Digital Signature Algorithm)
de: Digitalen Signaturalgorithmus (DSA) nicht verwenden
es: No usar el algoritmo de firma digital (DSA)
fr: Ne pas utiliser DSA (Digital Signature Algorithm)
it: Non usare l'algoritmo di firma digitale (DSA)
ja: デジタル署名アルゴリズム (DSA) を使用しない
ko: DSA (디지털 서명 알고리즘) 사용 안 함
pl: Nie używaj algorytmu Digital Signature Algorithm (DSA)
pt_br: Não Usar o DSA (Algoritmo de Assinatura Digital)
ru: Не использовать алгоритм DSA
tr: Dijital İmza Algoritması (DSA) Kullanma
zh_hans: 不使用数字签名算法(DSA)
zh_hant: 請勿使用數位簽章演算法 (DSA)

# DoNotUseDSADescription
source: DSA is too weak to use.
cs: Algoritmus DSA je příliš slabý a jeho použití se nedoporučuje.
de: DSA ist zu schwach für die Verwendung.
es: El algoritmo de firma digital no es suficientemente seguro para usarlo.
fr: L'algorithme DSA est trop faible pour être utilisé.
it: L'algoritmo DSA è troppo debole per essere usato.
ja: DSA は脆弱であるため使用しません。
ko: DSA가 보호 수준이 너무 낮아 사용할 수 없습니다.
pl: Algorytm DSA jest zbyt słaby, aby go użyć.
pt_br: O DSA é muito fraco para ser usado.
ru: Алгоритм DSA является слишком ненадежным для использования.
tr: DSA, kullanmak için çok zayıf.
zh_hans: DSA 太弱，无法使用。
zh_hant: DSA 太弱，所以無法使用。

# DoNotUseDSAMessage
source: Asymmetric encryption algorithm {0} is weak. Switch to an RSA with at least 2048 key size, ECDH or ECDSA algorithm instead.
cs: Algoritmus asymetrického šifrování {0} je slabý. Použijte radši algoritmus RSA s velikostí klíče alespoň 2048, ECDH nebo ECDSA.
de: Der asymmetrische Verschlüsselungsalgorithmus "{0}" ist schwach. Wechseln Sie stattdessen zu einer RSA-Verschlüsselung mit ECDH- oder ECDSA-Algorithmus mit einer Schlüsselgröße von mindestens 2048.
es: El algoritmo de cifrado asimétrico {0} no es seguro. Cambie a un algoritmo de ECDSA o ECDH con RSA que tenga un tamaño de clave mínimo de 2048.
fr: L'algorithme de chiffrement asymétrique {0} est faible. Passez plutôt à un algorithme RSA avec une clé d'au moins 2 048 bits, à un algorithme ECDH ou à un algorithme ECDSA.
it: L'algoritmo di crittografia asimmetrica {0} è debole. Passare a un algoritmo RSA con dimensione di chiave minima pari a 2048 oppure a un algoritmo ECDH o ECDSA.
ja: 非対称暗号化アルゴリズム {0} が脆弱です。代わりに、キー サイズが少なくとも 2048 の RSA、ECDH、または ECDSA アルゴリズムに切り替えてください。
ko: 비대칭 암호화 알고리즘 {0}은(는) 취약합니다. 대신 최소 2048 키 크기, ECDH 또는 ECDSA 알고리즘이 포함된 RSA로 전환하세요.
pl: Algorytm szyfrowania asymetrycznego {0} jest słaby. Przełącz się na algorytm RSA z kluczem o rozmiarze co najmniej 2048, algorytm ECDH lub algorytm ECDSA.
pt_br: O algoritmo de criptografia assimétrica {0} é fraco. Mude para um RSA com um tamanho de chave de pelo menos 2048 ou para um algoritmo ECDH ou ECDSA.
ru: Алгоритм асимметричного шифрования {0} является ненадежным. Перейдите на алгоритм RSA с размером ключа не менее 2048 бит либо на алгоритм ECDH или ECDSA.
tr: {0} asimetrik şifreleme algoritması zayıf. Bunun yerine en az 2048 anahtar boyutunda, ECDH veya ECDSA algoritmasına sahip bir RSA'ya geçiş yapın.
zh_hans: 非对称加密算法 {0} 较弱。请转而切换到至少具有 2048 位密钥大小的 RSA、ECDH 或者 ECDSA 算法。
zh_hant: 非對稱式加密演算法 {0} 是弱式加密。請改為至少有 2048 金鑰大小的 RSA、ECDH 或 ECDSA 演算法。

source: Do Not Use Deprecated Security Protocols
cs: Nepoužívejte zastaralé protokoly zabezpečení.
de: Verwenden Sie keine veralteten Sicherheitsprotokolle.
es: No usar protocolos de seguridad en desuso
fr: Ne pas utiliser de protocoles de sécurité dépréciés
it: Non usare protocolli di sicurezza deprecati
ja: 非推奨のセキュリティ プロトコルを使用しない
ko: 사용되지 않는 보안 프로토콜을 사용하지 마세요.
pl: Nie używaj przestarzałych protokołów zabezpieczeń
pt_br: Não Use Protocolos de Segurança Preteridos
ru: Не используйте нерекомендуемые протоколы безопасности
tr: Kullanım Dışı Güvenlik Protokollerini Kullanmayın
zh_hans: 请勿使用弃用的安全协议
zh_hant: 請勿使用已淘汰的安全性通訊協定

# DoNotUseDeprecatedSecurityProtocolsDescription
source: Using a deprecated security protocol rather than the system default is risky.
cs: Používání zastaralých protokolů zabezpečení místo systémových výchozích protokolů představuje riziko.
de: Die Verwendung eines veralteten Sicherheitsprotokolls anstelle des Systemstandards ist riskant.
es: El uso de un protocolo de seguridad en desuso en lugar del predeterminado del sistema supone un riesgo.
fr: L'utilisation d'un protocole de sécurité déprécié à la place du protocole par défaut du système est risquée.
it: L'uso di un protocollo di sicurezza deprecato rispetto a quello predefinito di sistema è rischioso.
ja: システムの既定値ではなく、非推奨のセキュリティ プロトコルを使用することは安全ではありません。
ko: 시스템 기본값이 아닌 사용되지 않는 보안 프로토콜을 사용하는 것은 위험합니다.
pl: Używanie przestarzałego protokołu zabezpieczeń zamiast domyślnego ustawienia systemowego jest ryzykowne.
pt_br: É arriscado usar um protocolo de segurança preterido em vez do padrão do sistema.
ru: Использование нерекомендуемого протокола безопасности вместо заданного по умолчанию в системе является рискованным.
tr: Sistem varsayılanı yerine bir kullanım dışı güvenlik protokolünü kullanmak risklidir.
zh_hans: 使用弃用的安全协议而不是系统默认协议将有风险。
zh_hant: 使用了已淘汰的安全性通訊協定而非系統預設值，相當具風險。

# DoNotUseDeprecatedSecurityProtocolsMessage
source: Hard-coded use of deprecated security protocol {0}
cs: Pevně zakódované použití zastaralého protokolu zabezpečení {0}
de: Hartcodierte Verwendung des veralteten Sicherheitsprotokolls "{0}"
es: Uso codificado de forma rígida de un protocolo de seguridad en desuso {0}
fr: Utilisation codée en dur du protocole de sécurité déprécié {0}
it: Uso hardcoded del protocollo di sicurezza deprecato {0}
ja: 非推奨のセキュリティ プロトコル {0} のハードコーディングされた使用
ko: 사용되지 않는 보안 프로토콜 {0}의 하드 코드된 사용
pl: Zakodowane korzystanie z przestarzałego protokołu zabezpieczeń {0}
pt_br: Uso do protocolo de segurança preterido {0} embutido em código
ru: Жестко заданное использование нерекомендуемого протокола безопасности {0}
tr: Kullanım dışı {0} güvenlik protokolünün sabit kodlanmış kullanımı
zh_hans: 以硬编码方式使用弃用的安全协议 {0}
zh_hant: 硬式編碼使用了已淘汰的安全性通訊協定 {0}

# DoNotUseEndOfStreamInAsyncMethodsDescription
source: The property 'StreamReader.EndOfStream' can cause unintended synchronous blocking when no data is buffered. Instead, use 'StreamReader.ReadLineAsync' directly, which returns 'null' when reaching the end of the stream.
cs: Vlastnost StreamReader.EndOfStream může způsobit nezamýšlené synchronní blokování, když nejsou žádná data ve vyrovnávací paměti. Místo toho použijte přímo StreamReader.ReadLineAsync, který při dosažení konce datového proudu vrátí hodnotu null.
de: Die Eigenschaft „StreamReader.EndOfStream“ kann eine unbeabsichtigte synchrone Blockierung verursachen, wenn keine Daten gepuffert werden. Verwenden Sie stattdessen direkt „StreamReader.ReadLineAsync“, wodurch beim Erreichen des Endes des Streams „null“ zurückgegeben wird.
es: La propiedad 'StreamReader.EndOfStream' puede provocar un bloqueo sincrónico no deseado cuando no se almacena en búfer ningún dato. En su lugar, use "StreamReader.ReadLineAsync" directamente, que devuelve "null" al llegar al final de la secuencia.
fr: La propriété « StreamReader.EndOfStream » peut provoquer un blocage synchrone involontaire lorsqu’aucune donnée n’est mise en mémoire tampon. Au lieu de cela, utilisez directement « StreamReader.ReadLineAsync », qui retourne « null » lorsque vous atteignez la fin du flux.
it: La proprietà 'StreamReader.EndOfStream' può causare un blocco sincrono non intenzionale quando non ci sono dati nel buffer. Utilizza invece 'StreamReader.ReadLineAsync' direttamente, che restituisce 'null' quando viene raggiunta la fine del flusso.
ja: プロパティ 'StreamReader.EndOfStream' は、データがバッファーに格納されていない場合に、意図しない同期ブロックを引き起こす可能性があります。代わりに、ストリームの末尾に達した際に 'null' を返す 'StreamReader.ReadLineAsync' を直接使用してください。
ko: 'StreamReader.EndOfStream' 속성은 데이터가 버퍼링되지 않은 경우 의도하지 않은 동기 차단을 초래할 수 있습니다. 대신, 스트림의 끝에 도달할 때 'null'을 반환하는 'StreamReader.ReadLineAsync'를 직접 사용하세요.
pl: Właściwość „StreamReader.EndOfStream” może powodować niezamierzone blokowanie synchroniczne, gdy żadne dane nie są buforowane. Zamiast tego użyj właściwości „StreamReader.ReadLineAsync” bezpośrednio, która zwraca wartość „null” po osiągnięciu końca strumienia.
pt_br: A propriedade ''StreamReader.EndOfStream'' pode causar um bloqueio síncrono indesejado quando nenhum dado está em buffer. Use ''StreamReader.ReadLineAsync'' diretamente, que retorna ''null'' ao atingir o final do fluxo.
ru: Свойство "StreamReader.EndOfStream" может вызвать непреднамеренное синхронное блокирование, если данные не отправляются в буфер. Вместо этого используйте "StreamReader.ReadLineAsync" напрямую, который возвращает "null" при достижении конца потока.
tr: "StreamReader.EndOfStream" özelliği, ara belleğe hiç veri alınmadığında zaman uyumlu istenmeyen engellemeye yol açabilir. Bunun yerine akış sonuna ulaşıldığında "null" döndüren "StreamReader.ReadLineAsync" işlevini doğrudan kullanın.
zh_hans: 如果未缓冲任何数据，属性 ‘StreamReader.EndOfStream’ 可能会导致意外的同步阻塞。请改为直接使用 ‘StreamReader.ReadLineAsync’，这会在到达流末尾时返回 ‘null’。
zh_hant: 沒有緩衝資料時，屬性 'StreamReader.EndOfStream' 可能會導致意外的同步封鎖。相反地，請直接使用 'StreamReader.ReadLineAsync'，當到達資料流的結尾時，它會傳回 'null'。

# DoNotUseEndOfStreamInAsyncMethodsMessage
source: Do not use '{0}' in an async method
cs: Nepoužívejte {0} v asynchronní metodě.
de: Verwenden Sie „{0}“ nicht in einer asynchronen Methode
es: No usar '{0}' en un método asincrónico
fr: N’utilisez pas « {0} » dans une méthode asynchrone
it: Non utilizzare '{0}' in un metodo asincrono
ja: 非同期メソッドで '{0}' を使用しないでください
ko: 비동기 메서드에서 '{0}'을(를) 사용하지 마세요
pl: Nie używaj elementu „{0}” w metodzie asynchronicznej
pt_br: Não use ''{0}'' em um método assíncrono
ru: Не используйте "{0}" в асинхронном методе
tr: Zaman uyumsuz yöntemlerde "{0}" kullanmayın
zh_hans: 不要在异步方法中使用 ‘{0}’
zh_hant: 請勿在非同步方法中使用 '{0}'

# DoNotUseEndOfStreamInAsyncMethodsTitle
source: Do not use 'StreamReader.EndOfStream' in async methods
cs: Nepoužívejte StreamReader.EndOfStream v asynchronních metodách
de: Verwenden Sie „StreamReader.EndOfStream“ nicht in asynchronen Methoden.
es: No use 'StreamReader.EndOfStream' en métodos asincrónicos
fr: N’utilisez pas « StreamReader.EndOfStream » dans les méthodes asynchrones
it: Non utilizzare 'StreamReader.EndOfStream' nei metodi asincroni
ja: 非同期メソッドで 'StreamReader.EndOfStream' を使用しない
ko: 비동기 메서드에서는 'StreamReader.EndOfStream'을 사용하지 마세요.
pl: Nie używaj właściwości „StreamReader.EndOfStream” w metodach asynchronicznych
pt_br: Não use ''StreamReader.EndOfStream'' em métodos assíncronos
ru: Не используйте "StreamReader.EndOfStream" в асинхронных методах
tr: Zaman uyumsuz yöntemlerde "StreamReader.EndOfStream" kullanmayın
zh_hans: 不要在异步方法中使用 ‘StreamReader.EndOfStream’
zh_hant: 請勿在非同步方法中使用 'StreamReader.EndOfStream'

source: This collection is directly indexable. Going through LINQ here causes unnecessary allocations and CPU work.
cs: Tato kolekce se dá přímo indexovat. Procházení kódu LINQ na tomto místě způsobuje zbytečné alokace a vytížení procesoru.
de: Diese Sammlung kann direkt indiziert werden. Der Umweg über LINQ verursacht in diesem Fall unnötige Zuordnungen und CPU-Last.
es: Esta colección es directamente indexable. Pasar por LINQ en este caso genera asignaciones y trabajo de CPU innecesarios.
fr: Cette collection est directement indexable. L'utilisation de LINQ ici entraîne des allocations non nécessaires et une sollicitation inutile de l'UC.
it: Questa raccolta è direttamente indicizzabile. L'uso di LINQ in questo punto causa un carico della CPU e allocazioni non necessarie.
ja: このコレクションは、直接インデックス可能です。ここで LINQ を実行すると、不要な割り当てと CPU 作業が生じます。
ko: 이 컬렉션을 직접 인덱싱할 수 있습니다. 여기에서 LINQ를 통과하면 불필요한 할당과 CPU 작업이 발생합니다.
pl: Tę kolekcję można zaindeksować bezpośrednio. Użycie w tym miejscu kodu LINQ powoduje niepotrzebne alokacje i obciążenie procesora CPU.
pt_br: Esta coleção é diretamente indexável. Passar pelo LINQ aqui gera alocações e trabalho de CPU desnecessários.
ru: Эта коллекция индексируется напрямую. В этом случае применение LINQ приводит к ненужным выделениям и нагрузке на ЦП.
tr: Bu koleksiyonun doğrudan dizini oluşturulabilir. Burada LINQ uygulanması gereksiz ayırmalara ve CPU yoğunluğuna yol açar.
zh_hans: 该集合是可直接索引的。在此处查看 LINQ 会导致不必要的分配和 CPU 工作。
zh_hant: 此集合是可直接編製索引的集合。完成此處的 LINQ 會導致不必要的配置與 CPU 工作。

source: Do not use Enumerable methods on indexable collections. Instead use the collection directly.
cs: Nepoužívejte metody Enumerable nebo indexovatelné kolekce. Použijte místo toho kolekci napřímo.
de: Verwenden Sie keine Enumerable-Methoden für indizierbare Sammlungen. Verwenden Sie die Sammlung stattdessen direkt.
es: No utilice métodos Enumerable en colecciones indexables. Use la colección directamente.
fr: N'utilisez pas de méthodes Enumerable sur les collections indexables. À la place, utilisez directement la collection.
it: Non usare metodi Enumerable su raccolte indicizzabili. In alternativa, usare direttamente la raccolta.
ja: インデックス可能なコレクションで Enumerable メソッドを使用しません。代わりに、コレクションを直接使用します。
ko: 인덱싱 가능한 컬렉션의 Enumerable 메서드를 사용하지 마세요. 대신 컬렉션을 직접 사용하세요.
pl: Nie używaj metod typu Enumerable dla kolekcji indeksowalnych. Zamiast tego użyj kolekcji bezpośrednio.
pt_br: Não use métodos Enumerable em coleções indexáveis. Em vez disso, use a coleção.
ru: Не используйте метод Enumerable для индексируемых коллекций. Вместо этого используйте непосредственно коллекцию.
tr: Dizini oluşturulabilen koleksiyonlarda Enumerable metotlarını kullanmayın. Bunun yerine doğrudan koleksiyonu kullanın.
zh_hans: 不要在可索引的集合上使用 Enumerable 方法。而是直接使用集合。
zh_hant: 請勿在可索引的集合上，使用 Enumerable 方法。改為直接使用集合。

source: Do not use Enumerable methods on indexable collections
cs: Nepoužívejte metody Enumerable nebo indexovatelné kolekce
de: Keine Enumerable-Methoden für indizierbare Sammlungen verwenden
es: No usar métodos Enumerable en las colecciones indexables
fr: N'utilisez pas de méthodes Enumerable sur les collections indexables
it: Non usare metodi Enumerable su raccolte indicizzabili
ja: インデックス可能なコレクションで Enumerable メソッドは使用不可
ko: 인덱싱 가능한 컬렉션의 Enumerable 메서드를 사용하면 안 됨
pl: Nie używaj metod typu Enumerable dla kolekcji indeksowalnych
pt_br: Não use métodos Enumerable em coleções indexáveis
ru: Запрет использования метода Enumerable для индексируемых коллекций
tr: Dizini oluşturulabilen koleksiyonlarda Enumerable metotlarını kullanmayın
zh_hans: 不要在可索引的集合上使用 Enumerable 方法
zh_hant: 請勿在可索引的集合上，使用 Enumerable 方法

source: Do not use insecure randomness
cs: Nepoužívat nezabezpečenou náhodnost
de: Keine unsichere Zufälligkeitsstufe verwenden
es: No usar aleatoriedad no segura
fr: Ne pas utiliser de sélection aléatoire non sécurisée
it: Non usare la casualità non sicura
ja: 安全でないランダム度を使用しない
ko: 안전하지 않은 임의성 사용 안 함
pl: Nie używaj niezabezpieczonej losowości
pt_br: Não usar aleatoriedade não segura
ru: Не используйте небезопасные генераторы случайных чисел.
tr: Güvenli olmayan rastgelelik kullanmayın
zh_hans: 请勿使用不安全的随机性
zh_hant: 不要使用不安全的隨機性

# DoNotUseInsecureRandomnessDescription
source: Using a cryptographically weak pseudo-random number generator may allow an attacker to predict what security-sensitive value will be generated. Use a cryptographically strong random number generator if an unpredictable value is required, or ensure that weak pseudo-random numbers aren't used in a security-sensitive manner.
cs: Použití generátoru kryptograficky slabých pseudonáhodných čísel může útočníkovi umožnit předpovědět, jaká hodnota citlivá z hlediska zabezpečení se vygeneruje. Použijte generátor kryptograficky silných náhodných čísel, pokud se vyžaduje nepředvídatelná hodnota, nebo zajistěte, aby se slabá pseudonáhodná čísla nepoužívala způsobem citlivým z hlediska zabezpečení.
de: Bei Verwendung eines kryptografisch schwachen Pseudozufallszahlen-Generators kann ein Angreifer möglicherweise vorhersagen, welcher sicherheitsrelevante Wert generiert wird. Verwenden Sie einen kryptografisch starken Zufallszahlen-Generator, wenn ein nicht vorhersehbarer Wert erforderlich ist, oder stellen Sie sicher, dass schwache Pseudozufallszahlen nicht auf sicherheitsrelevante Weise verwendet werden.
es: El uso de un generador de números pseudoaleatorios no seguro criptográficamente puede permitir a un atacante predecir el valor relativo a la seguridad que se va a generar. Use un generador de números aleatorios fuertemente cifrado si se requiere un valor impredecible, o bien asegúrese de que no se usan números pseudoaleatorios poco seguros de forma que afecte a la seguridad.
fr: L'utilisation d'un générateur de nombres pseudo-aléatoires faibles au niveau du chiffrement peut permettre à un attaquant de prédire la génération d'une valeur dont la sécurité est critique. Utilisez un générateur de nombres aléatoires forts au niveau du chiffrement si une valeur imprévisible est nécessaire, ou vérifiez qu'aucun nombre pseudo-aléatoire faible n'est utilisé dans le cadre d'opérations dont la sécurité est critique.
it: L'uso di un generatore di numeri pseudo-casuali vulnerabile dal punto di vista della crittografia può consentire a un utente malintenzionato di prevedere il valore sensibile alla sicurezza che verrà generato. Se è richiesto un valore non prevedibile, usare un generatore di numeri casuali sicuro dal punto di vista della crittografia oppure assicurarsi che i numeri pseudo-casuali vulnerabili non vengano usati in modo sensibile per la sicurezza.
ja: 暗号強度の低い擬似乱数ジェネレーターを使用すると、セキュリティ上注意が必要などのような値が生成されるかを攻撃者が予測できる可能性があります。予測できない値が必要な場合は暗号強度の高い乱数ジェネレーターを使用するか、または暗号強度の低い擬似乱数がセキュリティ上注意が必要な形で使用されていないことを確認してください。
ko: 암호화가 약한 의사 난수 생성기를 사용하면 공격자가 생성되는 보안에 중요한 값을 예측할 수 있습니다. 예측 불가능한 값이 필요한 경우 암호화가 강한 난수 생성기를 사용하거나, 약한 의사 난수가 보안에 중요한 방식으로 사용되지 않도록 하세요.
pl: Użycie kryptograficznie słabego generatora liczb pseudolosowych może umożliwić osobie atakującej przewidzenie, jaka wartość wpływająca na zabezpieczenia zostanie wygenerowana. Użyj kryptograficznie silnego generatora liczb losowych, jeśli jest wymagana wartość niemożliwa do przewidzenia, lub upewnij się, że liczby pseudolosowe nie są używane w przypadku wartości wpływających na zabezpieczenia.
pt_br: O uso de um gerador de números pseudoaleatórios criptograficamente fracos pode permitir que um invasor preveja qual valor sensível à segurança será gerado. Use um gerador de números aleatórios criptograficamente fortes se for necessário um valor imprevisível ou garanta que os números pseudoaleatórios fracos não sejam usados de uma maneira sensível à segurança.
ru: Использование криптографически слабого генератора псевдослучайных чисел может позволить злоумышленнику предсказать, какое значение, важное для обеспечения безопасности, будет сформировано. Используйте криптографически надежный генератор случайных чисел, если требуется непрогнозируемое значение, или убедитесь, что слабые псевдослучайные числа не используются для обеспечения безопасности.
tr: Şifreleme açısından zayıf olan bir sözde rastgele sayı oluşturucu kullanılması, saldırganın, oluşturulacak güvenlik açısından hassas değeri tahmin etmesini sağlayabilir. Tahmin edilemeyen bir değer gerekiyorsa, şifreleme açısından güçlü bir rastgele sayı oluşturucu kullanın veya güvenlik gerektiren işlemlerde zayıf sözde rastgele sayıların kullanılmadığından emin olun.
zh_hans: 使用加密的弱伪随机数生成器，攻击者可以预测将生成的安全敏感值。如果需要不可预测的值，请使用加密的强随机数生成器，或确保不以安全敏感的方式使用弱伪随机数。
zh_hant: 使用密碼編譯弱式虛擬亂數產生器可能會讓攻擊者得以預測將要產生的安全性敏感性值。如果需要無法預測的值，或是要確保未以安全性敏感性方式使用弱式虛擬亂數時，請使用密碼編譯強式亂數產生器。
