Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotDefineFinalizersForTypesDerivedFromMemoryManagerDescription
source: Adding a finalizer to a type derived from MemoryManager<T> may permit memory to be freed while it is still in use by a Span<T>.
cs: Když se do typu odvozeného z MemoryManager<T> přidá finalizační metoda, může to umožnit, aby se paměť uvolnila i přesto, že ji stále používá typ Span<T>.
de: Durch das Hinzufügen eines Finalizers zu einem von MemoryManager<T> abgeleiteten Typ wird möglicherweise Arbeitsspeicher freigegeben, der noch von einem Span<T>-Element verwendet wird.
es: Agregar un finalizador a un tipo derivado de MemoryManager<T> puede permitir que se libere memoria mientras aún la esté usando un elemento Span<T>.
fr: L'ajout d'un finaliseur à un type dérivé de MemoryManager<T> peut permettre de libérer de la mémoire alors qu'elle est toujours utilisée par un Span<T>.
it: L'aggiunta di un finalizzatore a un tipo derivato da MemoryManager<T> consente di liberare memoria mentre viene ancora usata da un elemento Span<T>.
ja: MemoryManager<T> から派生した型にファイナライザーを追加すると、Span<T> によってまだ使用中のメモリが解放される可能性があります。
ko: MemoryManager<T>에서 파생된 형식에 종료자를 추가하면 Span<T>에서 여전히 메모리를 사용하는 동안 메모리 해제가 허용될 수 있습니다.
pl: Dodanie finalizatora do typu pochodzącego od typu MemoryManager<T> może umożliwić zwalnianie pamięci, gdy jest ona nadal używana przez typ Span<T>.
pt_br: Adicionar um finalizador a um tipo derivado de MemoryManager<T> pode permitir que a memória seja liberada enquanto ela ainda está em uso por um Span<T>.
ru: Добавление метода завершения в тип, производный от MemoryManager<T>, может привести к тому, что будет разрешено освобождение памяти, пока эта память еще используется Span<T>.
tr: MemoryManager<T> öğesinden türetilen bir türe sonlandırıcı eklenmesi, belleğin bir Span<T> tarafından hala kullanımdayken serbest bırakılmasına izin verebilir.
zh_hans: 将终结器添加到派生自 MemoryManager<T> 的类型可能使内存在仍被 Span<T> 使用时得到释放。
zh_hant: 將完成項新增到衍生自 MemoryManager<T> 的類型時，可能會允許在 Span<T> 仍在使用記憶體時，釋出該記憶體。

# DoNotDefineFinalizersForTypesDerivedFromMemoryManagerMessage
source: Adding a finalizer to a type derived from MemoryManager<T> may permit memory to be freed while it is still in use by a Span<T>
cs: Když se do typu odvozeného z MemoryManager<T> přidá finalizační metoda, může to umožnit, aby se paměť uvolnila i přesto, že ji stále používá typ Span<T>.
de: Durch das Hinzufügen eines Finalizers zu einem von MemoryManager<T> abgeleiteten Typ wird möglicherweise Arbeitsspeicher freigegeben, der noch von einem Span<T>-Element verwendet wird.
es: Agregar un finalizador a un tipo derivado de MemoryManager<T> puede permitir que se libere memoria mientras aún la esté usando un elemento Span<T>.
fr: L'ajout d'un finaliseur à un type dérivé de MemoryManager<T> peut permettre de libérer de la mémoire alors qu'elle est toujours utilisée par un Span<T>
it: L'aggiunta di un finalizzatore a un tipo derivato da MemoryManager<T> consente di liberare memoria mentre viene ancora usata da un elemento Span<T>
ja: MemoryManager<T> から派生した型にファイナライザーを追加すると、Span<T> によってまだ使用中のメモリが解放される可能性があります
ko: MemoryManager<T>에서 파생된 형식에 종료자를 추가하면 Span<T>에서 계속 메모리를 사용하는 동안 메모리 해제가 허용될 수 있습니다.
pl: Dodanie finalizatora do typu pochodzącego od typu MemoryManager<T> może umożliwić zwalnianie pamięci, gdy jest ona nadal używana przez typ Span<T>
pt_br: Adicionar um finalizador a um tipo derivado de MemoryManager<T> pode permitir que a memória seja liberada enquanto ela ainda está em uso por um Span<T>
ru: Добавление метода завершения в тип, производный от MemoryManager<T>, может привести к тому, что будет разрешено освобождение памяти, пока эта память еще используется Span<T>.
tr: MemoryManager<T> öğesinden türetilen bir türe sonlandırıcı eklenmesi, belleğin bir Span<T> tarafından hala kullanımdayken serbest bırakılmasına izin verebilir
zh_hans: 将终结器添加到派生自 MemoryManager<T> 的类型可能使内存在仍被 Span<T> 使用时得到释放
zh_hant: 將完成項新增到衍生自 MemoryManager<T> 的型別時，可能會在 Span<T> 仍在使用記憶體時，允許釋出該記憶體

# DoNotDefineFinalizersForTypesDerivedFromMemoryManagerTitle
source: Do not define finalizers for types derived from MemoryManager<T>
cs: Pro typy odvozené z MemoryManager<T> nedefinujte finalizační metody
de: Keine Finalizer für von MemoryManager<T> abgeleitete Typen definieren
es: No definir finalizadores para los tipos derivados de MemoryManager<T>
fr: Ne définissez pas de finaliseurs pour les types dérivés de MemoryManager<T>
it: Non definire finalizzatori per tipi derivati da MemoryManager<T>
ja: MemoryManager<T> から派生した型にはファイナライザーを定義しないでください
ko: MemoryManager<T>에서 파생된 형식에 대한 종료자 정의 금지
pl: Nie definiuj finalizatorów dla typów pochodzących od typu MemoryManager<T>
pt_br: Não definir finalizadores para tipos derivados do MemoryManager<T>
ru: Не определяйте методы завершения для типов, производных от MemoryManager<T>
tr: MemoryManager<T> öğesinden türetilen türler için sonlandırıcıları tanımlama
zh_hans: 请勿为派生自 MemoryManager<T> 的类型定义终结器
zh_hant: 請勿為衍生自 MemoryManager<T> 的類型定義完成項

source: Do Not Disable Certificate Validation
cs: Nezakazovat ověření certifikátu
de: Deaktivieren Sie die Zertifikatüberprüfung nicht
es: No deshabilitar la validación de certificado
fr: Ne pas désactiver la validation de certificat
it: Non disabilitare la convalida del certificato
ja: 証明書の検証を無効にしません
ko: 인증서 유효성 검사를 비활성화하지 않음
pl: Nie należy wyłączać walidacji certyfikatów
pt_br: Não Desabilitar Validação do Certificado
ru: Не отключайте проверку сертификатов
tr: Sertifika Doğrulamasını Devre Dışı Bırakma
zh_hans: 请勿禁用证书验证
zh_hant: 請勿停用憑證驗證

# DoNotDisableCertificateValidationDescription
source: A certificate can help authenticate the identity of the server. Clients should validate the server certificate to ensure requests are sent to the intended server. If the ServerCertificateValidationCallback always returns 'true', any certificate will pass validation.
cs: Certifikát může pomoci ověřit identitu serveru. Klienti by měli certifikát serveru ověřovat, aby měli jistotu, že se požadavky odesílají na zamýšlený server. Pokud ServerCertificateValidationCallback vždy vrátí hodnotu true, projde ověřením jakýkoliv certifikát.
de: Mithilfe von Zertifikaten können Sie die Identität des Servers authentifizieren. Clients sollten das Serverzertifikat überprüfen, um sicherzustellen, dass die Anforderungen an den richtigen Server gesendet werden. Wenn die Eigenschaft "ServerCertificateValidationCallback" immer "true" zurückgibt, werden alle Zertifikate als gültig eingestuft.
es: Un certificado puede ayudar a autenticar la identidad del servidor. Los clientes deben validar el certificado del servidor para asegurarse de que las solicitudes se envían al servidor elegido. Si ServerCertificateValidationCallback devuelve siempre el valor "true", cualquier certificado pasará la validación.
fr: Un certificat peut vous aider à authentifier l'identité du serveur. Les clients doivent valider le certificat de serveur pour garantir que les demandes sont envoyées au serveur souhaité. Si ServerCertificateValidationCallback retourne toujours 'true', tous les certificats sont validés.
it: Un certificato può agevolare l'autenticazione dell'identità del server. I client dovrebbero convalidare il certificato del server per assicurarsi che le richieste vengano inviate al server previsto. Se ServerCertificateValidationCallback restituisce sempre 'true', qualsiasi certificato supererà la convalida.
ja: 証明書を使用すると、サーバーの ID を認証できます。クライアントは、サーバー証明書を検証し、要求が意図したとおりのサーバーに送信されるようにする必要があります。ServerCertificateValidationCallback が常時 'true' を返す場合、すべての証明書が検証に成功します。
ko: 인증서는 서버의 ID를 인증하는 데 도움이 될 수 있습니다. 클라이언트가 요청을 원하는 서버에 보내려면 서버 인증서의 유효성을 검사해야 합니다. ServerCertificateValidationCallback이 항상 'true'를 반환하는 경우 모든 인증서가 유효성 검사를 통과합니다.
pl: Certyfikat może pomóc uwierzytelnić tożsamość serwera. Klienci powinni weryfikować certyfikat serwera, aby upewnić się, że żądania są wysyłane do odpowiedniego serwera. Jeśli element ServerCertificateValidationCallback zawsze zwraca wartość „true”, walidacja każdego certyfikatu zakończy się powodzeniem.
pt_br: Um certificado pode ajudar a autenticar a identidade do servidor. Os clientes devem validar o certificado do servidor para garantir que as solicitações são enviadas para o servidor pretendido. Se o ServerCertificateValidationCallback sempre retorna 'true', qualquer certificado irá passar a validação.
ru: Сертификат может помочь подлинность сервера. Клиенты должны проверять сертификаты серверов, чтобы убедиться, что запросы отправляются нужному серверу. Если функция ServerCertificateValidationCallback всегда возвращает значение true, сертификат всегда успешно проходит проверку.
tr: Bir sertifika sunucunun kimliğini doğrulamaya yardımcı olabilir. İstemciler, isteklerin doğru sunucuya gönderildiğinden emin olmak için sunucu sertifikasını doğrulamalıdır. ServerCertificateValidationCallback her zaman 'true' döndürüyorsa, tüm sertifikalar doğrulamayı geçer.
zh_hans: 证书可以帮助认证服务器的身份。客户端应该验证服务器的证书，以确保将请求发送到预期的服务器。如果 ServerCertificateValidationCallback 始终返回 "true"，那么任何证书都将通过验证。
zh_hant: 憑證可協助驗證伺服器的身分識別。用戶端應該驗證伺服器憑證來確保要求會傳送到正確的伺服器。如果 ServerCertificateValidationCallback 一律傳回 'true'，則所有憑證都會通過驗證。

# DoNotDisableCertificateValidationMessage
source: The ServerCertificateValidationCallback is set to a function that accepts any server certificate, by always returning true. Ensure that server certificates are validated to verify the identity of the server receiving requests.
cs: Vlastnost ServerCertificateValidationCallback je nastavená na funkci, která přijímá libovolný certifikát serveru, protože vždy vrací hodnotu true. Dbejte na to, aby se certifikáty serverů ověřovaly a měli jste jistotu o identitě serveru přijímajícího požadavky.
de: Die ServerCertificateValidationCallback-Eigenschaft wurde auf eine Funktion festgelegt, die alle Serverzertifikate akzeptiert, indem immer "true" zurückgegeben wird. Stellen Sie sicher, dass die Serverzertifikate darauf ausgelegt sind, die Identität des Servers zu überprüfen, der Anforderungen erhält.
es: ServerCertificateValidationCallback está establecido en una función que acepta cualquier certificado de servidor, devolviendo siempre el valor "true". Asegúrese de que los certificados de servidor estén validados para verificar la identidad del servidor que recibe las peticiones.
fr: ServerCertificateValidationCallback est défini sur une fonction qui accepte n'importe quel certificat de serveur en retournant toujours la valeur true. Veillez à ce que ces certificats de serveur soient validés pour vérifier l'identité du serveur qui reçoit les demandes.
it: ServerCertificateValidationCallback è impostato su una funzione che accetta qualsiasi certificato del server, restituendo sempre true. Assicurarsi che i certificati del server siano convalidati per verificare l'identità del server che riceve le richieste.
ja: ServerCertificateValidationCallback は、常時 true を返すことによってあらゆるサーバー証明書を受け入れる関数に設定されます。要求を受信するサーバーの ID を確認するサーバー証明書が検証されるようにします。
ko: ServerCertificateValidationCallback은 항상 true를 반환하여 서버 인증서를 허용하는 함수로 설정되어 있습니다. 서버 인증서의 유효성을 검사하여 요청을 받는 서버의 ID를 확인해야 합니다.
pl: Właściwość zestawu ServerCertificateValidationCallback została ustawiona na funkcję, która akceptuje dowolny certyfikat serwera, zawsze zwracając wartość true. Upewnij się, że certyfikaty serwera zostały walidowane, aby zweryfikować tożsamość serwera odbierającego żądania.
pt_br: O ServerCertificateValidationCallback é definido como uma função que aceita qualquer certificado de servidor, retornando sempre true. Certifique-se de que os certificados de servidor são validados para verificar a identidade do servidor de recebimento de pedidos.
ru: В качестве значения параметра ServerCertificateValidationCallback задается функция, которая принимает любой сертификат сервера, всегда возвращая значение true. Убедитесь, что сертификаты серверов проверяются, чтобы подтвердить подлинность сервера, принимающего запросы.
tr: ServerCertificateValidationCallback, her zaman true döndürerek tüm sunucu sertifikatarını kabul eden bir işleve ayarlanmış. Sunucu sertifikalarının istekleri alan sunucunun kimliğini doğrulamak için doğrulandığından emin olun.
zh_hans: 已将 ServerCertificateValidationCallback 设置为通过始终返回 true 来接受任何服务器证书的一个函数。请确保服务器证书已经过验证，从而验证要接收请求的服务器的标识。
zh_hant: ServerCertificateValidationCallback 已設定為會一律傳回 true 來接受所有伺服器憑證的函式。請確保伺服器憑證經過驗證，以驗證收到要求之伺服器的身分識別。

source: Do Not Disable HTTP Header Checking
cs: Nezakazovat kontrolu hlaviček HTTP
de: Deaktivieren Sie nicht die Überprüfung von HTTP-Headern.
es: No deshabilitar la comprobación de encabezados HTTP
fr: Ne pas désactiver la vérification d'en-tête HTTP
it: Non disabilitare il controllo delle intestazioni HTTP
ja: HTTP ヘッダーのチェックを無効にしない
ko: HTTP 헤더 검사를 사용하지 않도록 설정하지 마세요.
pl: Nie wyłączaj sprawdzania nagłówka HTTP
pt_br: Não Desabilite a Verificação de Cabeçalho HTTP
ru: Не отключайте проверку заголовков HTTP
tr: HTTP Üst Bilgisi Denetlemeyi Devre Dışı Bırakmayın
zh_hans: 请勿禁用 HTTP 标头检查
zh_hant: 請勿停用 HTTP 標頭檢查

# DoNotDisableHTTPHeaderCheckingDescription
source: HTTP header checking enables encoding of the carriage return and newline characters, \r and \n, that are found in response headers. This encoding can help to avoid injection attacks that exploit an application that echoes untrusted data contained by the header.
cs: Kontrola hlaviček HTTP umožňuje kódovat znaky návratu na začátek řádku a nového řádku \r a \n, které se nacházejí v hlavičkách odpovědí. Toto kódování může pomoct při prevenci útoků injektáží, které zneužívají aplikaci, která vypisuje nedůvěryhodná data obsažená v hlavičce.
de: Durch die Überprüfung von HTTP-Headern wird die Codierung der Wagenrücklauf- und Zeilenumbruchzeichen (\r und \n) ermöglicht, die im Antwortheader enthalten sind. Durch diese Codierung können Angriffe durch Einschleusung von Befehlen vermieden werden, bei denen eine Anwendung ausgenutzt wird, die nicht vertrauenswürdige, im Header enthaltene Daten zurückgibt.
es: La comprobación de encabezados HTTP habilita la codificación de los caracteres de retorno de carro y nueva línea, \r y \n, que se encuentran en los encabezados de respuesta. Esta codificación puede ayudar a evitar los ataques por inyección que aprovecha una aplicación que repite datos que no son de confianza incluidos en el encabezado.
fr: La vérification d'en-tête HTTP active l'encodage des caractères de type retour chariot et nouvelle ligne, \r et \n, présents dans les en-têtes de réponse. Cet encodage permet d'éviter les attaques par injection qui exploitent les failles de sécurité d'une application quand celle-ci retransmet des données non fiables contenues dans l'en-tête.
it: Il controllo delle intestazioni HTTP consente di abilitare la codifica dei caratteri di ritorno a capo e nuova riga, \r e \n, presenti nelle intestazioni di risposta. Questa codifica consente di evitare attacchi di tipo injection che possono sfruttare un'applicazione che include nell'eco dati attendibili contenuti nell'intestazione.
ja: HTTP ヘッダーのチェックでは、応答ヘッダーに含まれる復帰や改行文字のエンコードを有効にします。\r\nこのエンコードは、ヘッダーに含まれる信頼されていないデータをエコーするアプリケーションを悪用するインジェクション攻撃を回避するのに役立ちます。
ko: HTTP 헤더 검사를 사용하면 응답 헤더에 있는 캐리지 리턴 및 줄 바꿈 문자 \r 및 \n을 인코딩할 수 있습니다. 이 인코딩을 수행하면 헤더에 포함된 신뢰할 수 없는 데이터를 에코하는 애플리케이션을 악용하는 삽입 공격을 방지할 수 있습니다.
pl: Sprawdzanie nagłówka HTTP umożliwia kodowanie znaków powrotu karetki i nowego wiersza, \r i \n, które znajdują się w nagłówkach odpowiedzi. To kodowanie może pomóc uniknąć ataków polegających na wstrzyknięciu kodu, które wykorzystują aplikację przekazującą niezaufane dane zawarte w nagłówku.
pt_br: A verificando de cabeçalho HTTP habilita a codificação dos caracteres de nova linha e de retorno de carro, \r e \n, que se encontram em cabeçalhos de resposta. Essa codificação pode ajudar a evitar ataques de injeção que exploram um aplicativo que ecoa dados não confiáveis contidos no cabeçalho.
ru: Проверка заголовков HTTP позволяет кодировать символы возврата каретки и новой строки \r и \n, находящиеся в заголовках ответов. Такая кодировка позволяет избежать атак путем внедрения, использующих приложение, которое возвращает ненадежные данные из заголовка.
tr: HTTP üst bilgisi denetleme, yanıt üst bilgilerinde bulunan satır başı ve yeni satır karakterlerinin (\r ve \n) kodlamasını sağlar. Bu kodlama, üst bilginin içerdiği güvenilmeyen verileri yansıtan bi uygulamanın açıklarından yararlanan ekleme saldırılarını önlemeye yardımcı olabilir.
zh_hans: HTTP 标头检查可对在响应标头中找到的回车和换行符(\r 和 \n)进行编码。这种编码有助于避免注入攻击，此类攻击会利用应答标头包含的不受信任数据的应用程序。
zh_hant: 利用 HTTP 標頭檢查可編碼回應標頭中所發現的歸位字元與換行字元 (\r 與 \n)。此編碼方式有助於避開插入式攻擊，這類攻擊會惡意探索應用程式是否會回應標頭所包含的不受信任資料。

# DoNotDisableHTTPHeaderCheckingMessage
source: Do not disable HTTP header checking
cs: Nezakazovat kontrolu hlaviček HTTP
de: Deaktivieren Sie nicht die Überprüfung von HTTP-Headern.
es: No deshabilitar la comprobación de encabezados HTTP
fr: Ne pas désactiver la vérification d'en-tête HTTP
it: Non disabilitare il controllo delle intestazioni HTTP
ja: HTTP ヘッダーのチェックを無効にしない
ko: HTTP 헤더 검사를 사용하지 않도록 설정하지 마세요.
pl: Nie wyłączaj sprawdzania nagłówków HTTP
pt_br: Não desabilite a verificação de cabeçalho HTTP
ru: Не отключайте проверку заголовков HTTP
tr: HTTP üst bilgisi denetlemeyi devre dışı bırakmayın
zh_hans: 请勿禁用 HTTP 标头检查
zh_hant: 請勿停用 HTTP 標頭檢查

# DoNotDisableHttpClientCRLCheckDescription
source: Using HttpClient without providing a platform specific handler (WinHttpHandler or CurlHandler or HttpClientHandler) where the CheckCertificateRevocationList property is set to true, will allow revoked certificates to be accepted by the HttpClient as valid.
cs: Použití třídy HttpClient bez poskytnutí obslužné rutiny specifické pro platformu (WinHttpHandler nebo CurlHandler nebo HttpClientHandler), kde je vlastnost CheckCertificateRevocationList nastavena na hodnotu true, umožní přijmout odvolané certifikáty třídou HttpClient jako platné.
de: Die Verwendung von HttpClient ohne Bereitstellen eines plattformspezifischen Handlers (WinHttpHandler, CurlHandler oder HttpClientHandler), bei dem die CheckCertificateRevocationList-Eigenschaft auf TRUE festgelegt ist, ermöglicht, dass gesperrte Zertifikate vom HttpClient als gültig akzeptiert werden.
es: Si se usa HttpClient sin proporcionar un controlador específico de la plataforma (WinHttpHandler, CurlHandler o HttpClientHandler), donde la propiedad CheckCertificateRevocationList se establece en true, se permitirá que HttpClient acepte los certificados revocados como válidos.
fr: L'utilisation de HttpClient sans fournir de gestionnaire spécifique à la plateforme (WinHttpHandler ou CurlHandler ou HttpClientHandler), où la propriété CheckCertificateRevocationList a la valeur true, permet aux certificats révoqués d'être acceptés par HttpClient comme valides.
it: Se si usa HttpClient senza fornire un gestore specifico della piattaforma (WinHttpHandler, CurlHandler o HttpClientHandler) in cui la proprietà CheckCertificateRevocationList è impostata su true, i certificati revocati verranno accettati come validi da HttpClient.
ja: CheckCertificateRevocationList プロパティが true に設定されている場合、プラットフォーム固有のハンドラー (WinHttpHandler、CurlHandler、HttpClientHandler のいずれか) を指定せずに HttpClient を使用すると、失効した証明書が有効な証明書として HttpClient に受け入れられます。
ko: CheckCertificateRevocationList 속성이 true로 설정된 플랫폼별 처리기(WinHttpHandler 또는 CurlHandler 또는 HttpClientHandler)를 제공하지 않고 HttpClient를 사용하면 해지된 인증서를 HttpClient에서 유효한 것으로 사용할 수 있도록 허용합니다.
pl: Używanie programu HttpClient bez udostępnienia procedury obsługi specyficznej dla platformy (WinHttpHandler, CurlHandler lub HttpClientHandler), gdzie właściwość CheckCertificateRevocationList jest ustawiona na wartość true, zezwoli na akceptowanie odwołanych certyfikatów jako prawidłowe przez ten program.
pt_br: Usar HttpClient sem fornecer um manipulador específico de plataforma (WinHttpHandler ou CurlHandler ou HttpClientHandler) em que a propriedade CheckCertificateRevocationList está definida como true permitirá que os certificados revogados sejam aceitos pelo HttpClient como válidos.
ru: Если при использовании HttpClient не указан обработчик для конкретной платформы (WinHttpHandler, CurlHandler или HttpClientHandler) и свойство CheckCertificateRevocationList имеет значение true (истина), то отозванные сертификаты будут приниматься клиентом HttpClient как действительные.
tr: CheckCertificateRevocationList özelliğinin true olarak ayarlandığı, platforma özel bir işleyici (WinHttpHandler veya CurlHandler veya HttpClientHandler) sağlamadan HttpClient kullanmak, iptal edilen sertifikaların HttpClient tarafından geçerli olarak kabul edilmesine olanak sağlar.
zh_hans: 将 CheckCertificateRevocationList 属性设置为 true 时，如果使用 HttpClient 而不提供特定于平台的处理程序(WinHttpHandler、CurlHandler 或 HttpClientHandler)，则将允许 HttpClient 将被吊销的证书作为有效证书接受。
zh_hant: 當 CheckCertificateRevocationList 屬性設為 true 時，使用 HttpClient 而不提供平台特定處理常式 (WinHttpHandler 或 CurlHandler 或 HttpClientHandler)，將允許 HttpClient 接受已撤銷的憑證為有效。

source: Do Not Disable Request Validation
cs: Nezakazovat ověřování požadavků
de: Deaktivieren Sie nicht die Anforderungsüberprüfung.
es: No deshabilitar la validación de solicitudes
fr: Ne pas désactiver la validation de requête
it: Non disabilitare la convalida delle richieste
ja: 要求の検証を無効にしない
ko: 요청 유효성 검사를 사용하지 않도록 설정하지 마세요.
pl: Nie wyłączaj weryfikacji żądań
pt_br: Não Desabilite a Validação de Solicitação
ru: Не отключайте проверку запросов
tr: İstek Doğrulamayı Devre Dışı Bırakmayın
zh_hans: 请勿禁用请求验证
zh_hant: 請勿停用要求驗證
