Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DataSetDataTableInRceDeserializableObjectGraphMessage
source: When deserializing untrusted input, deserializing a {0} object is insecure. '{1}' either is or derives from {0}
cs: Při deserializaci nedůvěryhodného vstupu není deserializace objektu {0} bezpečná. Objekt {1} je buď objektem {0}, nebo je z tohoto objektu odvozený.
de: Beim Deserialisieren einer nicht vertrauenswürdigen Eingabe ist die Deserialisierung eines {0}-Objekts unsicher. "{1}" ist entweder "{0}" oder davon abgeleitet.
es: Cuando se deserializa una entrada que no es de confianza, no es segura la deserialización de un objeto {0}. "{1}" es {0} o se deriva de este.
fr: Quand vous désérialisez une entrée non fiable, la désérialisation d'un objet {0} n'est pas une action sécurisée. '{1}' est égal à ou dérive de {0}
it: Quando si deserializza input non attendibile, la deserializzazione di un oggetto {0} non è sicura. '{1}' è {0} o deriva da esso
ja: 信頼されていない入力を逆シリアル化する場合、{0} オブジェクトの逆シリアル化は安全ではありません。'{1}' は {0} であるか、それから派生しています
ko: 신뢰할 수 없는 입력을 역직렬화하는 경우 {0} 개체를 역직렬화하는 것은 안전하지 않습니다. '{1}'은(는) {0}이거나 이 항목에서 파생됩니다.
pl: Deserializowanie obiektu {0} podczas deserializacji niezaufanych danych wejściowych nie jest bezpieczne. Element „{1}” jest elementem {0} lub pochodzi od niego
pt_br: Ao desserializar uma entrada não confiável, a desserialização de um objeto {0} não é segura. '{1}' é {0} ou deriva-se dele
ru: При десериализации недоверенных входных данных десериализация объекта {0} является небезопасной. Объект "{1}" является объектом {0} или производным от него объектом.
tr: Güvenilmeyen giriş seri durumdan çıkarılırken, {0} nesnesinin seri durumdan çıkarılması güvenli değildir. '{1}', {0} nesnesidir veya bu nesneden türetilmiştir
zh_hans: 对不受信任的输入进行反序列化处理时，反序列化 {0} 对象是不安全的。“{1}”是或派生自 {0}
zh_hant: 還原序列化不受信任的輸入時，將 {0} 物件還原序列化並不安全。'{1}' 屬於或衍生自 {0}

# DataSetDataTableInRceDeserializableObjectGraphTitle
source: Unsafe DataSet or DataTable in deserialized object graph can be vulnerable to remote code execution attacks
cs: Nebezpečné DataSet nebo DataTable v grafu deserializovaných objektů můžou být ohrožené útoky spuštěním vzdáleného kódu
de: Ein unsicherer DataSet- oder DataTable-Typ in einem deserialisierten Objektgraph kann für Angriffe durch Remotecodeausführung anfällig sein
es: Un elemento DataSet o DataTable no seguro en un gráfico de objetos deserializados puede ser vulnerable a ataques de ejecución remota de código
fr: Un DataSet ou DataTable non sécurisé dans un graphe d'objets désérialisé peut être vulnérable aux attaques par exécution de code à distance
it: L'oggetto DataSet o DataTable non sicuro nel grafico di oggetti deserializzato può essere vulnerabile ad attacchi di tipo esecuzione di codice remoto
ja: 逆シリアル化されたオブジェクト グラフに含まれる安全でない DataSet または DataTable は、リモート コード実行攻撃に対して脆弱になる可能性があります
ko: 역직렬화된 개체 그래프의 안전하지 않은 DataSet 또는 DataTable은 원격 코드 실행 공격에 취약할 수 있음
pl: Niebezpieczny element DataSet lub DataTable w zdeserializowanym wykresie obiektu może być narażony na ataki polegające na zdalnym wykonaniu kodu
pt_br: Um DataSet ou uma DataTable não segura em um grafo de objetos desserilizado pode ser vulnerável a ataques de execução de código remota
ru: Небезопасный набор данных или небезопасная таблица данных на графе десериализуемого объекта могут быть подвержены атакам методом удаленного выполнения кода
tr: Seri durumdan çıkarılan nesne grafındaki güvenli olmayan DataSet veya DataTable, uzaktan kod yürütme saldırılarına karşı savunmasız olabilir
zh_hans: 已反序列化的对象图中不安全的数据集或数据表可能易受远程代码执行攻击
zh_hant: 還原序列化後之物件圖表中的 Unsafe DataSet 或 DataTable 容易受到遠端程式碼執行攻擊

# DataSetDataTableInRceSerializableTypeMessage
source: When deserializing untrusted input with an IFormatter-based serializer, deserializing a {0} object is insecure. '{1}' either is or derives from {0}.
cs: Při deserializaci nedůvěryhodného vstupu pomocí serializátoru založeného na rozhraní IFormatter není deserializace objektu {0} bezpečná. Objekt {1} je buď objektem {0}, nebo je z tohoto objektu odvozený.
de: Beim Deserialisieren nicht vertrauenswürdiger Eingaben mit einem IFormatter-basierten Serialisierungsmodul ist die Deserialisierung eines {0}-Objekts unsicher. "{1}" ist entweder "{0}" oder davon abgeleitet.
es: Al deserializar la entrada que no es de confianza con un serializador basado en IFormatter, la deserialización de un objeto {0} no es segura. "{1}" es {0} o se deriva de él.
fr: Quand vous désérialisez une entrée non fiable avec un sérialiseur basé sur IFormatter, la désérialisation d'un objet {0} n'est pas une action sécurisée. '{1}' est égal à ou dérive de {0}.
it: Quando si deserializza input non attendibile con un serializzatore basato su IFormatter, la deserializzazione di un oggetto {0} non è sicura. '{1}' è {0} o deriva da esso.
ja: IFormatter ベースのシリアライザーを使用して信頼されていない入力を逆シリアル化する場合、{0} オブジェクトの逆シリアル化は安全ではありません。'{1}' は {0} であるか、それから派生しています。
ko: IFormatter 기반 직렬 변환기를 사용하여 신뢰할 수 없는 입력을 역직렬화하는 경우 {0} 개체를 역직렬화하는 것은 안전하지 않습니다. '{1}'은(는) {0}이거나 이 항목에서 파생됩니다.
pl: Deserializowanie obiektu {0} podczas deserializacji niezaufanych danych wejściowych przy użyciu serializatora opartego na interfejsie IFormatter nie jest bezpieczne. Element „{1}” jest elementem {0} lub pochodzi od niego.
pt_br: Ao desserializar uma entrada não confiável com um serializador baseado no IFormatter, a desserialização de um objeto {0} não é segura. '{1}' é {0} ou deriva-se dele.
ru: При десериализации недоверенных входных данных с сериализатором на основе IFormatter десериализация объекта {0} является небезопасной. "{1}" является {0} или производным от него.
tr: IFormatter tabanlı seri hale getirici ile güvenilmeyen giriş seri durumdan çıkarılırken {0} nesnesinin seri durumdan çıkarılması güvenli değildir. '{1}', {0} öğesidir veya bu öğeden türemiştir.
zh_hans: 在使用基于 IFormatter 的序列化程序来反序列化不受信任的输入时，反序列化 {0} 对象是不安全的。“{1}”是或派生自 {0}。
zh_hant: 當使用採用 IFormatter 之序列化程式還原序列化不信任的輸入時，將 {0} 物件還原序列化並不安全。'{1}' 屬於或衍生自 {0}。

# DataSetDataTableInRceSerializableTypeTitle
source: Unsafe DataSet or DataTable in serializable type can be vulnerable to remote code execution attacks
cs: Nebezpečné DataSet nebo DataTable v serializovatelném typu můžou být ohrožené útoky spuštěním vzdáleného kódu
de: Ein unsicheres DataSet- oder DataTable-Element in einem serialisierbaren Typ kann für Angriffe durch Remotecodeausführung anfällig sein
es: Un elemento DataSet o DataTable no seguro en un tipo serializable puede ser vulnerable a ataques de ejecución remota de código
fr: Un DataSet ou DataTable non sécurisé dans un type sérialisable peut être vulnérable aux attaques par exécution de code à distance
it: L'oggetto DataSet o DataTable non sicuro nel tipo serializzabile può essere vulnerabile ad attacchi di tipo esecuzione di codice remoto
ja: シリアル化可能な型に含まれる安全でない DataSet または DataTable は、リモート コード実行攻撃に対して脆弱になる可能性があります
ko: 직렬화 가능한 형식의 안전하지 않은 DataSet 또는 DataTable은 원격 코드 실행 공격에 취약할 수 있음
pl: Niebezpieczny element DataSet lub DataTable w typie, który można serializować, może być narażony na ataki polegające na zdalnym wykonaniu kodu
pt_br: Um DataSet ou uma DataTable não segura em um tipo serializável pode ser vulnerável a ataques de execução de código remota
ru: Небезопасный набор данных или небезопасная таблица данных в сериализуемом типе могут быть подвержены атакам методом удаленного выполнения кода
tr: Seri hale getirilebilir türdeki güvenli olmayan DataSet veya DataTable, uzaktan kod yürütme saldırılarına karşı savunmasız olabilir
zh_hans: 可序列化类型中不安全的数据集或数据表易受远程代码执行攻击
zh_hant: 可序列化類型中不安全的 DataSet 或 DataTable 容易受到遠端程式碼執行攻擊

# DataSetDataTableInSerializableTypeMessage
source: When deserializing untrusted input, deserializing a {0} object is insecure. '{1}' either is or derives from {0}
cs: Při deserializaci nedůvěryhodného vstupu není deserializace objektu {0} bezpečná. Objekt {1} je buď objektem {0}, nebo je z tohoto objektu odvozený.
de: Beim Deserialisieren einer nicht vertrauenswürdigen Eingabe ist die Deserialisierung eines {0}-Objekts unsicher. "{1}" ist entweder "{0}" oder davon abgeleitet.
es: Cuando se deserializa una entrada que no es de confianza, no es segura la deserialización de un objeto {0}. "{1}" es {0} o se deriva de este.
fr: Quand vous désérialisez une entrée non fiable, la désérialisation d'un objet {0} n'est pas une action sécurisée. '{1}' est égal à ou dérive de {0}
it: Quando si deserializza input non attendibile, la deserializzazione di un oggetto {0} non è sicura. '{1}' è {0} o deriva da esso
ja: 信頼されていない入力を逆シリアル化する場合、{0} オブジェクトの逆シリアル化は安全ではありません。'{1}' は {0} であるか、それから派生しています
ko: 신뢰할 수 없는 입력을 역직렬화하는 경우 {0} 개체를 역직렬화하는 것은 안전하지 않습니다. '{1}'은(는) {0}이거나 이 항목에서 파생됩니다.
pl: Deserializowanie obiektu {0} podczas deserializacji niezaufanych danych wejściowych nie jest bezpieczne. Element „{1}” jest elementem {0} lub pochodzi od niego
pt_br: Ao desserializar uma entrada não confiável, a desserialização de um objeto {0} não é segura. '{1}' é {0} ou deriva-se dele
ru: При десериализации недоверенных входных данных десериализация объекта {0} является небезопасной. Объект "{1}" является объектом {0} или производным от него объектом.
tr: Güvenilmeyen giriş seri durumdan çıkarılırken, {0} nesnesinin seri durumdan çıkarılması güvenli değildir. '{1}', {0} nesnesidir veya bu nesneden türetilmiştir
zh_hans: 对不受信任的输入进行反序列化处理时，反序列化 {0} 对象是不安全的。“{1}”是或派生自 {0}
zh_hant: 還原序列化不受信任的輸入時，將 {0} 物件還原序列化並不安全。'{1}' 屬於或衍生自 {0}

# DataSetDataTableInSerializableTypeTitle
source: Unsafe DataSet or DataTable in serializable type
cs: Nebezpečné DataSet nebo DataTable v serializovatelném typu
de: Unsicheres DataSet oder unsichere DataTable in serialisierbarem Typ
es: Elemento DataSet o DataTable no seguro en un tipo serializable
fr: DataSet ou DataTable non sécurisé dans un type sérialisable
it: Oggetto DataSet o DataTable non sicuro nel tipo serializzabile
ja: シリアル化可能な型に含まれる安全でない DataSet または DataTable
ko: 직렬화 가능한 형식의 안전하지 않은 DataSet 또는 DataTable
pl: Niebezpieczny element DataSet lub DataTable w typie, który można serializować
pt_br: DataSet ou DataTable não segura em um tipo serializável
ru: Небезопасный набор данных или небезопасная таблица данных в сериализуемом типе
tr: Seri hale getirilebilir türdeki güvenli olmayan DataSet veya DataTable
zh_hans: 可序列化类型中不安全的数据集或数据表
zh_hant: 可序列化類型中不安全的 DataSet 或 DataTable

# DataSetDataTableInWebDeserializableObjectGraphMessage
source: When deserializing untrusted input, deserializing a {0} object is insecure. '{1}' either is or derives from {0}
cs: Při deserializaci nedůvěryhodného vstupu není deserializace objektu {0} bezpečná. Objekt {1} je buď objektem {0}, nebo je z tohoto objektu odvozený.
de: Beim Deserialisieren einer nicht vertrauenswürdigen Eingabe ist die Deserialisierung eines {0}-Objekts unsicher. "{1}" ist entweder "{0}" oder davon abgeleitet.
es: Cuando se deserializa una entrada que no es de confianza, no es segura la deserialización de un objeto {0}. "{1}" es {0} o se deriva de este.
fr: Quand vous désérialisez une entrée non fiable, la désérialisation d'un objet {0} n'est pas une action sécurisée. '{1}' est égal à ou dérive de {0}
it: Quando si deserializza input non attendibile, la deserializzazione di un oggetto {0} non è sicura. '{1}' è {0} o deriva da esso
ja: 信頼されていない入力を逆シリアル化する場合、{0} オブジェクトの逆シリアル化は安全ではありません。'{1}' は {0} であるか、それから派生しています
ko: 신뢰할 수 없는 입력을 역직렬화하는 경우 {0} 개체를 역직렬화하는 것은 안전하지 않습니다. '{1}'은(는) {0}이거나 이 항목에서 파생됩니다.
pl: Deserializowanie obiektu {0} podczas deserializacji niezaufanych danych wejściowych nie jest bezpieczne. Element „{1}” jest elementem {0} lub pochodzi od niego
pt_br: Ao desserializar uma entrada não confiável, a desserialização de um objeto {0} não é segura. '{1}' é {0} ou deriva-se dele
ru: При десериализации недоверенных входных данных десериализация объекта {0} является небезопасной. Объект "{1}" является объектом {0} или производным от него объектом.
tr: Güvenilmeyen giriş seri durumdan çıkarılırken, {0} nesnesinin seri durumdan çıkarılması güvenli değildir. '{1}', {0} nesnesidir veya bu nesneden türetilmiştir
zh_hans: 对不受信任的输入进行反序列化处理时，反序列化 {0} 对象是不安全的。“{1}”是或派生自 {0}
zh_hant: 還原序列化不受信任的輸入時，將 {0} 物件還原序列化並不安全。'{1}' 屬於或衍生自 {0}

# DataSetDataTableInWebDeserializableObjectGraphTitle
source: Unsafe DataSet or DataTable type in web deserializable object graph
cs: V grafu deserializovatelných objektů webu je nebezpečný typ DataSet nebo DataTable
de: Unsicherer DataSet- oder DataTable-Typ in webserialisiertem Objektgraph
es: Tipo DataSet o DataTable no seguro en el gráfico de objetos deserializables web
fr: Type DataSet ou DataTable non sécurisé trouvé dans un graphe d'objets désérialisable web
it: Tipo DataSet o DataTable non sicuro nel grafico di oggetti deserializzabile Web
ja: Web の逆シリアル化可能なオブジェクト グラフに含まれる安全でない DataSet または DataTable 型
ko: 웹 역직렬화 가능한 개체 그래프의 안전하지 않은 DataSet 또는 DataTable 형식
pl: W internetowym wykresie obiektu, który można deserializować, znaleziono niebezpieczny typ DataSet lub DataTable
pt_br: Tipo DataSet ou DataTable não seguro no grafo de objetos desserializável da Web
ru: Небезопасный набор данных или небезопасная таблица данных на графе десериализуемого объекта
tr: Web'de seri durumdan çıkarılabilir nesne grafındaki güvenli olmayan DataSet veya DataTable türü
zh_hans: Web 可反序列化对象图中的不安全数据集或数据表类型
zh_hant: 可還原序列化之物件圖形中不安全的 DataSet 或 DataTable 類型

# DataSetReadXmlAutogeneratedMessage
source: The method '{0}' is insecure when deserializing untrusted data. Make sure that auto-generated class containing the '{0}' call is not deserialized with untrusted data.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná. Zajistěte, aby automaticky generovaná třída obsahující volání {0} nebyla deserializovaná s nedůvěryhodnými daty.
de: Die Methode "{0}" ist beim Deserialisieren nicht vertrauenswürdiger Daten unsicher. Stellen Sie sicher, dass die automatisch generierte Klasse, die den {0}-Aufruf enthält, ausschließlich mit vertrauenswürdigen Daten deserialisiert wird.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza. Asegúrese de que la clase autogenerada que contiene la llamada a "{0}" no se deserialice con dicho tipo de datos.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables. Vérifiez que la classe générée automatiquement contenant l'appel '{0}' n'est pas désérialisée avec des données non fiables.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili. Assicurarsi che la classe generata automaticamente che contiene la chiamata '{0}' non venga deserializzata con dati non attendibili.
ja: メソッド '{0}' は、信頼されていないデータを逆シリアル化しているときは安全ではありません。'{0}' 呼び出しを含む自動生成クラスが、信頼されていないデータで逆シリアル化されていないことを確認してください。
ko: 신뢰할 수 없는 데이터를 역직렬화하는 경우 '{0}' 메서드는 안전하지 않습니다. '{0}' 호출을 포함하는 자동 생성된 클래스가 신뢰할 수 없는 데이터로 역직렬화되지 않도록 하세요.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych. Upewnij się, że automatycznie wygenerowana klasa zawierająca wywołanie „{0}” nie jest deserializowana za pomocą niezaufanych danych.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis. Verifique se a classe gerada automaticamente que contém a chamada '{0}' não foi desserializada usando dados não confiáveis.
ru: Метод "{0}" является небезопасным при десериализации недоверенных данных. Убедитесь, что автоматически создаваемый класс, содержащий вызов "{0}", не десериализуется с недоверенными данными.
tr: '{0}' metodu, güvenilmeyen veriler seri durumdan çıkarılırken güvenli değildir. '{0}' çağrısını içeren otomatik oluşturulan sınıfın, güvenilmeyen verilerle seri durumdan çıkarılmadığından emin olun.
zh_hans: 对不受信任的数据进行反序列化处理时，方法“{0}”不安全。请确保包含“{0}”调用的自动生成的类没有使用不受信任的数据进行反序列化。
zh_hant: 還原序列化不受信任的資料時，方法 '{0}' 並不安全。請確定包含 '{0}' 呼叫的自動產生類別，不會還原序列化不受信任的資料。

# DataSetReadXmlAutogeneratedTitle
source: Ensure auto-generated class containing DataSet.ReadXml() is not used with untrusted data
cs: Zajistěte, aby se automaticky generovaná třída obsahující DataSet.ReadXml() nepoužívala s nedůvěryhodnými daty
de: Sicherstellen, dass die automatisch generierte Klasse mit DataSet.ReadXml() ausschließlich mit vertrauenswürdigen Daten verwendet wird
es: Asegurarse de que la clase autogenerada que contiene DataSet.ReadXml() no se use con datos que no son de confianza
fr: Vérifier que la classe générée automatiquement contenant DataSet.ReadXml() n'est pas utilisée avec des données non fiables
it: Assicurarsi che la classe generata automaticamente che contiene il metodo DataSet.ReadXml() non venga usata con dati non attendibili
ja: DataSet.ReadXml() を含む自動生成クラスが信頼されていないデータで使用されていないことを確認する
ko: DataSet.ReadXml()을 포함하는 자동 생성된 클래스가 신뢰할 수 없는 데이터와 함께 사용되지 않는지 확인
pl: Upewnij się, że automatycznie wygenerowana klasa zawierająca element DataSet.ReadXml() nie jest używana w połączeniu z niezaufanymi danymi
pt_br: Verifique se a classe gerada automaticamente que contém DataSet.ReadXml() não é usada com algum dado não confiável
ru: Убедитесь, что автоматически создаваемый класс, содержащий метод DataSet.ReadXml(), не используется с недоверенными данными
tr: DataSet.ReadXml() içeren otomatik oluşturulmuş sınıfın güvenilmeyen verilerle kullanılmadığından emin olun
zh_hans: 请确保包含 DataSet.ReadXml() 的自动生成的类没有与不受信任的数据一起使用
zh_hant: 請確認包含 DataSet.ReadXml() 的自動產生類別，不會與不受信任的資料一起使用

# DataSetReadXmlMessage
source: The method '{0}' is insecure when deserializing untrusted data
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません
ko: 신뢰할 수 없는 데이터를 역직렬화하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis
ru: Метод "{0}" является небезопасным при десериализации недоверенных данных.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil
zh_hans: 对不受信任的数据进行反序列化处理时，方法“{0}”不安全
zh_hant: 還原序列化不受信任的資料時，方法 '{0}' 不安全

# DataSetReadXmlTitle
source: Do not use DataSet.ReadXml() with untrusted data
cs: Nepoužívejte DataSet.ReadXml() s nedůvěryhodnými daty
de: DataSet.ReadXml() nicht mit nicht vertrauenswürdigen Daten verwenden
es: No usar DataSet.ReadXml() con datos que no son de confianza
fr: Ne pas utiliser DataSet.ReadXml() avec des données non fiables
it: Non usare DataSet.ReadXml() con dati non attendibili
ja: 信頼されていないデータで DataSet.ReadXml() を使用しない
ko: DataSet.ReadXml()을 신뢰할 수 없는 데이터와 함께 사용하지 마세요.
pl: Nie używaj elementu DataSet.ReadXml() z niezaufanymi danymi
pt_br: Não use DataSet.ReadXml() quando os dados não são confiáveis
ru: Не используйте метод DataSet.ReadXml() с недоверенными данными
tr: Güvenilmeyen verilerle DataSet.ReadXml() kullanmayın
zh_hans: 请勿将 DataSet.ReadXml() 与不受信任的数据一起使用
zh_hant: 使用 DataSet.ReadXml() 時請勿附上不受信任的資料

# DataTableReadXmlMessage
source: The method '{0}' is insecure when deserializing untrusted data
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません
ko: 신뢰할 수 없는 데이터를 역직렬화하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis
ru: Метод "{0}" является небезопасным при десериализации недоверенных данных.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil
zh_hans: 对不受信任的数据进行反序列化处理时，方法“{0}”不安全
zh_hant: 還原序列化不受信任的資料時，方法 '{0}' 不安全

# DataTableReadXmlTitle
source: Do not use DataTable.ReadXml() with untrusted data
cs: Nepoužívejte DataTable.ReadXml() s nedůvěryhodnými daty
de: DataTable.ReadXml() nicht mit nicht vertrauenswürdigen Daten verwenden
es: No usar DataTable.ReadXml() con datos que no son de confianza
fr: Ne pas utiliser DataTable.ReadXml() avec des données non fiables
it: Non usare DataTable.ReadXml() con dati non attendibili
ja: 信頼されていないデータで DataTable.ReadXml() を使用しない
ko: DataTable.ReadXml()을 신뢰할 수 없는 데이터와 함께 사용하지 마세요.
pl: Nie używaj elementu DataTable.ReadXml() z niezaufanymi danymi
pt_br: Não use DataTable.ReadXml() quando os dados não são confiáveis
ru: Не используйте метод DataTable.ReadXml() с недоверенными данными
tr: Güvenilmeyen verilerle DataTable.ReadXml() kullanmayın
zh_hans: 请勿将 DataTable.ReadXml() 与不受信任的数据一起使用
zh_hant: 使用 DataTable.ReadXml() 時請勿附上不受信任的資料

# DefinitelyDisableHttpClientCRLCheck
source: HttpClients should enable certificate revocation list checks
cs: Komponenty HttpClient by měly povolit kontroly seznamu odvolaných certifikátů.
de: HttpClients muss die Überprüfungen der Zertifikatsperrliste aktivieren.
es: HttpClients debe habilitar las comprobaciones de la lista de revocación de certificados.
fr: HttpClients doit activer les vérifications de la liste de révocation de certificats
it: HttpClients deve abilitare i controlli dell'elenco di revoche di certificati
ja: HttpClients では証明書失効リストの確認を有効にする必要があります
ko: HttpClients에서 인증서 해지 목록 확인을 사용하도록 설정해야 함
pl: Klienci HttpClients powinni włączyć sprawdzanie listy odwołania certyfikatów
pt_br: Os HttpClients devem habilitar as verificações da lista de certificados revogados
ru: Для клиентов HTTP (HttpClients) следует включить проверки списка отзыва сертификатов.
tr: HttpClients, sertifika iptal listesi denetimlerini etkinleştirmelidir
zh_hans: HttpClients 应启用证书吊销列表检查
zh_hant: HttpClients 應啟用憑證撤銷清單檢查

# DefinitelyDisableHttpClientCRLCheckMessage
source: HttpClient is created without enabling CheckCertificateRevocationList
cs: HttpClient se vytvoří bez povolení vlastnosti CheckCertificateRevocationList.
de: HttpClient wird ohne Aktivieren von CheckCertificateRevocationList erstellt.
es: HttpClient se crea sin habilitar CheckCertificateRevocationList.
fr: HttpClient est créé sans activation de CheckCertificateRevocationList
it: HttpClient viene creato senza abilitare CheckCertificateRevocationList
ja: HttpClient は、CheckCertificateRevocationList を有効にせずに作成されました
ko: CheckCertificateRevocationList를 사용하지 않고 HttpClient가 생성됩니다.
pl: Program HttpClient jest tworzony bez włączania właściwości CheckCertificateRevocationList
pt_br: HttpClient é criado sem habilitar CheckCertificateRevocationList
ru: HttpClient создается без включения CheckCertificateRevocationList.
tr: HttpClient, CheckCertificateRevocationList etkinleştirilmeden oluşturuldu
zh_hans: 在不启用 CheckCertificateRevocationList 的情况下创建了 HttpClient
zh_hant: 已建立 HttpClient，但未啟用 CheckCertificateRevocationList

# DefinitelyInstallRootCert
source: Do Not Add Certificates To Root Store
cs: Nepřidávat certifikáty do kořenového úložiště
de: Zertifikate nicht zum Stammspeicher hinzufügen
es: No agregar certificados al almacén raíz
fr: Ne pas ajouter de certificats au magasin racine
it: Non aggiungere certificati all'archivio radice
ja: ルート ストアに証明書を追加しない
ko: 루트 저장소에 인증서 추가 안 함
pl: Nie dodawaj certyfikatów do magazynu głównego
pt_br: Não Adicione Certificados Ao Armazenamento Raiz
ru: Не добавлять сертификаты в корневое хранилище
tr: Sertifikaları Kök Depoya Ekleme
zh_hans: 不将证书添加到根存储
zh_hant: 請勿將憑證新增至根存放區
