Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseStackallocInLoopsDescription
source: Stack space allocated by a stackalloc is only released at the end of the current method's invocation. Using it in a loop can result in unbounded stack growth and eventual stack overflow conditions.
cs: Prostor zásobníku přidělený operací stackalloc se uvolní jen na konci volání aktuální metody. Když se použije ve smyčce, může to způsobit neomezený růst zásobníku a nakonec i jeho přetečení.
de: Der über stackalloc zugewiesene Stapelspeicherplatz wird erst am Ende des Aufrufs der aktuellen Methode freigegeben. Die Verwendung in einer Schleife kann zu einer unbegrenzten Stapelvergrößerung und letztlich zu Stapelüberlaufbedingungen führen.
es: El espacio de pila asignado por una instancia de stackalloc solo se libera al final de la invocación del método actual. Si se usa en un bucle, puede producirse un crecimiento ilimitado de la pila y alcanzar condiciones de desbordamiento de esta.
fr: L'espace de pile alloué par stackalloc est uniquement libéré à la fin de l'appel de la méthode actuelle. Si vous l'utilisez dans une boucle, cela risque d'entraîner une croissance de pile indépendante et des conditions de dépassement de la capacité de la pile.
it: Lo spazio dello stack allocato da stackalloc viene rilasciato solo alla fine della chiamata del metodo corrente. Se viene usato in un ciclo, possono verificarsi condizioni di crescita illimitata dello stack e eventuale overflow dello stack.
ja: stackalloc によって割り当てられたスタック領域は、現在のメソッドの呼び出しの終了時にのみ解放されます。これをループ内で使用すると、スタックが無限に増加し、最終的にスタック オーバーフロー状態が発生する可能性があります。
ko: stackalloc에서 할당된 스택 공간은 현재 메서드의 호출이 끝날 때만 릴리스됩니다. 루프에서 stackalloc를 사용하면 바인딩되지 않은 스택 증가 및 최종 스택 오버플로 조건이 발생할 수 있습니다.
pl: Miejsce na stosie przydzielone przy użyciu słowa kluczowego stackalloc jest zwalniane jedynie na końcu wywołania bieżącej metody. Użycie go w pętli może spowodować nieograniczone powiększanie stosu i, ostatecznie, warunki przepełnienia stosu.
pt_br: O espaço de pilha alocado por um stackalloc é liberado somente no final da invocação do método atual. O uso de um stackalloc em um loop pode resultar em um aumento ilimitado da pilha e em condições eventuais de excedente de pilha.
ru: Место в стеке, выделенное stackalloc, освобождается только в конце вызова текущего метода. Использование его в цикле может привести к неограниченному увеличению стека и в конечном итоге к переполнению стека.
tr: Stackalloc tarafından ayrılan yığın alanı yalnızca geçerli metot çağrısının sonunda bırakılır. Bunu bir döngüde kullanmak, sınırsız yığın büyümesi ve sonunda yığın taşması durumlarına neden olabilir.
zh_hans: Stackalloc 分配的堆栈空间仅在当前方法的调用结束时释放。 在循环中使用它可能会导致无限堆栈增长和最终堆栈溢出条件。
zh_hant: stackalloc 配置的堆疊空間只會在目前方法的引動過程結束時釋出。在迴圈中使用該空間可能會造成堆疊無限增長，最終導致堆疊溢位。

# DoNotUseStackallocInLoopsMessage
source: Potential stack overflow. Move the stackalloc out of the loop.
cs: Možné přetečení zásobníku. Přesuňte stackalloc mimo smyčku.
de: Möglicher Stapelüberlauf. Verschieben Sie stackalloc aus der Schleife.
es: Posible desbordamiento de la pila. Mueva la instancia de stackalloc fuera del bucle.
fr: Probable dépassement de la capacité de la pile. Sortez stackalloc de la boucle.
it: Potenziale overflow dello stack. Spostare stackalloc all'esterno del ciclo.
ja: スタック オーバーフローの可能性があります。stackalloc をループの外に移動してください。
ko: 잠재적 스택 오버플로입니다. stackalloc를 루프 밖으로 이동합니다.
pl: Potencjalne przepełnienie stosu. Przenieś słowo kluczowe stackalloc z pętli.
pt_br: Possível excedente de pilha. Remova o stackalloc do loop.
ru: Потенциальное переполнение стека. Переместите stackalloc за пределы цикла.
tr: Olası yığın taşması. Stackalloc'u döngünün dışına taşıyın.
zh_hans: 潜在的堆栈溢出。将 stackalloc 移出循环。
zh_hant: 可能發生堆疊溢位。請將 stackalloc 移出迴圈。

# DoNotUseStackallocInLoopsTitle
source: Do not use stackalloc in loops
cs: Nepoužívat stackalloc ve smyčkách
de: stackalloc nicht in Schleifen verwenden
es: No utilizar stackalloc en los bucles
fr: N'utilisez pas stackalloc dans les boucles
it: Non usare stackalloc nei cicli
ja: stackalloc はループ内で使用不可
ko: 루프에서 stackalloc을 사용하면 안 됨
pl: Nie używaj słowa kluczowego stackalloc w pętlach
pt_br: Não use stackalloc em loops
ru: Запрет использования stackalloc в циклах
tr: Döngüler içinde stackalloc kullanmayın
zh_hans: 不要循环使用 stackalloc
zh_hant: 請勿在迴圈中使用 stackalloc

# DoNotUseThreadVolatileReadWriteCodeFixTitle
source: Replace obsolete call
cs: Nahradit zastaralé volání
de: Veralteten Aufruf ersetzen
es: Reemplazar llamada obsoleta
fr: Remplacer un appel obsolète
it: Sostituire chiamata obsoleta
ja: 古い呼び出しを置き換える
ko: 사용되지 않는 호출 바꾸기
pl: Zamień przestarzałe wywołanie
pt_br: Substituir a chamada obsoleta
ru: Замена устаревшего вызова
tr: Eski çağrıyı değiştirin
zh_hans: 替换过时的调用
zh_hant: 取代過時的通話

# DoNotUseTimersThatPreventPowerStateChangesDescription
source: Higher-frequency periodic activity will keep the CPU busy and interfere with power-saving idle timers that turn off the display and hard disks.
cs: Častější pravidelná aktivita bude zatěžovat procesor a ovlivňovat časovače neaktivity, které šetří energii a vypínají displej a pevné disky.
de: Regelmäßige Aktivitäten mit einer höheren Frequenz belasten die CPU und beeinflussen energiesparende Leerlauftimer, mit denen die Anzeige sowie die Festplatten ausgeschaltet werden.
es: Una actividad periódica más frecuente ocupará la CPU e interferirá con los temporizadores de inactividad para ahorro de energía que apagan el monitor y los discos duros.
fr: Une activité régulière à plus grande fréquence occupe le processeur et interfère avec les minuteurs d'inactivité qui déclenchent la mise en veille de l'écran et des disques durs pour économiser de l'énergie.
it: Un'attività periodica più frequente tiene la CPU occupata e interferisce con i timer di inattività per il risparmio di energia che disattivano lo schermo e i dischi rigidi.
ja: 頻度の高い定期的な動作は CPU のビジー状態を維持し、画面およびハード ディスクの電源を切る節電アイドル タイマーに影響します。
ko: 정기적인 작업의 실행 빈도가 높아지면 CPU 사용률도 높아져 디스플레이 및 하드 디스크를 끄는 절전 유휴 타이머에 방해가 됩니다.
pl: Działania okresowe wykonywane z dużą częstotliwością utrzymują zajętość procesora CPU i wpływają na czasomierze bezczynności funkcji oszczędzania energii, które powodują wyłączanie ekranu i dysków twardych.
pt_br: Atividade periódica de alta frequência manterá a CPU ocupada e interferirá nos medidores de tempo ocioso para economia de energia que desligam o visor e os discos rígidos.
ru: Периодическая активность с более высокой частотой заставит ЦП переключаться в активный режим и помешает работе энергосберегающих таймеров простоя, которые отключают дисплей и жесткие диски.
tr: Daha yüksek frekanslı düzenli etkinlik, CPU’nun meşgul kalmasına neden olmasının yanı sıra ekranı ve sabit diskleri kapatarak güç tasarrufu sağlayan boşta süreölçerlerini etkileyebilir.
zh_hans: 频率较高的定期活动会使 CPU 处于忙状态并且干扰具有节能功能(关闭显示器和硬盘)的空闲计时器。
zh_hant: 更高頻率的週期性活動，會讓 CPU 一直處於忙碌狀態，且會干擾關閉顯示器與硬碟的省電閒置計時器。

# DoNotUseTimersThatPreventPowerStateChangesMessage
source: Do not use timers that prevent power state changes
cs: Nepoužívejte časovače, které znemožňují změnit stav napájení
de: Keine Timer verwenden, die Änderungen am Energiezustand verhindern
es: No usar temporizadores que impidan los cambios de estado de energía
fr: Ne pas utiliser de minuteurs qui empêchent les changements d'état de l'alimentation
it: Non usare timer che impediscono le modifiche allo stato di potenza
ja: 電源の状態の変更を妨げるタイマーを使用しません
ko: 전원 상태 변경을 방해하는 타이머를 사용하지 마세요.
pl: Nie używaj czasomierzy, które uniemożliwiają zmiany stanu zasilania
pt_br: Não usar temporizadores que evitam alterações no estado de energia
ru: Не используйте таймеры, препятствующие изменению состояния электропитания
tr: Güç durumu değişikliklerini engelleyen süreölçerleri kullanmayın
zh_hans: 不要使用阻止电源状态更改的计时器
zh_hant: 請勿使用會讓電源狀態無法變更的計時器

# DoNotUseTimersThatPreventPowerStateChangesTitle
source: Do not use timers that prevent power state changes
cs: Nepoužívejte časovače, které znemožňují změnit stav napájení
de: Keine Timer verwenden, die Änderungen am Energiezustand verhindern
es: No usar temporizadores que impidan los cambios de estado de energía
fr: Ne pas utiliser de minuteurs qui empêchent les changements d'état de l'alimentation
it: Non usare timer che impediscono le modifiche allo stato di potenza
ja: 電源の状態の変更を妨げるタイマーを使用しません
ko: 전원 상태 변경을 방해하는 타이머를 사용하지 마세요.
pl: Nie używaj czasomierzy, które uniemożliwiają zmiany stanu zasilania
pt_br: Não usar temporizadores que evitam alterações no estado de energia
ru: Не используйте таймеры, препятствующие изменению состояния электропитания
tr: Güç durumu değişikliklerini engelleyen süreölçerleri kullanmayın
zh_hans: 不要使用阻止电源状态更改的计时器
zh_hant: 請勿使用會讓電源狀態無法變更的計時器

# DoNotUseUnsafeDllImportSearchPath
source: Do not use unsafe DllImportSearchPath value
cs: Nepoužívat nebezpečnou hodnotu DllImportSearchPath
de: Keinen unsicheren DllImportSearchPath-Wert verwenden
es: No usar un valor de DllImportSearchPath no seguro
fr: Ne pas utiliser de valeur non sécurisée pour DllImportSearchPath
it: Non usare il valore DllImportSearchPath non sicuro
ja: 安全でない DllImportSearchPath 値を使用しない
ko: 안전하지 않은 DllImportSearchPath 값 사용 안 함
pl: Nie używaj niebezpiecznej wartości DllImportSearchPath
pt_br: Não usar valor DllImportSearchPath não seguro
ru: Не используйте небезопасное значение DllImportSearchPath.
tr: Güvenli olmayan DllImportSearchPath değeri kullanmayın
zh_hans: 请勿使用不安全的 DllImportSearchPath 值
zh_hant: 不要使用不安全的 DllImportSearchPath 值

# DoNotUseUnsafeDllImportSearchPathDescription
source: There could be a malicious DLL in the default DLL search directories. Or, depending on where your application is run from, there could be a malicious DLL in the application's directory. Use a DllImportSearchPath value that specifies an explicit search path instead. The DllImportSearchPath flags that this rule looks for can be configured in .editorconfig.
cs: Ve výchozích adresářích pro vyhledávání DLL se může nacházet škodlivá knihovna DLL. Anebo v závislosti na tom, odkud se aplikace spouští, se může škodlivá knihovna DLL nacházet v adresáři aplikace. Použijte hodnotu DllImportSearchPath, která místo toho určuje explicitní vyhledávací cestu. Příznaky DllImportSearchPath, které toto pravidlo hledá, se dají nakonfigurovat v .editorconfig.
de: Die Standard-DLL-Suchverzeichnisse enthalten möglicherweise eine schädliche DLL. Je nachdem, von wo aus Ihre Anwendung ausgeführt wird, befindet sich möglicherweise auch eine schädliche DLL im Anwendungsverzeichnis. Verwenden Sie einen DllImportSearchPath-Wert, der stattdessen einen expliziten Suchpfad angibt. Die DllImportSearchPath-Flags, nach denen diese Regel sucht, können in .editorconfig konfiguriert werden.
es: Puede haber un archivo .dll malintencionado en los directorios de búsqueda de archivos .dll predeterminados. O bien, según desde dónde se ejecute la aplicación, puede haber un archivo .dll malintencionado en el directorio de la aplicación. Use un valor de DllImportSearchPath que especifique una ruta de acceso de búsqueda explícita. Las marcas de DllImportSearchPath que busca esta regla se pueden configurar en el archivo .editorconfig.
fr: Il existe peut-être une DLL malveillante dans les répertoires de recherche de DLL par défaut. De même, en fonction de l'emplacement d'exécution de votre application, il peut exister une DLL malveillante dans le répertoire de l'application. Utilisez une valeur pour DllImportSearchPath qui spécifie un chemin de recherche explicite à la place. Vous pouvez configurer les indicateurs DllImportSearchPath que cette règle recherche dans .editorconfig.
it: Nelle directory di ricerca DLL predefinite potrebbe essere presente una DLL dannosa oppure, a seconda della posizione di esecuzione dell'applicazione, nella directory dell'applicazione potrebbe essere presente una DLL dannosa. Usare un valore DllImportSearchPath che specifica un percorso di ricerca esplicito. I flag DllImportSearchPath cercati da questa regola possono essere configurati nel file con estensione editorconfig.
ja: 既定の DLL 検索ディレクトリ内に悪意のある DLL が存在する可能性があります。または、アプリケーションが実行されている場所に応じて、アプリケーションのディレクトリに悪意のある DLL が存在する可能性があります。代わりに、明示的な検索パスを指定する DllImportSearchPath 値を使用してください。この規則で検索される DllImportSearchPath フラグは、.editorconfig で構成できます。
ko: 기본 DLL 검색 디렉터리에 악성 DLL이 있을 수 있습니다. 또는 애플리케이션이 실행되는 위치에 따라 애플리케이션의 디렉터리에 악성 DLL이 있을 수 있습니다. 대신 명시적 검색 경로를 지정하는 DllImportSearchPath 값을 사용합니다. 이 규칙이 검색하는 DllImportSearchPath 플래그는 .editorconfig에서 구성할 수 있습니다.
pl: W domyślnych katalogach wyszukiwania bibliotek DLL może znajdować się złośliwa biblioteka DLL albo, w zależności od tego, z jakiej lokalizacji jest uruchamiana aplikacja, złośliwa biblioteka DLL może znajdować się w katalogu aplikacji. W zastępstwie użyj wartości DllImportSearchPath, która określa jawną ścieżkę wyszukiwania. Flagi DllImportSearchPath, które wyszukuje ta reguła, można skonfigurować w pliku .editorconfig.
pt_br: Pode haver uma DLL mal-intencionada nos diretórios de pesquisa de DLL padrão. Ou, dependendo do local de onde o seu aplicativo é executado, pode haver uma DLL mal-intencionada no diretório do aplicativo. Em vez disso, use um valor de DllImportSearchPath que especifique um caminho de pesquisa explícito. Os sinalizadores DllImportSearchPath pelos quais esta regra procura podem ser configurados em .editorconfig.
ru: В каталогах поиска DLL по умолчанию может присутствовать вредоносная библиотека DLL. Или в зависимости от места запуска приложения вредоносная библиотека DLL может присутствовать в каталоге приложения. Вместо этого используйте значение DllImportSearchPath, определяющее путь поиска явным образом. Флаги DllImportSearchPath, поиск которых осуществляет это правило, могут быть настроены в файле EDITORCONFIG.
tr: Varsayılan arama dizinlerinde zararlı bir DLL olabilir veya uygulamanızın çalıştığı konuma bağlı olarak uygulama dizininde zararlı bir DLL olabilir. Bunun yerine açık bir arama yolu belirten DllImportSearchPath değeri kullanın. Bu kuralın aradığı DllImportSearchPath bayrakları .editorconfig içinde yapılandırılabilir.
zh_hans: 默认 DLL 搜索目录中可能有恶意 DLL。或者，根据应用程序的运行位置，应用程序的目录中可能有恶意 DLL。请改为使用指定显式搜索路径的 DllImportSearchPath 值。可在 .editorconfig 中配置此规则查找的 DllImportSearchPath 标志。
zh_hant: 預設 DLL 搜尋目錄中可能有惡意的 DLL。或者，視應用程式的執行位置而定，應用程式的目錄中可能有惡意的 DLL。請改用指定明確搜尋路徑的 DllImportSearchPath 值。此規則尋找的 DllImportSearchPath 旗標可在 .editorconfig 中設定。

# DoNotUseUnsafeDllImportSearchPathMessage
source: Use of unsafe DllImportSearchPath value {0}
cs: Použití nebezpečné hodnoty DllImportSearchPath {0}
de: Verwendung eines unsicheren DllImportSearchPath-Werts "{0}"
es: Se está usando un valor de DllImportSearchPath ({0}) que no es seguro
fr: Utilisation d'une valeur de DllImportSearchPath non sécurisée {0}
it: Uso del valore {0} non sicuro di DllImportSearchPath
ja: 安全でない DllImportSearchPath 値 {0} の使用
ko: 안전하지 않은 DllImportSearchPath 값 {0} 사용
pl: Użycie niebezpiecznej wartości DllImportSearchPath {0}
pt_br: Uso de valor DllImportSearchPath não seguro {0}
ru: Использование небезопасного значения DllImportSearchPath {0}
tr: Güvenli olmayan DllImportSearchPath değeri {0}
zh_hans: 使用了不安全的 DllImportSearchPath 值 {0}
zh_hant: 使用不安全的 DllImportSearchPath 值 {0}

# DoNotUseWaitAllWithSingleTaskDescription
source: Using 'WaitAll' with a single task may result in performance loss, await or return the task instead.
cs: Použití WaitAll s jednou úlohou může vést ke ztrátě výkonu, čekání nebo vrácení úlohy.
de: Die Verwendung von "WaitAll" mit einer einzelnen Aufgabe kann zu Leistungseinbußen führen. Verwenden Sie stattdessen "await", oder geben Sie die Aufgabe zurück.
es: El uso de "WaitAll" con una sola tarea puede provocar una pérdida de rendimiento, esperar o devolver la tarea en su lugar.
fr: L’utilisation de ’WaitAll’ avec une seule tâche peut entraîner une perte de performance, attendre ou retourner la tâche à la place.
it: L'uso di 'WaitAll' con una singola attività potrebbe influire negativamente sulle prestazioni. In alternativa, attendere o restituire l'attività.
ja: 1 つのタスクで 'WaitAll' を使用すると、パフォーマンスが低下したり、代わりにタスクを待機したり、返したりする可能性があります。
ko: 단일 작업에 'WaitAll'을 사용하면 대신 성능이 저하되거나 작업을 기다리거나 반환할 수 있습니다.
pl: Użycie wywołania „WaitAll” z pojedynczym zadaniem może spowodować utratę wydajności, pojawienie się parametru await lub zwrócenie zadania.
pt_br: Usar 'WaitAll' com uma única tarefa pode resultar em perda de desempenho, aguardar ou retornar a tarefa.
ru: Использование "WaitAll" с одной задачей может привести к снижению производительности. Вместо этого ожидайте или возвратите задачу.
tr: Tek bir görevle 'WaitAll' kullanılması performans kaybına neden olabilir. Bunun yerine bekleyin veya göreve geri dönün.
zh_hans: 对单个任务使用 “WaitAll” 可能导致性能丢失、等待或返回该任务。
zh_hant: 對單一工作使用 'WaitAll' 可能會造成效能降低，請改為等待或返回工作。

# DoNotUseWaitAllWithSingleTaskFix
source: Replace 'WaitAll' with single 'Wait'
cs: Nahradit WaitAll s jedním Wait
de: "WaitAll" durch einzelnes "Wait" ersetzen
es: Reemplace "WaitAll" por un único elemento "Wait"
fr: Remplacer ’WaitAll’ par ’Wait’ unique
it: Sostituire 'WaitAll' con 'Wait' singolo
ja: 'WaitAll' を単一の 'Wait' に置き換える
ko: 'WaitAll'을 단일 'Wait'으로 교체
pl: Zastąp wywołanie „WaitAll” pojedynczym wywołaniem „Wait”
pt_br: Substituir 'WaitAll' por um único 'Wait'
ru: Заменить "WaitAll" на одиночный "Wait"
tr: 'WaitAll'ı tek 'Wait' ile değiştirin
zh_hans: 将 “WaitAll” 替换为单个 “Wait”
zh_hant: 以單一 'Wait' 取代 'WaitAll'

# DoNotUseWaitAllWithSingleTaskTitle
source: Do not use 'WaitAll' with a single task
cs: Nepoužívejte WaitAll s jednou úlohou.
de: "WaitAll" nicht mit einer einzelnen Aufgabe verwenden
es: No usar "WaitAll" con una sola tarea
fr: Ne pas utiliser ’WaitAll’ avec une seule tâche
it: Non usare 'WaitAll' con una singola attività
ja: 1 つのタスクで 'WaitAll' を使用しない
ko: 단일 작업에 'WaitAll'을 사용하지 마세요.
pl: Nie używaj wywołania „WaitAll” z pojedynczym zadaniem
pt_br: Não use 'WaitAll' com uma única tarefa
ru: Не использовать "WaitAll" с одной задачей
tr: Tek bir görevle 'WaitAll' kullanmayın
zh_hans: 不要对单个任务使用 “WaitAll”
zh_hant: 不要對單一工作使用 'WaitAll'

source: Do Not Use Weak Cryptographic Algorithms
cs: Nepoužívejte slabé kryptografické algoritmy
de: Keine schwachen kryptografischen Algorithmen verwenden
es: No usar algoritmos criptográficos poco seguros
fr: Ne pas utiliser d'algorithmes de chiffrement faibles
it: Non usare algoritmi di crittografia vulnerabili
ja: 脆弱な暗号アルゴリズムを使用しない
ko: 취약한 암호화 알고리즘을 사용하지 마세요.
pl: Nie używaj słabych algorytmów kryptograficznych
pt_br: Não usar algoritmos de criptografia fracos
ru: Не используйте слабые алгоритмы шифрования
tr: Zayıf Kriptografik Algoritmalar Kullanma
zh_hans: 不要使用弱加密算法
zh_hant: 請勿使用弱式密碼編譯演算法
