Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseBrokenCryptographicAlgorithmsDescription
source: An attack making it computationally feasible to break this algorithm exists. This allows attackers to break the cryptographic guarantees it is designed to provide. Depending on the type and application of this cryptographic algorithm, this may allow attackers to read enciphered messages, tamper with enciphered messages, forge digital signatures, tamper with hashed content, or otherwise compromise any cryptosystem based on this algorithm. Replace encryption uses with the AES algorithm (AES-256, AES-192 and AES-128 are acceptable) with a key length greater than or equal to 128 bits. Replace hashing uses with a hashing function in the SHA-2 family, such as SHA512, SHA384, or SHA256. Replace digital signature uses with RSA with a key length greater than or equal to 2048-bits, or ECDSA with a key length greater than or equal to 256 bits.
cs: Existuje útok, který je výpočetně dostatečně výkonný na to, aby prolomil tento algoritmus. Díky tomu můžou útočníci překonat kryptografické zabezpečení, které má algoritmus poskytovat. Podle typu aplikace a kryptografického algoritmu to může útočníkovi umožnit číst šifrované zprávy, upravovat je, falšovat digitální podpisy, upravovat hodnotu hash obsahu nebo jinak útočit na kryptografický systém založený na tomto algoritmu. Nahraďte místa, kde se používá šifrování, algoritmem AES (přípustné jsou varianty AES-256, AES-192 a AES-128) s délkou klíče alespoň 128 bitů. Nahraďte místa, kde se používá algoritmus hash, hashovací funkcí řady SHA-2, třeba SHA512, SHA384 nebo SHA256. Nahraďte místa, kde se používá digitální podpis, šifrováním RSA s délkou klíče alespoň 2048 bitů nebo algoritmem ECDSA s délkou klíče alespoň 256 bitů.
de: Es ist ein Angriff vorhanden, der es rechnerisch möglich macht, diesen Algorithmus zu zerstören. So können Angreifer die kryptografischen Garantien durchbrechen, für deren Bereitstellung er entwickelt wurde. Je nach Typ und Anwendung dieses kryptografischen Algorithmus können Angreifer verschlüsselte Nachrichten lesen, verschlüsselte Nachrichten manipulieren, digitale Signaturen fälschen, Hashinhalte manipulieren oder jedes auf diesem Algorithmus basierende Verschlüsselungssystem in anderer Hinsicht kompromittieren. Ersetzen Sie die Verwendung von Verschlüsselungen durch den AES-Algorithmus (AES-256, AES-192 und AES-128 sind zulässig) mit einer Schlüssellänge von mindestens 128 Bit. Ersetzen Sie die Verwendung von Hashing durch eine Hashfunktion in der SHA-2-Familie, beispielsweise SHA512, SHA384 oder SHA256. Ersetzen Sie die Verwendung digitaler Signaturen durch RSA mit einer Schlüssellänge von mindestens 2048 Bit oder durch ECDSA mit einer Schlüssellänge von mindestens 256 Bit.
es: Existe un ataque que hace factible a nivel computacional romper este algoritmo. Esto permite a los atacantes romper la garantía criptográfica que debe proporcionar. En función del tipo y la aplicación de este algoritmo criptográfico, esto podría permitir a los atacantes leer mensajes cifrados, alterar con mensajes cifrados, forzar firmas digitales, alterar con contenido con hash o poner en riesgo de otro modo cualquier sistema criptográfico basado en este algoritmo. Reemplace los usos del cifrado por el algoritmo AES (se aceptan AES-256, AES-192 y AES-128) con una longitud de clave igual o superior a 128 bits. Reemplace los usos del hash por una función hash de la familia de SHA-2, como SHA512, SHA384 o SHA256. Reemplace los usos de la firma digital por RSA con una longitud de clave igual o superior a 2048 bits, o ECDSA con una longitud de clave igual o superior a 256 bits.
fr: Avec la puissance de calcul appropriée, il est possible de casser cet algorithme. Cela permet aux pirates de réduire à néant les garanties de chiffrement censées être offertes. En fonction du type et de l'application de cet algorithme de chiffrement, les pirates peuvent lire des messages chiffrés, falsifier des messages chiffrés, falsifier des signatures numériques, falsifier du contenu basé sur un code de hachage ou compromettre d'une façon ou d'une autre tout système de chiffrement reposant sur cet algorithme. Remplacez la clé de chiffrement de l'algorithme AES (les algorithmes AES-256, AES-192 et AES-128 sont acceptables) par une clé de longueur supérieure ou égale à 128 bits. Remplacez l'utilisation des codes de hachage par une fonction de hachage de la famille SHA-2, par exemple SHA512, SHA384 ou SHA256. Remplacez l'utilisation des signatures numériques par un chiffrement RSA dont la longueur de clé est supérieure ou égale à 2 048 bits, ou par un algorithme ECDSA dont la longueur de clé est supérieure ou égale à 256 bits.
it: È stato individuato un attacco in grado di violare questo algoritmo dal punto di vista del calcolo. Gli utenti malintenzionati potrebbero violare le garanzie crittografiche che l'algoritmo dovrebbe offrire. A seconda del tipo e dell'applicazione di questo algoritmo di crittografia, questo potrebbe consentire agli utenti malintenzionati di leggere messaggi crittografati, manomettere messaggi crittografati, falsare firme digitali, manomettere contenuto con hash o compromettere in altro modo eventuali sistemi di crittografia basati su questo algoritmo. Sostituire la crittografia usata con l'algoritmo AES (sono accettabili AES-256, AES-192 e AES-128) con una lunghezza di chiave maggiore o uguale a 128 bit. Sostituire gli hash usati con una funzione hash della famiglia SHA-2, ad esempio SHA512, SHA384 o SHA256. Sostituire le firme digitali usate con RSA con una lunghezza di chiave maggiore o uguale a 2048 bit oppure con ECDSA con una lunghezza di chiave maggiore o uguale a 256 bit.
ja: このアルゴリズムを破ることをコンピューター的に実現する攻撃が存在します。これによって攻撃者は、提供されるはずの暗号化による保証を破ることが可能になります。この暗号アルゴリズムの種類とアプリケーションによっては、攻撃者は、暗号化されたメッセージの読み取り、暗号化されたメッセージの改ざん、デジタル署名の偽造、ハッシュされたコンテンツの改ざん、またはこのアルゴリズムに基づく暗号システムの侵害を実行できるようになる可能性があります。暗号化の使用を、キーの長さが 128 ビット以上の AES アルゴリズム (AES-256、AES-192、および AES-128 が使用可能) に置き換えます。ハッシュの使用を、SHA512、SHA384、SHA256 などの SHA-2 ファミリのハッシュ関数に置き換えます。デジタル署名の使用を、キーの長さが 2048 ビット以上の RSA か、キーの長さが 256 ビット以上の ECDSA に置き換えます。
ko: 계산상 이 알고리즘을 손상시킬 수 있는 공격이 있습니다. 이를 통해, 제공되어야 하는 암호화 보장이 공격자에 의해 손상될 수 있습니다. 암호화 알고리즘의 형식과 애플리케이션에 따라 공격자가 암호화된 메시지를 읽고, 암호화된 메시지를 변조하고, 디지털 서명을 위조하고, 해시된 콘텐츠를 변조하거나 이 알고리즘 기반의 암호화 시스템을 손상시킬 수 있습니다. 암호화를 키 길이가 128비트보다 크거나 같은 AES 알고리즘(AES-256, AES-192 및 AES-128 사용 가능)으로 바꾸세요. 해시를 SHA512, SHA384 또는 SHA256과 같은 SHA-2 패밀리의 해시 알고리즘으로 바꾸세요. 디지털 서명을 키 길이가 2048비트보다 크거나 같은 RSA 또는 키 길이가 256비트보다 크거나 같은 ECDSA로 바꾸세요.
pl: Możliwe jest przeprowadzenie ataku umożliwiającego obliczeniowe złamanie tego algorytmu. Pozwala to atakującym na złamanie kryptograficznych gwarancji, jakie powinien zapewniać. W zależności od typu i zastosowania tego algorytmu kryptograficznego może to umożliwić atakującemu odczytanie zaszyfrowanych wiadomości, ingerowanie w zaszyfrowane wiadomości, fałszowanie podpisów cyfrowych, ingerowanie w mieszaną zawartość lub inne naruszenie systemu kryptograficznego opartego na tym algorytmie. Zastąp użycia szyfrowane algorytmem AES (akceptowane są algorytmy AES-256, AES-192 i AES-128) z kluczem o długości równej lub większej niż 128 bitów. Zastąp użycia mieszane funkcją skrótu z rodziny SHA-2, taką jak SHA512, SHA384 lub SHA256. Zastąp użycia podpisu cyfrowego certyfikatem RSA z kluczem o długości równej lub większej niż 2048 bitów lub certyfikatem ECDSA z kluczem o długości równej lub większej niż 256 bitów.
pt_br: Existe um ataque que torna computacionalmente viável desfazer este algoritmo. Isso permite que os invasores desfaçam as garantias criptográficas que ele foi criado para fornecer. Dependendo do tipo e da aplicação desse algoritmo de criptografia, isso pode permitir que os invasores leiam e adulterem mensagens cifradas, forjem assinaturas digitais, adulterem conteúdo com hash ou, de outra forma, comprometam qualquer sistema de criptografia baseado nesse algoritmo. Substitua os usos de criptografia com o algoritmo AES (AES-256, AES-192 e AES-128 são aceitáveis) por um comprimento de chave maior ou igual a 128 bits. Substitua os usos de hash por uma função de hash na família SHA-2, tal como SHA512, SHA384 ou SHA256. A assinatura digital de substituição usa o RSA com um comprimento de chave maior ou igual a 2.048 bits ou o ECDSA com um comprimento de chave maior ou igual a 256 bits.
ru: С точки зрения вычислений существует атака, позволяющая взломать данный алгоритм. Это позволяет злоумышленникам нарушить предоставляемые им гарантии шифрования. В зависимости от типа и способа применения алгоритма шифрования злоумышленники могут считать или незаконно изменить зашифрованные сообщения, подделать цифровые подписи, незаконно изменить хэшированное содержимое, а также скомпрометировать любую систему шифрования, основанную на этом алгоритме. Замените средства шифрования на алгоритм AES (допустимы AES-256, AES-192 и AES-128) с длиной ключа не меньше 128 бит. Замените средства хэширования на хэш-функцию из семейства SHA-2, например SHA512, SHA384 или SHA256. Замените средства цифровой подписи на RSA с длиной ключа не меньше 2048 бит или ECDSA с длиной ключа не меньше 256 бит.
tr: Bu algoritmayı bozmayı işlemsel olarak uygun hale getiren bir saldırı var. Bu, saldırganların sağlamak için tasarlanan kriptografik garantileri aşmasına olanak sağlar. Bu kriptografik algoritmanın türü ve uygulamasına bağlı olarak, bu saldırganların şifrelenmiş iletileri okumasına, şifrelenmiş iletilen üzerinde oynamasına, dijital imza sahteciliği yapmasına, karma içerik üzerinde oynamasına veya bu algoritmayı temel alan herhangi bir kriptosistemin güvenliğini bozmasına neden olabilir. AES algoritması (AES-256, AES-192 ve AES-128 kabul edilebilir) ile şifreleme kullanımlarını 128 bit veya daha büyük bir anahtar uzunluğuyla değiştirin. Karma kullanımlarını SHA512, SHA384 veya SHA256 gibi SHA-2 ailesindeki bir karma işleviyle değiştirin. RSA ile dijital imza kullanımlarını 2048 bit veya daha büyük bir anahtar uzunluğuyla veya ECDSA’yı 256 bit veya daha büyük bir anahtar uzunluğuyla değiştirin.
zh_hans: 存在可能在计算方面破坏此算法的攻击。这使得攻击者可以破坏它本应提供的加密保证。根据此加密算法的类型和应用情况，可能会使攻击者读取加密消息、篡改加密消息、伪造数字签名、篡改哈希内容，或以其他方式危害任何基于该算法的加密系统。将加密用法替换为密钥长度大于或等于 128 位的 AES 算法(AES-256、AES-192 和 AES-128 均可)。将哈希用法替换为 SHA-2 系列中的哈希函数，例如 SHA512、SHA384 或 SHA256。将数字签名用法替换为密钥长度大于等于 2048 位的 RSA，或者密钥长度大于等于 256 位的 ECDSA。
zh_hant: 目前出現可用運算方式中斷此演算法的攻擊。如此會讓攻擊者能破壞原設計保證提供的密碼編譯。視此密碼編譯演算法的類型及應用方式之不同，會讓攻擊者能讀取加密的訊息、竄改加密的訊息、偽造數位簽章、竄改雜湊內容，或危害任何以此演算法為基礎的密碼系統。以長度大於或等於 128 位元的金鑰，取代搭配 AES (可接受 AES-256、AES-192 和 AES-128) 演算法的加密。以 SHA512、SHA384 或 SHA256 等 SHA-2 系列中的雜湊函數，取代雜湊用法。以長度大於或等於 2048 位元的金鑰，或金鑰長度大於或等於 256 位元的 ECDSA，取代搭配 RSA 的數位簽章。

# DoNotUseBrokenCryptographicAlgorithmsMessage
source: {0} uses a broken cryptographic algorithm {1}
cs: {0} používá prolomený kryptografický algoritmus {1}.
de: "{0}" verwendet einen beschädigten kryptografischen Algorithmus: {1}
es: {0} usa un algoritmo criptográfico dañado {1}.
fr: {0} utilise un algorithme de chiffrement cassé {1}
it: {0} usa un algoritmo di crittografia violato {1}
ja: {0} が、破られた暗号アルゴリズム {1} を使用します
ko: {0}이(가) 손상된 암호화 알고리즘 {1}을(를) 사용합니다.
pl: Element {0} używa złamanych algorytmów kryptograficznych {1}
pt_br: {0} usa um algoritmo de criptografia desfeito {1}
ru: {0} использует взломанный алгоритм шифрования {1}
tr: {0} bozuk {1} kriptografik algoritmasını kullanıyor
zh_hans: {0} 使用损坏的加密算法 {1}
zh_hant: {0} 使用損壞的密碼編譯演算法 {1}

# DoNotUseConfigureAwaitWithSuppressThrowingDescription
source: The ConfigureAwaitOptions.SuppressThrowing option is only supported with the non-generic Task, not a Task<TResult>. To use it with a Task<TResult>, first cast to the base Task.
cs: Možnost ConfigureAwaitOptions.SuppressThrowing se podporuje pouze u neobecných úloh, nikoli u Task<TResult>. Pokud ho chcete použít s task<TResult>, nejprve ho přetypujte na základní úlohu.
de: Die Option "ConfigureResultitOptions.SuppressInternewing" wird nur mit dem nicht generischen Task und nicht mit einem Task<TResult> unterstützt. Um es mit einem Task<TResult> zu verwenden, wandeln Sie zuerst in den Basistask um.
es: La opción ConfigureAwaitOptions.SuppressThrowing solo se admite con la Tarea no genérica, no con una Tarea<TResult>. Para usarlo con una Tarea<TResult>, primero transmítalo a la Tarea base.
fr: L’option ConfigureAwaitOptions.SuppressThrowing est uniquement pris en charge avec la tâche non générique, et non avec une tâche Task<TResult>. Pour l’utiliser avec une tâche Task<TResult>, commencez par effectuer un cast vers la tâche de base.
it: L'opzione ConfigureAwaitOptions.SuppressThrowing è supportata solo con l’attività non generica, non con l'attività<TResult>. Per usarlo con un oggetto Task<TResult>, eseguire prima il cast all'attività di base.
ja: ConfigureAwaitOptions.SuppressThrowing オプションは、Task<TResult> ではない、非ジェネリック Task での使用のみサポートされています。Task<TResult> で使用するには、まず、基本型の Task にキャストしてください。
ko: ConfigureAwaitOptions.SuppressThrowing 옵션은 Task<TResult>가 아니라 제네릭이 아닌 작업에서만 지원됩니다. 작업<TResult>과 함께 사용하려면 먼저 기본 작업에 캐스트합니다.
pl: Metoda ConfigureAwaitOptions.SuppressThrowing jest obsługiwana tylko z zadaniem niegenerycznym, a nie zadaniem <TResult>. Aby użyć ją z zadaniem <TResult>, najpierw rzutuj na zadanie podstawowe.
pt_br: Só há suporte para a opção ConfigureAwaitOptions.SuppressThrowing com a Tarefa não genérica, não com uma Tarefa<TResult>. Para usá-la com uma Tarefa<TResult>, primeiro converta para a Tarefa base.
ru: Параметр ConfigureAwaitOptions.SuppressThrowing поддерживается только с неуниверсальной задачей, а не с задачей<TResult>. Чтобы использовать его с задачей<TResult>, сначала выполните приведение к базовой задаче.
tr: ConfigureAwaitOptions.SuppressThrowing seçeneği, Task<TResult> ile değil, yalnızca genel olmayan Task ile desteklenir. Bu işlevi Task<TResult> ile kullanmak için öncelikle seçeneği temel Task olarak değiştirin.
zh_hans: ConfigureAwaitOptions.SuppressThrowing 选项仅支持用于非泛型任务，不可用于 Task<TResult>。若要将它用于 Task<TResult>，请先强制转换为基本任务。
zh_hant: ConfigureAwaitOptions.SuppressThrowing 選項只支援非一般工作，不支援 Task<TResult>。 若要與 Task<TResult> 一起使用，請先強制型轉到基本任務。

# DoNotUseConfigureAwaitWithSuppressThrowingMessage
source: The ConfigureAwaitOptions.SuppressThrowing option is only supported with the non-generic Task
cs: Možnost ConfigureAwaitOptions.SuppressThrowing se podporuje pouze u neobecných úloh.
de: Die Option "Configure OdbcitOptions.SuppressInternewing" wird nur mit dem nicht generischen Task unterstützt.
es: La opción ConfigureOptions.SuppressThrowing solo se admite con la tarea no genérica
fr: L’option ConfigureAwaitOptions.SuppressThrowing est uniquement pris en charge avec la tâche non générique
it: L'opzione ConfigureAwaitOptions.SuppressThrowing è supportata solo con l’attività non generica
ja: ConfigureAwaitOptions.SuppressThrowing オプションは、非ジェネリック Task での使用のみサポートされています
ko: ConfigureAwaitOptions.SuppressThrowing 옵션은 제네릭이 아닌 작업에서만 지원됩니다.
pl: Metoda ConfigureAwaitOptions.SuppressThrowing jest obsługiwana tylko z zadaniem niegenerycznym
pt_br: A opção ConfigureAwaitOptions.SuppressThrowing só é compatível com a Tarefa não genérica
ru: Параметр ConfigureAwaitOptions.SuppressThrowing поддерживается только с неуниверсальной задачей
tr: ConfigureAwaitOptions.SuppressThrowing seçeneği, yalnızca genel olmayan Task ile desteklenir
zh_hans: 只有非泛型任务才支持 ConfigureAwaitOptions.SuppressThrowing 选项
zh_hant: ConfigureAwaitOptions.SuppressThrowing 選項只支援非一般工作

# DoNotUseConfigureAwaitWithSuppressThrowingTitle
source: Do not use ConfigureAwaitOptions.SuppressThrowing with Task<TResult>
cs: Nepoužívejte ConfigureAwaitOptions.SuppressThrowing s Task<TResult>
de: Verwenden Sie "ConfigureOptionitOptions.SuppressWing" nicht mit Task<TResult>
es: No utilice ConfigureAwaitOptions.SuppressThrowing con Task<TResult>
fr: Ne pas utiliser ConfigureAwaitOptions.SuppressThrowing avec Task<TResult>
it: Non usare ConfigureOption.SuppressThrowing con Task<TResult>
ja: ConfigureAwaitOptions.SuppressThrowing を Task<TResult> で使用しないでください
ko: 작업<TResult>과 함께 ConfigureAwaitOptions.SuppressThrowing 사용 안 함
pl: Nie używaj metody ConfigureAwaitOptions.SuppressThrowing z zadaniem<TResult>
pt_br: Não use ConfigureAwaitOptions.SuppressThrowing com Task<TResult>
ru: Не использовать ConfigureAwaitOptions.SuppressThrowing с задачей<TResult>
tr: ConfigureAwaitOptions.SuppressThrowing işlevini Task<TResult> ile birlikte kullanmayın
zh_hans: 不要对 Task<TResult> 使用 ConfigureAwaitOptions.SuppressThrowing
zh_hant: 請勿使用 ConfigureAwaitOptions.SuppressThrowing 與 Task<TResult>

# DoNotUseCountAsyncWhenAnyAsyncCanBeUsedDescription
source: For non-empty collections, CountAsync() and LongCountAsync() enumerate the entire sequence, while AnyAsync() stops at the first item or the first item that satisfies a condition.
cs: U neprázdných kolekcí CountAsync() a LongCountAsync() zobrazí výčet celé sekvence, zatímco AnyAsync() se zastaví u první položky nebo u první položky, která splňuje podmínku.
de: Bei nicht leeren Sammlungen listen CountAsync() und LongCountAsync() die gesamte Sequenz auf, während AnyAsync() beim ersten Element oder bei dem ersten Element, das eine Bedingung erfüllt, beendet wird.
es: Para colecciones no vacías, CountAsync() y LongCountAsync() enumeran la secuencia completa, mientras que AnyAsync() se detiene en el primer elemento o en el primer elemento que satisface una condición.
fr: Pour les collections non vides, CountAsync() et LongCountAsync() énumèrent la séquence entière, alors que AnyAsync() s'arrête au premier élément ou au premier élément qui satisfait une condition.
it: Nel caso di raccolte non vuote CountAsync() e LongCountAsync() enumerano l'intera sequenza, mentre AnyAsync() si arresta in corrispondenza del primo elemento o del primo elemento che soddisfa una condizione.
ja: 空ではないコレクションで、CountAsync() と LongCountAsync() ではシーケンス全体が列挙されますが、AnyAsync() では最初の項目または条件を満たす最初の項目で停止します。
ko: 비어 있지 않은 컬렉션의 경우 CountAsync() 및 LongCountAsync()는 전체 시퀀스를 열거하고, AnyAsync()는 첫 번째 항목 또는 조건을 충족하는 첫 번째 항목에서 중지합니다.
pl: W przypadku niepustych kolekcji funkcje CountAsync() i LongCountAsync() wyliczają całą sekwencję, podczas gdy funkcja AnyAsync() zatrzymuje się na pierwszym elemencie lub pierwszym elemencie, który spełnia warunek.
pt_br: Para coleções não vazias, CountAsync() e LongCountAsync() enumeram toda a sequência, enquanto AnyAsync() é interrompido no primeiro item ou no primeiro item que satisfaz uma condição.
ru: Для непустых коллекций методы CountAsync() и LongCountAsync() перечисляют всю последовательность, а метод AnyAsync() останавливается на первом элементе или на первом элементе, который соответствует условию.
tr: Boş olmayan koleksiyonlarda CountAsync() ve LongCountAsync() dizinin tamamını numaralandırır. AnyAsync() ise ilk öğede veya koşulu karşılayan ilk öğede durur.
zh_hans: 对于非空集合，CountAsync() 和 LongCountAsync() 将枚举整个序列，而 AnyAsync() 将在第一项或满足条件的第一项处停止。
zh_hant: 對於非空白集合，CountAsync() 和 LongCountAsync() 會列舉整個序列，而 AnyAsync() 則會停止於第一個項目或第一個符合條件的項目。

# DoNotUseCountAsyncWhenAnyAsyncCanBeUsedMessage
source: {0}() is used where AnyAsync() could be used instead to improve performance
cs: {0}() se používá tam, kde se dá kvůli zvýšení výkonu použít AnyAsync().
de: "{0}()" wird verwendet, obwohl "AnyAsync()" stattdessen verwendet werden kann, um die Leistung zu verbessern.
es: Se usa {0}() donde podría usarse AnyAsync() para mejorar el rendimiento.
fr: {0}() est utilisé alors que vous pourriez utiliser AnyAsync() à la place pour améliorer le niveau de performance
it: Si usa {0}() in un punto in cui sarebbe possibile usare AnyAsync() per migliorare le prestazioni
ja: パフォーマンスを向上させるために AnyAsync() を代わりに使用できるところで {0}() が使用されています
ko: {0}()은(는) 성능 개선을 위해 AnyAsync()를 대신 사용할 수 있는 경우에 사용됩니다.
pl: Funkcja {0}() jest używana w miejscach, w których można użyć funkcji AnyAsync() w celu zwiększenia wydajności
pt_br: {0}() é usado onde AnyAsync() poderia ser usado para melhorar o desempenho
ru: {0}() используется там, где можно было бы использовать AnyAsync() для повышения производительности.
tr: Performansı artırmak için AnyAsync() metodu kullanılabilecekken bunun yerine {0}() kullanılıyor
zh_hans: 使用的是 {0}()，但本可以使用 AnyAsync() 来提高性能
zh_hant: 會在可使用 AnyAsync() 的地方改用 {0}() 來提升效能

# DoNotUseCountAsyncWhenAnyAsyncCanBeUsedTitle
source: Do not use CountAsync() or LongCountAsync() when AnyAsync() can be used
cs: Nepoužívat CountAsync() nebo LongCountAsync(), pokud se dá použít AnyAsync()
de: CountAsync() oder LongCountAsync() nicht verwenden, wenn AnyAsync() verwendet werden kann
es: No usar CountAsync() ni LongCountAsync() si se puede usar AnyAsync()
fr: N'utilisez pas CountAsync() ou LongCountAsync() quand AnyAsync() peut être utilisé
it: Non usare CountAsync() o LongCountAsync() se è possibile usare AnyAsync()
ja: AnyAsync() を使用できる場合は、CountAsync() または LongCountAsync() を使用しない
ko: AnyAsync()를 사용할 수 있는 경우 CountAsync() 또는 LongCountAsync() 사용 안 함
pl: Nie używaj funkcji CountAsync() ani LongCountAsync(), gdy można użyć funkcji AnyAsync()
pt_br: Não usar CountAsync() ou LongCountAsync() quando AnyAsync() puder ser usado
ru: Не используйте методы CountAsync() и LongCountAsync(), если можно использовать метод AnyAsync()
tr: AnyAsync() kullanılabiliyorsa CountAsync() veya LongCountAsync() kullanma
zh_hans: 如果可以使用 AnyAsync()，请勿使用 CountAsync() 或 LongCountAsync()
zh_hant: 不要在可使用 AnyAsync() 時使用 CountAsync() 或 LongCountAsync()

# DoNotUseCountWhenAnyCanBeUsedDescription
source: For non-empty collections, Count() and LongCount() enumerate the entire sequence, while Any() stops at the first item or the first item that satisfies a condition.
cs: U neprázdných kolekcí Count() a LongCount() zobrazí výčet celé sekvence, zatímco Any() se zastaví u první položky nebo u první položky, která splňuje podmínku.
de: Bei nicht leeren Sammlungen listen Count() und LongCount() die gesamte Sequenz auf, während Any() beim ersten Element oder bei dem ersten Element, das eine Bedingung erfüllt, beendet wird.
es: Para colecciones no vacías, Count() y LongCount() enumeran la secuencia completa, mientras que Any() se detiene en el primer elemento o en el primer elemento que satisface una condición.
fr: Pour les collections non vides, Count() et LongCount() énumèrent la séquence entière, alors que Any() s'arrête au premier élément ou au premier élément qui satisfait une condition.
it: Nel caso di raccolte non vuote Count() e LongCount() enumerano l'intera sequenza, mentre Any() si arresta in corrispondenza del primo elemento o del primo elemento che soddisfa una condizione.
ja: 空はでないコレクションで、Count() と LongCount() ではシーケンス全体が列挙されますが、Any() では最初の項目または条件を満たす最初の項目で停止します。
ko: 비어 있지 않은 컬렉션의 경우 Count() 및 LongCount()는 전체 시퀀스를 열거하고, Any()는 첫 번째 항목 또는 조건을 충족하는 첫 번째 항목에서 중지합니다.
pl: W przypadku niepustych kolekcji funkcje Count() i LongCount() wyliczają całą sekwencję, podczas gdy funkcja Any() zatrzymuje się na pierwszym elemencie lub pierwszym elemencie, który spełnia warunek.
pt_br: Para coleções não vazias, Count() e LongCount() enumeram toda a sequência, enquanto Any() é interrompido no primeiro item ou no primeiro item que satisfaz uma condição.
ru: Для непустых коллекций методы Count() и LongCount() перечисляют всю последовательность, а метод Any() останавливается на первом элементе или на первом элементе, который соответствует условию.
tr: Boş olmayan koleksiyonlarda Count() ve LongCount() dizinin tamamını numaralandırır. Any() ise ilk öğede veya koşulu karşılayan ilk öğede durur.
zh_hans: 对于非空集合，Count() 和 LongCount() 将枚举整个序列，而 Any() 将在第一项或满足条件的第一项处停止。
zh_hant: 對於非空白集合，Count() 和 LongCount() 會列舉整個序列，而 Any() 則會停止於第一個項目或第一個符合條件的項目。
