Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RecommendCaseInsensitiveStringComparisonMessage
source: Prefer the string comparison method overload of '{0}' that takes a 'StringComparison' enum value to perform a case-insensitive comparison, but keep in mind that this might cause subtle changes in behavior, so make sure to conduct thorough testing after applying the suggestion, or if culturally sensitive comparison is not required, consider using 'StringComparison.OrdinalIgnoreCase'
cs: Upřednostňujte metody přetížení porovnání řetězců „{0}“, které přebírá hodnotu výčtu „StringComparison“ k porovnání bez rozlišování velkých a malých písmen, ale mějte na paměti, že to může způsobit drobné změny chování. Proto po použití návrhu nezapomeňte provést důkladné testování nebo pokud není vyžadováno kulturní porovnání, zvažte použití metody „StringComparison.OrdinalIgnoreCase“.
de: Beachten Sie jedoch, dass dies zu geringfügigen Änderungen im Verhalten führen kann. Stellen Sie daher sicher, dass Sie nach der Anwendung des Vorschlags gründlich testen, oder wenn kein kulturabhängiger Vergleich erforderlich ist, erwägen Sie die Verwendung von "StringComparison.OrdinalIgnoreCase". Überladung der Zeichenfolgenvergleichsmethode von "{0}" bevorzugen, die einen Enumerationswert "StringComparison" akzeptiert, um einen Vergleich ohne Berücksichtigung der Groß-/Kleinschreibung durchzuführen.
es: Prefiera la sobrecarga de método de comparación de cadenas de "{0}" que toma un valor de enumeración "StringComparison" para realizar una comparación sin distinción de mayúsculas y minúsculas, pero tenga en cuenta que esto puede provocar cambios sutiles en el comportamiento, por lo que asegúrese de realizar pruebas exhaustivas después de aplicar la sugerencia, o si no se requiere una comparación culturalmente confidencial, considere la posibilidad de usar "StringComparison.OrdinalIgnoreCase"
fr: Préférez la surcharge de méthode de comparaison de chaînes de « {0} » qui accepte une valeur enum « StringComparison » pour effectuer une comparaison qui ne respecte pas la casse, mais gardez à l’esprit que cela peut entraîner des modifications subtiles du comportement. Veillez donc à effectuer des tests approfondis après l’application de la suggestion ou, si la comparaison sensible à la culture n’est pas nécessaire, envisagez d’utiliser « StringComparison.OrdinalIgnoreCase »
it: Preferire l'overload del metodo di confronto di stringhe di "{0}" che richiede un valore di enumerazione "StringComparison" per eseguire un confronto senza distinzione tra maiuscole e minuscole, ma tenere presente che ciò potrebbe causare lievi modifiche nel comportamento, quindi assicurarsi di eseguire test completi dopo l'applicazione del suggerimento o, se non è necessario un confronto sensibile a livello di cultura, provare a usare "StringComparison.OrdinalIgnoreCase"
ja: 大文字と小文字を区別しない比較を実行するには、'StringComparison' 列挙値を受け取る '{0}' の文字列比較メソッド オーバーロードをお勧めしますが、これにより、動作が微妙に変化する可能性があることに注意してください。そのため、提案を適用した後に十分なテストを実施してください。また、文化的に敏感な比較を行う必要がない場合は、'StringComparison.OrdinalIgnoreCase' の使用を検討してください
ko: 대/소문자를 구분하지 않는 비교를 수행하기 위해 'StringComparison' 열거형 값을 사용하는 '{0}' 문자열 비교 메서드 오버로드를 선호하되 이로 인해 동작이 미세하게 바뀔 수 있으므로 제안을 적용한 후 정밀한 테스트를 수행하거나, 문화적으로 민감한 비교가 필요하지 않은 경우에는 'StringComparison.OrdinalIgnoreCase' 사용을 고려해 보세요.
pl: Preferuj przeciążenie metody porównywania ciągów „{0}”, która przyjmuje wartość wyliczenia „StringComparison”, aby wykonać porównanie bez uwzględniania wielkości liter, ale pamiętaj, że może to spowodować subtelne zmiany w zachowaniu, więc upewnij się, że przeprowadzasz dokładne testy po zastosowaniu sugestii, lub jeśli porównanie wrażliwe kulturowo nie jest wymagane, rozważ użycie elementu „StringComparer.OrdinalIgnoreCase”
pt_br: Prefira a sobrecarga do método de comparação de strings '{0}' que usa um valor enum 'StringComparison' para realizar uma comparação que não diferencia maiúsculas de minúsculas, mas lembre-se de que isso pode causar mudanças sutis no comportamento, portanto, certifique-se de realizar testes completos após aplicar a sugestão, ou se a comparação culturalmente sensível não for necessária, considere usar 'StringComparison.OrdinalIgnoreCase'
ru: Рекомендуется использовать перегрузку метода сравнения строк "{0}", которая использует значение перечисления "StringComparison", но помните, что при этом поведение может немного измениться, поэтому проведите тщательное тестирование после применения этой рекомендации. Если же сравнение с учетом культуры не требуется, попробуйте использовать "StringComparison.OrdinalIgnoreCase".
tr: Büyük/küçük harfe duyarsız bir karşılaştırma gerçekleştirmek StringComparison' sabit listesi değeri alan '{0}' metot aşırı yüklemelerini tercih edin ancak bunun davranışta küçük değişikliklere neden olabileceğini unutmayın. Bu nedenle, öneriyi uyguladıktan sonra mutlaka kapsamlı testler yapın veya kültürel açıdan hassas karşılaştırma gerekmiyorsa 'StringComparer.OrdinalIgnoreCase' kullanmayı göz önünde bulundurun
zh_hans: 首选使用“StringComparison”枚举值来执行不区分大小写的比较的“{0}”的字符串比较方法重载，但请记住，这可能会导致行为发生细微变化，因此请确保在应用建议后进行全面测试，或者如果不需要区分区域性的比较，请考虑使用 “StringComparison.OrdinalIgnoreCase”
zh_hant: 建議採用 'StringComparison' 列舉值之 '{0}' 的字串比較方法多載，以執行不區分大小寫的比較，但請注意，這可能會導致行為發生輕微變更，因此請務必在套用建議之後進行全面測試，或者如果不需要文化相關比較，請考慮使用 'StringComparison.OrdinalIgnoreCase'

# RecommendCaseInsensitiveStringComparisonTitle
source: Use the 'StringComparison' method overloads to perform case-insensitive string comparisons
cs: Použijte metodu přetížení „StringComparison“ k porovnání řetězců bez rozlišování velkých a malých písmen
de: "StringComparison"-Methodenüberladungen verwenden, um Zeichenfolgenvergleiche ohne Beachtung der Groß-/Kleinschreibung durchzuführen
es: Use las sobrecargas del método "StringComparison" para realizar comparaciones de cadenas sin distinción de mayúsculas y minúsculas
fr: Utiliser les surcharges de méthode « StringComparison » pour effectuer des comparaisons de chaînes sans respect de la casse
it: Usa gli overload del metodo “StringComparison” per confrontare le stringhe senza distinzione tra maiuscole e minuscole
ja: 大文字と小文字を区別しない文字列比較を実行するには、'StringComparison' メソッド オーバーロードを使用します
ko: 대/소문자를 구분하지 않는 문자열 비교를 수행하려면 'StringComparison' 메서드 오버로드를 사용합니다.
pl: Użyj przeciążenia metody „StringComparison”, aby wykonać porównanie ciągów bez uwzględniania wielkości liter.
pt_br: Use as sobrecargas do método 'StringComparison' para realizar comparações de strings que não diferenciam maiúsculas de minúsculas
ru: Используйте перегрузки метода "StringComparison" для сравнения строк без учета регистра
tr: Büyük/küçük harfe duyarsız dize karşılaştırmaları gerçekleştirmek için 'StringComparison' metodu aşırı yüklemelerini kullanın
zh_hans: 使用 "StringComparison" 方法重载来执行不区分大小写的字符串比较
zh_hant: 使用 'StringComparison' 方法多載來執行不區分大小寫的字串比較

# RecommendCaseInsensitiveStringEqualsCodeFixTitle
source: Use 'string.Equals(string, StringComparison)'
cs: Použijte string.Equals(string, StringComparison)
de: Verwenden Sie "string.Equals(string, StringComparison)"
fr: Utilisez 'string. Equals(string, StringComparison)'
it: Usare 'string. Equals(string, StringComparison)'
ja: 'string.Equals(string, StringComparison)' を使用する
ko: 'string.Equals(문자열, StringComparison)' 사용
pl: Użyj ciągu „string.Equals(string, StringComparison)”
pt_br: Usar 'string.Equals(string, StringComparison)'
ru: Используйте "string.Equals(string, StringComparison)"
tr: 'string.Equals(string, StringComparison)' parametresini kullanın
zh_hans: 使用 "string.Equals(string, StringComparison)"
zh_hant: 使用 'string.Equals(string, StringComparison)'

# RecommendCaseInsensitiveStringEqualsDescription
source: Avoid calling 'ToLower', 'ToUpper', 'ToLowerInvariant' and 'ToUpperInvariant' to perform case-insensitive string comparisons, as in 'string.ToLower() == string.ToLower()', because they lead to an allocation. Instead, use 'string.Equals(string, StringComparison)' to perform case-insensitive comparisons. Switching to using an overload that takes a 'StringComparison' might cause subtle changes in behavior, so it's important to conduct thorough testing after applying the suggestion. Additionally, if a culturally sensitive comparison is not required, consider using 'StringComparison.OrdinalIgnoreCase'.
cs: Vyhněte se volání „ToLower“, „ToUpper“, „ToLowerInvariant“ a „ToUpperInvariant“ k provádění porovnávání řetězců bez rozlišování velkých a malých písmen, jako v „string.ToLower() == string.ToLower()“, protože vedou k přidělení. Místo toho pro porovnání bez rozlišování malých a velkých písmen použijte „string.Equals(string, StringComparison)“. Přechod na přetížení, které přijímá „StringComparison“, může způsobit drobné změny v chování, takže je důležité provést důkladné testování po použití návrhu. Pokud navíc není vyžadováno kulturní porovnání, zvažte použití „stringcomparison.OrdinalIgnoreCase“.
de: Vermeiden Sie den Aufruf von "ToLower", "ToUpper", "ToLowerInvariant" und "ToUpperInvariant", um Zeichenfolgenvergleiche ohne Beachtung der Groß-/Kleinschreibung durchzuführen, wie in "string.ToLower() == string.ToLower()", da sie zu einer Zuordnung führen. Verwenden Sie stattdessen "string.Equals(string, StringComparison)", um Vergleiche ohne Beachtung der Groß-/Kleinschreibung durchzuführen. Der Wechsel zu einer Überladung, die einen "StringComparison" akzeptiert, kann geringfügige Verhaltensänderungen verursachen. Daher ist es wichtig, nach dem Anwenden des Vorschlags gründlich zu testen. Wenn kein kulturabhängiger Vergleich erforderlich ist, sollten Sie außerdem die Verwendung von "StringComparison.OrdinalIgnoreCase" in Betracht ziehen.
es: Evite llamar a "ToLower", "ToUpper", "ToLowerInvariant" y "ToUpperInvariant" para realizar comparaciones de cadenas sin distinción de mayúsculas y minúsculas, como en "string.ToLower() == string.ToLower()" porque dan lugar a una asignación. En su lugar, use "string". Equals(string, StringComparison)" para realizar comparaciones sin distinción de mayúsculas y minúsculas. Si cambia a una sobrecarga que toma una "StringComparison", es posible que se produzcan cambios sutiles en el comportamiento, por lo que es importante realizar pruebas exhaustivas después de aplicar la sugerencia. Además, si no se requiere una comparación culturalmente confidencial, considere la posibilidad de usar "StringComparison.OrdinalIgnoreCase".
fr: Évitez d’appeler « ToLower », « ToUpper », « ToLowerInvariant » et « ToUpperInvariant » pour effectuer des comparaisons de chaînes sans respect de la casse, comme dans « string.ToLower() == string.ToLower() », car elles entraînent une allocation. Utilisez plutôt « string.Equals(string, StringComparison) » pour effectuer des comparaisons qui ne respectent pas la casse. Le passage à l’utilisation d’une surcharge qui accepte « StringComparison » peut entraîner des modifications subtiles du comportement. Il est donc important d’effectuer des tests approfondis après l’application de la suggestion. En outre, si aucune comparaison sensible à la culture n’est nécessaire, envisagez d’utiliser « StringComparison.OrdinalIgnoreCase ».
it: Si sconsiglia di chiamare i metodi "ToLower", "ToUpper", "ToLowerInvariant" e "ToUpperInvariant" per confrontare le stringhe senza distinzione tra maiuscole e minuscole, come in "string.ToLower() == string.ToLower()", perché portano a un'allocazione. Usare invece "string.Equals(string, StringComparison)" per eseguire confronti senza distinzione tra maiuscole e minuscole. Il passaggio all'uso di un overload che richiede un valore "StringComparison" potrebbe causare lievi modifiche nel comportamento, quindi è importante eseguire test completi dopo aver applicato il suggerimento. Inoltre, se non è necessario un confronto sensibile a livello di cultura, provare a usare "StringComparison.OrdinalIgnoreCase".
ja: 大文字と小文字を区別しない文字列比較を実行するために、'ToLower'、'ToUpper'、'ToLowerInvariant'、および 'ToUpperInvariant' を呼び出さないようにしてください。'string.ToLower() == string.ToLower()' のように、割り当てにつながるためです。代わりに、'string.Equals(string, StringComparison)' を使用して大文字と小文字を区別しない比較を実行してください。'StringComparison' を受け取るオーバーロードの使用に切り替えると、動作が微妙に変化する可能性があるため、提案を適用した後に十分なテストを実施することが重要です。また、文化的に敏感な比較を行う必要がない場合は、'StringComparison.OrdinalIgnoreCase' の使用を検討してください。
ko: 'string.ToLower() == string.ToLower()'처럼 대/소문자를 구분하지 않는 문자열 비교를 수행하기 위해 'ToLower', 'ToUpper', 'ToLowerInvariant', 'ToUpperInvariant'를 호출하지 마세요. 이로 인해 할당이 발생하게 됩니다. 대신 'string.Equals(string, StringComparison)'을 사용하여 대/소문자를 구분하지 않는 비교를 수행하세요. 'StringComparison'을 사용하는 오버로드 사용으로 전환하면 동작이 미세하게 바뀔 수 있으므로 제안을 적용한 후 정밀한 테스트를 수행하는 것이 중요합니다. 또한 문화적으로 민감한 비교가 필요하지 않은 경우에는 'StringComparison.OrdinalIgnoreCase' 사용을 고려해 보세요.
pl: Unikaj wywoływania elementów „ToLower”, „ToUpper”, „ToLowerInvariant” i „ToUpperInvariant”, aby wykonywać porównania ciągów bez uwzględniania wielkości liter, jak w przypadku „string”. ToLower() == ciąg. ToLower()”, ponieważ prowadzą do alokacji. Zamiast tego użyj „string.Equals(string, StringComparison)”, aby wykonać porównanie bez uwzględniania wielkości liter. Przełączenie się na użycie przeciążenia wykorzystującego element „StringComparison” może spowodować subtelne zmiany w zachowaniu, dlatego ważne jest przeprowadzenie dokładnego testowania po zastosowaniu sugestii. Ponadto jeśli nie jest wymagane porównanie wrażliwe kulturowo, rozważ użycie elementu „StringComparer.OrdinalIgnoreCase”.
pt_br: Evite chamar 'ToLower', 'ToUpper', 'ToLowerInvariant' e 'ToUpperInvariant' para realizar comparações de strings que não diferenciam maiúsculas de minúsculas, como em 'string.ToLower() == string.ToLower()', porque elas levam a uma alocação. Em vez disso, use 'string.Equals(string, StringComparison)' para realizar comparações que não diferenciam maiúsculas de minúsculas. Mudar para uma sobrecarga que utiliza um 'StringComparison' pode causar mudanças sutis no comportamento, por isso é importante realizar testes completos após aplicar a sugestão. Além disso, se uma comparação culturalmente sensível não for necessária, considere usar 'StringComparison.OrdinalIgnoreCase'.
ru: Не вызывайте "ToLower", "ToUpper", "ToLowerInvariant" и "ToUpperInvariant" для сравнения строк без учета регистра, например, "string.ToLower() == string.ToLower()", поскольку это приведет к выделению. Вместо этого используйте "string.Equals(string, StringComparison)" для сравнения без учета регистра. При переходе на использование перегрузки, которая использует "StringComparison", поведение может немного измениться, поэтому проведите тщательное тестирование после применения этой рекомендации. Кроме того, если сравнение с учетом культуры не требуется, попробуйте использовать "StringComparison.OrdinalIgnoreCase".
tr: Ayırmaya yol açtıklarından 'string.ToLower() == string.ToLower()' gibi büyük/küçük harfe duyarsız dize karşılaştırmaları gerçekleştirmek için 'ToLower', 'ToUpper', 'ToLowerInvariant' ve 'ToUpperInvariant' çağırmaktan kaçının. Bunun yerine, büyük/küçük harfe duyarsız karşılaştırma yapmak için 'string.Equals(string, StringComparison)' parametresini kullanmayı tercih edin. 'StringComparer' alan bir aşırı yüklemeye geçmek geçmek davranışta küçük değişikliklere neden olabileceğinden öneriyi uyguladıktan sonra mutlaka kapsamlı test yapılmalıdır. Ayrıca, kültürel açıdan hassas karşılaştırma gerekmiyorsa 'StringComparer.OrdinalIgnoreCase' kullanmayı göz önünde bulundurun.
zh_hans: 避免调用“ToLower”、“ToUpper”、“ToLowerInvariant”和“ToUpperInvariant”来执行不区分大小写的字符串比较，如“string.ToLower() == string.ToLower()”中所示，因为它们会导致分配。请改用“string.Equals(string, StringComparison)”以执行不区分大小写的比较。切换到使用采用“StringComparison”的重载可能会导致行为发生细微变化，因此在应用建议后执行全面测试非常重要。此外，如果不需要区分区域性的比较，请考虑使用“StringComparison.OrdinalIgnoreCase”。
zh_hant: 避免呼叫 'ToLower'、'ToUpper'、'ToLowerInvariant' 和 'ToUpperInvariant' 來執行不區分大小寫的字串比較，例如在 'string.ToLower() == string.ToLower()' 中，因為它們會導致配置。請改用 'string.Equals(string, StringComparison)' 以執行不區分大小寫的比較。切換至使用多載 (其採用 'StringComparer') 可能會導致行為發生輕微變更，因此在套用建議之後，必須進行全面性測試。此外，如果不需要文化相關比較，請考慮使用 'StringComparison.OrdinalIgnoreCase'。

# RecommendCaseInsensitiveStringEqualsMessage
source: Prefer using 'string.Equals(string, StringComparison)' to perform a case-insensitive comparison, but keep in mind that this might cause subtle changes in behavior, so make sure to conduct thorough testing after applying the suggestion, or if culturally sensitive comparison is not required, consider using 'StringComparison.OrdinalIgnoreCase'
cs: Pro porovnání bez rozlišování velkých a malých písmen preferujte použití „string.Equals(string, StringComparison)“, ale mějte na paměti, že to může způsobit drobné změny v chování. Proto nezapomeňte provést důkladné testování po použití návrhu nebo pokud není vyžadováno kulturní porovnání, zvažte použití „stringComparison.OrdinalIgnoreCase“.
de: Verwenden Sie lieber "string.Equals(string, StringComparison)", um einen Vergleich ohne Berücksichtigung der Groß-/Kleinschreibung durchzuführen. Beachten Sie jedoch, dass dies zu geringfügigen Verhaltensänderungen führen kann. Stellen Sie daher sicher, dass Sie nach dem Anwenden des Vorschlags gründlich testen. Falls kein kulturabhängiger Vergleich erforderlich ist, sollten Sie "StringComparison.OrdinalIgnoreCase" verwenden.
es: Prefiera usar "string.Equals(string, StringComparison)" para realizar una comparación sin distinción de mayúsculas y minúsculas, pero tenga en cuenta que esto puede provocar cambios sutiles en el comportamiento, por lo que asegúrese de realizar pruebas exhaustivas después de aplicar la sugerencia, o si no se requiere una comparación culturalmente confidencial, considere la posibilidad de usar "StringComparison.OrdinalIgnoreCase"
fr: Utilisez de préférence « string.Equals(string, StringComparison) » pour effectuer une comparaison sans respect de la casse, mais gardez à l’esprit que cela peut entraîner des modifications subtiles du comportement. Veillez donc à effectuer des tests approfondis après l’application de la suggestion ou, si la comparaison sensible à la culture n’est pas nécessaire, envisagez d’utiliser « StringComparison.OrdinalIgnoreCase »
it: Preferire l'uso di "string.Equals(string, StringComparison)" per eseguire un confronto senza distinzione tra maiuscole e minuscole, ma tenere presente che ciò potrebbe causare lievi modifiche nel comportamento, quindi assicurarsi di eseguire test completi dopo l'applicazione del suggerimento o, se non è necessario un confronto sensibile a livello di cultura, provare a usare "StringComparison.OrdinalIgnoreCase"
ja: 大文字と小文字を区別しない比較を実行するには、'string.Equals(string, StringComparison)' を使用することをお勧めしますが、これにより、動作が微妙に変化する可能性があることに注意してください。そのため、提案を適用した後に十分なテストを実施してください。また、文化的に敏感な比較を行う必要がない場合は、'StringComparison.OrdinalIgnoreCase' の使用を検討してください
ko: 대/소문자를 구분하지 않는 비교를 수행하기 위해 'string.Equals(string, StringComparison)'를 사용하는 것을 선호하되 이로 인해 동작이 미세하게 바뀔 수 있으므로 제안을 적용한 후 정밀한 테스트를 수행하거나, 문화적으로 민감한 비교가 필요하지 않은 경우에는 'StringComparison.OrdinalIgnoreCase' 사용을 고려해 보세요.
pl: Preferuj używanie ciągu „string.Equals(string, StringComparison)”, aby wykonać porównanie bez uwzględniania wielkości liter, ale pamiętaj, że może to spowodować subtelne zmiany w zachowaniu, więc upewnij się, że przeprowadzasz dokładne testy po zastosowaniu sugestii lub jeśli porównanie wrażliwe kulturowo nie jest wymagane, rozważ użycie elementu „StringComparer.OrdinalIgnoreCase”
pt_br: Prefira usar 'string.Equals(string, StringComparison)' para realizar uma comparação que não diferencia maiúsculas de minúsculas, mas lembre-se de que isso pode causar mudanças sutis no comportamento, portanto, certifique-se de realizar testes completos após aplicar a sugestão, ou se for uma comparação culturalmente sensível não é obrigatório, considere usar 'StringComparison.OrdinalIgnoreCase'
ru: Для сравнения без учета регистра лучше использовать "string.Equals(string, StringComparison)", но помните, что при этом поведение может немного измениться, поэтому проведите тщательное тестирование после применения этой рекомендации. Если же сравнение с учетом культуры не требуется, попробуйте использовать "StringComparison.OrdinalIgnoreCase".
tr: Büyük/küçük harfe duyarsız bir karşılaştırma gerçekleştirmek için 'string.Equals(string, StringComparison)' kullanmayı tercih edin ancak bunun davranışta küçük değişikliklere neden olabileceğini unutmayın. Bu nedenle, öneriyi uyguladıktan sonra mutlaka kapsamlı testler yapın veya kültürel açıdan hassas karşılaştırma gerekmiyorsa 'StringComparer.OrdinalIgnoreCase' kullanmayı göz önünde bulundurun
zh_hans: 首选使用“string.Equals(string, StringComparison)”执行不区分大小写的比较，但请记住，这可能会导致行为发生细微变化，因此请确保在应用建议后进行全面测试，或者，如果不需要区分区域性的比较，请考虑使用“StringComparison.OrdinalIgnoreCase”
zh_hant: 建議使用 'string.Equals(string, StringComparison)' 執行不區分大小寫的比較，但請注意，這可能會導致行為發生輕微變更，因此請務必在套用建議之後進行全面測試，或者如果不需要文化相關比較，請考慮使用 'StringComparison.OrdinalIgnoreCase

source: Remove redundant call
cs: Odebrat redundantní volání
de: Redundanten Aufruf entfernen
es: Quitar llamada redundante
fr: Supprimer un appel redondant
it: Rimuovi la chiamata ridondante
ja: 冗長な呼び出しを削除する
ko: 중복 호출 제거
pl: Usuń nadmiarowe wywołanie
pt_br: Remova a chamada redundante
ru: Удалить избыточный вызов
tr: Gereksiz çağrıyı kaldır
zh_hans: 删除冗余的调用
zh_hant: 移除冗餘的呼叫

# RemoveRedundantGuardCallCodeFixTitle
source: Remove unnecessary call
cs: Odebrat nepotřebné volání
de: Nicht erforderlichen Aufruf entfernen
es: Quitar llamada innecesaria
fr: Supprimer les appels inutiles
it: Rimuovere chiamata non necessaria
ja: 不要な呼び出しの削除
ko: 불필요한 호출 제거
pl: Usuń niepotrzebne wywołanie
pt_br: Remover chamada desnecessária
ru: Удалите ненужный вызов
tr: Gereksiz çağrıyı kaldır
zh_hans: 删除不必要调用
zh_hant: 移除不必要的呼叫

# ReplaceStringLiteralWithCharLiteralCodeActionTitle
source: Replace string literal with char literal
cs: Nahradit řetězcový literál s literálem char
de: Zeichenfolgenliteral durch Zeichenliteral ersetzen
es: Reemplazar literal de cadena por literal char
fr: Remplacer le littéral de chaîne par un littéral de caractère
it: Sostituire il valore letterale stringa con il valore letterale char
ja: 文字列リテラルを char リテラルに置き換える
ko: 문자열 리터럴을 char 리터럴로 바꾸기
pl: Zamień literał ciągu na literał char
pt_br: Substituir literal de cadeia de caracteres por literal char
ru: Заменить строковый литерал на знаковый литерал
tr: Sabit değerli dizeyi sabit değerli karakter ile değiştirin
zh_hans: 将字符串字面量替换为字符型文本
zh_hant: 以字元常值取代字串常值
