Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TestForNaNCorrectlyTitle
source: Test for NaN correctly
cs: Testujte správně hodnotu NaN
de: Ordnungsgemäß auf NaN testen
es: Probar NaN correctamente
fr: Effectuer correctement les tests NaN
it: Testare i valori NaN in modo corretto
ja: NaN に対して正しくテストします
ko: NaN에 대해 정확하게 테스트하세요.
pl: Sprawdzaj poprawnie pod kątem wartości NaN
pt_br: Testar para NaN corretamente
ru: Правильно выполняйте проверку NaN
tr: NaN testini doğru uygulayın
zh_hans: 正确测试 NaN
zh_hant: 正確地測試 NaN

# ThreadStaticInitializedInlineDescription
source: 'ThreadStatic' fields should be initialized lazily on use, not with inline initialization nor explicitly in a static constructor, which would only initialize the field on the thread that runs the type's static constructor.
cs: Pole ThreadStatic by se měla inicializovat laxně při použití, ne s vloženou inicializací ani explicitně ve statickém konstruktoru, což by inicializovalo pole jenom ve vlákně, které spouští statický konstruktor typu.
de: \"ThreadStatic\"-Felder sollten bei der Verwendung verzögert initialisiert werden, nicht mit Inlineinitialisierung oder explizit in einem statischen Konstruktor, der nur das Feld in dem Thread initialisieren würde, der den statischen Konstruktor des Typs ausführt.
es: Los campos “ThreadStatic” deben inicializarse de forma diferida al usarse, no con inicialización insertada ni explícitamente en un constructor estático, lo que solo inicializaría el campo en el subproceso que ejecuta el constructor estático del tipo.
fr: Les champs « ThreadStatic » doivent être initialisés tardivement lors de l’utilisation, pas avec l’initialisation inline ni explicitement dans un constructeur statique, ce qui initialiserait uniquement le champ sur le thread qui exécute le constructeur statique du type.
it: I campi 'ThreadStatic' devono essere inizializzati in modo differito durante l’esecuzione, non con inizializzazione inline né in modo esplicito in un costruttore statico, che inizializza il campo solo nel thread che esegue il costruttore statico del tipo.
ja: 'ThreadStatic' フィールドは、インラインの初期化や静的コンストラクターでの明示的な初期化ではなく、使用時に遅延して初期化される必要があります。そうすることで、型の静的コンストラクターを実行するスレッド上のフィールドのみが初期化されます。
ko: 'ThreadStatic' 필드는 인라인 초기화를 사용하거나 명시적으로 유형의 정적 생성자를 실행하는 스레드의 필드만 초기화하는 정적 생성자에서가 아니라 사용 시 느리게 초기화되어야 합니다.
pl: Pola „ThreadStatic“ powinny być inicjowane z opóźnieniem w użyciu, a nie z inicjacją śródwierszową ani jawnie w konstruktorze statycznym, co spowodowałoby zainicjowanie pola tylko w wątku, w którym działa konstruktor statyczny typu.
pt_br: Os campos “ThreadStatic” devem ser inicializado de forma lenta durante o uso, não com inicialização embutida nem explicitamente em um construtor estático, o que inicializaria somente o campo no thread que executa o construtor estático do tipo.
ru: Поля ThreadStatic должны инициализироваться отложенно при использовании, а не с помощью встроенной инициализации или явным образом в статическом конструкторе, который инициализирует поле только в потоке, где выполняется статический конструктор типа.
tr: 'ThreadStatic' alanları kullanım sırasında geç başlatılmalıdır. Satır içi başlatma kullanılarak veya yalnızca türün statik oluşturucusunu çalıştıran iş parçacığındaki alanı başlatacak olan bir statik oluşturucuda açıkça başlatılmamalıdır.
zh_hans: “ThreadStatic” 字段应在使用时延迟初始化，不应使用内联初始化，也不应在静态构造函数中显式初始化，这只会初始化县城上运行该类型的静态构造函数的字段。
zh_hant: 'ThreadStatic' 欄位應該在使用時初始化，而非使用內嵌初始化，也不應該明確初始化在靜態建構函式中，而此建構函式只會初始化執行該類型之靜態建構函式之執行緒上的欄位。

# ThreadStaticInitializedInlineMessage
source: 'ThreadStatic' fields should not use inline initialization
cs: Pole ThreadStatic by neměla používat vloženou inicializaci.
de: \"ThreadStatic\"-Felder dürfen keine Inlineinitialisierung verwenden.
es: Los campos “ThreadStatic” no deben usar la inicialización insertada
fr: Les champs « ThreadStatic » ne doivent pas utiliser l’initialisation inline
it: I campi 'ThreadStatic' non devono usare l'inizializzazione inline
ja: 'ThreadStatic' フィールドにインライン初期化を使用しないようにしてください
ko: 'ThreadStatic' 필드는 인라인 초기화를 사용하면 안 됩니다.
pl: Pola „ThreadStatic“ nie powinny używać inicjowania wbudowanego
pt_br: Os campos “ThreadStatic” não devem usar inicialização embutida
ru: Поля ThreadStatic не должны использовать встроенную инициализацию
tr: 'ThreadStatic' alanları satır içi başlatma kullanmamalıdır
zh_hans: “ThreadStatic” 字段不应使用内联初始化
zh_hant: 'ThreadStatic' 欄位不應該使用內嵌初始化

# ThreadStaticInitializedInlineTitle
source: Improper 'ThreadStatic' field initialization
cs: Nesprávná inicializace pole ThreadStatic
de: Ungültige Initialisierung des \"ThreadStatic\"-Feldes
es: Inicialización de campo “ThreadStatic” incorrecta
fr: Initialisation incorrecte du champ « ThreadStatic »
it: Inizializzazione del campo 'ThreadStatic' non corretta
ja: 'ThreadStatic' フィールドの初期化が不適切です
ko: 잘못된 'ThreadStatic' 필드 초기화
pl: Nieprawidłowe inicjowanie pola „ThreadStatic“
pt_br: Inicialização do campo “ThreadStatic” inadequada
ru: Неправильная инициализация поля ThreadStatic
tr: 'ThreadStatic' alanı başlatması hatalı
zh_hans: “ThreadStatic” 字段初始化不正确
zh_hant: 不正確的 'ThreadStatic' 欄位初始化

# ThreadStaticOnNonStaticFieldDescription
source: 'ThreadStatic' only affects static fields. When applied to instance fields, it has no impact on behavior.
cs: ThreadStatic má vliv jenom na statická pole. Když se pole instance použijí, nemá to žádný vliv na chování.
de: \"ThreadStatic\" wirkt sich nur auf statische Felder aus. Bei Anwendung auf Instanzfelder hat dies keine Auswirkungen auf das Verhalten.
es: “ThreadStatic” solo afecta a campos estáticos. Cuando se aplica a campos de instancia, no afecta al comportamiento.
fr: « ThreadStatic » affecte uniquement les champs statiques. Lorsqu’il est appliqué aux champs d’instance, il n’a aucun impact sur le comportement.
it: 'ThreadStatic' ha effetto solo sui campi statici. Se applicato ai campi dell'istanza, non ha alcun impatto sul comportamento.
ja: 'ThreadStatic' は静的フィールドにのみ影響します。インスタンス フィールドに適用しても、動作には影響しません。
ko: 'ThreadStatic'은(는) 정적 필드에만 영향을 줍니다. 인스턴스 필드에 적용할 때 동작에 영향을 주지 않습니다.
pl: Element „ThreadStatic“ ma wpływ tylko na pola statyczne. Po zastosowaniu do pól wystąpienia, nie ma on wpływu na zachowanie.
pt_br: “ThreadStatic” afeta somente campos estáticos. Quando aplicado aos campos de instância, ele não afeta o comportamento.
ru: ThreadStatic влияет только на статические поля. При применении к полям экземпляра это не влияет на поведение.
tr: 'ThreadStatic' yalnızca statik alanları etkiler. Örnek alanlara uygulandığında davranış üzerinde etkisi yoktur.
zh_hans: “ThreadStatic” 仅影响静态字段。应用于实例字段时，它不会影响行为。
zh_hant: 'ThreadStatic' 只會影響靜態欄位。套用到執行個體欄位時，不會影響行為。

# ThreadStaticOnNonStaticFieldMessage
source: Ensure 'ThreadStatic' is only used with static fields
cs: Ujistěte se, že ThreadStatic se používá jenom se statickými poli.
de: Sicherstellen, dass \"ThreadStatic\" nur mit statischen Feldern verwendet wird
es: Asegúrese de que “ThreadStatic” solo se usa con campos estáticos
fr: Vérifier que « ThreadStatic » est utilisé uniquement avec des champs statiques
it: Assicurarsi che 'ThreadStatic' sia usato solo con campi statici
ja: 'ThreadStatic' が静的フィールドでのみ使用されていることを確認する
ko: 'ThreadStatic'이(가) 정적 필드에서만 사용되는지 확인
pl: Upewnij się, że element „ThreadStatic“ jest używany tylko z polami statycznymi
pt_br: Verificar se “ThreadStatic” só é usado com campos estáticos
ru: Используйте ThreadStatic только со статическими полями
tr: 'ThreadStatic' iş parçacığının yalnızca statik alanlarla kullanıldığından emin olun
zh_hans: 确保 “ThreadStatic” 仅用于静态字段
zh_hant: 確保 'ThreadStatic' 只用於靜態欄位

# ThreadStaticOnNonStaticFieldTitle
source: 'ThreadStatic' only affects static fields
cs: ThreadStatic má vliv jenom na statická pole.
de: \"ThreadStatic\" wirkt sich nur auf statische Felder aus
es: “ThreadStatic” solo afecta a campos estáticos
fr: « ThreadStatic » affecte uniquement les champs statiques
it: 'ThreadStatic' influisce solo sui campi statici
ja: 'ThreadStatic' は静的フィールドにのみ影響します
ko: 'ThreadStatic'은(는) 정적 필드에만 영향을 줍니다.
pl: Element „ThreadStatic“ ma wpływ tylko na pola statyczne
pt_br: “ThreadStatic” afeta somente campos estáticos
ru: ThreadStatic влияет только на статические поля
tr: 'ThreadStatic' yalnızca statik alanları etkiler
zh_hans: “ThreadStatic” 仅影响静态字段
zh_hant: 'ThreadStatic' 只會影響靜態欄位

# UseArgumentExceptionThrowHelperTitle
source: Use ArgumentException throw helper
cs: Použití pomocné rutiny vyvolání ArgumentException
de: ArgumentException-Throw-Hilfsprogramm verwenden
es: Uso del asistente de inicio ArgumentException
fr: Utilisation de l’assistant de levée ArgumentException
it: Usare l'helper throw ArgumentException
ja: ArgumentException スロー ヘルパーを使用する
ko: ArgumentException throw 도우미 사용
pl: Użyj pomocnika zgłaszania ArgumentException
pt_br: Usar o auxiliar de lançamento ArgumentException
ru: Использовать вспомогательное приложение по вызову ArgumentException
tr: ArgumentException oluşturma yardımcısı kullan
zh_hans: 使用 ArgumentException 引发帮助程序
zh_hant: 使用 ArgumentException 擲回協助程式

# UseArgumentNullExceptionThrowHelperTitle
source: Use ArgumentNullException throw helper
cs: Použití pomocné rutiny vyvolání ArgumentNullException
de: ArgumentNullException-Throw-Hilfsprogramm verwenden
es: Uso del asistente de inicio ArgumentNullException
fr: Utilisation de l’assistant de levée ArgumentNullException
it: Usare ArgumentNullException per generare l'helper
ja: ArgumentNullException スロー ヘルパーを使用する
ko: ArgumentNullException throw 도우미 사용
pl: Użyj pomocnika zgłaszania ArgumentNullException
pt_br: Usar o auxiliar de lançamento de ArgumentNullException
ru: Использовать вспомогательное приложение по вызову ArgumentNullException
tr: ArgumentNullException oluşturma yardımcısını kullan
zh_hans: 使用 ArgumentNullException 引发帮助程序
zh_hant: 使用 ArgumentNullException 擲回協助程式

# UseArgumentOutOfRangeExceptionThrowHelperTitle
source: Use ArgumentOutOfRangeException throw helper
cs: Použití pomocné rutiny vyvolání ArgumentOutOfRangeException
de: ArgumentOutOfRangeException-Throw-Hilfsprogramm verwenden
es: Uso del asistente de inicio ArgumentOutOfRangeException
fr: Utiliser l’assistance de levée ArgumentOutOfRangeException
it: Usare ArgumentOutOfRangeException per generare l'helper
ja: ArgumentOutOfRangeException スロー ヘルパーを使用する
ko: ArgumentOutOfRangeException throw 도우미 사용
pl: Użyj pomocnika zgłaszania ArgumentOutOfRangeException
pt_br: Usar o auxiliar de lançamento ArgumentOutOfRangeException
ru: Использовать вспомогательное приложение по вызову ArgumentOutOfRangeException
tr: ArgumentOutOfRangeException oluşturma yardımcısı kullan
zh_hans: 使用 ArgumentOutOfRangeException 引发帮助程序
zh_hant: 使用 ArgumentOutOfRangeException 擲回協助程式

source: Use Array.Empty
cs: Použijte Array.Empty
de: Array.Empty verwenden
es: Usar Array.Empty
fr: Utiliser Array.Empty
it: Usare Array.Empty
ja: Array.Empty を使用します
ko: Array.Empty를 사용하세요.
pl: Użyj metody Array.Empty
pt_br: Usar Array.Empty
ru: Используйте Array.Empty
tr: Array.Empty kullanın
zh_hans: 使用 Array.Empty
zh_hant: 使用 Array.Empty

# UseAsSpanInsteadOfArrayRangeIndexerDescription
source: The Range-based indexer on array values produces a copy of requested portion of the array. This copy is often unwanted when it is implicitly used as a Span or Memory value. Use the AsSpan method to avoid the copy.
cs: Indexer hodnot pole založený na rozsahu vytváří kopii požadované části pole. Když se implicitně používá jako hodnota Span nebo Memory, je tato kopie často nežádoucí. Pokud se jí chcete vyhnout, použijte metodu AsSpan.
de: Der Range-basierte Indexer für Arraywerte erstellt eine Kopie des angeforderten Bereichs des Arrays. Diese Kopie ist bei einer impliziten Verwendung als Span- oder Memory-Wert häufig unerwünscht. Verwenden Sie die Methode "AsSpan", um das Erstellen einer Kopie zu vermeiden.
es: El indizador basado en intervalos en los valores de matriz genera una copia de la parte solicitada de la matriz. Esta copia suele ser no deseada cuando se usa implícitamente como valor Span o Memory. Use el método AsSpan para evitar la copia.
fr: L'indexeur basé sur Range pour les valeurs de tableau produit une copie de la partie demandée du tableau. Cette copie est souvent indésirable quand elle est implicitement utilisée en tant que valeur Span ou Memory. Utilisez la méthode AsSpan pour éviter la copie.
it: Con l'indicizzatore basato su Range su valori di matrice viene prodotta una copia della porzione richiesta della matrice. Questa copia è spesso indesiderata quando viene usata in modo implicito come valore di Span o Memory. Per evitare la copia, usare il metodo AsSpan.
ja: 配列の値に対して範囲ベースのインデクサーを使用すると、要求された配列の部分のコピーが作成されます。Span または Memory 値として暗黙的に使用される場合、このコピーは不要であることが少なくありません。このコピーを回避するには、AsSpan メソッドをご使用ください。
ko: 배열 값에 대한 범위 기반 인덱서는 배열의 요청된 부분의 복사본을 생성합니다. 이 복사본은 암시적으로 범위 또는 메모리 값으로 사용될 경우 대개 필요하지 않습니다. 복사본이 생성되지 않도록 하려면 AsSpan 메서드를 사용하세요.
pl: Użycie indeksatora opartego na zakresie w przypadku wartości tablicy powoduje utworzenie kopii żądanej części tablicy. Ta kopia jest często niechciana, gdy jest niejawnie używana jako wartość Span lub Memory. Użyj metody AsSpan, aby uniknąć kopiowania.
pt_br: O Indexador baseado em intervalo em valores de matriz produz uma cópia da porção solicitada da matriz. Essa cópia costuma ser indesejada quando é usada implicitamente como um valor de Span ou de Memory. Use o método AsSpan para evitar a cópia.
ru: Основанный на диапазонах индексатор для значений массива создает копию запрошенной части массива. Эта копия часто нежелательна, если она неявно используется в качестве значения Span или Memory. Используйте метод AsSpan, чтобы избежать копирования.
tr: Dizi değerleri üzerindeki Aralık tabanlı dizin oluşturucu, dizinin istenen kısmının bir kopyasını üretir. Bu kopya, örtük olarak bir Yayılma veya Bellek değeri olarak kullanıldığında genellikle istenmez. Kopya oluşturmamak için AsSpan metodunu kullanın.
zh_hans: 数组值的基于范围的索引器生成数组所请求部分的副本。此副本在隐式用作 Span 或 Memory 值时常常是不需要的。使用 AsSpan 方法可避免此副本。
zh_hant: 陣列值中以 Range 為基礎的索引子會產生陣列中要求部分的複本。隱含使用此複本作為 Span 或 Memory 值時，通常不需此複本。請使用 AsSpan 方法來避免使用此複本。

# UseAsSpanInsteadOfRangeIndexerMessage
source: Use '{0}' instead of the '{1}'-based indexer on '{2}' to avoid creating unnecessary data copies
cs: V {2} místo indexeru založeného na {1} použijte {0}, nebudou se tak vytvářet nepotřebné kopie dat.
de: Verwenden Sie "{0}" anstelle des {1}-basierten Indexers für "{2}", um das Erstellen nicht erforderlicher Datenkopien zu vermeiden.
es: Use "{0}" en lugar del indizador basado en "{1}" en "{2}" para evitar la creación de copias de datos innecesarias.
fr: Utilisez '{0}' à la place de l'indexeur basé sur '{1}' pour '{2}' afin d'éviter la création de copies de données inutiles
it: Usare '{0}' invece dell'indicizzatore basato su '{1}' su '{2}' per evitare la creazione di copie di dati non necessarie
ja: 不要なデータ コピーが作成されないようにするには、'{2}' で '{1}' ベースのインデクサーの代わりに '{0}' を使用してください
ko: 불필요한 데이터 복사본을 만들지 않으려면 '{2}'에서 '{1}' 기반 인덱서 대신 '{0}'을(를) 사용하세요.
pl: Użyj metody „{0}” zamiast indeksatora opartego na elementu „{1}” w przypadku wartości „{2}”, aby uniknąć tworzenia niepotrzebnych kopii danych
pt_br: Use '{0}' em vez do indexador baseado em '{1}' em '{2}' para evitar a criação de cópias de dados desnecessárias
ru: Используйте "{0}" вместо индексатора на основе "{1}" в "{2}", чтобы избежать создания ненужных копий данных.
tr: Gereksiz veri kopyaları oluşturmamak için '{2}' üzerinde '{1}' tabanlı dizin oluşturucu yerine '{0}' kullanın
zh_hans: 请使用 "{0}" 代替 "{2}" 上的基于 "{1}" 的索引器，以避免创建不必要的数据副本
zh_hant: 在 '{2}' 上使用 '{0}' 代替以 '{1}' 為基礎的索引子，以避免建立不必要的資料複本

# UseAsSpanInsteadOfRangeIndexerOnAStringCodeFixTitle
source: Use `{0}` instead of Range-based indexers on a string
cs: Použít {0} namísto indexerů založených na rozsahu na řetězci
de: "{0}" anstelle von bereichsbasierten Indexern in einer Zeichenfolge verwenden
es: Usar "{0}" en lugar de indizadores basados en intervalos en una cadena
fr: Utiliser '{0}' à la place des indexeurs basés sur une plage dans une chaîne
it: Usare `{0}` invece di indicizzatori basati su Range su una stringa
ja: 文字列で範囲ベースのインデクサーの代わりに '{0}' を使用する
ko: 문자열의 범위 기반 인덱서 대신 '{0}' 사용
pl: Użyj elementu „{0}” zamiast indeksatorów opartych na zakresie względem ciągu
pt_br: Use `{0}` em vez de indexadores baseados em Intervalo em uma cadeia de caracteres
ru: Используйте "{0}" вместо индексаторов на основе диапазона в строке
tr: Dizede Aralık tabanlı dizin oluşturucular yerine `{0}` kullanın
zh_hans: 对字符串使用“{0}”而不是基于范围的索引器
zh_hant: 請對字串使用 '{0}'，而不要使用範圍索引子

# UseAsSpanInsteadOfRangeIndexerOnAnArrayCodeFixTitle
source: Use `{0}` instead of Range-based indexers on an array
cs: Použít {0} namísto indexerů založených na rozsahu na poli
de: "{0}" anstelle von bereichsbasierten Indexern in einem Array verwenden
es: Usar "{0}" en lugar de indizadores basados en intervalos en una matriz
fr: Utiliser '{0}' à la place des indexeurs basés sur une plage dans un tableau
it: Usare `{0}` invece di indicizzatori basati su Range su una matrice
ja: 配列で範囲ベースのインデクサーの代わりに '{0}' を使用する
ko: 배열의 범위 기반 인덱서 대신 '{0}' 사용
pl: Użyj elementu „{0}” zamiast indeksatorów opartych na zakresie względem tablicy
pt_br: Use `{0}` em vez de indexadores baseados em Intervalo em uma matriz
ru: Используйте "{0}" вместо индексаторов на основе диапазона в массиве
tr: Dizide Aralık tabanlı dizin oluşturucular yerine `{0}` kullanın
zh_hans: 对数组使用“{0}”而不是基于范围的索引器
zh_hant: 請對陣列使用 '{0}'，而不要使用範圍索引子

# UseAsSpanInsteadOfRangeIndexerTitle
source: Use AsSpan or AsMemory instead of Range-based indexers when appropriate
cs: Tam, kde je to možné, používat místo indexerů založených na rozsahu metody AsSpan nebo AsMemory
de: Verwenden Sie bei Bedarf anstelle von Range-basierten Indexern "AsSpan" oder "AsMemory".
es: Usar AsSpan o AsMemory en lugar de indizadores basados en intervalos cuando proceda
fr: Utiliser AsSpan ou AsMemory à la place des indexeurs basés sur Range quand cela est approprié
it: Se necessario, usare AsSpan o AsMemory invece di indicizzatori basati su Range
ja: 該当する場合、範囲ベースのインデクサーの代わりに AsSpan か AsMemory を使用する
ko: 적절한 경우 범위 기반 인덱서 대신 AsSpan 또는 AsMemory를 사용합니다.
pl: Użyj metody AsSpan lub AsMemory zamiast indeksatorów opartych na zakresie, gdy ma to zastosowanie
pt_br: Use AsSpan ou AsMemory em vez de Indexadores baseados em intervalo quando apropriado
ru: При необходимости используйте AsSpan или AsMemory вместо индексаторов на основе диапазонов
tr: Uygun olduğunda Aralık tabanlı dizin oluşturucular yerine AsSpan veya AsMemory kullanın
zh_hans: 适当时，使用 AsSpan 或 AsMemory，而不是基于范围的索引器
zh_hant: 在適當情況下使用 AsSpan 或 AsMemory 取代以 Range 為基礎的索引子

# UseAsSpanInsteadOfStringRangeIndexerDescription
source: The Range-based indexer on string values produces a copy of requested portion of the string. This copy is usually unnecessary when it is implicitly used as a ReadOnlySpan or ReadOnlyMemory value. Use the AsSpan method to avoid the unnecessary copy.
cs: Indexer hodnot řetězců založený na rozsahu vytváří kopii požadované části řetězce. Když se implicitně používá jako hodnota ReadOnlySpan nebo ReadOnlyMemory, je tato kopie obvykle zbytečná. Pokud se jí chcete vyhnout, použijte metodu AsSpan.
de: Der Range-basierte Indexer für Zeichenfolgenwerte erzeugt eine Kopie des angeforderten Teils der Zeichenfolge. Diese Kopie ist bei der impliziten Verwendung als ReadOnlySpan- oder ReadOnlyMemory-Wert in der Regel nicht notwendig. Verwenden Sie die AsSpan-Methode, um die nicht benötigte Kopie zu vermeiden.
es: El indizador basado en intervalos en los valores de cadena genera una copia de la parte solicitada de la cadena. Esta copia suele ser innecesaria cuando se usa implícitamente como valor ReadOnlySpan o ReadOnlyMemory. Use el método AsSpan para evitar la copia innecesaria.
fr: L'indexeur basé sur Range pour les valeurs de chaîne produit une copie de la partie demandée de la chaîne. Cette copie est généralement inutile quand elle est implicitement utilisée en tant que valeur ReadOnlySpan ou ReadOnlyMemory. Utilisez la méthode AsSpan pour éviter toute copie inutile.
it: Con l'indicizzatore basato su Range su valori di stringa viene prodotta una copia della porzione richiesta della stringa. Questa copia è in genere non necessaria quando viene usata in modo implicito come valore di ReadOnlySpan o ReadOnlyMemory. Per evitare la copia non necessaria, usare il metodo AsSpan.
ja: 文字列値に対して範囲ベースのインデクサーを使用すると、要求された文字列の部分のコピーが作成されます。ReadOnlySpan または ReadOnlyMemory 値として暗黙的に使用される場合、このコピーは不要であることが少なくありません。不要なコピーを回避するには、AsSpan メソッドをご使用ください。
ko: 문자열 값에 대한 범위 기반 인덱서는 문자열의 요청된 부분의 복사본을 생성합니다. 이 복사본은 암시적으로 ReadOnlySpan 또는 ReadOnlyMemory 값으로 사용될 경우 대개 필요하지 않습니다. 불필요한 복사본이 생성되지 않도록 하려면 AsSpan 메서드를 사용하세요.
pl: Użycie indeksatora opartego na zakresie w przypadku wartości ciągu powoduje utworzenie kopii żądanej części ciągu. Ta kopia jest zwykle niepotrzebna, gdy jest niejawnie używana jako wartość ReadOnlySpan lub ReadOnlyMemory. Użyj metody AsSpan, aby uniknąć zbędnego kopiowania.
pt_br: O Indexador com base em intervalo em valores de cadeia de caracteres produz uma cópia da porção solicitada da cadeia de caracteres. Essa cópia normalmente é desnecessária quando é usada implicitamente como um valor de ReadOnlySpan ou de ReadOnlyMemory. Use o método AsSpan para evitar a cópia desnecessária.
ru: Основанный на диапазонах индексатор для строковых значений создает копию запрошенной части строки. Эта копия обычно не требуется, если она неявно используется в качестве значения ReadOnlySpan или ReadOnlyMemory. Используйте метод AsSpan, чтобы избежать ненужного копирования.
tr: Dize değerleri üzerindeki Aralık tabanlı dizin oluşturucu, dizenin istenen kısmının bir kopyasını oluşturur. Bu kopya örtük olarak bir ReadOnlySpan veya ReadOnlyMemory değeri olarak kullanıldığında genellikle gereksizdir. Kopya oluşturmamak için AsSpan metodunu kullanın.
zh_hans: 字符串值基于范围的索引器生成字符串的请求部分的副本。此副本在隐式用作 ReadOnlySpan 或 ReadOnlyMemory 值时常常是不需要的。使用 AsSpan 方法可避免使用不必要的副本。
zh_hant: 字串值中以 Range 為基礎的索引子會產生字串中要求部分的複本。隱含使用此複本作為 ReadOnlySpan 或 ReadOnlyMemory 值時，通常不需此複本。請使用 AsSpan 方法來避免使用不必要的複本。
