Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotDisableRequestValidationDescription
source: Request validation is a feature in ASP.NET that examines HTTP requests and determines whether they contain potentially dangerous content. This check adds protection from markup or code in the URL query string, cookies, or posted form values that might have been added for malicious purposes. So, it is generally desirable and should be left enabled for defense in depth.
cs: Ověřování požadavků je funkce v ASP.NET, která kontroluje požadavky HTTP a určuje, jestli neobsahují potenciálně nebezpečný obsah. Tato kontrola přidává ochranu před značkami nebo kódem v řetězci dotazu adresy URL, souborech cookie nebo odeslaných hodnotách formuláře, které se mohly přidat pro škodlivé účely. Proto je obecně žádoucí a pro důkladnou obranu by se měla nechat povolená.
de: Die Anforderungsüberprüfung ist ein Feature in ASP.NET, das HTTP-Anforderungen untersucht und ermittelt, ob sie potenziell gefährliche Inhalte enthalten. Diese Überprüfung fügt Schutz vor Markup oder Code in der URL-Abfragezeichenfolge, in Cookies oder in bereitgestellten Formularwerten hinzu, das bzw. der möglicherweise zu böswilligen Zwecken hinzugefügt wurden. Deshalb wird sie allgemein empfohlen und sollte für eine detaillierte Verteidigung aktiviert bleiben.
es: La validación de solicitudes es una característica de ASP.NET que examina las solicitudes HTTP y determina si incluyen contenido potencialmente peligroso. Esta comprobación agrega protección para marcado o código en los valores de formularios publicados, cookies o cadenas de consulta de URL que puedan haberse agregado con fines malintencionados. Por tanto, se recomienda su uso y debería dejarse habilitada para una defensa en profundidad.
fr: La validation de requête est une fonctionnalité ASP.NET qui examine les requêtes HTTP pour déterminer si elles contiennent un contenu potentiellement dangereux. Cette vérification renforce la protection contre l'ajout malveillant de balises ou de code dans la chaîne de requête, les cookies ou les valeurs de formulaire posté de l'URL. Il est donc généralement souhaitable de laisser cette fonctionnalité activée pour une défense en profondeur.
it: La convalida delle richieste è una funzionalità di ASP.NET che esamina le richieste HTTP e determina se includono contenuto potenzialmente pericoloso. Questo controllo costituisce un'ulteriore misura di protezione da markup o codice presente nella stringa di query dell'URL, nei cookie o nei valori del modulo pubblicato che potrebbero essere stati aggiunti per scopi dannosi. Si tratta quindi di un controllo auspicabile che deve essere lasciato abilitato per una difesa più efficace.
ja: 要求の検証は、HTTP 要求を調べ、危険性のあるコンテンツが含まれているかどうかを判断する ASP.NET の機能です。この確認により、不正な目的のために追加された可能性がある、URL クエリ文字列内のマークアップやコード、Cookie、投稿されたフォームの値から保護することができます。そのため、この機能は一般的に望ましいものであり、多重の防御のために有効にしておくべきです。
ko: 요청 유효성 검사는 HTTP 요청을 검사하고 잠재적으로 위험한 콘텐츠가 포함되는지 확인하는 ASP.NET 기능입니다. 이 검사는 악의적인 목적으로 추가되었을 수 있는 URL 쿼리 문자열, 쿠키 또는 게시된 양식 값에 있는 태그 또는 코드에서 보호를 추가합니다. 따라서 일반적으로 이 검사를 수행하는 것이 좋고 심층 방어를 위해 사용하도록 설정해 두어야 합니다.
pl: Weryfikacja żądań to funkcja platformy ASP.NET, która sprawdza żądania HTTP i określa, czy zawierają potencjalnie niebezpieczną zawartość. To sprawdzenie zapewnia dodatkową ochronę przed znacznikami lub kodem w ciągu zapytania adresu URL, plikach cookie lub przesłanych wartościach formularza, które mogły zostać dodane w złośliwym celu. Ogólnie jest to pożądana funkcja i powinna pozostać włączona, aby zapewnić ochronę w głębi systemu.
pt_br: A validação de solicitação é um recurso do ASP.NET que examina as solicitações HTTP e determina se elas contêm conteúdo possivelmente perigoso. Essa verificação adiciona proteção de marcação ou de código na cadeia de consulta da URL, nos cookies ou nos valores de formulário postados que possam ter sido adicionados com intenção maliciosa. Portanto, ela geralmente é desejável e deve permanecer habilitada para aumentar a proteção.
ru: Проверка запросов — это функция ASP.NET, которая анализирует HTTP-запросы и определяет, содержат ли они потенциально опасное содержимое. Эта проверка улучшает защиту от разметки или кода в строке запроса URL-адреса, файлах cookie или значениях опубликованной формы, которые могли быть добавлены злоумышленником. Таким образом, в общем случае эта проверка желательна, и ее следует оставить включенной, чтобы обеспечить полноценную защиту.
tr: İstek doğrulama, HTTP isteklerini inceleyen ve bu isteklerin potansiyel olarak tehlikeli içeriğe sahip olup olmadığını belirleyen bir ASP.NET özelliğidir. Bu denetleme, URL sorgu dizesi, tanımlama bilgileri veya kötü amaçlarla eklenmiş olabilecek gönderilmiş form değerlerindeki işaretleme veya kodlara karşı koruma sağlar. Dolayısıyla bu genellikle istenen bir özelliktir ve kapsamlı savunma için etkin olarak bırakılmalıdır.
zh_hans: 请求验证是 ASP.NET 中的一项功能，用于检查 HTTP 请求，并确定它们是否包含潜在危险内容。此检查可针对 URL 查询字符串中的标记或代码、cookie 或可能因恶意目的而添加的已发布表单值进行防护。因此，通常需要此验证并且应该保持启用以进行深度防御。
zh_hant: 要求驗證是 ASP.NET 中的功能，其會檢查 HTTP 要求，並會決定其是否包含具潛在危險性的內容。這項檢查對標記或程式碼的 URL 查詢字串、Cookie 或因惡意目的而可能新增的張貼表單值，提供更佳的安全性。因此，一般最好能使用，且應持續啟用以達到全面性防禦。

# DoNotDisableRequestValidationMessage
source: {0} has request validation disabled
cs: {0} má zakázané ověřování žádostí.
de: Für "{0}" wurde die Anforderungsüberprüfung deaktiviert.
es: {0} tiene deshabilitada la validación de solicitudes.
fr: La validation de requête est désactivée pour {0}
it: La convalida delle richieste è disabilitata per {0}
ja: メソッド {0} の要求の検証が無効です
ko: {0}에서 요청 유효성 검사가 사용하지 않도록 설정되었습니다.
pl: Element {0} ma wyłączoną weryfikację żądań
pt_br: {0} tem uma validação de solicitação desabilitada
ru: Для метода {0} проверка запросов отключена.
tr: {0} öğesinde istek doğrulama devre dışı
zh_hans: {0} 已禁用请求验证
zh_hant: {0} 已停用要求驗證

# DoNotDisableSchUseStrongCrypto
source: Do Not Disable SChannel Use of Strong Crypto
cs: Nezakazovat zprostředkovateli SChannel použití silného šifrování
de: Deaktivieren Sie die starke Verschlüsselung für Schannel nicht
es: No deshabilitar el uso de cifrado seguro de SChannel
fr: Ne pas désactiver l'utilisation du chiffrement fort par SChannel
it: Non disabilitare l'uso della crittografia avanzata in Schannel
ja: SChannel による強力な暗号の使用を無効にしません
ko: SChannel의 강력한 암호화 사용을 비활성화하지 않음
pl: Nie należy wyłączać użycia silnej kryptografii w pakiecie SChannel
pt_br: Não Desabilitar Uso de Criptografia Forte SChannel
ru: Не отключайте стойкое шифрование в защищенном канале
tr: Güçlü Şifrelemenin Schannel Kullanımını Devre Dışı Bırakma
zh_hans: 请勿禁用较强加密的 SChannel 使用
zh_hant: 請勿停用 SChannel 使用強式加密

# DoNotDisableSchUseStrongCryptoDescription
source: Starting with the .NET Framework 4.6, the System.Net.ServicePointManager and System.Net.Security.SslStream classes are recommended to use new protocols. The old ones have protocol weaknesses and are not supported. Setting Switch.System.Net.DontEnableSchUseStrongCrypto with true will use the old weak crypto check and opt out of the protocol migration.
cs: Počínaje .NET Framework 4.6 se doporučuje, aby třídy System.Net.ServicePointManager a System.Net.Security.SslStream používaly nové protokoly. Staré protokoly mají slabá místa a nejsou podporovány. Po nastavení Switch.System.Net.DontEnableSchUseStrongCrypto na hodnotu true se použije stará slabá kryptografická kontrola a výslovný nesouhlas s migrací protokolů.
de: Ab .NET Framework 4.6 wird empfohlen, dass die Klassen System.Net.ServicePointManager und System.Net.Security.SslStream neue Protokolle verwenden. Bei den alten Klassen liegen Protokollschwächen vor, weshalb sie nicht unterstützt werden. Wenn Sie Switch.System.Net.DontEnableSchUseStrongCrypto auf TRUE festlegen, wird die alte, schwache Verschlüsselungsprüfung verwendet und die Protokollmigration verhindert.
es: A partir de .NET Framework 4.6, se recomienda que las clases System.Net.ServicePointManager y System.Net.Security.SslStream usen nuevos protocolos. Los anteriores presentan vulnerabilidades y no se admiten. Al establecer Switch.System.Net.DontEnableSchUseStrongCrypto en true, se usará la comprobación de cifrado poco seguro anterior y no se aplicará la migración de protocolo.
fr: À partir de .NET Framework 4.6, les classes System.Net.ServicePointManager et System.Net.Security.SslStream sont recommandées pour l'utilisation des nouveaux protocoles. Les anciennes classes présentent des faiblesses relatives aux protocoles et ne sont pas prises en charge. Si vous affectez la valeur true à Switch.System.Net.DontEnableSchUseStrongCrypto, vous utilisez une vérification de chiffrement faible et vieillissante, et vous n'avez plus accès à la migration de protocole.
it: A partire da .NET Framework 4.6, è consigliabile che le classi System.Net.ServicePointManager e System.Net.Security.SslStream usino nuovi protocolli. I protocolli precedenti presentano punti debolezza e non sono supportati. Se si imposta Switch.System.Net.DontEnableSchUseStrongCrypto su true, verrà usato il precedente controllo della crittografia vulnerabile e sarà possibile rifiutare esplicitamente la migrazione dei protocolli.
ja: .NET Framework 4.6 以降、System.Net.ServicePointManager および System.Net.Security.SslStream クラスで新しいプロトコルを使用することをお勧めします。古いものは、プロトコルの脆弱性があるため、サポートされていません。Switch.System.Net.DontEnableSchUseStrongCrypto を true に設定すると、古くて脆弱な暗号のチェックが使用され、プロトコルの移行がオプトアウトされます。
ko: .NET Framework 4.6부터 System.Net.ServicePointManager 및 System.Net.Security.SslStream 클래스는 새 프로토콜을 사용하는 것이 좋습니다. 프로토콜 약점이 있는 기존 클래스는 지원되지 않습니다. Switch.System.Net.DontEnableSchUseStrongCrypto를 true로 설정하면 이전의 취약한 암호화 검사를 사용하여 프로토콜 마이그레이션을 옵트아웃합니다.
pl: Zaczynając od programu .NET Framework 4.6, klasy System.Net.ServicePointManager i System.Net.Security.SslStream są zalecane do użycia dla nowych protokołów. W starych występują słabości protokołu i nie są one obsługiwane. Ustawienie wartości true dla parametru Switch.System.Net.DontEnableSchUseStrongCrypto spowoduje użycie starego i słabego sprawdzania kryptograficznego oraz rezygnację z migracji protokołu.
pt_br: Iniciando com o .NET Framework 4.6, é recomendado que as classes System.Net.ServicePointManager e System.Net.Security.SslStream usem os novos protocolos. Os antigos têm vulnerabilidades de protocolo e não contam com suporte. A configuração de Switch.System.Net.DontEnableSchUseStrongCrypto como true fará com que a verificação de criptografia fraca antiga seja usada e que a migração de protocolo seja recusada.
ru: Начиная с .NET Framework 4.6 в классах System.Net.ServicePointManager и System.Net.Security.SslStream рекомендуется использовать новые протоколы. В старых протоколах обнаружены уязвимости, и они не поддерживаются. При установке значения true для параметра Switch.System.Net.DontEnableSchUseStrongCrypto будет включена проверка использования устаревшего протокола с наличием уязвимостей и не будет выполнен переход на новый протокол.
tr: .NET Framework 4.6'dan itibaren, yeni protokolleri kullanmak için System.Net.ServicePointManager ve System.Net.Security.SslStream sınıfları önerilir. Eski sınıflar protokol zayıflıklarına sahip olduğundan bunlar desteklenmez. Switch.System.Net.DontEnableSchUseStrongCrypto özelliğinin true olarak ayarlanması eski zayıf şifreleme denetimini kullanır ve protokol geçişini reddeder.
zh_hans: 建议从 .NET Framework 4.6、System.Net.ServicePointManager 和 System.Net.Security.SslStream 类开始以使用新的协议。旧的协议具有协议缺陷，不受支持。将 Switch.System.Net.DontEnableSchUseStrongCrypto 设置为 true 将使用旧的弱加密检查并选择退出协议迁移。
zh_hant: 自 .NET Framework 4.6 起，即建議 System.Net.ServicePointManager 及 System.Net.Security.SslStream 類別使用新的通訊協定。舊款通訊協定中有通訊協定弱點，已不支援。將 Switch.System.Net.DontEnableSchUseStrongCrypto 設定為 true，將會使用舊的弱式密碼編譯檢查，並會選擇退出通訊協定移轉。

# DoNotDisableSchUseStrongCryptoMessage
source: {0} disables TLS 1.2 and enables SSLv3
cs: {0} zakazuje TLS 1.2 a povoluje SSLv3.
de: {0} deaktiviert TLS 1.2 und aktiviert SSLv3
es: {0} deshabilita TLS 1.2 y habilita SSLv3
fr: {0} désactive TLS 1.2 et active SSLv3
it: {0} disabilita TLS 1.2 e abilita SSLv3
ja: {0} は、TLS 1.2 を無効にして、SSLv3 を有効にします
ko: {0}이(가) TLS 1.2를 사용하지 않도록, SSLv3를 사용하도록 설정합니다.
pl: Metoda {0} wyłącza protokół TLS 1.2 i włącza protokół SSLv3
pt_br: O {0} desabilita o TLS 1.2 e habilita o SSLv3
ru: {0} отключает TLS 1.2 и включает SSLv3
tr: {0}, TLS 1.2'yi devre dışı bırakır ve SSLv3'ü etkinleştirir
zh_hans: {0} 禁用 TLS 1.2 并且启用 SSLv3
zh_hant: {0} 停用 TLS 1.2 並啟用 SSLv3

# DoNotDisableTokenValidationChecksDescription
source: Token validation checks ensure that while validating tokens, all aspects are analyzed and verified. Turning off validation can lead to security holes by allowing untrusted tokens to make it through validation.
cs: Kontroly ověřování tokenů zajišťují, že při ověřování tokenů se analyzují a ověřují všechny aspekty. Vypnutí ověřování může vést k mezerám v zabezpečení tím, že umožňuje nedůvěryhodným tokenům projít přes ověření.
de: Durch Tokenvalidierungsprüfungen wird sichergestellt, dass beim Überprüfen von Token alle Aspekte analysiert und überprüft werden. Das Deaktivieren der Validierung kann zu Sicherheitslücken führen, da nicht vertrauenswürdige Token die Überprüfung durchführen können.
es: Las comprobaciones de validación de tokens garantizan que, al validar los tokens, se analicen y comprueben todos los aspectos. La desactivación de la validación puede conducir a vulnerabilidades de seguridad al permitir que los tokens que no son de confianza lo hagan durante la validación.
fr: Les vérifications de validation de jeton garantissent que lors de la validation des jetons, tous les aspects sont analysés et vérifiés. La désactivation de la validation peut entraîner des failles de sécurité en autorisant les jetons non approuvés à le faire via la validation.
it: I controlli di convalida dei token garantiscono che, durante la convalida dei token, tutti gli aspetti vengano analizzati e verificati. La disattivazione della convalida può causare problemi di sicurezza consentendo l'esecuzione della convalida anche per token non attendibili.
ja: トークンの検証チェックでは、トークンの検証中にすべての側面の分析と検証が行われます。検証をオフにすると、信頼されていないトークンが検証を通過してしまうことがあるため、セキュリティホールが発生する可能性があります。
ko: 토큰 유효성 검사는 토큰 유효성을 검사하는 동안 모든 측면이 분석되고 확인되도록 합니다. 유효성 검사를 끄면 신뢰할 수 없는 토큰이 유효성 검사를 통과하도록 허용하여 보안 허점이 발생할 수 있습니다.
pl: Sprawdzanie walidacji tokenu zagwarantuje, że podczas weryfikowania tokenów wszystkie aspekty zostaną poddane analizie i zweryfikowane. Wyłączenie walidacji może spowodować powstanie luk w zabezpieczeniach, umożliwiając niezaufanym tokenom przechodzenie przez proces walidacji.
pt_br: As verificações de validação dos tokens garantem que, ao validar os tokens, todos os aspectos sejam analisados e verificados. A desativação da validação pode resultar em falhas na segurança, permitindo que tokens não confiáveis sejam validados.
ru: При проверке токенов все аспекты анализируются и проверяются. Отключение проверки может привести к возникновению бреши в системе безопасности, так как ненадежные токены смогут обойти ее.
tr: Belirteç doğrulama kontrolleri, belirteçleri doğrularken tüm yönlerin analiz edilmesini ve doğrulanmasını sağlar. Doğrulamayı kapatmak, güvenilmeyen belirteçlerin doğrulamadan geçmesine izin vererek güvenlik açıklarına yol açabilir.
zh_hans: 令牌验证检查确保在验证令牌时，对所有方面进行分析和验证。关闭验证会允许不受信任的令牌通过验证，从而导致安全漏洞。
zh_hant: 權杖驗證檢查可確保在驗證權杖時，分析並驗證所有方面。關閉驗證可能會造成安全性漏洞，因為可能會允許未受信任的權杖通過驗證。

# DoNotDisableTokenValidationChecksMessage
source: TokenValidationParameters.{0} should not be set to false as it disables important validation
cs: TokenValidationParameters. Hodnota {0} by neměla být nastavena na False, protože to zakáže důležité ověřování.
de: TokenValidationParameters.{0}soll nicht auf FALSE festgelegt werden, da die wichtige Überprüfung deaktiviert wird.
es: TokenValidationParameters. {0} no se debe establecer en false porque deshabilita una validación importante
fr: TokenValidationParameters. {0} ne doit pas avoir la valeur false, car il désactive la validation importante.
it: TokenValidationParameters.{0} non deve essere impostato su false perché disabilita la convalida importante
ja: TokenValidationParameters。重要な検証を無効にしてしまうため、{0} を FALSE に設定しないでください
ko: TokenValidationParameters.{0}은(는) 중요한 유효성 검사를 비활성화하므로 false로 설정하면 안 됩니다.
pl: TokenValidationParameters. {0} nie należy ustawiać na wartość false, ponieważ spowoduje to wyłączenie ważnych weryfikacji
pt_br: TokenValidationParameters.{0} não deve ser definido como falso, pois desativa validações importantes
ru: TokenValidationParameters. Для {0} не следует задавать значение false, так как при этом будет отключена важная проверка
tr: TokenValidationParameters. {0} önemli doğrulamayı devre dışı bıraktığından false olarak ayarlanmamalıdır
zh_hans: TokenValidationParameters。{0} 不应设置为 false，因为它会禁用重要验证
zh_hant: TokenValidationParameters.{0} 不應設定為 False，因為它會停用重要驗證

# DoNotDisableTokenValidationChecksTitle
source: Do not disable token validation checks
cs: Nezakazujte kontroly ověřování tokenů
de: Tokenvalidierungsprüfungen nicht deaktivieren
es: No deshabilitar comprobaciones de validación de tokens
fr: Ne pas désactiver les vérifications de validation de jeton
it: Non disabilitare i controlli di convalida dei token
ja: トークンの検証チェックを無効にしない
ko: 토큰 유효성 검사를 비활성화하지 마세요
pl: Nie wyłączaj sprawdzania walidacji tokenów
pt_br: Não desative as verificações de validação de token
ru: Не отключать проверки токенов
tr: Belirteç doğrulama denetimlerini devre dışı bırakma
zh_hans: 请勿禁用令牌验证检查
zh_hant: 請勿停用權杖驗證檢查

# DoNotDisableUsingServicePointManagerSecurityProtocolsMessage
source: Do not set Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols to true. Setting this switch limits Windows Communication Framework (WCF) to using Transport Layer Security (TLS) 1.0, which is insecure and obsolete.
cs: Nenastavujte přepínač Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols na hodnotu true. Nastavení tohoto přepínače omezuje architekturu Windows Communication Framework (WCF) na používání protokolu Transport Layer Security (TLS) 1.0, který je nezabezpečený a zastaralý.
de: Legen Sie Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols nicht auf TRUE fest. Durch das Festlegen dieses Schalters wird WCF (Windows Communication Framework) auf die Verwendung von TLS 1.0 (Transport Layer Security) eingeschränkt, das unsicher und veraltet ist.
es: No establezca Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols en true. Al establecer este modificador, se limita a Windows Communication Framework (WCF) a usar la Seguridad de la capa de transporte (TLS) 1.0, que no es segura y está obsoleta.
fr: N'affectez pas la valeur true à Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols. La définition de ce commutateur limite WCF (Windows Communication Framework) à l'utilisation du protocole TLS (Transport Layer Security) 1.0, qui est non sécurisé et obsolète.
it: Non impostare Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols su true. Se si imposta questa opzione, si limita Windows Communication Framework (WCF) a usare Transport Layer Security (TLS) 1.0, che è insicuro e obsoleto.
ja: Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols を true に設定しないでください。このスイッチを設定すると、Windows Communication Framework (WCF) で、古く安全ではないトラスポート層セキュリティ (TLS) 1.0 しか使用できなくなります。
ko: Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols를 true로 설정하지 마세요. 이 스위치를 설정하면 WCF(Windows Communication Framework)가 안전하지 않고 사용되지 않는 TLS(전송 계층 보안) 1.0을 사용하도록 제한됩니다.
pl: Nie ustawiaj parametru Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols na wartość true. Ustawienie tego przełącznika ogranicza platformę Windows Communication Framework (WCF) do korzystania z protokołu Transport Layer Security (TLS) 1.0, który jest niezabezpieczony i przestarzały.
pt_br: Não defina Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols como true. Definir essa opção limita o WCF (Windows Communication Framework) a usar o protocolo TLS 1.0, que não é seguro e está obsoleto.
ru: Не задавайте для Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols значение TRUE. Если задать этот параметр, Windows Communication Framework (WCF) сможет использовать только протокол TLS 1.0, что является небезопасным и устаревшим.
tr: Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols anahtarını true olarak ayarlamayın. Bu anahtarı ayarlamak, Windows Communication Framework'ü (WCF) güvenli olmayan ve eski Aktarım Katmanı Güvenliği (TLS) 1.0 kullanacak şekilde kısıtlar.
zh_hans: 不要将 Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols 设置为 true。设置此开关会将 Windows Communication Framework (WCF)限制为使用传输层安全性(TLS) 1.0，而该层不安全且已过时。
zh_hant: 不要將 Switch.System.ServiceModel.DisableUsingServicePointManagerSecurityProtocols 設定為 true。設定此參數會限制 Windows Communication Framework (WCF) 使用不安全且已淘汰的傳輸層安全性 (TLS) 1.0。

# DoNotDisableUsingServicePointManagerSecurityProtocolsTitle
source: Do not disable ServicePointManagerSecurityProtocols
cs: Nezakazujte ServicePointManagerSecurityProtocols
de: ServicePointManagerSecurityProtocols nicht deaktivieren
es: No deshabilitar ServicePointManagerSecurityProtocols
fr: Ne pas désactiver ServicePointManagerSecurityProtocols
it: Non disabilitare ServicePointManagerSecurityProtocols
ja: ServicePointManagerSecurityProtocols を無効にしないでください
ko: ServicePointManagerSecurityProtocols를 사용하지 않도록 설정 안 함
pl: Nie wyłączaj protokołów ServicePointManagerSecurityProtocols
pt_br: Não desabilitar ServicePointManagerSecurityProtocols
ru: Не отключайте ServicePointManagerSecurityProtocols
tr: ServicePointManagerSecurityProtocols öğesini devre dışı bırakmayın
zh_hans: 不禁用 ServicePointManagerSecurityProtocols
zh_hant: 不要停用 ServicePointManagerSecurityProtocols
