Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ReviewCodeForSqlInjectionVulnerabilitiesMessage
source: Potential SQL injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží SQL, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Einschleusung von SQL-Befehlen gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de SQL en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de code SQL a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo SQL injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な SQL インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 SQL 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie kodu SQL, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de SQL, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода SQL, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası SQL ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在 SQL 注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入 SQL 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForSqlInjectionVulnerabilitiesTitle
source: Review code for SQL injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží SQL v kódu
de: Code auf Sicherheitsrisiken durch Einschleusung von SQL-Befehlen überprüfen
es: Revisar vulnerabilidades de inyección de SQL en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de code SQL
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo SQL injection
ja: コードをレビューし、SQL インジェクションの脆弱性を確認する
ko: 코드에서 SQL 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie kodu SQL
pt_br: Revisão de código quanto a vulnerabilidades de injeção de SQL
ru: Проверьте код на наличие уязвимостей к внедрению кода SQL
tr: Kodu SQL ekleme güvenlik açıkları için inceleyin
zh_hans: 检查 SQL 注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入 SQL 弱點

# ReviewCodeForXPathInjectionVulnerabilitiesMessage
source: Potential XPath injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží XPath, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XPath-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de inyección de XPath en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection XPath a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo XPath injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な XPath インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XPath 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie wyrażenia XPath, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de XPath, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода XPath, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası XPath ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在 XPath 注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入 XPath 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForXPathInjectionVulnerabilitiesTitle
source: Review code for XPath injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží XPath v kódu
de: Code auf Sicherheitsrisiken durch XPath-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de XPath en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection XPath
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XPath injection
ja: コードをレビューし、XPath インジェクションの脆弱性を確認する
ko: 코드에서 XPath 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie wyrażenia XPath
pt_br: Revisão de código quanto a vulnerabilidades de injeção de XPath
ru: Проверьте код на наличие уязвимостей к внедрению кода XPath
tr: Kodu XPath ekleme güvenlik açıkları için inceleyin
zh_hans: 查看 XPath 注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入 XPath 弱點

# ReviewCodeForXamlInjectionVulnerabilitiesMessage
source: Potential XAML injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží XAML, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XAML-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de inyección de XAML en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection XAML a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo XAML injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な XAML インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XAML 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie kodu XAML, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de XAML, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода XAML, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası XAML ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在 XAML 注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入 XAML 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForXamlInjectionVulnerabilitiesTitle
source: Review code for XAML injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží XAML v kódu
de: Code auf Sicherheitsrisiken durch XAML-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de XAML en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection XAML
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XAML injection
ja: コードをレビューし、XAML インジェクションの脆弱性を確認する
ko: 코드에서 XAML 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie kodu XAML
pt_br: Revisão de código quanto a vulnerabilidades de injeção de XAML
ru: Проверьте код на наличие уязвимостей к внедрению кода XAML
tr: Kodu XAML ekleme güvenlik açıkları için inceleyin
zh_hans: 查看 XAML 注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入 XAML 弱點

# ReviewCodeForXmlInjectionVulnerabilitiesMessage
source: Potential XML injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží XML, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XML-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de inyección de XML en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection XML a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo XML injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な XML インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XML 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie kodu XML, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de XML, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода XML, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası XML ekleme güvenlik açığı bulundu.
zh_hans: 找到了潜在 XML 注入漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的插入 XML 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForXmlInjectionVulnerabilitiesTitle
source: Review code for XML injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží XML v kódu
de: Code auf Sicherheitsrisiken durch XML-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de XML en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection XML
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XML injection
ja: コードをレビューし、XML インジェクションの脆弱性を確認する
ko: 코드에서 XML 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie kodu XML
pt_br: Revisão de código quanto a vulnerabilidades de injeção de XML
ru: Проверьте код на наличие уязвимостей к внедрению кода XML
tr: Kodu XML ekleme güvenlik açıkları için inceleyin
zh_hans: 查看 XML 注入漏洞的代码
zh_hant: 檢閱程式碼以了解是否有插入 XML 弱點

# ReviewCodeForXssVulnerabilitiesMessage
source: Potential cross-site scripting (XSS) vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení skriptováním mezi weby (XSS), kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XSS (Cross-Site Scripting) gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de ataque de scripts de sitios (XSS) en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une faille XSS (scripts intersites) a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo cross-site scripting (XSS) in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なクロスサイト スクリプト (XSS) の脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XSS(사이트 간 스크립팅) 취약성이 발견되었습니다.
pl: Wykryto potencjalną lukę umożliwiającą działanie skryptów międzywitrynowych (XSS), gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de XSS (cross-site scripting), em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к межсайтовым сценариям (XSS), где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası siteler arası betik yazma (XSS) güvenlik açığı bulundu.
zh_hans: 找到了潜在跨站点脚本(XSS)漏洞，其中方法“{1}”中的“{0}”可能会受到方法“{3}”中“{2}”的用户控制数据的污染。
zh_hant: 發現潛在的跨網站指令碼 (XSS) 弱點，方法 '{1}' 中的 '{0}' 可能被來自方法 '{3}' 中 '{2}' 由使用者控制的資料所感染。

# ReviewCodeForXssVulnerabilitiesTitle
source: Review code for XSS vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení proti XSS v kódu
de: Code auf Sicherheitsrisiken durch XSS überprüfen
es: Revisar vulnerabilidades de XSS en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées aux failles XSS
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XSS
ja: コードをレビューし、XSS の脆弱性を確認する
ko: 코드에서 XSS 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających działanie skryptów między witrynami
pt_br: Revisão de código quanto a vulnerabilidades de XSS
ru: Проверьте код на наличие уязвимостей к межсайтовым сценариям (XSS)
tr: Kodu XSS güvenlik açıkları için inceleyin
zh_hans: 检查 XSS 漏洞的代码
zh_hant: 檢閱程式碼以了解是否有 XSS 弱點

# ReviewSQLQueriesForSecurityVulnerabilitiesDescription
source: SQL queries that directly use user input can be vulnerable to SQL injection attacks. Review this SQL query for potential vulnerabilities, and consider using a parameterized SQL query.
cs: Dotazy SQL, které přímo používají uživatelský vstup, můžou být ohrožené útoky injektáží SQL. Zkontrolujte možná ohrožení zabezpečení tohoto dotazu SQL a zvažte možnost použít parametrizovaný dotaz SQL.
de: SQL-Abfragen, die eine Benutzereingabe direkt verwenden, können für Angriffe durch Einschleusung von SQL-Befehlen anfällig sein. Prüfen Sie diese SQL-Abfrage auf potenzielle Sicherheitsrisiken, und ziehen Sie die Verwendung einer parametrisierten SQL-Abfrage in Betracht.
es: Las consultas SQL que usan los datos del usuario directamente pueden ser vulnerables a ataques por inyección de código SQL. Revise la consulta SQL en busca de posibles vulnerabilidades y considere la posibilidad de usar una consulta SQL parametrizada.
fr: Les requêtes SQL qui utilisent directement les entrées utilisateur peuvent être vulnérables aux attaques par injection de code SQL. Recherchez dans cette requête SQL d'éventuelles vulnérabilités, puis utilisez une requête SQL paramétrable.
it: Le query SQL che usano direttamente l'input utente possono essere vulnerabili ad attacchi SQL injection. Esaminare la query SQL per individuare potenziali vulnerabilità e provare a usare una query SQL con parametri.
ja: ユーザー入力を直接使用する SQL クエリは、SQL インジェクション攻撃に対して脆弱である可能性があります。この SQL クエリをレビューして潜在的な脆弱性を確認し、パラメーター化された SQL クエリの使用を検討してください。
ko: 사용자 입력을 직접 사용하는 SQL 쿼리는 SQL 삽입 공격에 취약할 수 있습니다. 이 SQL 쿼리에 잠재적인 취약성이 있는지 검토하고 매개 변수화된 SQL 쿼리를 사용하는 것이 좋습니다.
pl: Zapytania SQL korzystające bezpośrednio z danych wejściowych użytkownika mogą być podatne na ataki polegające na wstrzyknięciu kodu SQL. Sprawdź to zapytanie SQL pod kątem potencjalnych luk i rozważ użycie sparametryzowanego zapytania SQL.
pt_br: As consultas SQL que usam a entrada do usuário diretamente podem ser vulneráveis a ataques de injeção de SQL. Examine esta consulta SQL quanto a possíveis vulnerabilidades e considere o uso de uma consulta SQL parametrizada.
ru: SQL-запросы, напрямую использующие введенные пользователем сведения, могут быть подвержены атакам путем внедрения кода SQL. Проверьте этот SQL-запрос на наличие уязвимостей и рассмотрите возможность использования параметризованного SQL-запроса.
tr: Doğrudan kullanıcı girişi kullanan SQL sorguları, SQL ekleme saldırılarına karşı savunmasız olabilir. Bu SQL sorgusunu olası güvenlik açıkları için inceleyin ve parametre tabanlı bir SQL sorgusu kullanmayı deneyin.
zh_hans: 直接使用用户输入的 SQL 查询可能容易受到 SQL 注入攻击。查看此 SQL 查询以查找潜在漏洞，请考虑使用参数化 SQL 查询。
zh_hant: 直接利用使用者輸入的 SQL 查詢，有可能會受到插入 SQL 的攻擊。請檢閱此 SQL 查詢是否有潛在的弱點，並請考慮使用參數化的 SQL 查詢。

# ReviewSQLQueriesForSecurityVulnerabilitiesMessageNoNonLiterals
source: Review if the query string passed to '{0}' in '{1}', accepts any user input
cs: Zkontrolujte, jestli řetězec dotazu, který se předává do {0} v {1}, přijímá uživatelský vstup.
de: Überprüfen Sie, ob die in "{1}" an "{0}" übergebene Abfragezeichenfolge Benutzereingaben akzeptiert.
es: Revise si la cadena de consulta que se pasó a "{0}" en "{1}" acepta datos proporcionados por el usuario.
fr: Vérifiez si la chaîne de requête passée à '{0}' dans '{1}' accepte des entrées utilisateur
it: Verificare se la stringa di query passata a '{0}' in '{1}' accetta input utente
ja: '{1}' の '{0}' に渡されたクエリ文字列が任意のユーザー入力を受け入れるかどうかを確認してください
ko: '{1}'의 '{0}'에 전달되는 쿼리 문자열이 사용자 입력을 허용하는지 검토합니다.
pl: Sprawdź, czy ciąg zapytania przekazany do elementu „{0}” w elemencie „{1}” akceptuje dowolne dane wejściowe użytkownika
pt_br: Examine se a cadeia de caracteres de consulta passada para '{0}' em '{1}' aceita qualquer entrada do usuário
ru: Проверьте, принимает ли строка запроса, переданная в "{0}" в "{1}", вводимые пользователем сведения.
tr: '{1}' içinde '{0}' öğesine geçirilen sorgu dizesinin kullanıcı girişi kabul edip etmediğini gözden geçirin
zh_hans: 查看传递给“{1}”中的“{0}”的查询字符串是否接受任何用户输入
zh_hant: 檢閱查詢字串是否已傳遞到 '{1}' 中的 '{0}'，接受所有使用者輸入

# ReviewSQLQueriesForSecurityVulnerabilitiesTitle
source: Review SQL queries for security vulnerabilities
cs: Zkontrolujte dotazy SQL pro chyby zabezpečení
de: SQL-Abfragen auf Sicherheitsrisiken überprüfen
es: Revisar consultas SQL para comprobar si tienen vulnerabilidades de seguridad
fr: Vérifier si les requêtes SQL présentent des failles de sécurité
it: Controllare l'eventuale vulnerabilità di sicurezza delle query SQL
ja: SQL クエリのセキュリティ脆弱性を確認
ko: 보안상 취약한 부분이 있는지 SQL 쿼리를 검토하십시오.
pl: Sprawdź zapytania SQL pod kątem luk w zabezpieczeniach
pt_br: Revisar as consultas SQL em busca de vulnerabilidades de segurança
ru: Проверка запросов SQL на уязвимости безопасности
tr: SQL sorgularını güvenlik açıkları için inceleyin
zh_hans: 检查 SQL 查询是否存在安全漏洞
zh_hant: 必須檢閱 SQL 查詢中是否有安全性弱點

# SealInternalTypesCodeFixTitle
source: Seal class
cs: Třída zapečetění
de: Siegelklasse
es: Clase de sello
fr: Sceller la Classe
it: Classe Seal
ja: クラスのシール
ko: 봉인 클래스
pl: Klasa pieczęci
pt_br: Classe do selo
ru: Класс запечатывания
tr: Sınıfı mühürle
zh_hans: 密封类
zh_hant: 密封類別

# SealInternalTypesDescription
source: When a type is not accessible outside its assembly and has no subtypes within its containing assembly, it can be safely sealed. Sealing types can improve performance.
cs: Pokud typ není přístupný mimo své sestavení a nemá v rámci svého obsaženého sestavení žádné podtypy, lze jej bezpečně zapečetit. Typy zapečetění můžou zlepšit výkon.
de: Wenn auf einen Typ außerhalb seiner Assembly nicht zugegriffen werden kann und keine Untertypen innerhalb seiner enthaltenden Assembly vorhanden sind, kann er sicher versiegelt werden. Dichtungsarten können die Leistung verbessern.
es: Cuando un tipo no es accesible fuera de su ensamblado y no tiene subtipos dentro de su ensamblado contenedor, se puede sellar de forma segura. Los tipos de sellado pueden mejorar el rendimiento.
fr: Lorsqu’un type n’est pas accessible en dehors de son assembly et qu’il n’a aucun sous-type dans son assembly conteneur, il peut être scellé en toute sécurité. Les types de scellage peuvent améliorer les performances.
it: Quando un tipo non è accessibile al di fuori del relativo assembly e non contiene sottotipi all'interno dell'assembly che lo contiene, può essere sealed. I tipi di sealing possono migliorare le prestazioni.
ja: 型がアセンブリの外部からアクセスできず、そこに含まれるアセンブリ内にサブタイプがない場合は、安全にシールできます。型をシールするとパフォーマンスが向上します。
ko: 형식이 해당 어셈블리 외부에서 액세스할 수 없고 포함하는 어셈블리 내에 하위 형식이 없는 경우 안전하게 봉인할 수 있습니다. 봉인 유형은 성능을 향상시킬 수 있습니다.
pl: Jeśli typ jest niedostępny poza swoim zestawem i nie ma żadnych podtypów w obrębie swojego zawierającego zestawu, to można go bezpiecznie zapieczętować. Zapieczętowanie typów może zwiększyć wydajność.
pt_br: Quando um tipo não está acessível fora da sua assembly e não tem subtipos dentro da sua assemlby que o contém, ele pode ser selado com segurança. Tipos de selagem podem melhorar o desempenho.
ru: Если тип недоступен вне сборки и не имеет подтипов в содержащей его сборке, его можно безопасно запечатать. Запечатывание типов может повысить производительность.
tr: Bir türe bütünleştirilmiş kodunun dışında erişilemediğinde ve türün kapsayan bütünleştirilmiş kodu içinde alt türü olmadığında, bu tür güvenli bir şekilde mühürlenebilir. Mühürleme türleri performansı artırabilir.
zh_hans: 当某类型在其程序集外部不可访问且其包含程序集中没有子类型时，可以安全地密封该类型。密封类型可以提高性能。
zh_hant: 當一個類型無法在其組建外部進行存取，且其包含元件內沒有子類型時，可以安全地密封該類型。密封類型可以改善效能。
