Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InstantiateArgumentExceptionsCorrectlyTitle
source: Instantiate argument exceptions correctly
cs: Vytvářejte správně instanci výjimek argumentů
de: Argumentausnahmen korrekt instanziieren
es: Crear instancias de las excepciones del argumento correctamente
fr: Instancier les exceptions d'argument correctement
it: Creare istanze di eccezioni di argomento in modo corretto
ja: 引数の例外を正しくインスタンス化します
ko: 올바른 인수 예외를 인스턴스화하세요.
pl: Utwórz poprawnie wystąpienia wyjątków argumentu
pt_br: Instanciar exceções de argumentos corretamente
ru: Правильно создавайте экземпляры исключений аргументов
tr: Bağımsız değişken özel durumlarını doğru bir şekilde başlatın
zh_hans: 正确实例化参数异常
zh_hant: 正確地將引數例外狀況具現化

# InterfaceMembersMissingImplementationDescription
source: Types attributed with 'DynamicInterfaceCastableImplementationAttribute' act as an interface implementation for a type that implements the 'IDynamicInterfaceCastable' type. As a result, it must provide an implementation of all of the members defined in the inherited interfaces, because the type that implements 'IDynamicInterfaceCastable' will not provide them otherwise.
cs: Typy s atributem DynamicInterfaceCastableImplementationAttribute se chovají jako implementace rozhraní pro typ, který implementuje typ IDynamicInterfaceCastable. V důsledku toho musí poskytovat implementaci všech členů definovaných ve zděděných rozhraních, protože typ, který implementuje IDynamicInterfaceCastable, je jinak neposkytne.
de: Typen mit dem Attribut "DynamicInterfaceCastableImplementationAttribute" fungieren als Schnittstellenimplementierung für einen Typ, der den Typ "IDynamicInterfaceCastable" implementiert. Als Ergebnis muss eine Implementierung aller in den geerbten Schnittstellen definierten Member bereitgestellt werden, weil der Typ, der "IDynamicInterfaceCastable" implementiert, sie nicht anderweitig bereitstellt.
es: Los tipos con atributos "DynamicInterfaceCastableImplementationAttribute" actúan como una implementación de interfaz para un tipo que implementa el tipo "IDynamicInterfaceCastable". Como resultado, debe proporcionar una implementación de todos los miembros definidos en las interfaces heredadas, ya que el tipo que implementa 'IDynamicInterfaceCastable' no los proporcionará de lo contrario.
fr: Les types attribués avec’DynamicInterfaceCastableImplementationAttribute’fonctionnent comme une implémentation d’interface pour un type qui implémente le type’IDynamicInterfaceCastable'. En conséquence, il doit fournir une implémentation de tous les membres définis dans les interfaces héritées, parce que le type qui implémente’IDynamicInterfaceCastable’ne les fournira pas autrement.
it: I tipi ai quali è stato applicato l'attributo 'DynamicInterfaceCastableImplementationAttribute' fungono da un'implementazione di interfaccia per un tipo che implementa il tipo 'IDynamicInterfaceCastable'. Di conseguenza, deve fornire un'implementazione di tutti i membri definiti nelle interfacce ereditate, perché il tipo che implementa 'IDynamicInterfaceCastable' non le fornisce diversamente.
ja: 'DynamicInterfaceCastableImplementationAttribute' の属性を持つ型は、'IDynamicInterfaceCastable' 型を実装する型のインターフェイス実装として機能します。その結果、継承されたインターフェイスで定義されているすべてのメンバーの実装を提供する必要があります。これは、'IDynamicInterfaceCastable' を実装する型では提供されないためです。
ko: 'DynamicInterfaceCastableImplementationAttribute' 특성이 있는 형식은 'IDynamicInterfaceCastable' 형식을 구현하는 형식에 대한 인터페이스 구현으로 작동합니다. 그 결과, 다른 경우에는 'IDynamicInterfaceCastable'을 구현하는 형식이 해당 항목을 제공하지 않기 때문에 상속된 인터페이스에 정의된 모든 멤버의 구현을 제공해야 합니다.
pl: Typy z atrybutem „DynamicInterfaceCastableImplementationAttribute” działają jako implementacja interfejsu dla typu, który implementuje typ „IDynamicInterfaceCastable”. W związku z tym musi dostarczać implementację wszystkich składowych zdefiniowanych w dziedziczonych interfejsach, ponieważ typ implementujący interfejs „IDynamicInterfaceCastable” nie udostępni ich w inny sposób.
pt_br: Os tipos atribuídos com 'DynamicInterfaceCastableImplementationAttribute' atuam como uma implementação de interface para um tipo que implementa o tipo 'IDynamicInterfaceCastable'. Como resultado, ele deve fornecer uma implementação de todos os membros definidos nas interfaces herdadas, porque o tipo que implementa 'IDynamicInterfaceCastable' não os fornecerá de outra forma.
ru: Типы с атрибутом "DynamicInterfaceCastableImplementationAttribute" действуют как реализация интерфейса для типа, который реализует тип "IDynamicInterfaceCastable". В результате они должны обеспечить реализацию всех элементов, определенных в унаследованных интерфейсах, так как тип, реализующий "IDynamicInterfaceCastable", не будет предоставлять их в противном случае.
tr: 'DynamicInterfaceCastableImplementationAttribute' özniteliğine sahip olan türler, 'IDynamicInterfaceCastable' türünü uygulayan bir tür için arabirim uygulaması olarak davranır. Sonuç olarak, devralınan arabirimlerde tanımlanan tüm üyelerin uygulanmasını sağlamalıdır çünkü diğer durumlarda 'IDynamicInterfaceCastable' uygulayan tür bu değeri sağlamaz.
zh_hans: 使用 “DynamicInterfaceCastableImplementationAttribute” 特性化的类型充当实现 “IDynamicInterfaceCastable” 类型的类型的接口实现。因此，它必须提供在继承的接口中定义的所有成员的实现，因为实现 “IDynamicInterfaceCastable” 的类型将不会提供它们。
zh_hant: 以 'DynamicInterfaceCastableImplementationAttribute' 作為屬性的類型，會當作實作 'IDynamicInterfaceCastable' 類型之類型的介面實作。因此，它必須提供繼承介面中定義之所有成員的實作，因為實作 'IDynamicInterfaceCastable' 的類型不會以其他方式提供它們。

# InterfaceMembersMissingImplementationMessage
source: Type '{0}' has the 'DynamicInterfaceCastableImplementationAttribute' applied to it but does not provide an implementation of all interface members defined in inherited interfaces
cs: Pro typ {0} je aplikovaná vlastnost DynamicInterfaceCastableImplementationAttribute, ale neposkytuje implementaci všech členů rozhraní definovaných ve zděděných rozhraních.
de: Auf den Typ "{0}" wird "DynamicInterfaceCastableImplementationAttribute" angewendet, aber es wird keine Implementierung aller Schnittstellenmember bereitgestellt, die in geerbten Schnittstellen definiert sind.
es: El tipo '{0}' tiene el atributo 'DynamicInterfaceCastableImplementationAttribute' aplicado, pero no proporciona una implementación de todos los miembros de interfaz definidos en interfaces heredadas.
fr: Le type' {0} 'a l’application ’DynamicInterfaceCastableImplementationAttribute’ mais ne fournit pas d’implémentation de tous les membres d’interface définis dans les interfaces héritées
it: Al tipo '{0}' è applicato l'elemento 'DynamicInterfaceCastableImplementationAttribute', che però non fornisce un'implementazione di tutti i membri di interfaccia definiti nelle interfacce ereditate
ja: 型 '{0}' には 'DynamicInterfaceCastableImplementationAttribute' が適用されていますが、継承されたインターフェイスで定義されているすべてのインターフェイス メンバーの実装を提供するわけではありません。
ko: '{0}' 형식에 'DynamicInterfaceCastableImplementationAttribute'가 적용되었지만 상속된 인터페이스에 정의된 모든 인터페이스 멤버의 구현을 제공하지 않습니다.
pl: Typ „{0}” ma zastosowany atrybut „DynamicInterfaceCastableImplementationAttribute”, ale nie udostępnia implementacji wszystkich składowych interfejsu zdefiniowanych w dziedziczonych interfejsach
pt_br: O tipo '{0}' tem o 'DynamicInterfaceCastableImplementationAttribute' aplicado a ele, mas não fornece uma implementação de todos os membros da interface definidos em interfaces herdadas
ru: К типу "{0}" применен "DynamicInterfaceCastableImplementationAttribute", но он не обеспечивает реализацию всех элементов интерфейса, определенных в унаследованных интерфейсах
tr: '{0}' türüne 'DynamicInterfaceCastableImplementationAttribute' uygulanmış ama devralınan arabirimlerde tanımlanan tüm arabirim üyelerinin uygulanmasını sağlamıyor
zh_hans: 类型“{0}”已应用 “DynamicInterfaceCastableImplementationAttribute”，但不提供继承接口中定义的所有接口成员的实现
zh_hant: 類型 '{0}' 已套用 'DynamicInterfaceCastableImplementationAttribute'，但未提供繼承介面中定義之所有介面成員的實作

# InterfaceMembersMissingImplementationTitle
source: All members declared in parent interfaces must have an implementation in a DynamicInterfaceCastableImplementation-attributed interface
cs: Všichni členové deklarovaní v nadřazených rozhraních musí mít implementaci v rozhraní s atributem DynamicInterfaceCastableImplementation.
de: Alle in übergeordneten Schnittstellen deklarierten Member müssen über eine Implementierung in einer Schnittstelle mit dem Attribut "DynamicInterfaceCastableImplementation" verfügen
es: Todos los miembros declarados en interfaces primarias deben tener una implementación en una interfaz con atributos DynamicInterfaceCastableImplementation
fr: Tous les membres déclarés dans les interfaces parentes doivent avoir une implémentation dans une interface avec attributs DynamicInterfaceCastableImplementation
it: Per tutti i membri dichiarati nelle interfacce padre devono esistere un'implementazione in un'interfaccia alla quale è stata applicato l'attributo DynamicInterfaceCastableImplementation
ja: 親インターフェイスで宣言されたすべてのメンバーは、DynamicInterfaceCastableImplementation 属性インターフェイスに実装されている必要があります
ko: 부모 인터페이스에 선언된 모든 멤버는 DynamicInterfaceCastableImplementation 속성 인터페이스에서 구현해야 합니다.
pl: Wszystkie składowe zadeklarowane w interfejsach nadrzędnych muszą mieć implementację w interfejsie DynamicInterfaceCastableImplementation-attributed
pt_br: Todos os membros declarados nas interfaces pai devem ter uma implementação em uma interface atributo DynamicInterfaceCastableImplementation
ru: У всех элементов, объявленных в родительских интерфейсах, должна быть реализация в интерфейсе с атрибутом DynamicInterfaceCastableImplementation
tr: Üst arabirimlerde bildirilen tüm üyelerin DynamicInterfaceCastableImplementation-öznitelikli bir arabirimde uygulanması gerekir
zh_hans: 在父接口中声明的所有成员必须在 DynamicInterfaceCastableImplementation-attributed 接口中具有实现
zh_hant: 在父介面中宣告的所有成員，在 DynamicInterfaceCastableImplementation 屬性介面中都必須有一個實作

# JavaScriptSerializerMaybeWithSimpleTypeResolverMessage
source: The method '{0}' is insecure when deserializing untrusted data with a JavaScriptSerializer initialized with a SimpleTypeResolver. Ensure that the JavaScriptSerializer is initialized without a JavaScriptTypeResolver specified, or initialized with a JavaScriptTypeResolver that limits the types of objects in the deserialized object graph.
cs: Metoda {0} není bezpečná při deserializaci nedůvěryhodných dat přes JavaScriptSerializer inicializovaný s nástrojem SimpleTypeResolver. Zajistěte, aby byl JavaScriptSerializer inicializovaný bez zadání nástroje JavaScriptTypeResolver nebo aby byl inicializovaný s nástrojem JavaScriptTypeResolver, který omezuje typy objektů v grafu deserializovaných objektů.
de: Die Methode "{0}" ist unsicher, wenn nicht vertrauenswürdige Daten mit einem JavaScriptSerializer deserialisiert werden, der mit einem SimpleTypeResolver initialisiert wurde. Stellen Sie sicher, dass der JavaScriptSerializer ohne Angabe eines JavaScriptTypeResolver oder mit einem JavaScriptTypeResolver initialisiert wird, der die Objekttypen im deserialisierten Objektgraphen einschränkt.
es: El método "{0}" no es seguro cuando se deserializan datos que no son de confianza con JavaScriptSerializer inicializado con SimpleTypeResolver. Asegúrese de que se ha inicializado JavaScriptSerializer sin especificar JavaScriptTypeResolver o de que se ha inicializado con un elemento JavaScriptTypeResolver que limite los tipos de objetos del grafo de objetos deserializado.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables à l'aide d'un JavaScriptSerializer initialisé avec un SimpleTypeResolver. Vérifiez que JavaScriptSerializer est initialisé sans JavaScriptTypeResolver, ou qu'il est initialisé avec un JavaScriptTypeResolver qui limite les types des objets dans le graphe d'objets désérialisé.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili con un elemento JavaScriptSerializer inizializzato con un elemento SimpleTypeResolver. Assicurarsi che l'elemento JavaScriptSerializer venga inizializzato senza specificare un elemento JavaScriptTypeResolver oppure che venga inizializzato con un elemento JavaScriptTypeResolver che limita i tipi di oggetti nel grafico di oggetti deserializzato.
ja: SimpleTypeResolver で初期化された JavaScriptSerializer で信頼されていないデータを逆シリアル化している場合、メソッド '{0}' は安全ではありません。JavaScriptTypeResolver が指定されずに JavaScriptSerializer が初期化されていること、または逆シリアル化されたオブジェクト グラフ内のオブジェクトの型を制限する JavaScriptTypeResolver で初期化されていることをご確認ください。
ko: SimpleTypeResolver로 초기화된 JavaScriptSerializer로 신뢰할 수 없는 데이터를 역직렬화하는 경우 '{0}' 메서드는 안전하지 않습니다. JavaScriptSerializer가 JavaScriptTypeResolver가 지정되지 않은 상태로 초기화되었거나 역직렬화된 개체 그래프에서 해당 개체 형식을 제한하는 JavaScriptTypeResolver로 초기화되었는지 확인하세요.
pl: Metoda „{0}” nie jest bezpieczna podczas deserializacji niezaufanych danych za pomocą klasy JavaScriptSerializer zainicjowanej z klasą SimpleTypeResolver. Upewnij się, że klasa JavaScriptSerializer jest inicjowana bez określonej klasy JavaScriptTypeResolver lub inicjowana z klasą JavaScriptTypeResolver, która ogranicza typy obiektów w zdeserializowanym grafie obiektów.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis com um JavaScriptSerializer inicializado com um SimpleTypeResolver. Verifique se o JavaScriptSerializer é inicializado sem um JavaScriptTypeResolver especificado ou inicializado com um JavaScriptTypeResolver que limita os tipos de objetos no grafo de objetos desserializado.
ru: Метод "{0}" является небезопасным при десериализации ненадежных данных с помощью JavaScriptSerializer, который был инициализирован с указанием SimpleTypeResolver. Убедитесь, что JavaScriptSerializer был инициализирован без указания JavaScriptTypeResolver или с указанием JavaScriptTypeResolver, который ограничивает типы объектов в десериализованном графе объектов.
tr: '{0}' yöntemi, SimpleTypeResolver ile başlatılmış bir JavaScriptSerializer ile güvenilmeyen veriler seri durumdan çıkarılırken güvenli değildir. JavaScriptSerializer'ın bir JavaScriptTypeResolver belirtilmeden başlatıldığından veya seri durumdan çıkarılan nesne grafındaki nesne türlerini sınırlayan bir JavaScriptTypeResolver ile başlatıldığından emin olun.
zh_hans: 使用通过 SimpleTypeResolver 初始化的 JavaScriptSerializer 反序列化不可信数据时，{0} 方法不安全。请确保初始化 JavaScriptSerializer 但不指定 JavaScriptTypeResolver，或使用限制为反序列化对象图形中的对象类型的 JavaScriptTypeResolver 初始化该对象。
zh_hant: 若使用以 SimpleTypeResolver 初始化的 JavaScriptSerializer 將未受信任的資料還原序列化，方法 '{0}' 就不安全。請確認將 JavaScriptSerializer 初始化時，未指定 JavaScriptTypeResolver，或使用 JavaScriptTypeResolver 來限制已還原序列化物件圖中的物件類型。

# JavaScriptSerializerMaybeWithSimpleTypeResolverTitle
source: Ensure JavaScriptSerializer is not initialized with SimpleTypeResolver before deserializing
cs: Zajistěte, aby se před deserializací neinicializoval JavaScriptSerializer s nástrojem SimpleTypeResolver.
de: Vor der Deserialisierung sicherstellen, dass JavaScriptSerializer nicht mit SimpleTypeResolver initialisiert wurde
es: Asegúrese de que no se ha inicializado JavaScriptSerializer con SimpleTypeResolver antes de deserializar
fr: Vérifier que JavaScriptSerializer n'est pas initialisé avec SimpleTypeResolver avant la désérialisation
it: Assicurarsi che JavaScriptSerializer non sia inizializzato con SimpleTypeResolver prima della deserializzazione
ja: 逆シリアル化する前に JavaScriptSerializer が SimpleTypeResolver で初期化されていないことを確認します
ko: deserialize하기 전에 JavaScriptSerializer가 SimpleTypeResolver로 초기화되지 않았는지 확인
pl: Upewnij się, że klasa JavaScriptSerializer nie jest zainicjowana za pomocą klasy z SimpleTypeResolver przed wykonaniem deserializacji
pt_br: Verifique se JavaScriptSerializer não foi inicializado com SimpleTypeResolver antes de desserializar
ru: Убедитесь, что JavaScriptSerializer не был инициализирован с SimpleTypeResolver до десериализации
tr: Seri durumdan çıkarmadan önce JavaScriptSerializer'ın SimpleTypeResolver ile başlatılmadığından emin olun
zh_hans: 请确保 JavaScriptSerializer 在反序列化之前未使用 SimpleTypeResolver 初始化
zh_hant: 請確認 JavaScriptSerializer 在還原序列化之前未以 SimpleTypeResolver 初始化

# JavaScriptSerializerWithSimpleTypeResolverMessage
source: The method '{0}' is insecure when deserializing untrusted data with a JavaScriptSerializer initialized with a SimpleTypeResolver. Initialize JavaScriptSerializer without a JavaScriptTypeResolver specified, or initialize with a JavaScriptTypeResolver that limits the types of objects in the deserialized object graph.
cs: Metoda {0} není bezpečná při deserializaci nedůvěryhodných dat přes JavaScriptSerializer inicializovaný s nástrojem SimpleTypeResolver. Inicializujte JavaScriptSerializer bez zadání nástroje JavaScriptTypeResolver nebo ho inicializujte s nástrojem JavaScriptTypeResolver, který omezuje typy objektů v grafu deserializovaných objektů.
de: Die Methode "{0}" ist unsicher, wenn nicht vertrauenswürdige Daten mit einem JavaScriptSerializer deserialisiert werden, der mit einem SimpleTypeResolver initialisiert wurde. Initialisieren Sie den JavaScriptSerializer ohne Angabe eines JavaScriptTypeResolver oder mit einem JavaScriptTypeResolver, der die Objekttypen im deserialisierten Objektgraphen einschränkt.
es: El método "{0}" no es seguro cuando se deserializan datos que no son de confianza con JavaScriptSerializer inicializado con SimpleTypeResolver. Inicialice JavaScriptSerializer sin especificar JavaScriptTypeResolver, o bien inicialícelo con un elemento JavaScriptTypeResolver que limite los tipos de objetos del grafo de objetos deserializado.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables à l'aide d'un JavaScriptSerializer initialisé avec un SimpleTypeResolver. Initialisez JavaScriptSerializer sans JavaScriptTypeResolver, ou initialisez un JavaScriptTypeResolver qui limite les types des objets dans le graphe d'objets désérialisé.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili con un elemento JavaScriptSerializer inizializzato con un elemento SimpleTypeResolver. Inizializzare JavaScriptSerializer senza specificare un elemento JavaScriptTypeResolver oppure inizializzarlo con un elemento JavaScriptTypeResolver che limita i tipi di oggetti nel grafico di oggetti deserializzato.
ja: SimpleTypeResolver で初期化された JavaScriptSerializer で信頼されていないデータを逆シリアル化している場合、メソッド '{0}' は安全ではありません。JavaScriptTypeResolver を指定せずに JavaScriptSerializer を初期化するか、逆シリアル化されたオブジェクト グラフ内のオブジェクトの型を制限する JavaScriptTypeResolver で初期化します。
ko: SimpleTypeResolver로 초기화된 JavaScriptSerializer로 신뢰할 수 없는 데이터를 역직렬화하는 경우 '{0}' 메서드는 안전하지 않습니다. JavaScriptTypeResolver가 지정되지 않은 상태로 JavaScriptSerializer를 초기화하거나 역직렬화된 개체 그래프에서 해당 개체 형식을 제한하는 JavaScriptTypeResolver로 초기화하세요.
pl: Metoda „{0}” nie jest bezpieczna podczas deserializacji niezaufanych danych za pomocą klasy JavaScriptSerializer zainicjowanej z klasą SimpleTypeResolver. Zainicjuj klasę JavaScriptSerializer bez określonej klasy JavaScriptTypeResolver lub zainicjuj ją z klasą JavaScriptTypeResolver, która ogranicza typy obiektów w zzdeserializowanym grafie obiektów.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis com um JavaScriptSerializer inicializado com um SimpleTypeResolver. Inicialize o JavaScriptSerializer sem um JavaScriptTypeResolver especificado ou inicialize com um JavaScriptTypeResolver que limita os tipos de objetos no grafo de objetos desserializado.
ru: Метод "{0}" является небезопасным при десериализации ненадежных данных с помощью JavaScriptSerializer, который был инициализирован с указанием SimpleTypeResolver. Инициализируйте JavaScriptSerializer без указания JavaScriptTypeResolver или с указанием JavaScriptTypeResolver, который ограничивает типы объектов в десериализованном графе объектов.
tr: '{0}' yöntemi, SimpleTypeResolver ile başlatılmış bir JavaScriptSerializer ile güvenilmeyen veriler seri durumdan çıkarılırken güvenli değildir. JavaScriptSerializer'ı JavaScriptTypeResolver belirtmeden veya seri durumdan çıkarılan nesne grafındaki nesne türlerini sınırlayan bir JavaScriptTypeResolver ile başlatın.
zh_hans: 使用通过 SimpleTypeResolver 初始化的 JavaScriptSerializer 反序列化不可信数据时，{0} 方法不安全。请初始化 JavaScriptSerializer 但不指定 JavaScriptTypeResolver，或使用限制为反序列化对象图形中的对象类型的 JavaScriptTypeResolver 初始化该对象。
zh_hant: 若使用以 SimpleTypeResolver 初始化的 JavaScriptSerializer 將未受信任的資料還原序列化，方法 '{0}' 就不安全。將 JavaScriptSerializer 初始化時，請不要指定 JavaScriptTypeResolver，或使用 JavaScriptTypeResolver 來限制已還原序列化物件圖中的物件類型。

# JavaScriptSerializerWithSimpleTypeResolverTitle
source: Do not deserialize with JavaScriptSerializer using a SimpleTypeResolver
cs: Nedeserializovat přes JavaScriptSerializer s použitím nástroje SimpleTypeResolver
de: Nicht mit JavaScriptSerializer und SimpleTypeResolver deserialisieren
es: No deserializar con JavaScriptSerializer mediante un SimpleTypeResolver
fr: Ne pas désérialiser à l'aide d'un JavaScriptSerializer avec un SimpleTypeResolver
it: Non deserializzare con JavaScriptSerializer usando un elemento SimpleTypeResolver
ja: SimpleTypeResolver を使用して JavaScriptSerializer で逆シリアル化できません
ko: SimpleTypeResolver를 사용하여 JavaScriptSerializer로 deserialize 안 함
pl: Nie wykonuj deserializacji za pomocą klasy JavaScriptSerializer używającej klasy SimpleTypeResolver
pt_br: Não desserialize com JavaScriptSerializer usando um SimpleTypeResolver
ru: Не выполняйте десериализацию в JavaScriptSerializer с помощью SimpleTypeResolver
tr: SimpleTypeResolver kullanarak JavaScriptSerializer ile seri durumdan çıkarma
zh_hans: 请勿通过使用 SimpleTypeResolver 的 JavaScriptSerializer 进行反序列化
zh_hant: 無法以使用了 SimpleTypeResolver 的 JavaScriptSerializer 還原序列化
