Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseEnvironmentProcessIdDescription
source: 'Environment.ProcessId' is simpler and faster than 'Process.GetCurrentProcess().Id'.
cs: Environment.ProcessId je jednodušší a rychlejší než Process.GetCurrentProcess().Id.
de: "Environment.ProcessId" ist einfacher und schneller als "Process.GetCurrentProcess().Id".
es: "Environment.ProcessId" es más rápido y sencillo que "Process.GetCurrentProcess().Id"
fr: 'Environment.ProcessId' est plus simple et plus rapide que 'Process.GetCurrentProcess().Id'.
it: 'Environment.ProcessId' è più semplice e rapido rispetto a 'Process.GetCurrentProcess().Id'.
ja: 'Environment.ProcessId' は、'Process.GetCurrentProcess().Id' よりも単純かつ高速です。
ko: 'Environment.ProcessId'가 'Process.GetCurrentProcess().Id'보다 더 빠르고 간단합니다.
pl: Element „Environment.ProcessId” jest prostszy i szybszy niż element „Process.GetCurrentProcess().Id”.
pt_br: 'Environment.ProcessId' é mais simples e rápido do que 'Process.GetCurrentProcess().Id'.
ru: "Environment.ProcessId" работает проще и быстрее, чем "Process.GetCurrentProcess().Id".
tr: 'Environment.ProcessId' şundan daha basit ve hızlıdır: 'Process.GetCurrentProcess().Id'.
zh_hans: "Environment.ProcessId" 比 "Process.GetCurrentProcess().Id" 更简单且速度更快。
zh_hant: 'Environment.ProcessId' 比 'Process.GetCurrentProcess().Id' 更簡單快速。

# UseEnvironmentProcessIdFix
source: Use 'Environment.ProcessId'
cs: Použijte Environment.ProcessId.
de: "Environment.ProcessId" verwenden
es: Usar "Environment.ProcessId"
fr: Utiliser 'Environment.ProcessId'
it: Usare 'Environment.ProcessId'
ja: 'Environment.ProcessId' を使用してください
ko: 'Environment.ProcessId' 사용
pl: Użyj elementu „Environment.ProcessId”
ru: Использование "Environment.ProcessId"
tr: 'Environment.ProcessId' kullanın
zh_hans: 使用 "Environment.ProcessId"
zh_hant: 請使用 'Environment.ProcessId'

# UseEnvironmentProcessIdMessage
source: Use 'Environment.ProcessId' instead of 'Process.GetCurrentProcess().Id'
cs: Namísto Process.GetCurrentProcess().Id použijte Environment.ProcessId.
de: Verwenden Sie "Environment.ProcessId" anstelle von "Process.GetCurrentProcess().Id"
es: Use "Environment.ProcessId" en lugar de "Process.GetCurrentProcess().Id".
fr: Utiliser 'Environment.ProcessId' à la place de 'Process.GetCurrentProcess().Id'
it: Usare 'Environment.ProcessId' invece di 'Process.GetCurrentProcess().Id'
ja: 'Process.GetCurrentProcess().Id' の代わりに 'Environment.ProcessId' を使用してください
ko: 'Process.GetCurrentProcess().Id' 대신 'Environment.ProcessId'를 사용하세요.
pl: Użyj elementu „Environment.ProcessId” zamiast elementu „Process.GetCurrentProcess().Id”
pt_br: Use 'Environment.ProcessId' em vez de 'Process.GetCurrentProcess().Id'
ru: Используйте "Environment.ProcessId" вместо "Process.GetCurrentProcess().Id".
tr: 'Process.GetCurrentProcess().Id' yerine 'Environment.ProcessId' kullanın
zh_hans: 使用 "Environment.ProcessId" 而不是 "Process.GetCurrentProcess().Id"
zh_hant: 請使用 'Environment.ProcessId' 而非 'Process.GetCurrentProcess().Id'

# UseEnvironmentProcessIdTitle
source: Use 'Environment.ProcessId'
cs: Použít Environment.ProcessId
de: "Environment.ProcessId" verwenden
es: Usar "Environment.ProcessId"
fr: Utiliser 'Environment.ProcessId'
it: Usare 'Environment.ProcessId'
ja: 'Environment.ProcessId' を使用する
ko: 'Environment.ProcessId' 사용
pl: Użyj elementu „Environment.ProcessId”
ru: Использование "Environment.ProcessId"
tr: 'Environment.ProcessId' kullanın
zh_hans: 使用 "Environment.ProcessId"
zh_hant: 請使用 'Environment.ProcessId'

# UseEnvironmentProcessPathDescription
source: 'Environment.ProcessPath' is simpler and faster than 'Process.GetCurrentProcess().MainModule.FileName'.
cs: Environment.ProcessPath je jednodušší a rychlejší než Process.GetCurrentProcess(). MainModule.FileName.
de: "Environment.ProcessPath" ist einfacher und schneller als "Process.GetCurrentProcess().MainModule.FileName".
es: "Environment.ProcessPath" es más sencillo y rápido que "Process.GetCurrentProcess(). MainModule.FileName'.
fr: 'Environment.ProcessId' est plus simple et plus rapide que 'Process.GetCurrentProcess().Id'.
it: 'Environment.ProcessPath' è più semplice e rapido rispetto a 'Process.GetCurrentProcess().MainModule.FileName'.
ja: 'Environment.ProcessPath' は、'Process.GetCurrentProcess().MainModule.FileName' よりも単純で高速です。
ko: 'Environment.ProcessPath'는 'Process.GetCurrentProcess().MainModule.FileName'보다 간단하고 빠릅니다.
pl: Element „Environment.ProcessPath” jest prostszy i szybszy niż element „Process.GetCurrentProcess(). MainModule.FileName”.
pt_br: 'Environment.ProcessPath' é mais simples e mais rápido do que 'Process.GetCurrentProcess(). MainModule.FileName'.
ru: "Environment.ProcessPath" работает проще и быстрее, чем "Process.GetCurrentProcess().MainModule.FileName".
tr: 'Environment.ProcessPath', 'Process.GetCurrentProcess().MainModule.FileName'dan daha basit ve hızlıdır.
zh_hans: “Environment.ProcessPath” 比 “Process.GetCurrentProcess().MainModule.FileName” 更为简单快速。
zh_hant: 'Environment.ProcessPath' 比 'Process.GetCurrentProcess().MainModule.FileName' 更簡單快速。

# UseEnvironmentProcessPathFix
source: Use 'Environment.ProcessPath'
cs: Použít Environment.ProcessPath
de: "Environment.ProcessPath" verwenden
es: Uso de "Environment.ProcessPath"
fr: Utiliser 'Environment.ProcessId'
it: Usare 'Environment.ProcessPath'
ja: 'Environment.ProcessId' を使用する
ko: 'Environment.ProcessPath' 사용
pl: Użyj ścieżki „Environment.ProcessPath”
ru: Использовать "Environment.ProcessPath"
zh_hans: 使用 “Environment.ProcessPath”
zh_hant: 請使用 'Environment.ProcessPath'

# UseEnvironmentProcessPathMessage
source: Use 'Environment.ProcessPath' instead of 'Process.GetCurrentProcess().MainModule.FileName'
cs: Místo Process.GetCurrentProcess() použít Environment.ProcessPath. MainModule.FileName'
de: Verwenden Sie "Environment.ProcessPath' anstelle von "Process.GetCurrentProcess().MainModule.FileName".
es: Use "Environment.ProcessPath" en lugar de "Process.GetCurrentProcess(). MainModule.FileName'
fr: Utilisez ’Environment. ProcessPath’ à la place de ’Process. GetCurrentProcess (). MainModule. FileName'
it: Usare 'Environment.ProcessPath' invece di 'Process.GetCurrentProcess().MainModule.FileName'
ja: 'Process.GetCurrentProcess() MainModule.FileName の代わりに 'Environment.ProcessPath' を使用します
ko: 'Process.GetCurrentProcess().MainModule.FileName' 대신 'Environment.ProcessPath' 사용
pl: Użyj elementu „Environment.ProcessPath” zamiast elementu „Process.GetCurrentProcess ().MainModule.FileName”
ru: Использовать "Environment.ProcessPath" вместо "Process.GetCurrentProcess().MainModule.FileName"
tr: 'Process.GetCurrentProcess().MainModule.FileName' yerine 'Environment.ProcessPath' kullanın
zh_hans: 使用 “Environment.ProcessPath” 而不是 “Process.GetCurrentProcess().MainModule.FileName”
zh_hant: 請使用 'Environment.ProcessPath' 而非 'Process.GetCurrentProcess().MainModule.FileName'

# UseEnvironmentProcessPathTitle
source: Use 'Environment.ProcessPath'
cs: Použít Environment.ProcessPath
de: "Environment.ProcessPath" verwenden
es: Uso de "Environment.ProcessPath"
fr: Utiliser 'Environment.ProcessId'
it: Usare 'Environment.ProcessPath'
ja: 'Environment.ProcessId' を使用する
ko: 'Environment.ProcessPath' 사용
pl: Użyj ścieżki „Environment.ProcessPath”
ru: Использовать "Environment.ProcessPath"
zh_hans: 使用 “Environment.ProcessPath”
zh_hant: 請使用 'Environment.ProcessPath'

source: Use indexer
cs: Použít indexer
de: Indexer verwenden
es: Usar el indizador
fr: Utiliser l'indexeur
it: Usare l'indicizzatore
ja: インデクサーを使用する
ko: 인덱서 사용
pl: Użyj indeksatora
pt_br: Usar o indexador
ru: Использовать индексатор
tr: Dizin oluşturucuyu kullanın
zh_hans: 使用索引器
zh_hant: 使用索引子

# UseInvariantVersion
source: Use an invariant version
cs: Použít neutrální verzi
de: Verwenden Sie eine unveränderliche Version
es: Usar una versión invariable
fr: Utiliser une version invariante
it: Usare una versione invariante
ja: インバリアント バージョンを使用する
ko: 고정 버전 사용
pl: Użyj niezmiennej wersji
pt_br: Usar uma versão invariável
ru: Использовать инвариантную версию
tr: Sabit bir sürüm kullanın
zh_hans: 使用固定版本
zh_hant: 使用固定版本

# UseManagedEquivalentsOfWin32ApiDescription
source: An operating system invoke method is defined and a method that has the equivalent functionality is located in the .NET Framework class library.
cs: Metoda invoke operačního systému je definována a metoda, která má ekvivalentní funkci, se nachází v knihovně tříd .NET Framework.
de: Eine Methode zum Betriebssystemaufruf ist definiert, und eine Methode mit der entsprechenden Funktionalität befindet sich in der .NET Framework-Klassenbibliothek.
es: Se define un método de invocación de sistema operativo y hay un método con la funcionalidad equivalente en la biblioteca de clases de .NET Framework.
fr: Une méthode d'appel de système d'exploitation est définie et une méthode ayant la fonctionnalité équivalente se trouve dans la bibliothèque de classes .NET Framework.
it: Viene definito un metodo di chiamata del sistema operativo e nella libreria di classi .NET Framework è presente un metodo con funzionalità equivalente.
ja: オペレーティング システムの呼び出しメソッドが定義されており、同等の機能を持つメソッドが .NET Framework クラス ライブラリにあります。
ko: 운영 체제 호출 메서드가 정의되었으며 동일한 기능의 메서드가 .NET Framework 클래스 라이브러리에 있습니다.
pl: Metoda wywoływania systemu operacyjnego jest zdefiniowana, a metoda mająca odpowiadającą jej funkcję znajduje się w bibliotece klas platformy .NET Framework.
pt_br: Um método de invocação de sistema operacional é definido e um método que tem a funcionalidade equivalente está localizado na biblioteca de classes .NET Framework.
ru: Определен метод вызова операционной системы, а метод с аналогичной функциональностью находится в библиотеке классов платформы .NET Framework.
tr: Bir işletim sistemi çağırma yöntemi tanımlanır ve .NET Framework sınıf kitaplığında eşdeğer işleve sahip bir yöntem bulunur.
zh_hans: 已定义操作系统调用方法，且具有等效功能的方法位于 .NET Framework 类库中。
zh_hant: 定義有作業系統叫用方法，且在 .NET Framework 類別庫中具有對等的功能。

# UseManagedEquivalentsOfWin32ApiMessage
source: Use managed equivalents of win32 api
cs: Použití spravovaných ekvivalentů rozhraní Win32 API
de: Verwaltete Entsprechungen der Win32-API verwenden
es: Utilizar equivalentes administrados de la API Win32
fr: Utiliser les équivalents managés de l'API Win32
it: Usare equivalenti gestiti dell'API Win32
ja: Win32 API に相当するマネージ API を使用します
ko: Win32 API에 있는 동일한 기능의 관리되는 항목을 사용하세요.
pl: Używaj zarządzanych odpowiedników funkcji win32 api
pt_br: Usar equivalentes gerenciados da API win32
ru: Используйте управляемые эквиваленты API Win32
tr: Win32 API’sinin yönetilen eşdeğerlerini kullan
zh_hans: 使用 Win32 API 的托管等效项
zh_hant: 使用 Win32 API 的受控對等項

# UseManagedEquivalentsOfWin32ApiTitle
source: Use managed equivalents of win32 api
cs: Použití spravovaných ekvivalentů rozhraní Win32 API
de: Verwaltete Entsprechungen der Win32-API verwenden
es: Utilizar equivalentes administrados de la API Win32
fr: Utiliser les équivalents managés de l'API Win32
it: Usare equivalenti gestiti dell'API Win32
ja: Win32 API に相当するマネージ API を使用します
ko: Win32 API에 있는 동일한 기능의 관리되는 항목을 사용하세요.
pl: Używaj zarządzanych odpowiedników funkcji win32 api
pt_br: Usar equivalentes gerenciados da API win32
ru: Используйте управляемые эквиваленты API Win32
tr: Win32 API’sinin yönetilen eşdeğerlerini kullan
zh_hans: 使用 Win32 API 的托管等效项
zh_hant: 使用 Win32 API 的受控對等項

# UseObjectDisposedExceptionThrowHelperTitle
source: Use ObjectDisposedException throw helper
cs: Použití pomocné rutiny vyvolání ObjectDisposedException
de: ObjectDisposedException-Throw-Hilfsprogramm verwenden
es: Uso del asistente de inicio ObjectDisposedException
fr: Utiliser l’assistance de levée ObjectDisposedException
it: Usare ObjectDisposedException per generare l'helper
ja: ObjectDisposedException スロー ヘルパーを使用する
ko: ObjectDisposedException throw 도우미 사용
pl: Użyj pomocnika zgłaszania ObjectDisposedException
pt_br: Usar o auxiliar de lançamento ObjectDisposedException
ru: Использовать вспомогательное приложение по вызову ObjectDisposedException
tr: ObjectDisposedException oluşturma yardımcısı kullan
zh_hans: 使用 ObjectDisposedException 引发帮助程序
zh_hant: 使用 ObjectDisposedException 擲回協助程式

# UseOrdinalStringComparisonDescription
source: A string comparison operation that is nonlinguistic does not set the StringComparison parameter to either Ordinal or OrdinalIgnoreCase. By explicitly setting the parameter to either StringComparison.Ordinal or StringComparison.OrdinalIgnoreCase, your code often gains speed, becomes more correct, and becomes more reliable.
cs: Operace porovnání řetězců, která není jazyková, nenastavuje parametr StringComparison na hodnotu Ordinal nebo OrdinalIgnoreCase. Explicitním nastavením parametru na hodnotu StringComparison.Ordinal nebo StringComparison.OrdinalIgnoreCase se kód často urychlí a bývá správnější a spolehlivější.
de: Bei einem nicht linguistischen Vorgang zum Zeichenfolgenvergleich wird der StringComparison-Parameter nicht auf "Ordinal" oder "OrdinalIgnoreCase" festgelegt. Indem der Parameter explizit auf "StringComparison.Ordinal" oder "StringComparison.OrdinalIgnoreCase" festgelegt wird, gewinnt Ihr Code häufig an Geschwindigkeit und ist zudem korrekter und zuverlässiger.
es: Una operación no lingüística de comparación de cadenas no establece el parámetro StringComparison en Ordinal ni en OrdinalIgnoreCase. Si se establece explícitamente el parámetro en StringComparison.Ordinal o StringComparison.OrdinalIgnoreCase, el código será más rápido y ganará en precisión y confiabilidad.
fr: Une opération de comparaison de chaînes non linguistique n'affecte pas au paramètre StringComparison la valeur Ordinal ou OrdinalIgnoreCase. En affectant explicitement au paramètre la valeur StringComparison.Ordinal ou StringComparison.OrdinalIgnoreCase, votre code gagne souvent en rapidité, tout en devenant plus correct et plus fiable.
it: In un'operazione di confronto tra stringhe di tipo non linguistico il parametro StringComparison non viene impostato su Ordinal o OrdinalIgnoreCase. L'impostazione esplicita del parametro su StringComparison.Ordinal o StringComparison.OrdinalIgnoreCase consente spesso di rendere il codice più veloce, corretto e affidabile.
ja: 非言語的な文字列比較操作では、StringComparison パラメーターが Ordinal にも OrdinalIgnoreCase にも設定されません。パラメーターを StringComparison.Ordinal または StringComparison.OrdinalIgnoreCase に明示的に設定することによって、コードは多くの場合、高速で正確になり、信頼性が向上します。
ko: 비언어적 문자열 비교 작업에서는 StringComparison 매개 변수를 서수 또는 OrdinalIgnoreCase로 설정하지 않습니다. 매개 변수를 명시적으로 StringComparison.Ordinal 또는 StringComparison.OrdinalIgnoreCase로 설정하면 코드의 속도가 빨라지고, 정확도와 신뢰도가 더 높아집니다.
pl: Operacja porównywania ciągów nieuwzględniająca zasad języka nie ustawia parametru StringComparison na wartość Ordinal ani OrdinalIgnoreCase. Jawne ustawienie parametru na wartość StringComparison.Ordinal lub StringComparison.OrdinalIgnoreCase umożliwia często przyspieszenie kodu oraz zwiększenie jego poprawności i niezawodności.
pt_br: Uma comparação de cadeia de caracteres não linguística não define o parâmetro StringComparison como Ordinal ou OrdinalIgnoreCase. Ao definir explicitamente o parâmetro como StringComparison.Ordinal ou StringComparison.OrdinalIgnoreCase, seu código geralmente ganha velocidade, torna-se mais correto e mais confiável.
ru: Нелингвистическая операция сравнения строк не задает для параметра StringComparison значение Ordinal или OrdinalIgnoreCase. Задав явным образом значение StringComparison.Ordinal или StringComparison.OrdinalIgnoreCase для параметра, можно сделать код более быстродействующим, корректным и надежным.
tr: Dille ilgili olmayan bir dize karşılaştırma işlemi, StringComparison parametresini Ordinal veya OrdinalIgnoreCase olarak ayarlamaz. Parametreyi açıkça StringComparison.Ordinal veya StringComparison.OrdinalIgnoreCase olarak ayarladığınızda kodunuz genellikle hızlanır, daha doğru ve daha güvenilir hale gelir.
zh_hans: 非语义的字符串比较运算没有将 StringComparison 参数设置为 Ordinal 或 OrdinalIgnoreCase。通过将参数显式设置为 StringComparison.Ordinal 或 StringComparison.OrdinalIgnoreCase，通常可提高代码的速度、准确率和可靠性。
zh_hant: 非語言的字串比較作業不會將 StringComparison 參數設為 Ordinal 或 OrdinalIgnoreCase。將參數明確設定為 StringComparison.Ordinal 或 StringComparison.OrdinalIgnoreCase 時，程式碼通常會更快速、精確且更可靠。

# UseOrdinalStringComparisonTitle
source: Use ordinal string comparison
cs: Použít porovnání ordinálních řetězců
de: Ordinalzeichenfolgenvergleich verwenden
es: Usar una comparación de cadena ordinal
fr: Utiliser la comparaison de chaînes ordinales
it: Usa il confronto di stringhe tra ordinali
ja: 序数の文字列比較を使用してください
ko: 서수 문자열 비교 사용
pl: Użyj porównywania ciągów porządkowych
pt_br: Usar a comparação de cadeia de caracteres ordinal
ru: Использование порядкового сравнения строк
tr: Sıralı dize karşılaştırması kullanın
zh_hans: 使用序数字符串比较
zh_hant: 使用序數字串比較

# UsePropertyInsteadOfCountMethodWhenAvailableDescription
source: Enumerable.Count() potentially enumerates the sequence while a Length/Count property is a direct access.
cs: Enumerable.Count() může vytvořit výčet sekvence, zatímco vlastnost Length/Count stanoví přímý přístup.
de: Enumerable.Count() listet möglicherweise die Sequenz auf, während es sich bei einer Length/Count-Eigenschaft um Direktzugriff handelt.
es: Enumerable.Count() posiblemente enumera la secuencia, mientras que una propiedad Length/Count es un acceso directo.
fr: Enumerable.Count() énumère potentiellement la séquence alors qu'une propriété Length/Count représente un accès direct.
it: Enumerable.Count() enumera potenzialmente la sequenza mentre una proprietà Length/Count è un accesso diretto.
ja: Enumerable.Count() は、Length または Count プロパティが直接アクセスの場合、シーケンスを列挙する可能性があります。
ko: Length/Count 속성이 직접 액세스인 동안 Enumerable.Count()는 잠재적으로 시퀀스를 열거합니다.
pl: Metoda Enumerable.Count() może potencjalnie wyliczyć sekwencję, podczas gdy właściwość Length/Count stanowi dostęp bezpośredni.
pt_br: Enumerable.Count() potencialmente enumera a sequência enquanto uma propriedade Length/Count é um acesso direto.
ru: Enumerable.Count() может выполнять перечисление последовательности, в то время как свойство Length/Count предполагает прямой доступ.
tr: Enumerable.Count() diziyi numaralandırabilir, bir Length/Count özelliği doğrudan erişimdir.
zh_hans: Enumerable.Count() 可能枚举序列，而 Length/Count 属性是直接访问。
zh_hant: 當長度/計數屬性為直接存取時，Enumerable.Count() 可能會列舉序列。

# UsePropertyInsteadOfCountMethodWhenAvailableMessage
source: Use the "{0}" property instead of Enumerable.Count()
cs: Použijte vlastnost {0} namísto Enumerable.Count().
de: Verwenden Sie die Eigenschaft "{0}" anstelle von "Enumerable.Count()".
es: Use la propiedad "{0}" en lugar de Enumerable.Count().
fr: Utilisez la propriété "{0}" à la place de Enumerable.Count()
it: Usare la proprietà "{0}" invece di Enumerable.Count()
ja: Enumerable.Count() の代わりに "{0}" プロパティを使用してください
ko: Enumerable.Count() 대신 "{0}" 속성을 사용하세요.
pl: Użyj właściwości „{0}” zamiast metody Enumerable.Count()
pt_br: Use a propriedade "{0}" em vez de Enumerable.Count()
ru: Используйте свойство "{0}" вместо Enumerable.Count().
tr: Enumerable.Count() yerine "{0}" özelliğini kullanın
zh_hans: 请使用 "{0}" 属性而不是 Enumerable.Count()
zh_hant: 使用 "{0}" 屬性而非 Enumerable.Count()

# UsePropertyInsteadOfCountMethodWhenAvailableTitle
source: Use Length/Count property instead of Count() when available
cs: Pokud je k dispozici, použijte vlastnost Length/Count namísto Count()
de: Length/Count-Eigenschaft anstelle von Count() verwenden, wenn verfügbar
es: Usar la propiedad Length/Count en lugar de Count() cuando esté disponible
fr: Utiliser la propriété Length/Count à la place de Count() si elle est disponible
it: Usare la proprietà Length/Count invece di Count() quando disponibile
ja: 使用可能な場合は Count() の代わりに Length または Count プロパティを使用
ko: 사용 가능한 경우 Count() 대신 Length/Count 속성을 사용
pl: Użyj właściwości Length/Count zamiast metody Count(), gdy jest to możliwe
pt_br: Usar a propriedade Length/Count em vez de Count() quando disponível
ru: Используйте свойство Length/Count вместо Count(), если оно доступно
tr: Kullanılabilir olduğunda Count() yerine Length/Count özelliğini kullanın
zh_hans: 在可用时使用 Length/Count 属性而不是 Count()
zh_hant: 可行時，使用長度/計數屬性而非 Count()

# UseRSAWithSufficientKeySize
source: Use Rivest-Shamir-Adleman (RSA) Algorithm With Sufficient Key Size
cs: Použijte algoritmus RSA (Rivest-Shamir-Adleman) s dostatečnou velikostí klíče
de: Verwenden Sie den RSA-Algorithmus (Rivest – Shamir – Adleman) mit einer ausreichenden Schlüsselgröße
es: Usar un algoritmo de Rivest-Shamir-Adleman (RSA) con un tamaño de clave suficiente
fr: Utiliser l'algorithme RSA (Rivest-Shamir-Adleman) avec une taille de clé suffisante
it: Usa l'algoritmo RSA (Rivest-Shamir-Adleman) con dimensione di chiave sufficiente
ja: 十分なキー サイズの Rivest-Shamir-Adleman (RSA) アルゴリズムを使用します
ko: 충분한 키 크기로 RSA(Rivest-Shamir-Adleman) 알고리즘 사용
pl: Użyj algorytmu Rivest-Shamir-Adleman (RSA) z wystarczającym rozmiarem klucza
pt_br: Use o algoritmo Rivest-Shamir-Adleman (RSA) com tamanho de chave suficiente
ru: Использовать алгоритм шифрования RSA с достаточным размером ключа
tr: Yeterli Anahtar Boyutuna Sahip Rivest-Shamir-Adleman (RSA) Algoritmasını Kullan
zh_hans: 设置具有足够密钥大小的 Rivest-Shamir-Adleman (RSA)算法
zh_hant: 使用有足夠金鑰大小的 Rivest-Shamir-Adleman (RSA) 加密演算法

# UseRSAWithSufficientKeySizeDescription
source: Encryption algorithms are vulnerable to brute force attacks when too small a key size is used.
cs: Šifrovací algoritmy jsou zranitelné vůči útokům hrubou silou, pokud se použije příliš malá velikost klíče.
de: Verschlüsselungsalgorithmen sind anfällig für Brute-Force-Angriffe, wenn eine zu geringe Schlüsselgröße verwendet wird.
es: Los algoritmos de cifrado son vulnerables a los ataques por fuerza bruta cuando se usa un tamaño de clave demasiado pequeño.
fr: Les algorithmes de chiffrement sont vulnérables aux attaques par force brute quand une clé trop petite est utilisée.
it: Gli algoritmi di crittografia sono vulnerabili agli attacchi di forza bruta quando si usa una dimensione di chiave troppo piccola.
ja: 暗号化アルゴリズムは、小さすぎるキー サイズが使用されていると、ブルート フォース攻撃に対して脆弱になります。
ko: 사용되는 키 크기가 너무 작으면 암호화 알고리즘이 무차별 암호 대입 공격에 취약할 수 있습니다.
pl: Algorytmy szyfrowania z kluczem o zbyt małym rozmiarze są podatne na ataki siłowe.
pt_br: Os algoritmos de criptografia são vulneráveis a ataques de força bruta quando um tamanho de chave muito pequeno é usado.
ru: Алгоритмы шифрования уязвимы для атак методом подбора, если размер используемого ключа слишком мал.
tr: Çok küçük boyutlu bir anahtar kullanıldığında şifreleme algoritmaları deneme yanılma saldırılarına karşı savunmasız durumda kalır.
zh_hans: 在使用的密钥大小太小时，加密算法容易遭到暴力破解攻击。
zh_hant: 當使用的金鑰大小太小時，加密演算法易面臨暴力密碼破解攻擊。
