Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Use XmlReader for 'DataSet.ReadXml()'
cs: Použít XmlReader pro DataSet.ReadXml()
de: XmlReader für "DataSet.ReadXml()" verwenden
es: Usar XmlReader para "DataSet.ReadXml()"
fr: Utiliser XmlReader pour 'DataSet.ReadXml()'
it: Usa XmlReader per 'DataSet.ReadXml()'
ja: 'DataSet.ReadXml()' に対して XmlReader を使用します
ko: 'DataSet.ReadXml()'에 XmlReader 사용
pl: Użyj elementu XmlReader dla metody „DataSet.ReadXml()”
pt_br: Use o XmlReader para 'DataSet.ReadXml()'
ru: Используйте XmlReader для "DataSet.ReadXml()".
tr: 'DataSet.ReadXml()' için XmlReader kullanın
zh_hans: 将 XmlReader 用于 "DataSet.ReadXml()"
zh_hant: 將 XmlReader 用於 'DataSet.ReadXml()'

# UseXmlReaderForDeserialize
source: Use XmlReader for 'XmlSerializer.Deserialize()'
cs: Použít XmlReader pro XmlSerializer.Deserialize()
de: XmlReader für "XmlSerializer.Deserialize()" verwenden
es: Usar XmlReader para "XmlSerializer.Deserialize()"
fr: Utiliser XmlReader pour 'XmlSerializer.Deserialize()'
it: Usa XmlReader per 'XmlSerializer.Deserialize()'
ja: 'XmlSerializer.Deserialize()' に対して XmlReader を使用します
ko: 'XmlSerializer.Deserialize()'에 XmlReader 사용
pl: Użyj elementu XmlReader dla metody „XmlSerializer.Deserialize()”
pt_br: Use o XmlReader para 'XmlSerializer.Deserialize()'
ru: Используйте XmlReader для "XmlSerializer.Deserialize()".
tr: 'XmlSerializer.Deserialize()' için XmlReader kullanın
zh_hans: 将 XmlReader 用于 "XmlSerializer.Deserialize()"
zh_hant: 將 XmlReader 用於 'XmlSerializer.Deserialize()'

# UseXmlReaderForSchemaRead
source: Use XmlReader for 'XmlSchema.Read()'
cs: Použít XmlReader pro XmlSchema.Read()
de: XmlReader für "XmlSchema.Read()" verwenden
es: Usar XmlReader para "XmlSchema.Read()"
fr: Utiliser XmlReader pour 'XmlSchema.Read()'
it: Usa XmlReader per 'XmlSchema.Read()'
ja: 'XmlSchema.Read()' に対して XmlReader を使用します
ko: 'XmlSchema.Read()'에 XmlReader 사용
pl: Użyj elementu XmlReader dla metody „XmlSchema.Read()”
pt_br: Use o XmlReader para 'XmlSchema.Read()'
ru: Используйте XmlReader для "XmlSchema.Read()".
tr: 'XmlSchema.Read()' için XmlReader kullanın
zh_hans: 将 XmlReader 用于 "XmlSchema.Read()"
zh_hant: 將 XmlReader 用於 'XmlSchema.Read()'

# UseXmlReaderForValidatingReader
source: Use XmlReader for XmlValidatingReader constructor
cs: Použít XmlReader pro konstruktor XmlValidatingReader
de: XmlReader für XmlValidatingReader-Konstruktor verwenden
es: Usar XmlReader para el constructor XmlValidatingReader
fr: Utiliser XmlReader pour le constructeur XmlValidatingReader
it: Usa XmlReader per il costruttore XmlValidatingReader
ja: XmlValidatingReader コンストラクターに対して XmlReader を使用します
ko: XmlValidatingReader 생성자에 XmlReader 사용
pl: Użyj elementu XmlReader dla konstruktora XmlValidatingReader
pt_br: Usar o XmlReader para o construtor XmlValidatingReader
ru: Используйте XmlReader для конструктора XmlValidatingReader.
tr: XmlValidatingReader oluşturucusu için XmlReader kullanın
zh_hans: 将 XmlReader 用于 XmlValidatingReader 构造函数
zh_hant: 將 XmlReader 用於 XmlValidatingReader 建構函式

# UseXmlReaderForXPathDocument
source: Use XmlReader for XPathDocument constructor
cs: Použít XmlReader pro konstruktor XPathDocument
de: XmlReader für XPathDocument-Konstruktor verwenden
es: Usar XmlReader para el constructor XPathDocument
fr: Utiliser XmlReader pour le constructeur XPathDocument
it: Usa XmlReader per il costruttore XPathDocument
ja: XPathDocument コンストラクターに対して XmlReader を使用します
ko: XPathDocument 생성자에 XmlReader 사용
pl: Użyj elementu XmlReader dla konstruktora XPathDocument
pt_br: Usar o XmlReader para o construtor XPathDocument
ru: Используйте XmlReader для конструктора XPathDocument.
tr: XPathDocument oluşturucusu için XmlReader kullanın
zh_hans: 将 XmlReader 用于 XPathDocument 构造函数
zh_hant: 將 XmlReader 用於 XPathDocument 建構函式

# UseXmlReaderMessage
source: This overload of the '{0}.{1}' method is potentially unsafe. It may enable Document Type Definition (DTD) which can be vulnerable to denial of service attacks, or might use an XmlResolver which can be vulnerable to information disclosure. Use an overload that takes a XmlReader instance instead, with DTD processing disabled and no XmlResolver.
cs: Toto přetížení metody {0}.{1} může být nebezpečné. Může povolit specifikaci DTD, která může být ohrožená útoky DoS (Denial of Service) nebo může používat XmlResolver, který představuje riziko odhalení informací. Použijte místo toho přetížení, které přijímá instanci XmlReader, má zakázané zpracování DTD a nepoužívá XmlResolver.
de: Diese Überladung der {0}.{1}-Methode ist potenziell unsicher. Sie kann die Dokumenttypdefinition (DTD) aktivieren, die für DoS-Angriff (Denial of Service) anfällig ist, oder einen XmlResolver verwenden, der anfällig für eine Offenlegung von Informationen sein kann. Verwenden Sie eine Überladung, die stattdessen eine XmlReader-Instanz nutzt, und bei der die DTD-Verarbeitung deaktiviert ist und kein XmlResolver-Vorgang ausgeführt wird.
es: Es posible que la sobrecarga del método "{0}.{1}" no sea segura. Puede habilitar la definición de tipo de documento (DTD), que puede ser vulnerable a los ataques por denegación de servicio, o bien usar un elemento XmlResolver que puede ser vulnerable a la divulgación de información. Use una sobrecarga que tome una instancia de XmlReader, con el procesamiento de DTD deshabilitado y sin XmlResolver.
fr: Cette surcharge de la méthode '{0}.{1}' est potentiellement non sécurisée. Elle peut activer le traitement DTD (définition de type de document), qui est vulnérable aux attaques par déni de service, ou utiliser une opération XmlResolver, qui est vulnérable à la divulgation d'informations. Employez une surcharge qui accepte plutôt une instance de XmlReader, avec désactivation du traitement DTD et de XmlResolver.
it: Questo overload del metodo '{0}.{1}' è potenzialmente non sicuro. Può abilitare DTD (Document Type Definition), che può essere vulnerabile ad attacchi Denial of Service oppure usare un elemento XmlResolver che può essere vulnerabile alla diffusione di informazioni. Usare un overload che accetta un'istanza di XmlReader, con elaborazione DTD disabilitata e nessun elemento XmlResolver.
ja: '{0}.{1}' メソッドのこのオーバーロードは、安全でない可能性があります。これによって、サービス拒否攻撃に対して脆弱となり得るドキュメント型定義 (DTD) が有効になるおそれがあります。あるいは情報漏えいに対して脆弱となり得る XmlResolver が使用されるおそれがあります。その代わりに、XmlReader インスタンスを受け取るオーバーロードを使用して、DTD 処理を無効にし、XmlResolver を使用しないようにします。
ko: '{0}.{1}' 메서드의 이 오버로드는 잠재적으로 안전하지 않습니다. 서비스 거부 공격에 취약할 수 있는 DTD(문서 종류 정의)를 사용하도록 설정하거나 정보 공개에 취약할 수 있는 XmlResolver를 사용할 수 있습니다. 대신 DTD 처리를 사용할 수 없고 XmlResolver가 없는 XmlReader 인스턴스를 사용하는 오버로드를 사용하세요.
pl: To przeciążenie metody „{0}.{1}” jest potencjalnie niebezpieczne. Być może włącza definicję typu dokumentu podatną na ataki typu „odmowa usługi” lub używa elementu XmlResolver podatnego na ujawnienie informacji. Użyj zamiast tego przeciążenia, które przyjmuje wystąpienie elementu XmlReader, ma wyłączone przetwarzanie definicji typu dokumentu i nie używa elementu XmlResolver.
pt_br: Esta sobrecarga do método '{0}.{1}' é potencialmente não segura. Ela pode habilitar a DTD (Definição do Tipo de Documento), que pode ser vulnerável a ataques de negação de serviço ou pode usar um XmlResolver que pode ser vulnerável à divulgação de informações. Use uma sobrecarga que usa uma instância XmlReader em vez disso, com o processamento de DTD desabilitado e sem o XmlResolver.
ru: Перегрузка метода "{0}.{1}" потенциально небезопасна. Она может включать определение типа документа (DTD), которое может быть уязвимо для атак типа "отказ в обслуживании", или может использовать XmlResolver, что может представлять уязвимость для раскрытия информации. Используйте перегрузку, которая принимает экземпляр XmlReader, с отключенной обработкой DTD и без XmlResolver.
tr: '{0}.{1}' metodunun bu aşırı yüklemesi güvenli olmayabilir. Hizmet reddi saldırılarına açık olabilecek Belge Türü Tanımı'nı (DTD) etkinleştirebilir veya bilginin açığa çıkmasına karşı savunmasız olabilecek XmlResolver kullanabilir. Bunun yerine DTD işlemesinin devre dışı olduğu ve XmlResolver'ın olmadığı XmlReader örneğini alan bir aşırı yükleme kullanın.
zh_hans: 重载“{0}.{1}”方法可能不安全。这样做可能会启用文档类型定义(DTD)，DTD 可能会遭到拒绝服务攻击，这样做也可能会使用 XmlResolver，这可能会导致信息泄露。请改用采用 XmlReader 实例的重载，禁用 DTD 处理且没有 XmlResolver。
zh_hant: '{0}.{1}' 方法的此多載可能不安全。其會啟用文件類型定義 (DTD) ，而如此可能會容易受到阻斷服務攻擊，或可能會使用 XmlResolver，而造成資訊洩漏。請改用採用 XmlReader 執行個體的多載，並停用 DTD 處理以及禁用 XmlResolver。

# UsesPreviewTypeParameterMessage
source: '{0}' uses the preview type '{1}' and needs to opt into preview features. See {2} for more information.
cs: {0} používá typ preview {1} a vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: „{0}“ verwendet den Vorschautyp „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: '{0}' usa el tipo de vista previa '{1}' y debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{0}' utilise le type de prévisualisation '{1}' et doit opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: '{0}' utilizza il tipo di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: '{0}' はプレビュー型 '{1}' を使用するため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: '{0}'은(는) 미리 보기 유형 '{1}'을(를) 사용하고 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}을(를) 참조하세요.
pl: „{0}” używa typu w wersji zapoznawczej „{1}” i wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: “{0}” usa o tipo de visualização “{1}” e precisa aceitar os recursos de visualização. Consulte {2} para obter mais informações.
ru: "{0}" использует предварительную версию типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: '{0}', '{1}' önizleme türünü kullandığından önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: “{0}”使用预览类型“{1}”，并且需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: '{0}' 使用預覽類型 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# UsesPreviewTypeParameterMessageWithCustomMessagePlaceholder
source: {3} '{0}' uses the preview type '{1}' and needs to opt into preview features. See {2} for more information.
cs: {3}{0} používá typ preview {1} a vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: {3} „{0}“ verwendet den Vorschautyp „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: {3} '{0}' usa el tipo de vista previa '{1}' y debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{3}'{0} utilise le type de prévisualisation '{1}' et doit opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: {3} '{0}' utilizza il tipo di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: {3} '{0}' はプレビュー型 '{1}' を使用するため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: {3} '{0}'은(는) 미리 보기 유형 '{1}'을(를) 사용하며 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}(을)를 참조하세요.
pl: {3} „{0}” używa typu w wersji zapoznawczej „{1}” i wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: {3}“{0}” usa o tipo de visualização “{1}” e precisa aceitar os recursos de visualização. Consulte {2} para obter mais informações.
ru: "{0}" {3} использует предварительную версию типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: {3} '{0}', '{1}' önizleme türünü kullandığından önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: {3}.“{0}”使用预览类型“{1}”，并且需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: {3} '{0}' 使用預覽類型 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。
