Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PreferIsEmptyOverCountTitle
source: Prefer IsEmpty over Count
cs: Upřednostňovat IsEmpty před Count
de: Ziehen Sie "IsEmpty" gegenüber "Count" vor
es: Elegir IsEmpty en vez de Count
fr: Préférer IsEmpty à Count
it: Preferire IsEmpty a Count
ja: Count より IsEmpty を優先する
ko: Count 대신 IsEmpty 사용
pl: Preferuj właściwość IsEmpty przed Count
pt_br: Preferir IsEmpty em vez de Count
ru: Старайтесь использовать "IsEmpty" вместо "Count"
tr: Count yerine IsEmpty tercih edin
zh_hans: 最好使用 "IsEmpty" (而不是 "Count")
zh_hant: 建議使用 IsEmpty，而不要使用 Count

# PreferLengthCountIsEmptyOverAnyDescription
source: Prefer using 'IsEmpty', 'Count' or 'Length' properties whichever available, rather than calling 'Enumerable.Any()'. The intent is clearer and it is more performant than using 'Enumerable.Any()' extension method.
cs: Upřednostňujte použití vlastnosti IsEmpty, Count nebo Length podle toho, která je k dispozici, namísto volání metody Enumerable.Any(). Záměr je jasnější a je výkonnější než použití rozšiřující metody Enumerable.Any().
de: Verwenden Sie lieber die Eigenschaften „IsEmpty“, „Count“ oder „Length“, sofern verfügbar, statt „Enumerable.Any()“ aufzurufen. Die Absicht ist klarer und das Ausführungsverhalten besser als bei Verwendung der Erweiterungsmethode „Enumerable.Any()“.
es: Es preferible usar las propiedades "IsEmpty", "Count" o "Length", si hay alguna disponible, en lugar de llamar a "Enumerable.Any()". La intención es más clara y tiene un mejor rendimiento que usar el método de extensión "Enumerable.Any()".
fr: Préférez utiliser les propriétés 'IsEmpty', 'Count' ou 'Length' selon la disponibilité, plutôt que d’appeler 'Enumerable.Any()'. L’intention est plus claire et plus performante que l’utilisation de la méthode d’extension 'Enumerable.Any()'.
it: Preferire l’uso delle proprietà 'IsEmpty', 'Count' o 'Length' se disponibili, anziché chiamare 'Enumerable.Any()'. La finalità è più chiara ed è più efficiente rispetto all'uso del metodo di estensione 'Enumerable.Any()'.
ja: 'Enumerable.Any()' を呼び出すのではなく、'IsEmpty'、'Count'、または 'Length' のいずれか使用可能なプロパティの使用を優先してください。この方が、'Enumerable.Any()' 拡張メソッドを使用するよりも意図が明確で、パフォーマンスが向上します。
ko: 'Enumerable.Any()'를 호출하는 것보다 사용 가능한 'IsEmpty', 'Count' 또는 'Length' 속성을 사용하는 것이 좋습니다. 의도가 더 명확하고 'Enumerable.Any()' 확장 방법을 사용하는 것보다 더 성능이 좋습니다.
pl: Preferuj używanie właściwości „IsEmpty”, „Count” lub „Length” w zależności od dostępności, zamiast wywoływać metodę „Enumerable.Any()”. Intencja jest bardziej przejrzysta i wydajniejsza niż użycie metody rozszerzenia „Enumerable.Any()”.
pt_br: Prefira usar as propriedades 'IsEmpty', 'Count' ou 'Length', conforme disponível, em vez de chamar 'Enumerable.Any()'. A intenção é mais clara e tem mais desempenho do que usar o método de extensão 'Enumerable.Any()'.
ru: Старайтесь использовать свойства 'IsEmpty', 'Count' или 'Length' в зависимости от доступности вместо вызова 'Enumerable.Any()'. Намерение является более четким и более эффективным по сравнению с использованием метода расширения 'Enumerable.Any()'.
tr: 'Enumerable.Any()' metodunu çağırmak yerine hangisi mevcutsa 'IsEmpty', 'Count' veya 'Length' özelliklerinden birini kullanmayı tercih edin. Amaç daha kolay anlaşılır ve 'Enumerable.Any()' genişletme metoduna göre daha yüksek performans sunar.
zh_hans: 首选使用可用的 'IsEmpty'、'Count' 或 'Length' 属性，而不是调用 'Enumerable.Any()'。意向更清晰，其性能高于使用 'Enumerable.Any() 扩展方法。
zh_hant: 偏好使用 'IsEmpty'、'Count' 或 'Length' 屬性 (以可用者為准)，而不是呼叫 'Enumerable.Any()'。意圖更清楚，而且比使用 'Enumerable.Any()' 擴充方法更具效能。

# PreferLengthCountIsEmptyOverAnyTitle
source: Avoid using 'Enumerable.Any()' extension method
cs: Nepoužívejte rozšiřující metodu Enumerable.Any().
de: Verwendung der Erweiterungsmethode „Enumerable.Any()“ vermeiden
es: Evitar usar el método de extensión "Enumerable.Any()"
fr: Éviter d’utiliser la méthode d’extension 'Enumerable.Any()'
it: Evitare di usare il metodo di estensione 'Enumerable.Any()'
ja: 'Enumerable.Any()' 拡張メソッドを使用しないでください
ko: 'Enumerable.Any()' 확장 메서드 사용 금지
pl: Unikaj używania metody rozszerzenia „Enumerable.Any()”
pt_br: Evite usar o método de extensão 'Enumerable.Any()'
ru: Не используйте метод расширения 'Enumerable.Any()'
tr: 'Enumerable.Any()' genişletme metodunu kullanmayın
zh_hans: 避免使用 'Enumerable.Any()' 扩展方法
zh_hant: 避免使用 'Enumerable.Any()' 擴充方法

# PreferLengthOverAnyCodeFixTitle
source: Use 'Length' check instead of 'Any()'
cs: K ověření použijte metodu Length místo Any()
de: Überprüfung mit „Length“ anstelle von „Any()“ verwenden
es: Usar la comprobación "Length" en lugar de "Any()"
fr: Utiliser la vérification « Length » au lieu de « Any() »
it: Usare il controllo 'Length' anziché 'Any()'
ja: 'Any()' の代わりに 'Length' チェックを使用してください
ko: 'Any()' 대신 'Length' 확인 사용
pl: Użyj sprawdzania „Length” zamiast „Any()”
pt_br: Usar a verificação 'Length' em vez de 'Any()'
ru: Используйте проверку 'Length' вместо 'Any()'
tr: 'Any()' yerine 'Length' denetimi kullanın
zh_hans: 使用 'Length' 检查而非 'Any()'
zh_hant: 使用 'Length' 檢查而非 'Any()'

# PreferLengthOverAnyMessage
source: Prefer comparing 'Length' to 0 rather than using 'Any()', both for clarity and for performance
cs: Upřednostňujte porovnání vlastnosti Length s 0 místo použití metody Any(), a to jak pro přehlednost, tak pro výkon.
de: Sowohl aus Gründen der Klarheit als auch der Leistung ist der Vergleich von „Length“ mit 0 der Verwendung von „Any()“ vorzuziehen
es: Es preferible comparar "Length" con 0 en lugar de usar "Any()", tanto por claridad como por rendimiento.
fr: Préférez comparer 'Length' à 0 au lieu d’utiliser 'Any()', à la fois pour plus de clarté et pour des performances
it: Preferire il confronto 'Length' con 0 anziché usare 'Any()', sia per chiarezza che per prestazioni
ja: 明確性とパフォーマンスの両方のために、'Any()' を使用するのではなく、'Length' を 0 と比較することを優先してください
ko: 명확성과 성능을 위해 'Any()'를 사용하는 것보다 'Length'를 0과 비교하는 것이 좋습니다.
pl: Preferuj porównywanie wartości „Length” z wartością 0 zamiast używania elementu „Any()”, zarówno w celu zapewnienia przejrzystości, jak i wydajności
pt_br: Prefira comparar 'Length' com 0 em vez de usar 'Any()', tanto para clareza quanto para desempenho
ru: Для ясности и для обеспечения производительности старайтесь сравнивать 'Length' с 0 вместо того, чтобы использовать 'Any()'
tr: Hem kolay anlaşılırlık hem de performans için 'Length' değerini 'Any()' yerine 0 ile karşılaştırmayı tercih edin
zh_hans: 为了清楚起见和提高性能，首选将 'Length'与 0 进行比较，而不是使用 'Any()'。
zh_hant: 為了清楚明瞭和為了提升效能，偏好比較 'Length' 與 0，而不是使用 'Any()'

# PreferStreamAsyncMemoryOverloadsDescription
source: 'Stream' has a 'ReadAsync' overload that takes a 'Memory<Byte>' as the first argument, and a 'WriteAsync' overload that takes a 'ReadOnlyMemory<Byte>' as the first argument. Prefer calling the memory based overloads, which are more efficient.
cs: Stream má přetížení ReadAsync, které jako první argument přijímá Memory<Byte>, a přetížení WriteAsync, které jako první argument přijímá ReadOnlyMemory<Byte>. Upřednostňujte volání přetížení založených na paměti, která jsou efektivnější.
de: Stream verfügt über eine Überladung "ReadAsync", die "Memory<Byte>" als erstes Argument akzeptiert, sowie über eine Überladung "WriteAsync", die "ReadOnlyMemory<Byte>" als erstes Argument akzeptiert. Rufen Sie möglichst arbeitsspeicherbasierte Überladungen auf, da diese effizienter sind.
es: "Stream" tiene una sobrecarga "ReadAsync" que toma "Memory<Byte>" como primer argumento y una sobrecarga "WriteAsync" que toma "ReadOnlyMemory<Byte>" como primer argumento. Es preferible llamar a las sobrecargas basadas en memory, que son más eficaces.
fr: 'Stream’ a une surcharge ’ReadAsync’ qui prend un ’Memory<Byte>' comme premier argument et une surcharge ’WriteAsync’ qui prend un ’ReadOnlyMemory<Byte>' comme premier argument. Préférez l'appel des surcharges basées sur la mémoire, car elles sont plus efficaces.
it: 'Stream' contiene un overload 'ReadAsync' che accetta 'Memory<Byte>' come primo argomento e un overload 'WriteAsync' che accetta 'ReadOnlyMemory<Byte>' come primo argomento. Per la chiamata preferire gli overload basati su Memory, che sono più efficaci.
ja: 'Stream' には、最初の引数として 'Memory<Byte>' を取る 'ReadAsync' オーバーロードと、最初の引数として 'ReadOnlyMemory<Byte>' を取る 'WriteAsync' オーバーロードがあります。より効率的なメモリ ベースのオーバーロードを呼び出すことをお勧めします。
ko: 'Stream'에 첫 번째 인수로 'Memory<Byte>'를 사용하는 'ReadAsync' 오버로드와 첫 번째 인수로 'ReadOnlyMemory<Byte>'를 사용하는 'WriteAsync' 오버로드가 있습니다. 더 효율적인 메모리 기반 오버로드를 호출하는 것이 좋습니다.
pl: Element „Stream” ma przeciążenie „ReadAsync”, które przyjmuje „Memory<Byte>” jako pierwszy argument i przeciążenie „WriteAsync”, które przyjmuje „ReadOnlyMemory<Byte>” jako pierwszy argument. Preferuj wywoływanie przeciążeń opartych na pamięci, co jest bardziej wydajne.
pt_br: 'Stream' tem uma sobrecarga 'ReadAsync' que recebe um 'Memory<Byte>' como o primeiro argumento e uma sobrecarga 'WriteAsync' que recebe um 'ReadOnlyMemory<Byte>' como o primeiro argumento. Prefira chamar as sobrecargas com base na memória, que são mais eficientes.
ru: "Stream" содержит перегрузку "ReadAsync", которая принимает в качестве первого аргумента "Memory<Byte>", и перегрузку "WriteAsync", которая принимает в качестве первого аргумента "ReadOnlyMemory<Byte>". Старайтесь использовать перегрузки на основе памяти, которые являются более эффективными.
tr: 'Stream', ilk bağımsız değişken olarak 'Memory<Byte>' alan bir 'ReadAsync' aşırı yüklemesine ve ilk bağımsız değişken olarak 'ReadOnlyMemory<Byte>' alan bir 'WriteAsync' aşırı yüklemesine sahip. Daha verimli olan bellek tabanlı aşırı yüklemeleri çağırmayı tercih edin.
zh_hans: "Stream" 有一个将 "Memory<Byte>" 作为第一个参数的 "ReadAsync" 重载和一个将 "Memory<Byte>" 作为第一个参数的 "WriteAsync" 重载。首选调用基于内存的重载，它们的效率更高。
zh_hant: 'Stream' 具有採用 'Memory<Byte>' 作為第一個引數的 'ReadAsync' 多載，以及採用 'ReadOnlyMemory<Byte>' 作為第一個引數的 'WriteAsync' 多載。建議呼叫採用記憶體的多載，較有效率。

# PreferStreamAsyncMemoryOverloadsMessage
source: Change the '{0}' method call to use the '{1}' overload
cs: Změňte volání metody {0} tak, aby se použilo přetížení {1}.
de: Ändern Sie den Methodenaufruf "{0}" so, dass die Überladung "{1}" verwendet wird.
es: Cambie la llamada de método "{0}" para usar la sobrecarga "{1}"
fr: Changer l'appel de méthode '{0}' pour utiliser la surcharge '{1}'
it: Modificare la chiamata al metodo '{0}' per usare l'overload '{1}'
ja: '{0}' メソッド呼び出しを変更し、'{1}' オーバーロードを使用します
ko: '{1}' 오버로드를 사용하도록 '{0}' 메서드 호출을 변경하세요.
pl: Zmień wywołanie metody „{0}” tak, aby używało przeciążenia „{1}”
pt_br: Altere a chamada de método '{0}' para usar a sobrecarga '{1}'
ru: Измените вызов метода "{0}", так чтобы он использовал перегрузку "{1}".
tr: '{0}' metot çağrısını, '{1}' aşırı yüklemesini kullanacak şekilde değiştir
zh_hans: 请将“{0}”方法调用更改为使用“{1}”重载
zh_hant: 將 '{0}' 方法呼叫變更為使用 '{1}' 多載

# PreferStreamAsyncMemoryOverloadsTitle
source: Prefer the 'Memory'-based overloads for 'ReadAsync' and 'WriteAsync'
cs: Pro ReadAsync a WriteAsync upřednostňovat přetížení založená na Memory
de: Für "ReadAsync" und "WriteAsync" auf "Memory" basierende Überladungen bevorzugen
es: Elija preferentemente las sobrecargas basadas en "Memory" para "ReadAsync" y "WriteAsync".
fr: Préférer les surcharges basées sur 'Memory' pour 'ReadAsync' et 'WriteAsync'
it: Preferire gli overload basati su 'Memory' per 'ReadAsync' e 'WriteAsync'
ja: 'ReadAsync' および 'WriteAsync' で 'Memory' ベースのオーバーロードを優先的に使用する
ko: 'ReadAsync' 및 'WriteAsync'에 '메모리' 기반 오버로드 사용
pl: Preferuj „przeciążanie oparte na elemencie „Memory” dla elementów „ReadAsync” i „WriteAsync”
pt_br: Prefira as sobrecargas baseadas em 'Memória' para 'ReadAsync' e 'WriteAsync'
ru: Старайтесь использовать перегрузки на основе памяти для "ReadAsync" и "WriteAsync"
tr: 'ReadAsync' ve 'WriteAsync' için 'Memory' tabanlı aşırı yüklemeleri tercih et
zh_hans: 对于 "ReadAsync" 和 "WriteAsync"，首选基于内存的重载
zh_hant: 建議針對 'ReadAsync' 和 'WriteAsync' 使用採用 'Memory' 的多載

# PreferStringContainsOverIndexOfCodeFixTitle
source: Replace with 'string.Contains'
cs: Nahraďte řetězcem string.Contains
de: Durch "string.Contains" ersetzen
es: Reemplazar por "string.Contains"
fr: Remplacer par 'string.Contains'
it: Sostituisci con 'string.Contains'
ja: 'string.Contains' で置き換える
ko: 'string.Contains'로 바꾸기
pl: Zamień na „string.Contains”
pt_br: Substituir por 'string.Contains'
ru: Заменить на "string.Contains"
tr: 'string.Contains' ile değiştir
zh_hans: 替换为 "string.Contains"
zh_hant: 以 'string.Contains' 取代

# PreferStringContainsOverIndexOfDescription
source: Calls to 'string.IndexOf' where the result is used to check for the presence/absence of a substring can be replaced by 'string.Contains'.
cs: Volání metody string.IndexOf, kde se pomocí výsledku kontroluje přítomnost nebo nepřítomnost podřetězce, se dá nahradit metodou string.Contains.
de: Aufrufe von "string.IndexOf", um das Ergebnis auf das Vorhandensein/Fehlen einer Teilzeichenfolge zu überprüfen, können durch "string.Contains" ersetzt werden.
es: Las llamadas a "string.IndexOf" donde el resultado se usa para comprobar la presencia o ausencia de una subcadena pueden reemplazarse por "string.Contains".
fr: Les appels à 'string.IndexOf' où le résultat est utilisé pour vérifier la présence/l'absence d'une sous-chaîne peuvent être remplacés par 'string.Contains'.
it: Le chiamate a 'string.IndexOf' in cui il risultato viene usato per verificare la presenza/assenza di una sottostringa possono essere sostituite da 'string.Contains'.
ja: 部分文字列が存在するかどうかを確認するために結果を使用する 'string.IndexOf' の呼び出しは、'string.Contains' で置き換えることができます。
ko: 결과가 하위 문자열의 존재 여부를 확인하는 데 사용되는 'string.IndexOf' 호출은 'string.Contains'로 바꿀 수 있습니다.
pl: Wywołania elementu „string.IndexOf”, w przypadku których wynik jest używany do sprawdzania obecności/nieobecności podciągu, mogą zostać zastąpione przez wyrażenie „string.Contains”.
pt_br: As chamadas para 'string.IndexOf' nas quais o resultado é usado para verificar a presença ou a ausência de uma substring podem ser substituídas por 'string.Contains'.
ru: Вызовы "string.IndexOf", в которых результат используется для проверки наличия или отсутствия подстроки, можно заменить на "string.Contains"
tr: Sonucu, bir alt dizenin varlığını/yokluğunu denetlemek için kullanılan 'string.IndexOf' çağrıları 'string.Contains' ile değiştirilebilir.
zh_hans: 如果结果用于检查是否存在/缺少子字符串，对 "string.IndexOf" 的调用可替换为对 "string.Contains" 的调用。
zh_hant: 呼叫 'String.IndexOf' 的結果，將用於確認有無子字串可由 'String.Contains' 取代。

# PreferStringContainsOverIndexOfMessage
source: Use 'string.Contains' instead of 'string.IndexOf' to improve readability
cs: Pro lepší čitelnost použijte místo string.IndexOf metodu string.Contains.
de: Verwenden Sie "string.Contains" anstelle von "string.IndexOf", um die Lesbarkeit zu verbessern.
es: Usar "string.Contains" en lugar de "string.IndexOf" para mejorar la legibilidad
fr: Utiliser 'string.Contains' à la place de 'string.IndexOf' pour améliorer la lisibilité
it: Per migliorare la leggibilità, usare 'string.Contains' invece di 'string.IndexOf'
ja: 読みやすくするために 'string.IndexOf' の代わりに 'string.Contains' を使用します
ko: 가독성을 개선하기 위해 'string.IndexOf' 대신 'string.Contains'를 사용하세요.
pl: Używaj metody „string.Contains” zamiast metody „string.IndexOf”, aby zwiększyć czytelność
pt_br: Use 'string.Contains' em vez de 'string.IndexOf' para aprimorar a legibilidade
ru: Используйте "string.Contains" вместо "string.IndexOf" для улучшения читаемости.
tr: Okunabilirliği artırmak için 'string.IndexOf' yerine 'string.Contains' kullanın
zh_hans: 使用 "string.Contains" 而不是 "string.IndexOf" 来提高可读性
zh_hant: 使用 'String.Contains'，而不要使用 'String.IndexOf'，以提高可讀性

# PreferStringContainsOverIndexOfTitle
source: Consider using 'string.Contains' instead of 'string.IndexOf'
cs: Zvážit možnost místo string.IndexOf použít string.Contains
de: Erwägen Sie die Verwendung von "string.Contains" anstelle von "string.IndexOf"
es: Considere la posibilidad de usar "string.Contains" en lugar de "string.IndexOf"
fr: Utiliser de préférence 'string.Contains' à la place de 'string.IndexOf'
it: Provare a usare 'string.Contains' invece di 'string.IndexOf'
ja: 'string.IndexOf' の代わりに 'string.Contains' を使用することを検討する
ko: 'string.IndexOf' 대신 'string.Contains' 사용 고려
pl: Rozważ użycie metody „string.Contains” zamiast „string.IndexOf”
pt_br: Considere o uso de 'string.Contains' em vez de 'string.IndexOf'
ru: Попробуйте использовать "string.Contains" вместо "string.IndexOf"
tr: 'string.IndexOf' yerine 'string.Contains' kullanmayı düşünün
zh_hans: 请考虑使用 "string.Contains" 而不是 "string.IndexOf"
zh_hant: 請考慮使用 'String.Contains'，而不要使用 'String.IndexOf'

# PreferTypedStringBuilderAppendOverloadsDescription
source: StringBuilder.Append and StringBuilder.Insert provide overloads for multiple types beyond System.String. When possible, prefer the strongly-typed overloads over using ToString() and the string-based overload.
cs: StringBuilder.Append a StringBuilder.Insert nabízejí přetížení kromě System.String i několika dalším typům. Kdykoli je to možné, upřednostňujte před metodou ToString() přetížení silného typu a přetížení založené na řetězcích.
de: StringBuilder.Append und StringBuilder.Insert stellen Überladungen für verschiedene Typen über System.String hinaus bereit. Sofern möglich, geben Sie den stark typisierten Überladungen Vorrang vor einer Verwendung von ToString() und zeichenfolgenbasierten Überladungen.
es: StringBuilder.Append y StringBuilder.Insert proporcionan sobrecargas para varios tipos aparte de System.String. Cuando sea posible, elija preferentemente las sobrecargas fuertemente tipadas frente al uso de ToString() y la sobrecarga basada en cadenas.
fr: StringBuilder.Append et StringBuilder.Insert fournissent des surcharges pour plusieurs types au-delà de System.String. Quand cela est possible, préférez les surcharges fortement typées à l'utilisation de ToString() et de la surcharge basée sur une chaîne.
it: StringBuilder.Append e StringBuilder.Insert forniscono overload per più tipi oltre System.String. Quando possibile, preferire gli overload fortemente tipizzati invece di usare ToString() e l'overload basato su stringhe.
ja: StringBuilder.Append および StringBuilder.Insert では、System.String 以外の複数の型に対してオーバーロードを提供します。可能であれば、ToString () と文字列ベースのオーバーロードを使用するよりも、厳密に型指定されたオーバーロードを優先して使用することをお勧めします。
ko: StringBuilder.Append 및 StringBuilder.Insert는 System.String 외의 여러 형식에 대한 오버로드를 제공합니다. 가능한 경우 ToString() 및 문자열 기반 오버로드를 사용하는 대신 강력한 형식의 오버로드를 사용하세요.
pl: Metody StringBuilder.Append i StringBuilder.Insert zapewniają przeciążenia dla wielu typów oprócz typu System.String. Jeśli to możliwe, preferuj silnie typizowane przeciążenia zamiast używania metody ToString() i przeciążenia opartego na ciągu.
pt_br: StringBuilder.Append e StringBuilder.Insert fornecem sobrecargas para vários tipos além de System.String. Quando possível, prefira as sobrecargas fortemente tipadas usando ToString() e a sobrecarga baseada em cadeia de caracteres.
ru: StringBuilder.Append и StringBuilder.Insert предоставляют перегрузки для нескольких типов наряду с System.String. Если это возможно, рекомендуется использовать строго типизированные перегрузки и перегрузки на основе строк вместо метода ToString().
tr: StringBuilder.Append ve StringBuilder.Insert, System.String'in ötesinde birden çok türe yönelik aşırı yükleme sağlar. Mümkün olduğunda, ToString() ve dize tabanlı aşırı yüklemeyi kullanmak yerine kesin tür belirtilmiş aşırı yüklemeleri tercih edin.
zh_hans: StringBuilder.Append 和 StringBuilder.Insert 为 System.String 之外的多种类型提供重载。在可能情况下，尽量使用强类型重载而非使用 ToString() 和基于字符串的重载。
zh_hant: StringBuilder.Append 與 StringBuilder.Insert 可為 System.String 以外的多種類型提供多載。建議盡可能使用強型別多載，而非 ToString() 與字串式多載。

# PreferTypedStringBuilderAppendOverloadsMessage
source: Remove the ToString call in order to use a strongly-typed StringBuilder overload
cs: Odeberte volání ToString, aby se používalo přetížení StringBuilder silného typu.
de: Entfernen Sie den Aufruf von "ToString", um eine stark typisierte StringBuilder-Überladung zu verwenden.
es: Quite la llamada a ToString para usar una sobrecarga StringBuilder fuertemente tipada.
fr: Supprimez l'appel de ToString pour utiliser une surcharge StringBuilder fortement typée
it: Rimuovere la chiamata ToString per usare un overload di StringBuilder fortemente tipizzato
ja: 厳密に型指定された StringBuilder のオーバーロードを使用するには、ToString 呼び出しを削除してください
ko: 강력한 형식의 StringBuilder 오버로드를 사용하려면 ToString 호출을 제거하세요.
pl: Usuń wywołanie metody ToString, aby użyć silnie typizowanego przeciążenia elementu StringBuilder
pt_br: Remova a chamada ToString para usar uma sobrecarga de StringBuilder fortemente tipada
ru: Удалите вызов ToString и используйте строго типизированную перегрузку StringBuilder.
tr: Kesin tür belirtilmiş bir StringBuilder aşırı yüklemesi kullanmak için ToString çağrısını kaldırın
zh_hans: 删除 ToString 调用以使用强类型 StringBuilder 重载
zh_hant: 移除 ToString 呼叫，以使用強型別 StringBuilder 多載

# PreferTypedStringBuilderAppendOverloadsRemoveToString
source: Remove the ToString call
cs: Odeberte volání ToString.
de: ToString-Aufruf entfernen
es: Quitar la llamada a ToString
fr: Supprimer l'appel de ToString
it: Rimuovere la chiamata a ToString
ja: ToString 呼び出しを削除する
ko: ToString 호출 제거
pl: Usuń wywołanie metody ToString
pt_br: Remover a chamada ToString
ru: Удалите вызов ToString
tr: ToString çağrısını kaldırın
zh_hans: 删除 ToString 调用
zh_hant: 移除 ToString 呼叫

# PreferTypedStringBuilderAppendOverloadsTitle
source: Prefer strongly-typed Append and Insert method overloads on StringBuilder
cs: Upřednostňovat pro StringBuilder přetížení metod Append a Insert silného typu
de: Stark typisierte Append- und Insert-Methodenüberladungen für StringBuilder bevorzugen
es: Prefiera las sobrecargas de método Append e Insert fuertemente tipadas en StringBuilder
fr: Préférez les surcharges de méthode Append et Insert fortement typées sur StringBuilder
it: Preferire gli overload di metodi Append e Insert fortemente tipizzati su StringBuilder
ja: StringBuilder での厳密に型指定された Append および Insert メソッドのオーバーロードを推奨
ko: StringBuilder 대신 강력한 형식의 Append 및 Insert 메서드 오버로드를 사용
pl: Preferuj silnie typizowane metody Append i Insert w elemencie StringBuilder
pt_br: Prefira sobrecargas de método Append e Insert fortemente tipadas no StringBuilder
ru: Рекомендация использовать строго типизированные перегрузки методов Append и Insert в StringBuilder
tr: StringBuilder'da kesin tür belirtilmiş Append ve Insert metodu aşırı yüklemelerini tercih edin
zh_hans: 最好使用 StringBuilder 的强类型 Append 和 Insert 方法重载
zh_hant: 建議在 StringBuilder 上使用強型別 Append 及 Insert 方法多載
