Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotPassNullableStructToArgumentNullExceptionThrowIfNullTitle
source: Do not pass a nullable struct to 'ArgumentNullException.ThrowIfNull'
cs: Nepředávejte strukturu s možnou hodnotou null argumentu ArgumentNullException.ThrowIfNull.
de: Übergeben Sie keine Struktur, die Nullwerte zulässt, an „ArgumentNullException.ThrowIfNull“.
es: No pasar una estructura que admite un valor NULL a "ArgumentNullException.ThrowIfNull"
fr: Ne pas passer un struct nullable à 'ArgumentNullException.ThrowIfNull'
it: Non passare uno struct nullable ad "AgumentNullException.ThrowIfNull"
ja: Null 許容構造体を 'ArgumentNullException.ThrowIfNull' に渡さないでください
ko: nullable 구조체를 'ArgumentNullException.ThrowIfNull'에 전달 금지
pl: Nie przekazuj struktury dopuszczającej wartość null do elementu „ArgumentNullException.ThrowIfNull”
pt_br: Não repasse um struct anulável para "ArgumentNullException.ThrowIfNull"
ru: Не передавать структуру, допускающую значение NULL, в "ArgumentNullException.ThrowIfNull"
tr: Null atanabilir bir yapıyı 'ArgumentNullException.ThrowIfNull' öğesine geçirme
zh_hans: 不要将可为 null 的结构传递给 "ArgumentNullException.ThrowIfNull"
zh_hant: 請勿將可為 Null 的結構傳遞到 'ArgumentNullException.ThrowIfNull'

# DoNotRaiseReservedExceptionTypesDescription
source: An exception of type that is not sufficiently specific or reserved by the runtime should never be raised by user code. This makes the original error difficult to detect and debug. If this exception instance might be thrown, use a different exception type.
cs: Uživatelský kód by nikdy neměl vyvolat výjimku typu, který není dostatečně konkrétní nebo je rezervovaný modulem runtime. V takovém případě je totiž obtížné zjistit a ladit původní chybu. Pokud může dojít k vyvolání této instance výjimky, použijte jiný typ výjimky.
de: Eine Ausnahme eines Typs, der nicht ausreichend spezifisch ist oder durch die Runtime reserviert wurde, sollte niemals von Benutzercode ausgelöst werden. Dadurch ist der ursprüngliche Fehler schwierig zu erkennen und zu debuggen. Wenn diese Ausnahmeinstanz ausgelöst werden könnte, verwenden Sie einen anderen Ausnahmetyp.
es: El código de usuario nunca debe provocar una excepción de tipo que no sea suficientemente específica o esté reservada por el tiempo de ejecución. Esto provoca que el error original sea difícil de detectar y depurar. Si puede iniciarse esta instancia de excepción, utilice un tipo de excepción diferente.
fr: Une exception de type qui n'est pas suffisamment spécifique ou réservée par le runtime ne doit jamais être levée par le code utilisateur. Cela rend l'erreur d'origine difficile à détecter et à corriger. Si cette instance d'exception peut être levée, utilisez un autre type d'exception.
it: Il codice utente non dovrebbe mai generare un'eccezione di un tipo non sufficiente specifico o riservato dal runtime. Il rilevamento e il debug dell'errore originale diventano quindi più difficili. Se potrebbe essere generata questa istanza di eccezione, usare un tipo di eccezione diverso.
ja: 十分に特定されていない種類の例外またはランタイムによって予約されている種類の例外は、ユーザー コードで発生することはありません。これにより、元のエラーの検出およびデバッグが困難になります。この例外インスタンスがスローされる可能性がある場合は、別の例外の種類を使用してください。
ko: 충분히 구체적이지 않거나 런타임에서 예약된 형식의 예외는 사용자 지정 코드에서 발생할 수 없습니다. 이로 인해 원래 오류를 감지하거나 디버그하기 어려워집니다. 이러한 예외 인스턴스가 throw되면 다른 예외 형식을 사용하세요.
pl: Wyjątek typu, który nie jest wystarczająco specyficzny lub został zastrzeżony przez środowisko uruchomieniowe, nie powinien być nigdy zgłaszany przez kod użytkownika. Utrudnia to wykrycie i zdebugowanie pierwotnego błędu. Jeśli to wystąpienie wyjątku może zostać zgłoszone, użyj innego typu wyjątku.
pt_br: Uma exceção de tipo que não é suficientemente especificada nem reservada pelo tempo de execução nunca deve ser gerada pelo código do usuário. Isso torna o erro original difícil de ser detectado e depurado. Se esta instância de exceção puder ser gerada, use um tipo de exceção diferente.
ru: Пользовательский код никогда не должен порождать исключение типа, который является недостаточно определенным либо зарезервирован средой выполнения. Это затрудняет обнаружение и отладку исходной ошибки. Если экземпляр этого исключения может быть порожден, используйте другой тип исключения.
tr: Kullanıcı kodu tarafından hiçbir zaman yeterince belirgin olmayan veya çalışma zamanı tarafından ayrılmış türdeki bir özel durum tetiklenmemelidir. Bu, özgün hatanın algılanmasını ve ayıklanmasını zorlaştırır. Bu özel durum örneği oluşturulabiliyorsa farklı bir özel durum türü kullanın.
zh_hans: 用户代码永不会引发不够具体或运行时保留的异常类型。这样会使原来的错误难以检测和调试。如有可能引发此异常实例，请使用其他异常类型。
zh_hant: 明確度不足或由執行階段所保留的例外狀況類型，一律不應由使用者程式碼引發。這會讓原始錯誤的偵測與偵錯更加困難。如果可能會擲回此例外狀況執行個體，請使用其他例外狀況類型。

# DoNotRaiseReservedExceptionTypesMessageReserved
source: Exception type {0} is reserved by the runtime
cs: Výjimka typu {0} je rezervovaná modulem runtime.
de: Der Ausnahmetyp "{0}" wurde durch die Runtime reserviert.
es: El tipo de excepción {0} está reservado por el tiempo de ejecución.
fr: Le type d'exception {0} est réservé par le runtime
it: Il tipo di eccezione {0} è riservato dal runtime
ja: 例外の種類 {0} は、ランタイムによって予約されています
ko: 예외 형식 {0}이(가) 런타임에서 예약되었습니다.
pl: Typ wyjątku {0} został zastrzeżony przez środowisko uruchomieniowe
pt_br: O tipo de exceção {0} está reservado pelo runtime
ru: Тип исключения {0} зарезервирован средой выполнения.
tr: {0} özel durum türü çalışma zamanı tarafından ayrılmış
zh_hans: 异常类型 {0} 是运行时保留的
zh_hant: 例外狀況型別 {0} 由執行階段所保留

# DoNotRaiseReservedExceptionTypesMessageTooGeneric
source: Exception type {0} is not sufficiently specific
cs: Výjimka typu {0} není dost konkrétní.
de: Der Ausnahmetyp "{0}" ist nicht ausreichend spezifisch.
es: El tipo de excepción {0} no es suficientemente específico.
fr: Le type d'exception {0} n'est pas suffisamment spécifique
it: Il tipo di eccezione {0} non è sufficientemente specifico
ja: 例外の種類 {0} は十分に特定されていません
ko: 예외 형식 {0}이(가) 충분히 구체적이지 않습니다.
pl: Typ wyjątku {0} nie jest wystarczająco specyficzny
pt_br: O tipo de exceção {0} não é específico o suficiente
ru: Тип исключения {0} является недостаточно определенным.
tr: {0} özel durum türü yeterince belirli değil
zh_hans: 异常类型 {0} 不够具体
zh_hant: 例外狀況型別 {0} 不夠明確

# DoNotRaiseReservedExceptionTypesTitle
source: Do not raise reserved exception types
cs: Nevyvolávejte rezervované typy výjimek
de: Keine reservierten Ausnahmetypen auslösen
es: No provocar tipos de excepción reservados
fr: Ne pas lever de types d'exception réservés
it: Non generare tipi di eccezione riservati
ja: 予約された例外の種類を発生させません
ko: 예약된 예외 형식을 발생시키지 마세요.
pl: Nie zgłaszaj wyjątków zastrzeżonych typów
pt_br: Não gerar tipos de exceção reservados
ru: Не порождайте исключения зарезервированных типов
tr: Ayrılmış özel durum türleri tetiklemeyin
zh_hans: 不要引发保留的异常类型
zh_hant: 請勿引發保留的例外狀況類型

source: Do Not Serialize Types With Pointer Fields
cs: Neserializujte typy s poli ukazatelů.
de: Typen mit Zeigerfeldern dürfen nicht serialisiert werden.
es: No serializar los tipos con campos de puntero
fr: Ne pas sérialiser les types avec des champs de pointeur
it: Non serializzare i tipi con campi puntatore
ja: ポインター フィールドを持つ型をシリアル化しない
ko: 포인터 필드를 사용하여 형식을 직렬화하지 마세요.
pl: Nie serializuj typów z polami wskaźników
pt_br: Não Serialize Tipos com Campos de Ponteiro
ru: Не сериализуйте типы с полями указателей
tr: İşaretçi Alanlara Sahip Türleri Serileştirmeyin
zh_hans: 请勿序列化具有 Pointer 字段的类型
zh_hant: 請勿將類型序列化為指標欄位

# DoNotSerializeTypesWithPointerFieldsDescription
source: Pointers are not "type safe" in the sense that you cannot guarantee the correctness of the memory they point at. So, serializing types with pointer fields is dangerous, as it may allow an attacker to control the pointer.
cs: Ukazatelé nezajišťují bezpečnost typů. To znamená, že není možné zaručit správnost paměti, na kterou ukazují. Proto je serializace typů s poli ukazatelů nebezpečná, může totiž umožnit útočníkovi ovládat ukazatele.
de: Zeiger sind nicht "typensicher", insofern als Sie nicht garantieren können, dass auf den richtigen Arbeitsspeicher verwiesen wird. Daher ist das Serialisieren von Typen mit Zeigerfeldern gefährlich, weil ein Angreifer dadurch möglicherweise den Zeiger steuern kann.
es: Los punteros no tienen "seguridad de tipos", es decir, no se puede garantizar que la memoria a la que apuntan sea correcta. Por lo tanto, la serialización de tipos con campos de puntero es peligrosa, ya que puede permitir que un atacante controle el puntero.
fr: Les pointeurs ne sont pas "de type sécurisé". En effet, vous ne pouvez pas garantir l'exactitude de la mémoire vers laquelle ils pointent. Il est donc dangereux de sérialiser des types avec des champs de pointeur, car cela peut permettre à un attaquant de contrôler le pointeur.
it: I puntatori non sono "indipendenti dai tipi", ovvero non è possibile garantire la correttezza della memoria a cui puntano. La serializzazione di tipi con campi puntatore è quindi pericolosa perché può consentire a un utente malintenzionato di controllare il puntatore.
ja: ポインターは、自身がポイントするメモリの正しさを保証できないという意味で「タイプ セーフ」ではありません。そのため、攻撃者によるポインターの制御が可能になる場合があるので、ポインター フィールドを持つ型をシリアル化することは危険です。
ko: 포인터는 가리키는 메모리의 정확성을 보장할 수 없다는 점에서 "형식이 안전"하지 않습니다. 따라서 공격자가 포인터를 제어하게 될 수 있으므로 포인터 필드를 사용하여 형식을 직렬화하는 것은 위험합니다.
pl: Wskaźniki nie są „bezpieczne pod względem typu” w tym sensie, że nie można zagwarantować poprawności pamięci, którą wskazują. W związu z tym serializowanie typów z polami wskaźnika jest niebezpieczne, ponieważ może umożliwić atakującemu kontrolowanie wskaźnika.
pt_br: Os ponteiros não são "type safe" no sentido de que você não pode garantir a exatidão da memória para a qual eles apontam. Portanto, a serialização de tipos com campos de ponteiro é perigosa, pois ela pode permitir que um invasor controle o ponteiro.
ru: Указатели не являются "типобезопасными" в том смысле, что невозможно гарантировать правильность памяти, на которую они указывают. Таким образом, сериализация типов с полями указателей опасна, так как она может позволить злоумышленнику контролировать указатель.
tr: İşaretçiler, işaret ettikleri belleğin doğruluğunu garanti edemediğinden "tür kullanımı uyumlu" değildir. Bu nedenle, bir saldırganın işaretçiyi kontrol etmesine olanak sağlayabileceğinden işaretçi alanlara sahip türleri serileştirmek tehlikelidir.
zh_hans: Pointer 不是“类型安全”，因为无法保证它们所指向内存的正确性。因此，序列化具有 Pointer 字段的类型是危险的，它可能允许攻击者控制指针。
zh_hant: 指標並非「安全類型」意味著您無法保證其所指向的記憶體是否正確。因此，指標欄位若為序列化類型很危險，因為如此可能會讓攻擊者能控制指標。

# DoNotSerializeTypesWithPointerFieldsMessage
source: Pointer field {0} on serializable type
cs: Pole ukazatele {0} v serializovatelném typu
de: Zeigerfeld "{0}" für serialisierbaren Typ
es: Campo de puntero {0} en el tipo serializable
fr: Champ de pointeur {0} pour le type sérialisable
it: Campo puntatore {0} sul tipo serializzabile
ja: シリアル化可能な型のポインター フィールド {0} です
ko: 직렬화 가능한 형식의 포인터 필드 {0}입니다.
pl: Pole wskaźnika {0} w typie przeznaczonym do serializacji
pt_br: O campo de ponteiro {0} em um tipo serializável
ru: Поле указателя {0} для сериализуемого типа.
tr: Serileştirilebilir türde {0} işaretçi alanı
zh_hans: 可序列化类型上的 Pointer 字段 {0}
zh_hant: 可序列化型別上的指標欄位 {0}

# DoNotUseAccountSAS
source: Do Not Use Account Shared Access Signature
cs: Nepoužívat sdílený přístupový podpis účtu
de: Shared Access Signature des Kontos nicht verwenden
es: No usar la firma de acceso compartido de la cuenta
fr: Ne pas utiliser de signature d'accès partagé au compte
it: Non usare la firma di accesso condiviso dell'account
ja: アカウントの Shared Access Signature を使用しない
ko: 계정 공유 액세스 서명 사용 안 함
pl: Nie korzystaj z sygnatury dostępu współdzielonego konta
pt_br: Não Usar a Assinatura de Acesso Compartilhado da Conta
ru: Не использовать подписанный URL-адрес учетной записи
tr: Hesabın Paylaşılan Erişim İmzasını Kullanmayın
zh_hans: 不使用帐户共享访问签名
zh_hant: 不要使用帳戶共用存取簽章

# DoNotUseAccountSASDescription
source: Shared Access Signatures(SAS) are a vital part of the security model for any application using Azure Storage, they should provide limited and safe permissions to your storage account to clients that don't have the account key. All of the operations available via a service SAS are also available via an account SAS, that is, account SAS is too powerful. So it is recommended to use Service SAS to delegate access more carefully.
cs: Sdílené přístupové podpisy (SAS) jsou důležitou součástí modelu zabezpečení pro jakoukoli aplikaci, která používá Azure Storage. Měly by poskytovat omezená a bezpečná oprávnění k účtu úložiště klientům, kteří nemají klíč účtu. Všechny operace, které jsou k dispozici prostřednictvím SAS služby, jsou k dispozici také prostřednictvím SAS účtu. SAS účtu je velmi silný nástroj. Při delegování přístupu se doporučuje používat SAS služby s rozvahou.
de: SAS (Shared Access Signatures) sind ein wichtiger Bestandteil des Sicherheitsmodells für jede Anwendung, die Azure Storage verwendet. Sie müssen eingeschränkte und sichere Berechtigungen für Ihr Speicherkonto für Clients bereitstellen, die nicht über den Kontoschlüssel verfügen. Alle über eine Dienst-SAS verfügbaren Vorgänge sind auch über eine Konto-SAS verfügbar. Die Konto-SAS besitzt daher zu hohe Berechtigungen. Es empfiehlt sich, die Dienst-SAS zu verwenden und den Zugriff detaillierter zu delegieren.
es: Las firmas de acceso compartido (SAS) son una parte fundamental del modelo de seguridad para cualquier aplicación que use Azure Storage, por lo que deben proporcionar permisos limitados y seguros a su cuenta de almacenamiento para los clientes que no dispongan de la clave de la cuenta. Todas las operaciones disponibles a través de una SAS de servicio también están disponibles a través de una SAS de cuenta; con lo que se demuestra la elevada eficacia de las SAS de cuenta. Por lo tanto, se recomienda usar SAS de servicio para delegar el acceso con más atención.
fr: Les SAP (signatures d'accès partagé) constituent une partie essentielle du modèle de sécurité pour toutes les applications qui utilisent le Stockage Azure. Elles doivent fournir des autorisations limitées et sécurisées aux clients qui accèdent à votre compte de stockage et qui ne disposent pas de la clé de compte. Toutes les opérations disponibles via un SAP de service sont également disponibles via un SAP de compte, ce qui signifie que le SAP de compte a trop de pouvoir. Il est donc recommandé d'utiliser un SAP de service pour déléguer l'accès plus prudemment.
it: Le firme di accesso condiviso (SAS) sono una parte essenziale del modello di sicurezza per qualsiasi applicazione che usa Archiviazione di Azure e consentono di concedere autorizzazioni limitate e sicure all'account di archiviazione ai client che non hanno la chiave dell'account. Tutte le operazioni disponibili tramite una firma di accesso condiviso del servizio sono disponibili anche tramite una firma di accesso condiviso dell'account, che prevede molte meno limitazioni. Si consiglia quindi di prestare particolare attenzione quando si usa la firma di accesso condiviso del servizio per delegare l'accesso.
ja: Shared Access Signatures (SAS) は、Azure Storage を使用しているすべてのアプリケーションのセキュリティ モデルに不可欠な部分であり、アカウント キーを持たないクライアントにストレージ アカウントへの制限された安全なアクセス許可を提供する必要があります。サービス SAS を通じて利用可能なすべての操作は、アカウント SAS を通じて利用することもできます。つまり、アカウント SAS は強力すぎるということです。このため、サービス SAS を使用してアクセスをより慎重に委任することをお勧めします。
ko: SAS(공유 액세스 서명)는 Azure Storage를 사용하는 애플리케이션에 대한 보안 모델의 필수적인 부분으로, 계정 키가 없는 클라이언트에 스토리지 계정에 대한 제한되고 안전한 권한을 제공해야 합니다. 서비스 SAS를 통해 사용할 수 있는 모든 작업은 계정 SAS를 통해서도 사용할 수 있습니다. 즉, 계정 SAS는 권한이 너무 강력합니다. 따라서 서비스 SAS를 사용하여 액세스 권한을 더욱 신중하게 위임하는 것이 좋습니다.
pl: Sygnatury dostępu współdzielonego (SAS) są istotną częścią modelu zabezpieczeń każdej aplikacji korzystającej z usługi Azure Storage. Powinny one zapewniać ograniczone i bezpieczne uprawnienia do konta magazynu klientom, którzy nie mają klucza konta. Wszystkie operacje dostępne za pośrednictwem sygnatury dostępu współdzielonego usługi są także dostępne za pośrednictwem sygnatury dostępu współdzielonego konta, co oznacza, że sygnatura dostępu współdzielonego konta daje zbyt szerokie uprawnienia. Dlatego zaleca się, aby korzystać z sygnatury dostępu współdzielonego usługi do ostrożniejszego delegowania dostępu.
pt_br: As SASs (Assinaturas de Acesso Compartilhado) são uma parte vital do modelo de segurança de qualquer aplicativo que use Armazenamento do Azure. Elas fornecem permissões limitadas e seguras à sua conta de armazenamento a clientes que não tenham a chave de conta. Todas as operações disponíveis por meio de uma SAS de serviço também estão disponíveis por meio de uma conta de SAS, ou seja, a SAS da conta é extremamente eficiente. Portanto, é recomendado usar as SAS de Serviço para delegar o acesso com mais cuidado.
ru: Подписанные URL-адреса (SAS) являются критически важной частью модели безопасности для любого приложения, использующего службу хранилища Azure, они должны предоставлять ограниченные и безопасные разрешения для вашей учетной записи хранения для клиентов, не имеющих ключа учетной записи. Все операции, доступные через SAS службы, также доступны через SAS учетной записи, то есть учетная запись SAS обладает слишком широкими полномочиями. Поэтому рекомендуется использовать SAS службы для более аккуратного делегирования доступа.
tr: Paylaşılan Erişim İmzaları (SAS), Azure Depolama kullanan tüm uygulamalar için güvenlik modelinin önemli bir bölümüdür, hesap anahtarı olmayan istemciler için depolama hesabınıza yönelik sınırlı ve güvenli izinler sağlar. Hizmet SAS'si üzerinden kullanılabilir olan işlemlerin tümü ayrıca, hesap SAS'sinin çok güçlü olması durumunda hesap SAS'si üzerinden de kullanılabilir. Bu nedenle daha dikkatli bir şekilde erişim vermek için Hizmet SAS'sini kullanmanız önerilir.
zh_hans: 共享访问签名(SAS)是使用 Azure 存储的任何应用程序的安全模型的重要部分，它们应为没有帐户密钥的客户端提供对存储帐户的有限安全权限。通过服务 SAS可使用的所有操作也可通过帐户 SAS 实现，即帐户 SAS 的功能太过强大。因此，建议使用服务 SAS 更仔细地委派访问权限。
zh_hant: 共用存取簽章 (SAS) 對於使用 Azure 儲存體的任何應用程式而言，都是資訊安全模型至關重要的一部份，應向不具帳戶金鑰的用戶端提供儲存體帳戶有限且安全的權限。只要是可以透過服務 SAS 提供的作業，就也可以透過帳戶 SAS 提供，這意味著帳戶 SAS 的權限過大。因此建議您使用服務 SAS，更謹慎地委派存取權。

# DoNotUseAccountSASMessage
source: Use Service SAS instead of Account SAS for fine grained access control and container-level access policy
cs: Pokud chcete využívat jemně odstupňované řízení přístupu a zásady přístupu na úrovni kontejneru, místo SAS účtu použijte SAS služby.
de: Für detailliertere Zugriffssteuerung und Zugriffsrichtlinie auf Containerebene die Dienst-SAS anstelle der Konto-SAS verwenden
es: Use la SAS de servicio en lugar de la SAS de cuenta para el control de acceso detallado y la directiva de acceso de nivel de contenedor
fr: Utiliser un SAP de service à la place d'un SAP de compte pour appliquer un contrôle d'accès de granularité fine et une stratégie d'accès au niveau du conteneur
it: Usare la firma di accesso condiviso del service anziché quella dell'account per criteri più specifici di accesso a livello di contenitore e di controllo di accesso
ja: 詳細に設定されたアクセス制御とコンテナーレベルのアクセス ポリシーには、アカウント SAS の代わりにサービス SAS を使用してください
ko: 세분화된 액세스 제어와 컨테이너 수준 액세스 정책을 위해 계정 SAS가 아닌 서비스 SAS 사용
pl: Użyj sygnatury dostępu współdzielonego usługi zamiast sygnatury dostępu współdzielonego konta w celu uzyskania szczegółowej kontroli dostępu i zasad dostępu na poziomie kontenera
pt_br: Usar o Serviço SAS em vez da SAS de Conta para o controle de acesso refinado e política de acesso de nível de contêiner
ru: Используйте SAS службы вместо SAS учетной записи для детализированного контроля доступа и политики доступа на уровне контейнеров.
tr: Ayrıntılı erişim denetimi ve kapsayıcı düzeyinde erişim ilkesi için Hesap SAS'si yerine Hizmet SAS'sini kullanın
zh_hans: 使用服务 SAS 而不是帐户 SAS 实现精细访问控制和容器级访问策略
zh_hant: 請使用服務 SAS 而非帳戶 SAS，以執行微調的存取控制和容器層級存取原則

source: Do Not Use Broken Cryptographic Algorithms
cs: Nepoužívejte prolomené kryptografické algoritmy
de: Keine beschädigten kryptografischen Algorithmen verwenden
es: No usar algoritmos criptográficos dañados
fr: Ne pas utiliser d'algorithmes de chiffrement cassés
it: Non usare algoritmi di crittografia violati
ja: 破られた暗号アルゴリズムを使用しない
ko: 손상된 암호화 알고리즘을 사용하지 마세요.
pl: Nie używaj złamanych algorytmów kryptograficznych
pt_br: Não usar algoritmos de criptografia desfeitos
ru: Не используйте взломанные алгоритмы шифрования
tr: Bozuk Kriptografik Algoritmalar Kullanma
zh_hans: 不要使用损坏的加密算法
zh_hant: 請勿使用損壞的密碼編譯演算法
