Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PreferDictionaryTryAddMessage
source: To avoid double lookup, call 'TryAdd' instead of calling 'Add' with a 'ContainsKey' guard
cs: Pokud se chcete vyhnout dvojitému vyhledávání, zavolejte TryAdd místo volání Add s ochranou ContainsKey.
de: Um eine doppelte Suche zu vermeiden, rufen Sie "TryAdd" auf, anstatt "Add" mit einem ContainsKey-Wächter aufzurufen.
es: Para evitar búsquedas dobles, llame a "TryAdd" en lugar de llamar a "Add" con una protección "ContainsKey"
fr: Pour éviter la double recherche, appeler « TryAdd » au lieu d’appeler « Add » avec un garde « ContainsKey »
it: Per evitare una doppia ricerca, chiamare 'TryAdd' invece di chiamare 'Add' con una protezione 'ContainsKey'
ja: 二重ルックアップを回避するために、'Add' を 'ContainsKey' 保護付きで呼び出すのではなく 'TryAdd' を呼び出してください
ko: 이중 조회를 방지하려면 'ContainsKey' 가드를 사용하여 'Add'를 호출하는 대신 'TryAdd'를 호출하세요.
pl: Aby uniknąć podwójnego wyszukiwania, wywołaj metodę „TryAdd” zamiast wywoływać metodę „Add” z funkcją „ContainsKey”
pt_br: Para evitar a pesquisa dupla, chame 'TryAdd' em vez de chamar 'Add' com um guarda 'ContainsKey'
ru: Чтобы избежать двойного поиска, вызовите "TryAdd" вместо вызова "Add" с защитой "ContainsKey"
tr: Çift aramayı önlemek için 'ContainsKey' korumasıyla 'Add' yerine 'TryAdd' işlevini çağırın
zh_hans: 为了避免重复查找，请调用 "TryAdd"，而不是调用带有 "ContainsKey" 保护的 "Add"
zh_hant: 若要避免重複查閱，請呼叫 'TryAdd'，而不是使用 'ContainsKey' 成立條件呼叫 'Add'

# PreferDictionaryTryAddTitle
source: Prefer the 'IDictionary.TryAdd(TKey, TValue)' method
cs: Preferovat metodu IDictionary.TryAdd(TKey, TValue)
de: Methode "Dictionary.TryAdd(TKey, TValue)" bevorzugen
es: Dé preferencia al método "IDictionary.TryAdd(TKey, TValue)"
fr: Préférer la méthode « IDictionary.TryAdd(TKey, TValue) »
it: Preferisci il metodo 'IDictionary.TryAdd(TKey, TValue)'
ja: 'IDictionary.TryAdd(TKey, TValue)' メソッドを推奨します
ko: 'IDictionary.TryAdd(TKey, TValue)' 메서드 선호
pl: Preferuj metodę „IDictionary.TryAdd(TKey, TValue)”
pt_br: Prefira o método 'IDictionary.TryAdd(TKey, TValue)'
ru: Предпочитать метод "IDictionary.TryAdd(TKey, TValue)"
tr: 'IDictionary.TryAdd(TKey, TValue)' yöntemini tercih edin
zh_hans: 首选 "IDictionary.TryAdd(TKey, TValue)" 方法
zh_hant: 建議使用 'IDictionary.TryAdd(TKey, TValue)' 方法

# PreferDictionaryTryAddValueCodeFixTitle
source: Use 'TryAdd(TKey, TValue)'
cs: Použít TryAdd(TKey, TValue)
de: "TryAdd(TKey, TValue)" verwenden
es: Utilice "TryAdd(TKey, TValue)"
fr: Utiliser « TryAdd(TKey, TValue) »
it: Usa 'TryAdd(TKey, TValue)'
ja: 'TryAdd(TKey, TValue)' を使用してください
ko: 'TryAdd(TKey, TValue)' 사용
pl: Użyj polecenia „TryAdd(TKey, TValue)”
ru: Использовать "TryAdd(TKey, TValue)"
tr: 'TryAdd(TKey, TValue)' yöntemini kullanın
zh_hans: 使用 "TryAdd(TKey, TValue)"
zh_hant: 使用 'TryAdd(TKey, TValue)'

# PreferDictionaryTryGetValueCodeFixTitle
source: Use 'TryGetValue(TKey, out TValue)'
cs: Použít TryGetValue(TKey, out TValue)
de: „TryGetValue(TKey, out TValue)“ verwenden
fr: Utiliser « TryGetValue(TKey, out TValue) »
it: Usa 'TryGetValue(TKey, out TValue)'
ja: 'TryGetValue(TKey, out TValue)' を使用する
ko: 'TryGetValue(TKey, out TValue)' 사용
pl: Użyj polecenia „TryGetValue(TKey, out TValue)”
pt_br: Usar 'TryGetValue(TKey, out TValue)'
ru: Использовать "TryGetValue(TKey, out TValue)"
tr: 'TryGetValue(TKey, out TValue)' kullanın
zh_hans: 使用 “TryGetValue(TKey, out TValue)”
zh_hant: 使用 'TryGetValue(TKey，out TValue)'

# PreferDictionaryTryGetValueDescription
source: Prefer a 'TryGetValue' call over a Dictionary indexer access guarded by a 'ContainsKey' check. 'ContainsKey' and the indexer both would lookup the key under the hood, so using 'TryGetValue' removes the extra lookup.
cs: Upřednostňujte volání TryGetValue před přístupem indexeru slovníku chráněným kontrolou ContainsKey. ContainsKey i indexer by hledaly klíč na pozadí, takže použití TryGetValue odebere dodatečné vyhledávání.
de: Ziehen Sie einen „TryGetValue“-Aufruf einem Wörterbuchindexerzugriff vor, der durch eine „ContainsKey“-Überprüfung geschützt wird. „ContainsKey“ und der Indexer würden beide den Schlüssel im Hintergrund suchen; die Verwendung von „TryGetValue“ entfernt die zusätzliche Suche.
es: Preferir una llamada "TryGetValue" a un acceso al indexador del diccionario protegido por una comprobación "ContainsKey". Tanto "ContainsKey" como el indexador buscarían de forma exhaustiva, por lo que el uso de "TryGetValue" elimina la búsqueda adicional.
fr: Préférez un appel 'TryGetValue' à un accès à l’indexeur dictionary protégé par une vérification 'ContainsKey'. 'ContainsKey' et l’indexeur recherchent tous les deux la clé sous le capot. Par conséquent, l’utilisation de 'TryGetValue' supprime la recherche supplémentaire.
it: Preferire una chiamata 'TryGetValue' a un accesso all'indicizzatore Dictionary controllato da una verifica 'ContainsKey'. 'ContainsKey' e l'indicizzatore ricercherebbero entrambi la chiave sotto il cofano, quindi l'uso di 'TryGetValue' rimuoverà la ricerca aggiuntiva.
ja: 'ContainsKey' チェックによって保護された Dictionary インデクサー アクセスよりも 'TryGetValue' 呼び出しを優先します。'ContainsKey' とインデクサーの両方が内部のキーを参照するため、'TryGetValue' を使用すると余分な参照が削除されます。
ko: 'ContainsKey' 검사로 보호되는 사전 인덱서 액세스보다 'TryGetValue' 호출을 선호합니다. 'ContainsKey'와 인덱서는 모두 내부 키를 조회하므로 'TryGetValue'를 사용하면 추가 조회가 제거됩니다.
pl: Preferuj wywołanie „TryGetValue” względem dostępu indeksatora słownika chronionego przez kontrolę „ContainsKey”. Element „ContainsKey” i indeksator wyszukają klucz pod maską, więc użycie polecenia „TryGetValue” spowoduje usunięcie dodatkowego wyszukiwania.
pt_br: Prefira uma chamada 'TryGetValue' em vez de um acesso ao indexador de dicionário protegido por uma verificação 'ContainsKey'. 'ContainsKey' e o indexador pesquisariam a chave sob o capô, portanto, usar 'TryGetValue' remove a pesquisa extra.
ru: Предпочитать вызов TryGetValue"доступу к индексатору словаря, защищенного проверкой ContainsKey. Как ContainsKey, так и индексатор будут искать ключ в фоновом режиме, поэтому при использовании TryGetValue удаляется дополнительный поиск.
tr: 'ContainsKey' denetimi tarafından korunan bir Sözlük dizin oluşturucu erişimi yerine 'TryGetValue' çağrısı tercih edin. 'ContainsKey' ve dizin oluşturucunun her ikisi de başlık altındaki anahtarı arayacağından 'TryGetValue' kullanmak, ek aramayı kaldırır.
zh_hans: 首选 “TryGetValue” 调用，而不是通过 “ContainsKey” 检查保护的字典索引器访问。“ContainsKey” 和索引器都会查找位于底层的密钥，因此使用 “TryGetValue” 会删除额外的查找。
zh_hant: 建議使用 'TryGetValue' 呼叫，而不是由 'ContainsKey' 檢查所防護的字典索引子存取權。'ContainsKey' 和索引子會在罩下查閱索引鍵，因此使用 'TryGetValue' 會移除額外的查閱。

# PreferDictionaryTryGetValueMessage
source: Prefer a 'TryGetValue' call over a Dictionary indexer access guarded by a 'ContainsKey' check to avoid double lookup
cs: Upřednostňovat volání TryGetValue před přístupem indexeru slovníku chráněným kontrolou ContainsKey, aby se zabránilo dvojitému vyhledávání
de: Ziehen Sie einen „TryGetValue“-Aufruf einem Wörterbuchindexerzugriff vor, der durch eine „ContainsKey“-Überprüfung geschützt wird, um eine doppelte Suche zu vermeiden
es: Preferir una llamada "TryGetValue" en lugar de un acceso al indexador del diccionario protegido por una comprobación "ContainsKey" para evitar la doble búsqueda
fr: Préférer un appel 'TryGetValue' à un accès à l’indexeur dictionary protégé par une vérification 'ContainsKey' pour éviter la double recherche.
it: Preferisci una chiamata 'TryGetValue' a un accesso all'indicizzatore Dictionary controllato da una verifica 'ContainsKey' per evitare una doppia ricerca
ja: 二重参照を回避するには、'ContainsKey' チェックによって保護された Dictionary インデクサー アクセスよりも 'TryGetValue' 呼び出しを優先します
ko: 이중 조회 방지를 위해 'ContainsKey' 검사로 보호되는 사전 인덱서 액세스보다 'TryGetValue' 호출을 선호합니다.
pl: Preferuj wywołanie „TryGetValue” względem dostępu indeksatora słownika chronionego przez kontrolę „ContainsKey”, aby uniknąć podwójnego wyszukiwania
pt_br: Prefira uma chamada 'TryGetValue' em vez de um acesso ao indexador de dicionário protegido por uma verificação 'ContainsKey' para evitar pesquisa dupla
ru: Предпочитать вызов TryGetValue доступу к индексатору словаря, защищенного проверкой ContainsKey, чтобы избежать двойного поиска
tr: Çift aramayı önlemek için 'ContainsKey' denetimi tarafından korunan Sözlük dizin oluşturucu erişimi yerine 'TryGetValue' çağrısı tercih edin
zh_hans: 首选 “TryGetValue” 调用，而不是由 “ContainsKey” 检查保护的字典索引器访问，以避免双重查找
zh_hant: 建議使用 'TryGetValue' 呼叫，而不是使用 'ContainsKey' 檢查所防護的字典索引子存取權，以避免再次查閱

# PreferDictionaryTryGetValueTitle
source: Prefer the 'IDictionary.TryGetValue(TKey, out TValue)' method
cs: Preferovat metodu IDictionary.TryGetValue(TKey, out TValue)
de: Methode „IDictionary.TryGetValue(TKey, out TValue)“ bevorzugen
es: Preferir el método "IDictionary.TryGetValue(TKey, out TValue)"
fr: Préférer la méthode 'IDictionary.TryGetValue(TKey, out TValue)'
it: Preferisci il metodo 'IDictionary.TryGetValue(TKey, out TValue)'
ja: 'IDictionary.TryGetValue(TKey, out TValue)' メソッドを優先します
ko: 'IDictionary.TryGetValue(TKey, out TValue)' 메서드 선호
pl: Preferuj metodę „IDictionary.TryGetValue(TKey, out TValue)”
pt_br: Prefira o método 'IDictionary.TryGetValue(TKey, out TValue)'
ru: Предпочитать метод "IDictionary.TryGetValue(TKey, out TValue)"
tr: 'IDictionary.TryGetValue(TKey, out TValue)' yöntemini tercih edin
zh_hans: 首选 “IDictionary.TryGetValue(TKey, out TValue)” 方法
zh_hant: 建議使用 'IDictionary.TryGetValue(TKey，out TValue)' 方法

# PreferGenericOverloadsCodeFixTitle
source: Use generic overload
cs: Použijte obecné přetížení
de: Generische Überladung verwenden
es: Usar sobrecarga genérica
fr: Utiliser une surcharge générique
it: Usare overload generico
ja: ジェネリック オーバーロードの使用
ko: 제네릭 오버로드 사용
pl: Użyj ogólnego przeciążenia
pt_br: Use a sobrecarga genérica
ru: Использовать универсальную перегрузку
tr: Genel aşırı yükleme kullan
zh_hans: 使用泛型重载
zh_hant: 使用泛型多載

# PreferGenericOverloadsDescription
source: Using a generic overload is preferable to the 'System.Type' overload when the type is known, promoting cleaner and more type-safe code with improved compile-time checks.
cs: Použití obecného přetížení je vhodnější než přetížení System.Type, pokud je typ známý, což zvyšuje přehlednější kód zajišťující bezpečnost typů díky vylepšeným kontrolám za kompilace.
de: Die Verwendung einer generischen Überladung ist der Überladung „System.Type“ vorzuziehen, wenn der Typ bekannt ist, und fördert übersichtlicheren und typsichereren Code mit verbesserten Kompilierzeitüberprüfungen.
es: El uso de una sobrecarga genérica es preferible a la sobrecarga "System.Type" cuando se conoce el tipo, lo que promueve código más limpio y más seguro para tipos con comprobaciones en tiempo de compilación mejoradas.
fr: L’utilisation d’une surcharge générique est préférable à la surcharge « System.Type » lorsque le type est connu, ce qui favorise un code plus propre et plus sécurisé avec des vérifications améliorées au moment de la compilation.
it: L'uso di un overload generico è preferibile all'overload "System.Type" quando il tipo è noto, promuovendo un codice più pulito e indipendente dai tipi con controlli migliorati in fase di compilazione.
ja: ジェネリック オーバーロードの使用は、型が既知の場合に 'System.Type' オーバーロードに適しており、改善されたコンパイル時チェックで、よりクリーンでよりタイプ セーフなコードを促進します。
ko: 형식이 알려진 경우 제네릭 오버로드를 사용하는 것이 'System.Type' 오버로드보다 낫기 때문에 컴파일 시간 검사를 개선하여 보다 깔끔하고 형식이 안전한 코드를 승격할 수 있습니다.
pl: Użycie ogólnego przeciążenia jest lepsze niż przeciążenie „System.Type”, gdy typ jest znany, promując czystszy i bardziej bezpieczny kod z ulepszonymi kontrolami czasu kompilacji.
pt_br: O uso de uma sobrecarga genérica é preferível à sobrecarga "System.Type" quando o tipo é conhecido, promovendo um código mais limpo e mais fortemente tipado para os tipos com verificações aprimoradas do tempo de compilação.
ru: Использование универсальной перегрузки предпочтительнее перегрузки "System.Type" в случае, если тип известен. Это обеспечивает более чистый и типобезопасный код с улучшенными проверками времени компиляции.
tr: Tür biliniyorsa genel bir aşırı yükleme kullanmak 'System.Type' aşırı yüklemesi kullanmaya tercih edilir ve bu, geliştirilmiş derleme zamanı denetimleriyle kodun daha temiz ve daha tür kullanımı uyumlu olmasını sağlar.
zh_hans: 当类型已知时，泛型重载比 "System.Type" 重载更适合，通过改进的编译时检查来提升更简洁且更具类型安全性的代码。
zh_hant: 當型別為已知時，使用泛型多載會比使用 'System.Type' 多載更合適，可透過改善的編譯時間檢查來提升更為簡潔且型別安全的程式碼。

# PreferGenericOverloadsMessage
source: Prefer the generic overload '{0}' instead of '{1}'
cs: Preferovat obecné přetížení {0} místo {1}
de: Generische Überladung „{0}“ anstelle von „{1}“ bevorzugen
es: Preferir la sobrecarga genérica "{0}" en lugar de "{1}"
fr: Préférer la surcharge générique '{0}' au lieu de '{1}'
it: Preferire l'overload generico "{0}" invece di '{1}'
ja: '{1}' ではなく、ジェネリック オーバーロード '{0}' を優先する
ko: '{1}' 대신 '{0}' 제네릭 오버로드를 선호합니다.
pl: Preferuj ogólne przeciążenie „{0}” zamiast „{1}”
pt_br: Prefira a sobrecarga genérica "{0}" em vez de "{1}"
ru: Предпочитайте универсальную перегрузку "{0}" вместо "{1}"
tr: '{1}' yerine genel aşırı yükleme '{0}' tercih edin
zh_hans: 首选泛型重载“{0}”而不是“{1}”
zh_hant: 偏好泛型多載 '{0}'，而非 '{1}'

# PreferGenericOverloadsTitle
source: Prefer generic overload when type is known
cs: Preferujte obecné přetížení, pokud je známý typ
de: Generische Überladung bevorzugen, wenn der Typ bekannt ist
es: Preferir sobrecarga genérica cuando se conoce el tipo
fr: Préférer la surcharge générique lorsque le type est connu
it: Preferire l'overload generico quando il tipo è noto
ja: 型が既知の場合はジェネリック オーバーロードを優先する
ko: 형식이 알려진 경우 제네릭 오버로드 선호
pl: Preferuj ogólne przeciążenie, gdy typ jest znany
pt_br: Prefira a sobrecarga genérica quando o tipo for conhecido
ru: Предпочитать универсальную перегрузку, если тип известен
tr: Tür bilindiğinde genel aşırı yükleme tercih edin
zh_hans: 类型已知时首选泛型重载
zh_hant: 當型別為已知時，優先使用泛型多載

# PreferHashDataCodefixTitle
source: Replace with 'HashData' method
cs: Nahraďte metodou HashData.
de: Ersetzen Sie dies durch die Methode „HashData“.
es: Reemplazar por el método 'HashData'
fr: Remplacer par la méthode "HashData"
it: Sostituire con il metodo 'HashData'
ja: 'HashData' メソッドに置き換える
ko: 'HashData' 메소드로 대체
pl: Zamień na metodę „HashData”
pt_br: Substituir pelo método “HashData”
ru: Заменить методом HashData
tr: 'HashData' yöntemiyle değiştir
zh_hans: 替换为“HashData”方法
zh_hant: 以 'HashData' 方法取代

# PreferHashDataOverComputeHashAnalyzerDescription
source: It is more efficient to use the static 'HashData' method over creating and managing a HashAlgorithm instance to call 'ComputeHash'.
cs: Při vytváření a správě instance HashAlgorithm k volání ComputeHash je efektivnější používat statickou metodu HashData.
de: Es ist effizienter, die statische Methode „HashData“ zu verwenden, als eine HashAlgorithm-Instanz zum Aufrufen von „ComputeHash“ zu erstellen und zu verwalten.
es: Es más eficaz usar el método estático "HashData" para crear y administrar una instancia de HashAlgorithm para llamar a "ComputeHash".
fr: Il est plus efficace d’utiliser la méthode 'HashData' statique sur la création et la gestion d’une instance HashAlgorithm pour appeler 'ComputeHash'.
it: È più efficiente usare il metodo statico 'HashData' per creare e gestire un'istanza di HashAlgorithm per chiamare 'ComputeHash'.
ja: 'ComputeHash' を呼び出すには、HashAlgorithm インスタンスを作成して管理するよりも、静的な 'HashData' メソッドを使用する方が効率的です。
ko: 'ComputeHash'를 호출하기 위해 HashAlgorithm 인스턴스를 생성하고 관리하는 것보다 정적 'HashData' 메서드를 사용하는 것이 더 효율적입니다.
pl: Korzystanie z metody statycznej „HashData” jest wydajniejsze niż tworzenie wystąpienia HashAlgorithm i zarządzanie nim w celu wywołania „ComputeHash”.
pt_br: É mais eficiente usar o método estático “HashData” do que criar e gerenciar uma instância HashAlgorithm para chamar “ComputeHash”.
ru: Вместо создания экземпляра HashAlgorithm и управления этим экземпляром для вызова метода "ComputeHash" более эффективно использовать статический метод "HashData".
tr: 'ComputeHash' çağırmak için HashAlgorithm örneği oluşturup yönetmek yerine statik 'HashData' yöntemini kullanmak daha verimlidir.
zh_hans: 相比创建并管理 HashAlgorithm 实例来调用“ComputeHash”，使用静态“HashData”方法更高效。
zh_hant: 使用靜態 'HashData' 方法比建立和管理 HashAlgorithm 執行個體來呼叫 'ComputeHash' 更有效率。

# PreferHashDataOverComputeHashAnalyzerMessage
source: Prefer static '{0}.HashData' method over 'ComputeHash'
cs: Preferovat statickou metodu {0}.HashData před ComputeHash
de: Statische Methode „{0}.HashData“ gegenüber „ComputeHash“ bevorzugen.
es: Preferir "{0}" estático. Método HashData' sobre 'ComputeHash'
fr: Préférer les {0} statiques. Méthode HashData sur « ComputeHash »
it: Preferire '{0} statico. Metodo HashData' su 'ComputeHash'
ja: 静的な '{0}.HashData' メソッドは 'ComputeHash' に優先します
ko: 'ComputeHash'보다 정적 '{0}.HashData' 메서드를 선호합니다.
pl: Preferuj metodę statyczną „{0}.HashData”, nie „ComputeHash”
pt_br: Prefira o método estático “{0}.HashData” ao invés de “ComputeHash'
ru: Предпочитать статический метод "{0}.HashData" методу "ComputeHash"
tr: 'ComputeHash' yerine statik '{0}.HashData' yöntemini tercih edin
zh_hans: 首选静态“{0}.HashData”而不是的“ComputeHash”
zh_hant: 偏好靜態 '{0}.HashData' 方法而非 'ComputeHash'

# PreferHashDataOverComputeHashAnalyzerTitle
source: Prefer static 'HashData' method over 'ComputeHash'
cs: Preferovat statickou metodu .HashData před ComputeHash
de: Statische Methode „HashData“ gegenüber „ComputeHash“ bevorzugen.
es: Preferir el método estático "HashData" a "ComputeHash"
fr: Préférer les statiques. Méthode HashData sur « ComputeHash »
it: Preferire il metodo 'HashData' rispetto a 'ComputeHash'
ja: 静的な 'HashData' メソッドは 'ComputeHash' に優先します
ko: 'ComputeHash'보다 정적 'HashData' 메서드를 선호합니다.
pl: Preferuj metodę statyczną „HashData”, nie „ComputeHash”
pt_br: Preferir o método estático “HashData” em vez de “ComputeHash”
ru: Предпочитать статический метод "HashData" методу "ComputeHash"
tr: 'ComputeHash' yerine statik 'HashData' yöntemini tercih edin
zh_hans: 首选静态“HashData”而不是的“ComputeHash”
zh_hant: 偏好靜態 'HashData' 方法而非 'ComputeHash'

# PreferIsEmptyOverAnyCodeFixTitle
source: Use 'IsEmpty' check instead of 'Any()'
cs: K ověření použijte metodu IsEmpty místo Any()
de: Überprüfung mit „IsEmpty“ anstelle von „Any()“ verwenden
es: Usar la comprobación "IsEmpty" en lugar de "Any()"
fr: Utiliser la vérification « IsEmpty » au lieu de « Any() »
it: Usare il controllo 'IsEmpty' anziché 'Any()'
ja: 'Any()' の代わりに 'IsEmpty' チェックを使用してください
ko: 'Any()' 대신 'IsEmpty' 확인 사용
pl: Użyj sprawdzania „IsEmpty” zamiast „Any()”
pt_br: Usar a verificação 'IsEmpty' em vez de 'Any()'
ru: Используйте проверку 'IsEmpty' вместо 'Any()'
tr: 'Any()' yerine 'IsEmpty' denetimi kullan
zh_hans: 使用 'IsEmpty' 检查而不是'Any()'
zh_hant: 使用 'IsEmpty' 檢查，而不是 'Any()'

# PreferIsEmptyOverAnyMessage
source: Prefer an 'IsEmpty' check rather than using 'Any()', both for clarity and for performance
cs: Upřednostňujte k ověření metodu IsEmpty místo použití metody Any(), a to jak pro přehlednost, tak pro výkon.
de: Sowohl aus Gründen der Klarheit als auch der Leistung ist eine Überprüfung mit „IsEmpty“ der Verwendung von „Any()“ vorzuziehen
es: Es preferible una comprobación "IsEmpty" en lugar de usar "Any()", tanto por claridad como por rendimiento.
fr: Préférer une vérification ' IsEmpty' plutôt que d’utiliser 'Any()', à la fois pour plus de clarté et pour des performances
it: Preferire il controllo 'IsEmpty' anziché di usare 'Any()', sia per chiarezza che per prestazioni
ja: 明確性とパフォーマンスの両方のために、'Any()' を使用するのではなく、'IsEmpty' チェックを優先してください
ko: 명확성과 성능을 위해 'Any()'를 사용하는 것보다 'IsEmpty' 확인 선호
pl: Preferuj kontrolę „IsEmpty”, a nie „Any()”, zarówno w celu zapewnienia przejrzystości, jak i wydajności
pt_br: Prefira uma verificação 'IsEmpty' em vez de usar 'Any()', tanto para clareza quanto para desempenho
ru: Для ясности и для обеспечения производительности старайтесь использовать проверку 'IsEmpty' вместо 'Any()'
tr: Hem kolay anlaşılırlık hem de performans için 'Any()' kullanmak yerine bir 'IsEmpty' denetimi yapmayı tercih edin
zh_hans: 首选 'IsEmpty'检查，而不是使用 'Any()'，这既是为了清楚明了，也是为了提高性能
zh_hant: 為了清楚明瞭和為了提升效能，偏好 'IsEmpty' 檢查，而不是使用 'Any()'

# PreferIsEmptyOverCountDescription
source: For determining whether the object contains or not any items, prefer using 'IsEmpty' property rather than retrieving the number of items from the 'Count' property and comparing it to 0 or 1.
cs: Pokud chcete určit, jestli objekt obsahuje nějaké položky, nebo ne, namísto načtení počtu položek z vlastnosti Count a porovnání s hodnotami 0 nebo 1 používejte raději vlastnost IsEmpty.
de: Wenn Sie bestimmen möchten, ob das Objekt Elemente enthält oder nicht, verwenden Sie die Eigenschaft "IsEmpty", anstatt die Anzahl von Elementen aus der Eigenschaft "Count" abzurufen und mit 0 oder 1 zu vergleichen.
es: Para determinar si el objeto contiene o no cualquier elemento, opte por la propiedad "IsEmpty" en lugar de recuperar el número de elementos de la propiedad "Count" y compararlo con 0 o 1.
fr: Pour déterminer si l'objet contient ou non des éléments, utilisez de préférence la propriété 'IsEmpty' au lieu de récupérer le nombre d'éléments à partir de la propriété 'Count' et de le comparer à 0 ou 1.
it: Per determinare se l'oggetto contiene o meno elementi, usare la proprietà 'IsEmpty' invece di recuperare il numero di elementi con la proprietà 'Count' e confrontarlo con 0 o 1.
ja: オブジェクトにアイテムが含まれているかどうかを判断するには、'Count' プロパティからアイテム数を取得し、それを 0 または 1 と比較する代わりに、'IsEmpty' プロパティを使用することをお勧めします。
ko: 개체에 항목이 포함되어 있는지 확인하려면 'Count' 속성의 항목 수를 검색하고 0 또는 1과 비교하는 대신 'IsEmpty' 속성을 사용하는 것이 좋습니다.
pl: Aby określić, czy obiekt zawiera jakiekolwiek elementy, stosuj właściwość „IsEmpty” zamiast pobierać liczbę elementów z właściwości „Count” i porównywać ją z wartością 0 lub 1.
pt_br: Para determinar se o objeto contém ou não contém itens, prefira usar a propriedade 'IsEmpty' em vez de recuperar o número de itens da propriedade 'Count' e compará-lo com 0 ou 1.
ru: Чтобы определить, содержит ли объект другие элементы, старайтесь использовать свойство "IsEmpty" вместо того, чтобы определять число элементов с помощью свойства "Count" и сравнивать его с 0 или 1.
tr: Nesnenin öğe içerip içermediğini belirlemek için 'Count' özelliğinden öğe sayısını almak yerine 'IsEmpty' özelliğini kullanmayı ve bunu 0 veya 1 ile karşılaştırmayı tercih edin.
zh_hans: 若要确定对象是否包含项，最好使用 "IsEmpty" 属性，而不是从 "Count" 属性检索项的数目并将其与 0 或 1 进行比较。
zh_hant: 若要判斷物件是否包含項目，建議使用 'IsEmpty' 屬性，而不要從 'Count' 屬性中擷取項目數來與 0 或 1 比較。

# PreferIsEmptyOverCountMessage
source: Prefer 'IsEmpty' over 'Count' to determine whether the object is empty
cs: Při zjišťování, jestli je objekt prázdný, používejte spíše než Count vlastnost IsEmpty.
de: Verwenden Sie "IsEmpty" anstelle von "Count", um zu bestimmen, ob das Objekt leer ist.
es: Elegir "IsEmpty" en vez de "Count" para determinar si el objeto está vacío
fr: Préférer 'IsEmpty' à 'Count' pour déterminer si l'objet est vide
it: Preferire 'IsEmpty' a 'Count' per determinare se l'oggetto è vuoto
ja: オブジェクトが空かどうかを判断するには、'Count' より 'IsEmpty' を優先してください
ko: 개체가 비어 있는지 확인하려면 'Count' 대신 'IsEmpty'를 사용하세요.
pl: Preferuj właściwość „IsEmpty” przed właściwością „Count” do określania, czy obiekt jest pusty
pt_br: Preferir 'IsEmpty' em vez de 'Count' para determinar se o objeto está vazio
ru: Старайтесь использовать "IsEmpty" вместо "Count", чтобы определить, пуст ли объект.
tr: Nesnenin boş olup olmadığını belirlemek için 'Count' yerine 'IsEmpty' seçeneğini tercih edin
zh_hans: 最好使用 "IsEmpty" (而不是 "Count")来确定对象是否为空
zh_hant: 若要判斷物件是否為空，建議使用 'IsEmpty'，而不要使用 'Count'
