Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PreferConstCharOverConstUnitStringInStringBuilderMessage
source: Use 'StringBuilder.Append(char)' instead of 'StringBuilder.Append(string)' when the input is a constant unit string
cs: Když je vstup konstantní jednotkový řetězec, použijte místo StringBuilder.Append(string) metodu StringBuilder.Append(char).
de: Verwenden Sie "StringBuilder.Append(char)" anstelle von "StringBuilder.Append(string)", wenn es sich bei der Eingabe um eine konstante Einheitenzeichenfolge handelt.
es: Use "StringBuilder.Append(char)" en lugar de "StringBuilder.Append(string)" cuando la entrada es una cadena de unidad constante.
fr: Utilisez 'StringBuilder.Append(char)' à la place de 'StringBuilder.Append(string)' quand l'entrée est une chaîne d'unité de constante
it: Usare 'StringBuilder.Append(char)' invece di 'StringBuilder.Append(string)' quando l'input è una stringa costante composta da un solo carattere
ja: 入力が定数単位文字列である場合は、'StringBuilder.Append(string)' ではなく、'StringBuilder.Append(char)' を使用してください
ko: 입력이 상수 단위 문자열인 경우 'StringBuilder.Append(string)' 대신 'StringBuilder.Append(char)'를 사용하세요.
pl: Użyj metody „StringBuilder.Append(char)” zamiast metody „StringBuilder.Append(string)”, gdy dane wejściowe są stałym ciągiem jednostki
pt_br: Use 'StringBuilder.Append(char)' em vez de 'StringBuilder.Append(string)' quando a entrada for uma cadeia de caracteres de unidade constante
ru: Если строка представляет собой константу, используйте метод "StringBuilder.Append(char)" вместо "StringBuilder.Append(string)".
tr: Giriş, sabit birim dizesi olduğunda 'StringBuilder.Append(string)' yerine 'StringBuilder.Append(char)' kullanın
zh_hans: 当输入是常量单位字符串时，请使用 "StringBuilder.Append(char)" 而不是 "StringBuilder.Append(string)"
zh_hant: 當輸入為常數單元字串時，請使用 'StringBuilder.Append(char)'，而非 'StringBuilder.Append(string)'

# PreferConstCharOverConstUnitStringInStringBuilderTitle
source: Consider using 'StringBuilder.Append(char)' when applicable
cs: Zvažte možnost použít metodu StringBuilder.Append(char) tam, kde je to možné
de: Verwendung von "StringBuilder.Append(char)" erwägen
es: Puede usar "StringBuilder.Append(char)" cuando sea aplicable
fr: Utilisez 'StringBuilder.Append(char)' le cas échéant
it: Se applicabile, provare a usare 'StringBuilder.Append(char)'
ja: 該当する場合は 'StringBuilder.Append(char)' の使用を検討
ko: 해당하는 경우 'StringBuilder.Append(char)'를 사용하는 것이 좋음
pl: Rozważ użycie elementu „StringBuilder.Append(char)”, jeśli ma to zastosowanie
pt_br: Considere o uso de 'StringBuilder.Append(char)' quando aplicável
ru: Рекомендация использовать метод "StringBuilder.Append(char)" по мере возможности
tr: Uygun olduğunda 'StringBuilder.Append(char)' kullanabilirsiniz
zh_hans: 若适用，请考虑使用 "StringBuilder.Append(char)"
zh_hant: 請在適當時考慮使用 'StringBuilder.Append(char)'

# PreferConvertToHexStringOverBitConverterCodeFixTitle
source: Replace with 'Convert.{0}'
cs: Nahraďte výrazem „Convert.{0}“
de: Ersetzen Sie sie durch „Convert.{0}“.
es: Reemplazar por 'Convert.{0}'
fr: Remplacez par « Convertir.{0} »
it: Sostituire con "Converti{0}"
ja: 'Convert.{0}' で置き換え
ko: 'Convert.{0}'(으)로 대체
pl: Zamień na „Konwertuj.{0}”
pt_br: Substituir por "Convert.{0}"
ru: Заменить на "Convert.{0}"
tr: 'Convert.{0}' ile değiştirin
zh_hans: 替换为“Convert.{0}”
zh_hant: 以 'Convert.{0}' 取代

# PreferConvertToHexStringOverBitConverterDescription
source: Use 'Convert.ToHexString' or 'Convert.ToHexStringLower' when encoding bytes to a hexadecimal string representation. These methods are more efficient and allocation-friendly than using 'BitConverter.ToString' in combination with 'String.Replace' to replace dashes and 'String.ToLower'.
cs: Při kódování bajtů na reprezentaci šestnáctkového řetězce použijte „Convert.ToHexString“ nebo „Convert.ToHexStringLower“. Tyto metody jsou efektivnější a dají se lépe přidělit než použití „BitConverter.ToString“ v kombinaci se „String.Replace“ k nahrazení pomlček a „String.ToLower“.
de: Verwenden Sie „Convert.ToHexString“ oder „Convert.ToHexStringLower“, wenn Sie Bytes in eine hexadezimale Zeichenfolgendarstellung codieren. Diese Methoden sind effizienter und lassen sich leichter zuordnen als die Verwendung von „BitConverter.ToString“ in Kombination mit „String.Replace“, um Bindestriche und „String.ToLower“ zu ersetzen.
es: Utilice "Convert.ToHexString" o "Convert.ToHexStringLower" al codificar bytes en una representación de cadena hexadecimal. Estos métodos son más eficientes y compatibles con las asignaciones que el uso de 'BitConverter.ToString' en combinación con 'String.Replace' para reemplazar guiones y 'String.ToLower'.
fr: Utilisez « Convert.ToHexString » ou « Convert.ToHexStringLower » lors de l’encodage d’octets dans une représentation de chaîne hexadécimale. Ces méthodes sont plus efficaces et plus adaptées à l’allocation que l’utilisation de « BitConverter.ToString » en combinaison avec « String.Replace » pour remplacer les tirets et « String.ToLower ».
it: Utilizzare "Convert.ToHexString" o "Convert.ToHexStringLower" quando si codificano i byte in una rappresentazione di stringa esadecimale. Questi metodi sono più efficienti e facili da allocare rispetto all'utilizzo di "BitConverter.ToString" in combinazione con "String.Replace" per sostituire i trattini e "String.ToLower".
ja: バイト値を 16 進数の文字列表現にエンコードする場合は、'Convert.ToHexString' または 'Convert.ToHexStringLower' を使用します。これらのメソッドは、'BitConverter.ToString' を、ダッシュの置き換えのために 'String.Replace' と組み合わせたり、 'String.ToLower' と組み合わせたりするより効率的で、割り当てに適しています。
ko: 바이트를 16진수 문자열 표현으로 인코딩할 때 'Convert.ToHexString' 또는 'Convert.ToHexStringLower'를 사용합니다. 이러한 메서드는 대시와 'String.ToLower'를 바꾸기 위해 'String.Replace'와 함께 'BitConverter.ToString'을 사용하는 것보다 효율적이고 할당에 친화적입니다.
pl: Użyj wartości „Convert.ToHexString” lub „Convert.ToHexStringLower” podczas kodowania bajtów do reprezentacji ciągu szesnastkowego. Te metody są bardziej wydajne i przyjazne dla alokacji niż użycie elementu „BitConverter.ToString” w połączeniu z elementem „String.Replace” w celu zastąpienia łączników i ciągu „String.ToLower”.
pt_br: Use "Convert.ToHexString" ou "Convert.ToHexStringLower" ao codificar bytes em uma representação de cadeia de caracteres hexadecimal. Esses métodos são mais eficientes e amigáveis para alocação do que usar "BitConverter.ToString" em combinação com "String.Replace" para substituir traços e "String.ToLower".
ru: При кодировании байтов в шестнадцатеричное строковое представление используйте "Convert.ToHexString" или "Convert.ToHexStringLower". Эти методы более эффективны и удобны для выделения, чем использование "BitConverter.ToString" в сочетании со "String.Replace" для замены дефисов и "String.ToLower".
tr: Baytları onaltılık dize gösterimine kodlarken 'Convert.ToHexString' veya 'Convert.ToHexStringLower' kullanın. Bu yöntemler, tireleri değiştirmek için 'String.Replace' ve 'String.ToLower' ile birlikte 'BitConverter.ToString' kullanmaktan daha verimlidir ve ayırmaya uygundur.
zh_hans: 将字节编码为十六进制字符串表示形式时，请使用 `Convert.ToHexString` 或 `Convert.ToHexStringLower`。与将“BitConverter.ToString”与“String.Replace”结合使用以替换短划线和“String.ToLower”相比，这些方法更高效且更易于分配。
zh_hant: 將位元組編碼為十六進位字串表示法時，請使用 'Convert.ToHexString' 或 'Convert.ToHexStringLower'。這些方法比使用 'BitConverter.ToString' 與 'String.Replace' 一起取代虛線和 'String.ToLower' 更有效率且更易配置。

# PreferConvertToHexStringOverBitConverterMessage
source: Prefer '{0}' over call chains based on '{1}'
cs: Preferovat „{0}“ před posloupnostmi volání na základě „{1}“
de: Bevorzugen Sie „{0}“ gegenüber Anrufketten, die auf „{1}“ basieren.
es: Preferir '{0}' en lugar de cadenas de llamada basadas en '{1}'
fr: Préférer « {0} » aux chaînes d’appel basées sur « {1} »
it: Preferire "{0}" alle catene di chiamate basate su "{1}"
ja: '{1}' に基づく呼び出しチェーンより '{0}' を優先
ko: '{0}' 기반의 호출 체인보다 '{1}' 선호
pl: Preferuj element „{0}” niż łańcuchy wywołań oparte na „{1}”
pt_br: Preferir "{0}" em vez de cadeias de chamadas com base em "{1}"
ru: Предпочитать "{0}" цепочкам вызовов на основе "{1}"
tr: '{1}' tabanlı çağrı zincirleri yerine '{0}' tercih edin
zh_hans: 首选“{0}”而不是基于“{1}”的调用链
zh_hant: 比起以 '{1}' 為基礎的呼叫鏈，更偏好 '{0}'

# PreferConvertToHexStringOverBitConverterTitle
source: Prefer 'Convert.ToHexString' and 'Convert.ToHexStringLower' over call chains based on 'BitConverter.ToString'
cs: Preferovat „Convert.ToHexString“ a „Convert.ToHexStringLower“ před posloupnostmi volání založenými na „BitConverter.ToString“
de: Bevorzugen Sie „Convert.ToHexString“ und „Convert.ToHexStringLower“ gegenüber Aufrufketten, die auf „BitConverter.ToString“ basieren.
es: Preferir 'Convert.ToHexString' y 'Convert.ToHexStringLower' en lugar de cadenas de llamada basadas en 'BitConverter.ToString'
fr: Préférer « Convert.ToHexString » et « Convert.ToHexStringLower » aux chaînes d’appel basées sur « BitConverter.ToString »
it: Preferire "Convert.ToHexString" e "Convert.ToHexStringLower" rispetto alle catene di chiamate basate su "BitConverter.ToString"
ja: 'BitConverter.ToString' に基づく呼び出しチェーンより、 'Convert.ToHexString' と 'Convert.ToHexStringLower' を優先
ko: 'BitConverter.ToString'을 기반으로 하는 호출 체인보다 'Convert.ToHexString' 및 'Convert.ToHexStringLower'를 선호합니다.
pl: Preferuj wartości „Convert.ToHexString” i „Convert.ToHexStringLower” w stosunku do łańcuchów wywołań opartych na elemencie „BitConverter.ToString”
pt_br: Preferir "Convert.ToHexString" e "Convert.ToHexStringLower" em vez de cadeias de chamadas com base em "BitConverter.ToString"
ru: Предпочитать "Convert.ToHexString" и "Convert.ToHexStringLower" цепочкам вызовов на основе "BitConverter.ToString"
tr: 'BitConverter.ToString' tabanlı çağrı zincirleri yerine 'Convert.ToHexString' ve 'Convert.ToHexStringLower' tercih edin
zh_hans: 首选“Convert.ToHexString”和“Convert.ToHexStringLower”而不是基于“BitConverter.ToString”的调用链
zh_hant: 比起以 'BitConverter.ToString' 為基礎的呼叫鏈結，更偏好 'Convert.ToHexString' 和 'Convert.ToHexStringLower'

# PreferCountOverAnyCodeFixTitle
source: Use 'Count' check instead of 'Any()'
cs: K ověření použijte metodu Count místo Any()
de: „Count“ anstelle von „Any()“ verwenden
es: Usar la comprobación "Count" en lugar de "Any()"
fr: Utilisez 'Count' case activée au lieu de 'Any()'
it: Usare il controllo 'Count' anziché 'Any()'
ja: 'Any()' の代わりに 'Count' チェックを使用してください
ko: 'Any()' 대신 'Count' 확인 사용
pl: Użyj sprawdzania „Count” zamiast „Any()”
pt_br: Usar a verificação 'Count' em vez de 'Any()'
ru: Используйте проверку 'Count' вместо 'Any()'
tr: 'Any()' yerine 'Count' denetimi kullanın
zh_hans: 使用 'Count' 检查而不是 'Any()'
zh_hant: 使用 'Count' 檢查而非 'Any()'

# PreferCountOverAnyMessage
source: Prefer comparing 'Count' to 0 rather than using 'Any()', both for clarity and for performance
cs: Upřednostňujte porovnání vlastnosti Count s 0 místo použití metody Any(), a to jak pro přehlednost, tak pro výkon.
de: Sowohl aus Gründen der Klarheit als auch der Leistung ist der Vergleich von „Count“ mit 0 der Verwendung von „Any()“ vorzuziehen
es: Es preferible comparar "Count" con 0 en lugar de usar "Any()", tanto por claridad como por rendimiento.
fr: Préférez comparer « Count » à 0 au lieu d’utiliser « Any() », à la fois pour plus de clarté et pour des performances
it: Preferire il confronto 'Count' con 0 anziché usare 'Any()', sia per chiarezza che per prestazioni.
ja: 明確性とパフォーマンスの両方のために、'Any()' を使用するのではなく、'Count' を 0 と比較することを優先してください
ko: 명확성과 성능을 위해 'Any()'를 사용하는 것보다 'Count'를 0과 비교하는 것이 좋습니다.
pl: Preferuj porównywanie wartości „Count” z wartością 0 zamiast użycia elementu „Any()”, zarówno w celu zapewnienia jednoznaczności, jak i wydajności
pt_br: Prefira comparar 'Count' com 0 em vez de usar 'Any()', tanto para clareza quanto para desempenho
ru: Для ясности и для обеспечения производительности старайтесь сравнивать 'Count' с 0 вместо того, чтобы использовать 'Any()'
tr: Hem kolay anlaşılırlık hem de performans için 'Count' değerini 'Any()' yerine 0 ile karşılaştırmayı tercih edin
zh_hans: 更喜欢将 'Count' 与 0 进行比较，而不是使用 'Any()'，这既是为了清楚明了，也是为了提高性能
zh_hant: 為了清楚明瞭和為了提升效能，偏好比較 'Count' 與 0，而不是使用 'Any()'

# PreferDictionaryContainsKeyCodeFixTitle
source: Use 'ContainsKey'
cs: Použít ContainsKey
de: "ContainsKey" verwenden
es: Usar 'ContainsKey'
fr: Utiliser « ContainsKey »
it: Usare 'ContainsKey'
ja: 'ContainsKey' を使用する
ko: 'ContainsKey' 사용
pl: Użyj elementu „ContainsKey”
pt_br: Usar 'ContainsKey'
ru: Использовать "ContainsKey"
tr: 'ContainsKey' kullanın
zh_hans: 使用 “ContainsKey”
zh_hant: 請使用 'ContainsKey'

# PreferDictionaryContainsKeyDescription
source: 'ContainsKey' is usually O(1), while 'Keys.Contains' may be O(n) in some cases. Additionally, many dictionary implementations lazily initialize the Keys collection to cut back on allocations.
cs: ContainsKey je obvykle O(1), zatímco Keys.Contains může být v některých případech V(n). Kromě toho mnoho slovníkových implementací laxně inicializuje kolekci Keys, aby se omezilo přidělení.
de: "ContainsKey" lautet normalerweise O(1), während "Keys.Contains" in einigen Fällen O(n) lauten kann. Außerdem wird bei vielen Wörterbuchimplementierungen die Keys-Sammlung verzögert initialisiert, um Zuordnungen einzuschränken.
es: 'ContainsKey' suele ser O(1), mientras que 'Keys.Contains' puede ser O(n) en algunos casos. Además, muchas implementaciones de diccionario inicializan la colección Keys de forma diferida para reducir las asignaciones.
fr: 'ContainsKey’ est généralement O (1), tandis que ’Keys. Contains. Contains peut être O (n) dans certains cas. En outre, de nombreuses implémentations de dictionnaires initialisent tardivement la collection Keys pour réduire les allocations.
it: 'ContainsKey' è in genere O(1), mentre in alcuni casi 'Keys.Contains' può essere O(n). Inoltre, molte implementazioni del dizionario inizializzano in modo differito la raccolta Keys per ridurre le allocazioni.
ja: 'ContainsKey' は通常 O(1) ですが、'Keys.Contains' は場合によっては O(n) になることがあります。さらに、多くのディクショナリ実装では、割り当てを削減するために Keys コレクションが遅延初期化されます。
ko: 'ContainsKey'는 일반적으로 O(1)인 반면 'Keys.Contains'는 경우에 따라 O(n)일 수 있습니다. 또한 많은 사전 구현은 할당을 줄이기 위해 Keys 컬렉션을 느리게 초기화합니다.
pl: Element „ContainsKey” ma zazwyczaj wartość O(1), a element „Keys.Contains” może w niektórych przypadkach mieć wartość O(n). Ponadto wiele implementacji słownika bardzo wolno inicjuje kolekcję kluczy, aby ograniczyć alokacje.
pt_br: 'ContainsKey' geralmente é O(1), enquanto 'Keys.Contains' pode ser O(n) em alguns casos. Além disso, muitas implementações de dicionário inicializam lentamente a coleção keys para recortar as alocações.
ru: "ContainsKey" обычно относится к O(1), а "Keys.Contains" может в некоторых случаях относиться к O(n). Кроме того, многие реализации словаря не очень хорошо инициализируют коллекцию Keys, чтобы сократить затраты на выделения.
tr: 'ContainsKey' genellikle O(1) iken 'Keys.Contains' bazı durumlarda O(n) olabilir. Ayrıca birçok sözlük uygulaması ayırmaları sınırlandırmak için Keys koleksiyonunu geç başlatır.
zh_hans: “ContainsKey” 通常是 O(1)，而 “Keys.Contains” 在某些情况下可能是 O(n)。此外，许多字典实现会延迟地初始化 Keys 集合，以减少分配。
zh_hant: 'ContainsKey' 通常為 O(1)，但在某些情況下，'Keys.Contains' 可能為 O(n)。此外，許多字典實作會延遲初始化 Keys 集合以縮減配置。

# PreferDictionaryContainsKeyMessage
source: Prefer 'ContainsKey' over 'Keys.Contains' for dictionary type '{0}'
cs: Pro typ slovníku{0} preferovat ContainsKey před Keys.Contains
de: Bevorzugen Sie "ContainsKey" gegenüber "Keys.Contains" für den Wörterbuchtyp "{0}".
es: Preferir "ContainsKey" a "Keys.Contains" para el tipo de diccionario "{0}"
fr: Préférez ’ContainsKey’ au-dessus de ’Keys. Contains’ pour le type de dictionnaire' {0} '
it: Preferire 'ContainsKey' a 'Keys.Contains' per il tipo di dizionario '{0}'
ja: ディクショナリ型 '{0}' の場合は、'Keys.Contains' よりも 'ContainsKey' を優先します
ko: 사전 형식 '{0}'에 대해 'Keys.Contains'보다 'ContainsKey'를 우선적으로 사용합니다.
pl: Preferuj element „ContainsKey” niż „Keys.Contains” dla typu słownika „{0}”
pt_br: Prefira 'ContainsKey' em vez de 'Keys.Contains' para o tipo de dicionário '{0}'
ru: Предпочтительное использование "ContainsKey" вместо "Keys.Contains" для типа словаря "{0}"
tr: Sözlük türü '{0}' için 'Keys.Contains' yerine 'ContainsKey' tercih edin
zh_hans: 对于字典类型“{0}”，首选 “ContainsKey” 而不是 “Keys.Contains”。
zh_hant: 字典類型 '{0}' 建議使用 'ContainsKey' 而不是 'Keys.Contains'

# PreferDictionaryContainsMethodsTitle
source: Prefer Dictionary.Contains methods
cs: Preferovat metody Dictionary.Contains
de: Dictionary.Contains-Methoden bevorzugen
es: Preferir métodos Dictionary.Contains
fr: Préférer dictionary. Contains. Contains
it: Preferire i metodi Dictionary.Contains
ja: Dictionary.Contains メソッドを優先する
ko: Dictionary.Contains 메서드를 우선적으로 사용
pl: Preferuj metody Dictionary.Contains
pt_br: Preferir métodos Dictionary.Contains
ru: Предпочтительное использование методов Dictionary.Contains
tr: Dictionary.Contains yöntemleri tercih edin
zh_hans: 首选 Dictionary.Contains 方法
zh_hant: 建議使用 Dictionary.Contains 方法

# PreferDictionaryContainsValueCodeFixTitle
source: Use 'ContainsValue'
cs: Použít ContainsValue
de: "ContainsValue" verwenden
es: Usar 'ContainsValue'
fr: Utiliser ’ContainsValue'
it: Usare 'ContainsValue'
ja: 'ContainsValue' を使用する
ko: 'ContainsValue' 사용
pl: Użyj wartości „ContainsValue”
pt_br: Usar 'ContainsValue'
ru: Использовать "ContainsValue"
tr: 'ContainsValue' kullanın
zh_hans: 使用 “ContainsValue”
zh_hant: 請使用 'ContainsValue'

# PreferDictionaryContainsValueDescription
source: Many dictionary implementations lazily initialize the Values collection. To avoid unnecessary allocations, prefer 'ContainsValue' over 'Values.Contains'.
cs: Mnoho slovníkových implementací laxně inicializuje kolekci Values. Pokud nechcete, aby nedocházelo k zbytečnému přidělení, upřednostňujte ContainsValue před Values.Contains.
de: Bei vielen Wörterbuchimplementierungen wird die Values-Sammlung verzögert initialisiert. Um unnötige Zuordnungen zu vermeiden, bevorzugen Sie "ContainsValue" gegenüber "Values.Contains".
es: Muchas implementaciones de diccionario inicializan la colección Values de forma diferida. Para evitar asignaciones innecesarias, se prefiere "ContainsValue" a "Values.Contains".
fr: Plusieurs implémentations de dictionnaires initialisent tardivement la collection Values. Pour éviter les allocations inutiles, préférez ’ContainsValue’ à ’Values. Contains'.
it: Molte implementazioni del dizionario inizializzano in modo differito la raccolta Values. Per evitare allocazioni non necessarie, preferire 'ContainsValue' a 'Values.Contains'.
ja: 多くのディクショナリ実装では、Values コレクションが遅延初期化されます。不要な割り当てを回避するには、'Values.Contains' よりも 'ContainsValue' を優先します。
ko: 많은 사전 구현이 Values ​​컬렉션을 느리게 초기화합니다. 불필요한 할당을 피하려면 'Values.Contains'보다 'ContainsValue'를 우선적으로 사용합니다.
pl: Wiele implementacji słowników bardzo wolno inicjalizuje kolekcję Values. Aby uniknąć niepotrzebnych alokacji, preferuj wartość „ContainsValue” zamiast wartości „Values.Contains”.
pt_br: Muitas implementações de dicionário inicializam lentamente a coleção Values. Para evitar alocações desnecessárias, prefira 'ContainsValue' em vez de 'Values.Contains'.
ru: Многие реализации словаря не очень хорошо инициализируют коллекцию Values. Чтобы избежать ненужных выделений, используйте "ContainsValue" вместо "Values.Contains".
tr: Birçok sözlük uygulaması Values derlemesini geç başlatır. Gereksiz ayırmaları önlemek için 'Values.Contains' yerine 'ContainsValue' tercih edin.
zh_hans: 许多字典实现延迟初始化 Values 集合。为了避免不必要的分配，首选 “ContainsValue” 而不是 “Values.Contains”。
zh_hant: 許多字典實作會延遲初始化 Values 集合。為避免不必要的配置，建議使用 'ContainsValue' 而不是 'Values.Contains'。

# PreferDictionaryContainsValueMessage
source: Prefer 'ContainsValue' over 'Values.Contains' for dictionary type '{0}'
cs: Pro typ slovníku{0} preferovat ContainsValue před Values.Contains
de: Bevorzugen Sie "ContainsValue" gegenüber "Values.Contains" für den Wörterbuchtyp "{0}".
es: Preferir 'ContainsValue' a 'Values.Contains' para el tipo de diccionario '{0}'
fr: Préférer ’ContainsValue’ à ’Values. Contains’ pour le type de dictionnaire '{0}'
it: Preferire 'ContainsValue' a 'Values.Contains' per il tipo di dizionario '{0}'
ja: ディクショナリ型 '{0}' の 'Values.Contains' よりも 'ContainsValue' を優先します
ko: 사전 형식 '{0}'에 대해 'Values.Contains'보다 'ContainsValue'를 우선적으로 사용합니다.
pl: Preferuj wartość „ContainsValue” niż wartość „Values.Contains” dla typu słownika „{0}”
pt_br: Prefira 'ContainsValue' em vez de 'Values.Contains' para o tipo de dicionário '{0}'
ru: Предпочтительное использование "ContainsValue" вместо "Vаlues.Contains" для словаря типа "{0}"
tr: Sözlük türü '{0}' için 'Values.Contains' yerine 'ContainsValue' tercih edin
zh_hans: 对于字典类型“{0}”，首选 “ContainsValue” 而不是 “Values.Contains”。
zh_hant: 字典類型 '{0}' 建議使用 'ContainsValue' 而不是 'Values.Contains'

# PreferDictionaryTryAddDescription
source: Prefer a 'TryAdd' call over an 'Add' call guarded by a 'ContainsKey' check. 'TryAdd' behaves the same as 'Add', except that when the specified key already exists, it returns 'false' instead of throwing an exception.
cs: Upřednostňujte volání TryAdd před voláním Add, které je chráněné kontrolou ContainsKey. TryAdd se chová stejně jako Add s tím rozdílem, že pokud už zadaný klíč existuje, vrátí hodnotu false místo vyvolání výjimky.
de: Bevorzugen Sie einen TryAdd-Aufruf gegenüber einem Add-Aufruf, der durch eine ContainsKey-Überprüfung geschützt wird. "TryAdd" verhält sich genauso wie "Add", außer dass der angegebene Schlüssel "false" zurückgibt, anstatt eine Ausnahme auszulösen, wenn der angegebene Schlüssel bereits vorhanden ist.
es: Dé preferencia a una llamada a "TryAdd" sobre una llamada a "Add" que esté protegida por una comprobación "ContainsKey". "TryAdd" se comporta igual que "Add", excepto que cuando la clave especificada ya existe, devuelve "false" en lugar de iniciar una excepción.
fr: Préférez un appel « TryAdd » à un appel « Add » protégé par une vérification « ContainsKey ». « TryAdd » se comporte comme « Add », sauf que lorsque la clé spécifiée existe déjà, elle retourne false au lieu de lever une exception.
it: Preferisci una chiamata 'TryAdd' rispetto a una chiamata 'Add' sorvegliata da un controllo 'ContainsKey'. 'TryAdd' si comporta come 'Add', ma quando la chiave specificata esiste già, restituisce 'false' anziché generare un'eccezione.
ja: 'ContainsKey' チェックによる保護付きの 'Add' 呼び出しではなく 'TryAdd' 呼び出しを推奨します。'TryAdd' の基本的な動作は 'Add' と同じですが、指定したキーが既に存在する場合には、例外をスローするのではなく 'false' を返します。
ko: 'ContainsKey' 확인으로 보호되는 'Add' 호출보다 'TryAdd' 호출을 선호합니다. 'TryAdd'는 'Add'와 동일하게 동작하지만 지정한 키가 이미 존재하는 경우 예외를 던지는 대신 'false'를 반환합니다.
pl: Preferuj wywołanie „TryAdd” zamiast wywołania „Add” chronionego przez sprawdzenie „ContainsKey”. Element „TryAdd” zachowuje się tak samo jak element „Add”, ale jeśli określony klucz już istnieje, zwraca wartość „false” zamiast zgłaszania wyjątku.
pt_br: Prefira uma chamada 'TryAdd' em vez de uma chamada 'Add' protegida por uma verificação 'ContainsKey'. 'TryAdd' se comporta da mesma forma que 'Add', exceto que quando a chave especificada já existe, ele retorna 'false' em vez de lançar uma exceção.
ru: Предпочитать вызов "TryAdd" вызову "Add", защищенному с помощью проверки "ContainsKey". "TryAdd" ведет себя так же, как и "Add", за исключением того, что при существовании указанного ключа он возвращает значение "false" вместо выдачи исключения.
tr: 'TryAdd' çağrısını 'ContainsKey' denetimiyle korunan 'Add' çağrısına tercih edin. 'TryAdd' çağrısı, belirtilen anahtarın zaten mevcut olduğu durumlar dışında 'Add' çağrısıyla aynı şekilde davranır; bir özel durum oluşturmak yerine 'false' değerini döndürür.
zh_hans: 首选 "TryAdd" 调用而不是由 "ContainsKey" 检查保护的 "Add" 调用。"TryAdd" 的行为与 "Add" 相同，但当指定的密钥已存在时，它返回 "false" 而不是引发异常。
zh_hant: 偏好 'TryAdd' 呼叫，而不要使用由 'ContainsKey' 檢查所防護的 'Add' 呼叫。'TryAdd' 的行為與 'Add' 相同，唯一的例外是，當指定的索引鍵已存在時會返回 'false'，而不是擲回例外狀況。
