Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MarkISerializableTypesWithSerializableDescription
source: To be recognized by the common language runtime as serializable, types must be marked by using the SerializableAttribute attribute even when the type uses a custom serialization routine through implementation of the ISerializable interface.
cs: Aby modul CLR (Common Language Runtime) mohl typy rozpoznat jako serializovatelné, musí se tyto typy označit atributem SerializableAttribute, a to i v případě, že typ používá vlastní serializační rutinu prostřednictvím implementace rozhraní ISerializable.
de: Um von der Common Language Runtime als serialisierbar erkannt zu werden, müssen Typen auch dann mit dem SerializableAttribute-Attribut markiert werden, wenn der Typ eine Routine zur benutzerdefinierten Serialisierung durch Implementierung der ISerializable-Schnittstelle verwendet.
es: Para que Common Language Runtime reconozca los tipos como serializables, estos se deben marcar con el atributo SerializableAttribute, incluso cuando usan una rutina de serialización personalizada mediante la implementación de la interfaz ISerializable.
fr: Pour être reconnus par le Common Language Runtime comme sérialisables, les types doivent être marqués avec l'attribut SerializableAttribute même s'ils utilisent une routine de sérialisation personnalisée via l'implémentation de l'interface ISerializable.
it: Per essere riconosciuti come serializzabili in Common Language Runtime, i tipi devono essere contrassegnati usando l'attributo SerializableAttribute anche quando usano una routine di serializzazione personalizzata tramite l'implementazione dell'interfaccia ISerializable.
ja: 共通言語ランタイムからシリアル化可能として認識されるには、型が ISerializable インターフェイスの実装によりカスタムのシリアル化ルーチンを使用する場合でも、SerializableAttribute 属性を使用して型をマークする必要があります。
ko: 공용 언어 런타임에서 serializable로 인식되려면 형식이 ISerializable 인터페이스 구현을 통해 사용자 지정 serialization 루틴을 사용하는 경우에도 SerializableAttribute 특성을 사용하여 형식을 표시해야 합니다.
pl: Aby typy mogły zostać rozpoznane przez środowiska uruchomieniowe w trakcie wykonania jako możliwe do serializacji, muszą być oznaczone atrybutem SerializableAttribute, nawet gdy typ używa niestandardowej procedury serializacji przez implementację interfejsu ISerializable.
pt_br: Para que sejam reconhecidos pelo Common Language Runtime como serializáveis, os tipos precisam ser marcados usando o atributo SerializableAttribute, mesmo quando o tipo usa uma rotina de serialização personalizada por meio da implementação da interface ISerializable.
ru: Чтобы среда CLR распознавала типы как сериализуемые, они должны быть помечены с помощью атрибута SerializableAttribute, даже если тип использует настраиваемую процедуру сериализации посредством реализации интерфейса ISerializable.
tr: Ortak dil çalışma zamanı modülü tarafından serileştirilebilir olarak tanınmak için, tür ISerializable arabiriminin uygulanması aracılığıyla özel bir serileştirme yordamı kullandığında bile, türler SerializableAttribute özniteliği kullanılarak işaretlenmelidir.
zh_hans: 要被公共语言运行时识别为可序列化，必须使用 SerializableAttribute 特性标记类型，即使类型通过 ISerializable 接口的实现使用自定义序列化例程时也不例外。
zh_hant: 若要通用語言執行階段將其辨識為可序列化，即使類型透過實作 ISerializable 介面使用自訂序列化常式，也必須使用 SerializableAttribute 屬性來標示類型。

# MarkISerializableTypesWithSerializableMessage
source: Add [Serializable] to {0} as this type implements ISerializable
cs: Přidejte [Serializable] k {0}, protože tento typ implementuje ISerializable.
de: Fügen Sie "{0}" [Serializable] hinzu, da dieser Typ ISerializable implementiert.
es: Agregue [Serializable] a {0}, ya que este tipo implementa ISerializable.
fr: Ajoutez [Serializable] à {0}, car ce type implémente ISerializable
it: Aggiungere [Serializable] a {0} perché questo tipo implementa ISerializable
ja: この型は ISerializable を実装するため、[Serializable] を {0} に追加します
ko: ISerializable을 구현하는 [Serializable]을 {0}에 추가합니다.
pl: Dodaj atrybut [Serializable] do typu {0}, ponieważ ten typ implementuje interfejs ISerializable
pt_br: Adicione [Serializable] a {0}, pois este tipo implementa ISerializable
ru: Добавьте [Serializable] к {0}, так как этот тип реализует ISerializable
tr: {0} türü ISerializable uyguladığı için [Serializable] ekleyin
zh_hans: 将 [Serializable] 添加到 {0}，因为此类型实现 ISerializable
zh_hant: 將 [Serializable] 新增至 {0}，因為這個類型會實作 ISerializable

# MarkISerializableTypesWithSerializableTitle
source: Mark ISerializable types with serializable
cs: Označit typy ISerializable jako serializable
de: ISerializable-Typen mit "serializable" markieren
es: Marcar los tipos ISerializable con serializable
fr: Marquer les types ISerializable avec serializable
it: Contrassegnare i tipi ISerializable con serializable
ja: ISerializable 型を serializable に設定します
ko: serializable로 ISerializable 형식 표시
pl: Oznacz typy ISerializable atrybutem serializable
pt_br: Marque os tipos ISerializable com serializable
ru: Пометить типы ISerializable атрибутом serializable
tr: ISerializable türlerini serileştirilebilir ile işaretleyin
zh_hans: 将 ISerializable 类型标记为“可序列化”
zh_hant: 將 ISerializable 類型標示為可序列化

# MaybeDisableHttpClientCRLCheck
source: Ensure HttpClient certificate revocation list check is not disabled
cs: Zkontrolujte, že kontrola seznamu odvolaných certifikátů HttpClient není vypnutá.
de: Stellen Sie sicher, dass die Überprüfung der HttpClient-Zertifikatsperrliste nicht deaktiviert ist.
es: Garantizar que la comprobación de la lista de revocación de certificados HttpClient no está deshabilitada
fr: Contrôlez si la vérification de la liste de révocation de certificats HttpClient est bien activée
it: Assicurarsi che il controllo dell'elenco di revoche di certificati di HttpClient non sia disabilitato
ja: HttpClient 証明書失効リストの確認が無効になっていないことをご確認ください
ko: HttpClient 인증서 해지 목록 확인을 사용할 수 있는지 확인합니다.
pl: Upewnij się, że sprawdzenie listy odwołań certyfikatów programu HttpClient nie jest wyłączone
pt_br: Certifique-se de que a verificação da lista de certificados revogados do HttpClient não está desabilitada
ru: Проверка списка отзыва сертификатов HttpClient не должна быть отключена.
tr: HttpClient sertifika iptal listesi denetiminin devre dışı bırakılmadığından emin olun
zh_hans: 确保未禁用 HttpClient 证书吊销列表检查
zh_hant: 確認未停用 HttpClient 憑證撤銷清單檢查

# MaybeDisableHttpClientCRLCheckMessage
source: HttpClient may be created without enabling CheckCertificateRevocationList
cs: Třída HttpClient může být vytvořena bez povolení vlastnosti CheckCertificateRevocationList.
de: HttpClient wird möglicherweise ohne Aktivieren von CheckCertificateRevocationList erstellt.
es: HttpClient se puede crear sin habilitar CheckCertificateRevocationList.
fr: HttpClient peut être créé sans activation de CheckCertificateRevocationList
it: HttpClient può essere creato senza abilitare CheckCertificateRevocationList
ja: HttpClient は、CheckCertificateRevocationList を有効にせずに作成できます
ko: CheckCertificateRevocationList를 사용하지 않고 HttpClient가 생성될 수 있습니다.
pl: Program HttpClient może zostać utworzony bez włączania właściwości CheckCertificateRevocationList
pt_br: HttpClient pode ser criado sem habilitar CheckCertificateRevocationList
ru: HttpClient может создаваться без включения CheckCertificateRevocationList.
tr: HttpClient, CheckCertificateRevocationList etkinleştirilmeden oluşturulabilir
zh_hans: 可在不启用 CheckCertificateRevocationList 的情况下创建 HttpClient
zh_hant: 可在不啟用 CheckCertificateRevocationList 的情況下建立 HttpClient

# MaybeInstallRootCert
source: Ensure Certificates Are Not Added To Root Store
cs: Zajistit, aby se certifikáty nepřidávaly do kořenového úložiště
de: Stellen Sie sicher, dass Zertifikate nicht zum Stammspeicher hinzugefügt werden.
es: Asegurarse de que los certificados no se agregan al almacén raíz
fr: Vérifier que les certificats ne sont pas ajoutés au magasin racine
it: Verificare che i certificati non vengano aggiunti all'archivio radice
ja: 証明書がルート ストアに追加されていないことを確認する
ko: 루트 저장소에 인증서가 추가되지 않았는지 확인
pl: Upewnij się, że certyfikaty nie są dodawane do magazynu głównego
pt_br: Verifique Se Não Foram Adicionados Certificados ao Repositório Raiz
ru: Убедитесь, что сертификаты не добавлены в корневое хранилище
tr: Sertifikaların Kök Depoya Eklenmediğinden Emin Olun
zh_hans: 确保没有将证书添加到根存储
zh_hant: 請確認憑證不會新增至根存放區

# MaybeInstallRootCertMessage
source: Adding certificates to the operating system's trusted root certificates is insecure. Ensure that the target store is not root store.
cs: Přidávání certifikátů mezi důvěryhodné kořenové certifikáty operačního systému není bezpečné. Ujistěte se, že cílové úložiště není kořenové.
de: Das Hinzufügen von Zertifikaten zu den vertrauenswürdigen Stammzertifikaten des Betriebssystems stellt ein Sicherheitsrisiko dar. Stellen Sie sicher, dass der Zielspeicher kein Stammspeicher ist.
es: La adición de certificados a los certificados raíz de confianza del sistema operativo no es segura. Asegúrese de que el almacén de destino no es un almacén raíz.
fr: L'ajout de certificats aux certificats racines approuvés du système d'exploitation n'est pas sécurisé. Vérifiez que le magasin cible n'est pas un magasin racine.
it: L'aggiunta di certificati a certificati radice attendibili del sistema operativo non è sicura. Verificare che l'archivio di destinazione non sia un archivio radice.
ja: オペレーティング システムの信頼されたルート証明書に証明書を追加することは安全ではありません。ターゲット ストアがルート ストアでないことを確認してください。
ko: 운영 체제의 신뢰할 수 있는 루트 인증서에 인증서를 추가하는 것은 안전하지 않습니다. 대상 저장소가 루트 저장소가 아닌지 확인하세요.
pl: Dodawanie certyfikatów do zaufanych certyfikatów głównych systemu operacyjnego nie jest bezpieczne. Upewnij się, że magazyn docelowy nie jest magazynem głównym.
pt_br: A adição de certificados aos certificados raiz confiáveis do sistema operacional não é segura. Verifique se o repositório de destino não é um repositório raiz.
ru: Добавление сертификатов в доверенные корневые сертификаты операционной системы небезопасно. Убедитесь, что целевое хранилище не находится в корневом хранилище.
tr: Sertifikaların, işletim sisteminin güvenilen kök sertifikalarına eklenmesi güvenli değildir. Hedef deponun kök depo olmadığından emin olun.
zh_hans: 将证书添加到操作系统受信任的根证书很不安全。请确保目标存储不是根存储。
zh_hant: 將憑證新增至作業系統的受信任根憑證並不安全。請確認目標存放區並非根存放區。

# MaybeUseCreateEncryptorWithNonDefaultIV
source: Use CreateEncryptor with the default IV
cs: Použít CreateEncryptor s výchozím inicializačním vektorem
de: CreateEncryptor mit Standard-Initialisierungsvektoren verwenden
es: Usar CreateEncryptor con el vector de inicialización predeterminado
fr: Utiliser CreateEncryptor avec la valeur par défaut IV
it: Usa CreateEncryptor con il vettore di inizializzazione predefinito
ja: 既定の IV で CreateEncryptor を使用する
ko: 기본 IV와 함께 CreateEncryptor 사용
pl: Użyj metody CreateEncryptor z domyślnym wektorem inicjowania
pt_br: Usar CreateEncryptor com o IV padrão
ru: Используйте CreateEncryptor с вектором инициализации по умолчанию
tr: Varsayılan IV ile CreateEncryptor kullan
zh_hans: 将 CreateEncryptor 与默认 IV 结合使用
zh_hant: 使用具有預設 IV 的 CreateEncryptor

# MaybeUseCreateEncryptorWithNonDefaultIVMessage
source: The non-default initialization vector, which can be potentially repeatable, is used in the encryption. Ensure use the default one.
cs: V šifrování se používá nevýchozí inicializační vektor, který by se potenciálně mohl dát opakovat. Zajistěte použití výchozího nastavení.
de: Für die Verschlüsselung wird ein nicht standardmäßiger Initialisierungsvektor verwendet, der potenziell wiederholbar sein kann. Stellen Sie sicher, dass der Standardvektor verwendet wird.
es: El vector de inicialización no predeterminado, que puede repetirse, se usa en el cifrado. Asegúrese de usar el valor predeterminado.
fr: Le vecteur d'initialisation non défini par défaut, potentiellement répétable, est utilisé dans le chiffrement. Veillez à utiliser le vecteur par défaut.
it: Nella crittografia viene usato il vettore di inizializzazione non predefinito, che può essere potenzialmente ripetibile. Assicurarsi di usare quello predefinito.
ja: 暗号化で既定以外の初期化ベクトルが使用されており、これは反復使用できる可能性があります。必ず既定のものをご使用ください。
ko: 잠재적으로 반복할 수 있는, 기본이 아닌 초기화 벡터가 암호화에 사용됩니다. 기본 초기화 벡터를 사용하세요.
pl: W szyfrowaniu jest używany wektor inicjowania inny niż domyślny, który może być powtarzalny. Upewnij się, że używasz domyślnego wektora inicjowania.
pt_br: O vetor de inicialização não padrão, que pode ser repetível, é usado na criptografia. Garanta o uso do padrão.
ru: Для шифрования используется вектор инициализации, не являющийся вектором инициализации по умолчанию. Этот вектор потенциально может быть воспроизводимым. Используйте вектор инициализации по умолчанию.
tr: Şifrelemede, muhtemelen yinelenebilir, varsayılan olmayan başlatma vektörü kullanılıyor. Varsayılan başlatma vektörünü kullandığınızdan emin olun.
zh_hans: 加密中使用了可能是可重复的非默认初始化向量。请确保使用默认值。
zh_hant: 加密中使用了可能可以重複的非預設初始化向量。請務必使用預設值。

# MaybeUseSecureCookiesASPNetCore
source: Ensure Use Secure Cookies In ASP.NET Core
cs: Zajistit používání zabezpečených souborů cookie v ASP.NET Core
de: Verwendung sicherer Cookies in ASP.NET Core sicherstellen
es: Asegurarse de usar cookies seguras en ASP.NET Core
fr: Vérifier l'utilisation de cookies sécurisés en ASP.NET Core
it: Assicura l'uso di cookie protetti in ASP.NET Core
ja: ASP.Net Core で安全な Cookie を使用していることを確認します
ko: ASP.NET Core에서 보안 쿠키 사용 확인
pl: Upewnij się, że używasz bezpiecznych plików cookie na platformie ASP.NET Core
pt_br: Garantir o Uso de Cookies Seguros no ASP.Net Core
ru: Убедитесь в использовании защищенных файлов cookie в ASP.NET Core.
tr: ASP.NET Core'da Güvenli Tanımlama Bilgileri Kullanılmasını Sağla
zh_hans: 确保在 ASP.NET Core 中使用安全 Cookie
zh_hant: 請確認在 ASP.Net Core 中使用安全 Cookie

# MaybeUseSecureCookiesASPNetCoreMessage
source: Ensure that CookieOptions.Secure = true when setting a cookie
cs: Při nastavování souboru cookie nezapomeňte nastavit CookieOptions.Secure = true.
de: Stellen Sie sicher, dass beim Festlegen eines Cookies "CookieOptions.Secure = true" festgelegt wird.
es: Asegurarse de que CookieOptions.Secure es true al establecer una cookie
fr: Vérifier que CookieOptions.Secure = true au moment de définir un cookie
it: Assicurarsi che CookieOptions.Secure = true durante l'impostazione di un cookie
ja: Cookie を設定する場合は、CookieOptions.Secure = true になっていることを確認してください
ko: 쿠키를 설정할 때 CookieOptions.Secure = true인지 확인합니다.
pl: Upewnij się, że podczas ustawiania pliku cookie wartość CookieOptions.Secure = true
pt_br: Verifique se CookieOptions.Secure = true ao configurar um cookie
ru: Убедитесь, что для параметра CookieOptions.Secure установлено значение true при настройке файла cookie.
tr: Tanımlama bilgisi ayarlanırken CookieOptions.Secure = true olduğundan emin olun
zh_hans: 请确保设置 Cookie 时 CookieOptions.Secure = true
zh_hant: 請確認設定 Cookie 時，CookieOptions.Secure = true

# MaybeUseWeakKDFInsufficientIterationCount
source: Ensure Sufficient Iteration Count When Using Weak Key Derivation Function
cs: Při použití slabé funkce odvození klíče (KDF) zajistěte dostatečný počet iterací.
de: Bei Verwendung einer schwachen Schlüsselableitungsfunktion ausreichende Iterationsanzahl sicherstellen
es: Garantizar un recuento de iteraciones suficiente al usar una función de derivación de claves débiles
fr: Vérifiez que le nombre d'itérations est suffisant durant l'utilisation de la fonction de dérivation de clés faibles
it: Assicurare un numero di iterazioni sufficiente quando si usa la funzione di derivazione di chiave vulnerabile
ja: 弱いキー派生関数を使用する場合は十分な反復回数を確保してください
ko: 취약한 키 파생 함수를 사용할 때 충분한 반복 횟수가 필요함
pl: Używając funkcji wyprowadzania klucza słabego, upewnij się, że istnieje wystarczająca liczba iteracji
pt_br: Assegure uma Contagem de Iteração Suficiente ao Usar a Função de Derivação de Chaves Fraca
ru: Обеспечение достаточного числа итераций при использовании ненадежной функции формирования ключа
tr: Zayıf Anahtar Türetme İşlevini Kullanırken Yeterli Sayıda Yineleme Sağlayın
zh_hans: 使用弱密钥派生功能时，请确保迭代计数足够大
zh_hant: 使用弱式金鑰衍生函數 (Key Derivation Function) 時，請確保反覆項目計量足夠

# MaybeUseWeakKDFInsufficientIterationCountMessage
source: Ensure that the iteration count is at least {0} when deriving a cryptographic key from a password. By default, Rfc2898DeriveByte's IterationCount is only 1000
cs: Při odvozování kryptografického klíče z hesla zajistěte, aby byl počet iterací alespoň {0}. Ve výchozím nastavení má atribut IterationCount pro Rfc2898DeriveByte hodnotu pouze 1000.
de: Stellen Sie eine Iterationsanzahl von mindestens {0} sicher, wenn Sie einen kryptografischen Schlüssel aus einem Kennwort ableiten. Standardmäßig beträgt IterationCount von Rfc2898DeriveByte nur 1000.
es: Asegúrese de que el recuento de iteraciones es de al menos {0} al derivar una clave criptográfica de una contraseña. De forma predeterminada, el valor IterationCount de Rfc2898DeriveByte es solo 1000
fr: Vérifiez que le nombre d'itérations est au moins égal à {0} quand vous dérivez une clé de chiffrement à partir d'un mot de passe. Par défaut, le IterationCount de Rfc2898DeriveByte est seulement égal à 1 000
it: Assicurarsi che il numero delle iterazioni sia almeno {0} durante la derivazione di una chiave crittografica da una password. Per impostazione predefinita, il valore di IterationCount per Rfc2898DeriveByte è solo 1000
ja: パスワードから暗号化キーを派生させる場合は、反復回数が少なくとも {0} 回であることを確認してください。既定では、Rfc2898DeriveByte の IterationCount は 1000 のみです
ko: 암호에서 암호화 키를 파생할 때 {0} 이상의 반복 횟수를 사용하세요. 기본적으로 Rfc2898DeriveByte의 IterationCount는 1,000뿐입니다.
pl: Wyprowadzając klucz kryptograficzny z hasła, upewnij się, że liczba iteracji to co najmniej {0}. Domyślnie wartość IterationCount dla klasy Rfc2898DeriveByte to tylko 1000
pt_br: Verifique se a contagem de iteração é de pelo menos {0} ao derivar uma chave de criptografia de uma senha. Por padrão, a IterationCount de Rfc2898DeriveByte é de apenas 1000
ru: Убедитесь, что число итераций составляет не меньше {0} при формировании криптографического ключа из пароля. По умолчанию значение IterationCount для Rfc2898DeriveByte равно всего 1000
tr: Bir paroladan şifreleme anahtarı türetirken yineleme sayısının en az {0} olduğundan emin olun. Varsayılan olarak, Rfc2898DeriveByte'ın IterationCount değeri yalnızca 1000'dir
zh_hans: 基于密码派生加密密钥时，请确保迭代计数至少为 {0}。默认情况下，Rfc2898DeriveByte 的 IterationCount 仅为 1000
zh_hant: 當從密碼衍生密碼編譯金鑰時，請確保反覆項目計數至少為 {0}。根據預設，Rfc2898DeriveByte 的 IterationCount 只有 1000

# MembersDeclaredOnImplementationTypeMustBeStaticDescription
source: Since a type that implements 'IDynamicInterfaceCastable' may not implement a dynamic interface in metadata, calls to an instance interface member that is not an explicit implementation defined on this type are likely to fail at runtime. Mark new interface members 'static' to avoid runtime errors.
cs: Vzhledem k tomu, že typ, který implementuje rozhraní IDynamicInterfaceCastable, nesmí implementovat dynamické rozhraní v metadatech, volání člena rozhraní instance, který není explicitní implementací definovanou pro tento typ, pravděpodobně selžou za běhu. Označte nové členy rozhraní static, abyste se vyhnuli chybám modulu runtime.
de: Da ein Typ, der "IDynamicInterfaceCastable" implementiert, möglicherweise keine dynamische Schnittstelle in Metadaten implementiert, treten bei Aufrufen eines Instanzschnittstellenmembers, der keine explizite, für diesen Typ definierte Implementierung ist, zur Laufzeit wahrscheinlich Fehler auf. Markieren Sie neue Schnittstellenmember als "static", um Laufzeitfehler zu vermeiden.
es: Dado que un tipo que implementa 'IDynamicInterfaceCastable' no puede implementar una interfaz dinámica en metadatos, es probable que las llamadas a un miembro de interfaz de instancia que no sea una implementación explícita definida en este tipo generen errores en tiempo de ejecución. Marque los nuevos miembros de interfaz como "estáticos" para evitar errores en tiempo de ejecución.
fr: Dans la mesure où un type qui implémente ’IDynamicInterfaceCastable’ ne peut pas implémenter une interface dynamique dans les métadonnées, les appels à un membre d’interface d’instance qui n’est pas une implémentation explicite définie sur ce type risquent d’échouer au moment de l’exécution. Marquez les nouveaux membres de l’interface comme étant statiques pour éviter les erreurs d’exécution.
it: Dal momento che un tipo che implementa 'IDynamicInterfaceCastable' non può implementare un'interfaccia dinamica nei metadati, le chiamate a un membro di interfaccia di istanza che non è un'implementazione esplicita definita in questo tipo potrebbero non riuscire in fase di esecuzione. Contrassegnare i membri della nuova interfaccia come 'static' per evitare errori di runtime.
ja: 'IDynamicInterfaceCastable' を実装する型はメタデータに動的インターフェイスを実装できない可能性があるため、この型で定義されている明示的な実装ではないインスタンス インターフェイス メンバーの呼び出しはランタイムで失敗する可能性があります。ランタイム エラーを回避するために、新しいインターフェイス メンバーを 'static' としてマークします。
ko: 'IDynamicInterfaceCastable'을 구현하는 형식은 메타데이터에서 동적 인터페이스를 구현하지 않을 수 있으므로 이 형식에 정의된 명시적 구현이 아닌 인스턴스 인터페이스 멤버에 대한 호출은 런타임에 실패할 가능성이 높습니다. 런타임 오류를 방지하려면 새 인터페이스 멤버를 '정적'으로 표시하세요.
pl: Ponieważ typ implementujący interfejs „IDynamicInterfaceCastable” może nie implementować interfejsu dynamicznego w metadanych, wywołania do składowej interfejsu wystąpienia, który nie jest jawną implementacją zdefiniowaną w tym typie, mogą zakończyć się niepowodzeniem w czasie wykonywania. Oznacz nowe składowe interfejsu jako „statyczne”, aby uniknąć błędów środowiska uruchomieniowego.
pt_br: Como um tipo que implementa 'IDynamicInterfaceCastable' pode não implementar uma interface dinâmica em metadados, as chamadas para um membro da interface de instância que não é uma implementação explícita definida nesse tipo provavelmente falharão em runtime. Marque os novos membros da interface como "estáticos" para evitar erros de runtime.
ru: Так как тип, реализующий "IDynamicInterfaceCastable", не может реализовать динамический интерфейс в метаданных, вызовы для элемента интерфейса экземпляра, которые не являются явной реализацией, определенной для этого типа, вероятно, завершатся сбоем во время выполнения. Помечайте новые элементы интерфейса как "static", чтобы избежать ошибок времени выполнения.
tr: 'IDynamicInterfaceCastable' uygulayan bir tür meta verilerde dinamik arabirim uygulamayabileceği için, bu tür üzerinde tanımlı açık bir uygulama olmayan bir örnek arabirim üyesine yapılan çağrılar, çalışma zamanında başarısız olabilir. Çalışma zamanı hatalarını önlemek için yeni arabirim üyelerini 'static' olarak işaretleyin.
zh_hans: 由于实现 “IDynamicInterfaceCastable” 的类型可能不会在元数据中实现动态接口，因此对不是针对此类型定义的显式实现的实例接口成员的调用可能会在运行时失败。请将新的接口成员标记为 “static” 以避免运行时错误。
zh_hant: 因為實作 'IDynamicInterfaceCastable' 的類型不會在中繼資料中實作動態介面，所以呼叫在此類型不是明確實作的執行個體介面成員，在執行階段可能會失敗。請標示新的介面成員 'static' 以避免執行階段錯誤。
