Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CallGCSuppressFinalizeCorrectlyMessageNotPassedThis
source: {0} calls {1} on something other than itself. Change the call site to pass 'this' ('Me' in Visual Basic) instead.
cs: {0} volá {1} na něco jiného než sebe. Změňte lokalitu volání tak, aby místo toho předávala this (Me ve Visual Basicu).
de: "{0}" ruft "{1}" für etwas anderes als sich selbst auf. Ändern Sie die Aufrufsite so, dass stattdessen "this" ("Me" in Visual Basic) übergeben wird.
es: {0} llama a {1} sobre algo diferente de sí mismo. Cambie el sitio de llamada para que pase "this" ("Me" en Visual Basic).
fr: {0} appelle {1} sur autre chose que lui -même. Changez le site d'appel pour passer 'this' ('Me' en Visual Basic) à la place.
it: {0} chiama {1} su un elemento diverso da se stesso. Modificare il sito di chiamata in modo da passare 'this' ('Me' in Visual Basic).
ja: {0} が、それ以外に対して {1} を呼び出します。呼び出しサイトを変更して、'this' (Visual Basic では 'Me') を渡します。
ko: {0}이(가) 자기 자신이 아닌 다른 개체에서 {1}을(를) 호출합니다. 대신 호출 사이트를 변경하여 'this'(Visual Basic의 경우 'Me')를 전달하세요.
pl: Obiekt {0} wywołuje metodę {1} dla obiektu innego niż on sam. Zmień wywołanie, tak aby zamiast tego był przekazywany obiekt „this” („Me” w języku Visual Basic).
pt_br: {0} chama {1} em algo diferente dele mesmo. Altere o local da chamada para passar 'this' em vez disso ('Me' no Visual Basic).
ru: {0} вызывает {1} для другого объекта, а не для себя. Измените место вызова, чтобы передать вместо него "this" ("Me" в Visual Basic).
tr: {0}, kendi dışında bir şey üzerinde {1} çağrısı yapıyor. Çağrı konumunu bunun yerine 'this' (Visual Basic’te 'Me') geçirecek şekilde değiştirin.
zh_hans: {0} 对除自身以外的其他对象调用 {1}。请更改调用站点，改而传递 "this" (在 Visual Basic 中为 "Me")。
zh_hant: {0} 於本身以外的其他項目上呼叫了 {1}。變更呼叫位置以傳遞 'this' (在 Visual Basic 中為 'Me')。

# CallGCSuppressFinalizeCorrectlyMessageOutsideDispose
source: {0} calls {1}, a method that is typically only called within an implementation of 'IDisposable.Dispose'. Refer to the IDisposable pattern for more information.
cs: {0} volá {1}, což je metoda, která se obvykle volá jen v implementaci metody IDisposable.Dispose. Další informace najdete ve vzoru IDisposable.
de: "{0}" ruft "{1}" auf, eine Methode, die normalerweise nur innerhalb einer Implementierung von "IDisposable.Dispose" aufgerufen wird. Weitere Informationen finden Sie im IDisposable-Muster.
es: {0} llama a {1}, un método al que normalmente solo se llama en una implementación de "IDisposable.Dispose". Consulte el modelo de IDisposable para obtener más información.
fr: {0} appelle {1}, une méthode qui est généralement appelée uniquement dans une implémentation de 'IDisposable.Dispose'. Consultez le modèle IDisposable pour plus d'informations.
it: {0} chiama {1}, un metodo chiamato in genere all'interno di un'implementazione di 'IDisposable.Dispose'. Per altre informazioni, fare riferimento al criterio IDisposable.
ja: {0} は、通常 'IDisposable.Dispose' の実装内でのみ呼び出されるメソッド {1} を呼び出しています。詳細については、IDisposable パターンを参照してください。
ko: {0}이(가) 일반적으로 'IDisposable.Dispose'의 구현 내에서만 호출되는 메서드인 {1}을(를) 호출합니다. 자세한 내용은 IDisposable 패턴을 참조하세요.
pl: Metoda {0} wywołuje metodę {1}, która zazwyczaj jest wywoływana tylko w ramach implementacji metody „IDisposable.Dispose”. Więcej informacji zawiera opis wzorca IDisposable.
pt_br: {0} chama {1}, um método que geralmente só é chamado de dentro de uma implementação de 'IDisposable.Dispose'. Consulte o padrão IDisposable para obter mais informações.
ru: {0} вызывает {1}, метод, который обычно вызывается только внутри реализации "IDisposable.Dispose". Дополнительные сведения см. в шаблоне IDisposable.
tr: {0}, genellikle yalnızca bir 'IDisposable.Dispose' uygulamasının içinden çağrılan bir yöntem olan {1} öğesine çağrı yapıyor. Daha fazla bilgi edinmek için IDisposable desenine başvurun.
zh_hans: {0} 调用 {1}，该方法通常只在 "IDisposable.Dispose" 实现内部调用。有关详细信息，请参见 IDisposable 模式。
zh_hant: {0} 呼叫了 {1}，但此方法通常只在 'IDisposable.Dispose' 的實作內呼叫。如需詳細資訊，請參閱 IDisposable 模式。

# CallGCSuppressFinalizeCorrectlyTitle
source: Dispose methods should call SuppressFinalize
cs: Metody Dispose by měly volat SuppressFinalize
de: Dispose-Methoden müssen SuppressFinalize aufrufen
es: Los métodos Dispose deberían llamar a SuppressFinalize
fr: Les méthodes Dispose doivent appeler SuppressFinalize
it: I metodi Dispose devono chiamare SuppressFinalize
ja: Dispose メソッドは、SuppressFinalize を呼び出す必要があります
ko: Dispose 메서드는 SuppressFinalize를 호출해야 합니다.
pl: Metoda Dispose powinna wywoływać metodę SuppressFinalize
pt_br: Os métodos Dispose devem chamar SuppressFinalize
ru: Методы Dispose должны вызывать SuppressFinalize
tr: Dispose yöntemleri tarafından SuppressFinalize çağrılmalıdır
zh_hans: Dispose 方法应调用 SuppressFinalize
zh_hant: Dispose 方法應該呼叫 SuppressFinalize

# ConstantExpectedApplicationDescription
source: ConstantExpected attribute is not applied correctly on the parameter.
cs: Atribut ConstantExpected není u parametru použit správně.
de: Das ConstantExpected-Attribut wird nicht ordnungsgemäß auf den Parameter angewendet.
es: El atributo ConstantExpected no se aplica correctamente en el parámetro.
fr: L’attribut ConstantExpected n’est pas appliqué correctement au paramètre.
it: Attributo ConstantExpected non applicato correttamente al parametro.
ja: ConstantExpected 属性がパラメーターに正しく適用されていません。
ko: ConstantExpected 특성이 매개 변수에 올바르게 적용되지 않았습니다.
pl: Atrybut ConstantExpected nie jest poprawnie stosowany do parametru.
pt_br: O atributo ConstantExpected não está aplicado corretamente no parâmetro.
ru: Атрибут ConstantExpected неправильно применен к параметру.
tr: ConstantExpected özniteliği parametreye doğru olarak uygulanmadı.
zh_hans: ConstantExpected 属性未正确应用于参数。
zh_hant: 未在參數上正確套用 ConstantExpected 屬性。

# ConstantExpectedApplicationTitle
source: Incorrect usage of ConstantExpected attribute
cs: Nesprávné použití atributu ConstantExpected
de: Falsche Verwendung des ConstantExpected-Attributs
es: Uso incorrecto del atributo ConstantExpected
fr: Utilisation incorrecte de l’attribut ConstantExpected
it: Utilizzo non corretto dell'attributo ConstantExpected
ja: ConstantExpected 属性の使用法が正しくありません
ko: ConstantExpected 특성의 사용이 잘못되었습니다.
pl: Nieprawidłowe użycie atrybutu ConstantExpected
pt_br: Uso incorreto do atributo ConstantExpected
ru: Неправильное использование атрибута ConstantExpected
tr: ConstantExpected özniteliğinin yanlış kullanımı
zh_hans: ConstantExpected 属性的用法不正确
zh_hant: ConstantExpected 屬性的用法不正確

# ConstantExpectedAttributExpectedMessage
source: The ConstantExpected attribute is required for the parameter due to the parent method annotation
cs: Atribut ConstantExpected je pro parametr vyžadován z důvodu poznámky nadřazené metody.
de: Das ConstantExpected-Attribut ist für den Parameter aufgrund der Anmerkung der übergeordneten Methode erforderlich.
es: El atributo ConstantExpected es necesario para el parámetro debido a la anotación del método primario
fr: L’attribut ConstantExpected est requis pour le paramètre en raison de l’annotation de méthode parente
it: L'attributo ConstantExpected è obbligatorio per il parametro a causa dell'annotazione del metodo padre
ja: 親メソッドの注釈により、パラメーターには ConstantExpected 属性が必要です
ko: 부모 메서드 주석으로 인해 매개 변수에 ConstantExpected 특성이 필요합니다.
pl: Atrybut ConstantExpected jest wymagany dla parametru z powodu adnotacji metody nadrzędnej
pt_br: O atributo ConstantExpected é necessário para o parâmetro devido à anotação do método pai
ru: Атрибут ConstantExpected является обязательным для параметра из-за заметки родительского метода
tr: Üst yöntem ek açıklaması nedeniyle parametre için ConstantExpected özniteliği gereklidir
zh_hans: 由于父方法批注，参数需要 ConstantExpected 属性
zh_hant: 由於父方法註釋，參數需要 ConstantExpected 屬性

# ConstantExpectedIncompatibleConstantTypeMessage
source: The '{0}' value is not compatible with parameter type of '{1}'
cs: Hodnota {0} není kompatibilní s typem parametru {1}.
de: Der Wert "{0}" ist nicht mit dem Parametertyp "{1}" kompatibel.
es: El valor '{0}' no es compatible con el tipo de parámetro de '{1}'
fr: La valeur « {0} » n’est pas compatible avec le type de paramètre « {1} »
it: Il valore '{0}' non è compatibile con il tipo di parametro di '{1}'
ja: '{0}' 値は、'{1}' のパラメーターの型と互換性がありません
ko: '{0}' 값이 '{1}' 매개 변수 형식과 호환되지 않습니다.
pl: Wartość „{0}” jest niezgodna z typem parametru „{1}”
pt_br: O valor '{0}' não é compatível com o tipo de parâmetro de '{1}'
ru: Значение "{0}" несовместимо с типом параметра "{1}"
tr: '{0}' değeri '{1}' parametre türüyle uyumlu değil
zh_hans: "{0}" 值与 "{1}" 的参数类型不兼容
zh_hant: '{0}' 值與 '{1}' 的參數類型不相容

# ConstantExpectedInvalidBoundsMessage
source: The '{0}' value does not fit within the parameter value bounds of '{1}' to '{2}'
cs: Hodnota {0} se nevejde do mezí hodnot parametru od {1} do {2}.
de: Der Wert "{0}" passt nicht in die Parameterwertgrenzen von "{1}" bis "{2}".
es: El valor '{0}' no cabe dentro de los límites de valor de parámetro de '{1}' a '{2}'
fr: La valeur « {0} » ne tient pas dans les limites de valeur de paramètre de « {1} » à « {2} »
it: Il valore '{0}' non rientra nei limiti del valore del parametro di '{1}' per '{2}'
ja: '{0}' の値が '{1}' から '{2}' までのパラメーター値の範囲内に収まりません
ko: '{0}' 값이 '{1}'에서 '{2}'까지 매개 변수 값 범위 내에 맞지 않습니다.
pl: Wartość „{0}” nie mieści się w granicach wartości parametru od „{1}” do „{2}”
pt_br: O valor '{0}' não cabe dentro dos limites do valor do parâmetro de '{1}' para '{2}'
ru: Значение "{0}" не соответствует границам значения параметра от "{1}" до "{2}"
tr: '{0}' değeri, '{2}' için '{1}' parametre değeri sınırlarına uymuyor
zh_hans: "{0}" 值不符合 "{1}" 到 "{2}" 的参数值界限
zh_hant: '{0}' 值不符合 '{1}' 到 '{2}' 的參數值範圍

# ConstantExpectedInvalidMessage
source: The constant is not of the same '{0}' type as the parameter
cs: Konstanta nemá stejný typ {0} jako parametr.
de: Die Konstante weist nicht denselben Typ "{0}" wie der Parameter auf.
es: La constante no es del mismo tipo '{0}' que el parámetro
fr: La constante n’est pas du même type « {0} » que le paramètre
it: La costante non è dello stesso tipo '{0}' del parametro
ja: 定数の '{0}' 型がパラメーターと同じではありません
ko: 상수가 매개 변수와 동일한 '{0}' 형식이 아닙니다.
pl: Stała nie jest tego samego typu „{0}” co parametr
pt_br: A constante não é do mesmo tipo '{0}' do parâmetro
ru: Константа отличается от типа "{0}" параметра
tr: Sabit, parametreyle aynı '{0}' türünde değil
zh_hans: 常量与参数的 "{0}" 类型不同
zh_hant: 常數不是與參數相同的 '{0}' 類型

# ConstantExpectedInvertedRangeMessage
source: The Min and Max values are inverted
cs: Hodnoty Min a Max jsou obrácené.
de: Die Werte "Min" und "Max" werden invertiert.
es: Los valores Mínimo y Máximo están invertidos
fr: Les valeurs Min et Max sont inversées
it: I valori minimo e massimo sono invertiti
ja: 最小値と最大値が反転されます
ko: 최소 및 최대값이 반전됩니다.
pl: Wartości Min i Max są odwrócone
pt_br: Os valores Min e Max são invertidos
ru: Минимальное и максимальное значения инвертированы
tr: Min ve Max değerleri ters çevrilmiş
zh_hans: 已反转最小值和最大值
zh_hant: 最小值和最大值會反轉

# ConstantExpectedNotConstantMessage
source: The argument should be a constant for optimal performance
cs: Aby parametr fungoval optimálně, měl by být konstantou.
de: Das Argument sollte eine Konstante sein, um eine optimale Leistung zu erzielen.
es: El argumento debe ser una constante para obtener un rendimiento óptimo
fr: L’argument doit être une constante pour des performances optimales
it: L'argomento deve essere una costante per prestazioni ottimali
ja: 最適なパフォーマンスを得るには、引数を定数にする必要があります
ko: 최적의 성능을 위해 인수는 상수여야 합니다.
pl: Argument powinien być stałą w celu uzyskania optymalnej wydajności
pt_br: O argumento deve ser uma constante para desempenho ideal
ru: Аргумент должен быть константой для оптимальной производительности
tr: En iyi performans için bağımsız değişken sabit olmalıdır
zh_hans: 参数应是一个常量，以获得最佳性能
zh_hant: 引數應為常數，以獲得最佳效能

# ConstantExpectedNotSupportedMessage
source: The '{0}' type is not supported for ConstantExpected attribute
cs: Typ {0} není pro atribut ConstantExpected podporován.
de: Der Typ "{0}" wird für das ConstantExpected-Attribut nicht unterstützt.
es: No se admite el tipo '{0}' para el atributo ConstantExpected
fr: Le type « {0} » n’est pas pris en charge pour l’attribut ConstantExpected
it: Il tipo di '{0}' non è supportato per l'attributo ConstantExpected
ja: '{0}' 型は ConstantExpected 属性ではサポートされていません
ko: ConstantExpected 특성에는 '{0}' 형식이 지원되지 않습니다.
pl: Typ „{0}” nie jest obsługiwany dla atrybutu ConstantExpected
pt_br: O tipo '{0}' não é suportado para o atributo ConstantExpected
ru: Тип "{0}" не поддерживается для атрибута ConstantExpected
tr: '{0}' türü ConstantExpected özniteliği için desteklenmiyor
zh_hans: ConstantExpected 特性不支持 "{0}" 类型
zh_hant: ConstantExpected 屬性不支援 '{0}' 類型

# ConstantExpectedOutOfBoundsMessage
source: The constant does not fit within the value bounds of '{0}' to '{1}'
cs: Konstanta se nevejde do mezí hodnot od {0} do {1}.
de: Die Konstante passt nicht in die Wertebegrenzungen von "{0}" bis "{1}".
es: La constante no cabe dentro de los límites de valor de '{0}' a '{1}'
fr: La constante ne tient pas dans les limites de valeur de « {0} » à « {1} »
it: La costante non rientra nei limiti dei valori di '{0}' a '{1}'
ja: 定数は '{0}' から '{1}' までの値の範囲内に収まりません
ko: 상수가 '{0}'에서 '{1}'까지 값 범위 내에 맞지 않습니다.
pl: Stała nie mieści się w granicach wartości od „{0}” do „{1}”
pt_br: A constante não cabe dentro dos limites de valor de '{0}' para '{1}'
ru: Константа не соответствует границам значений от "{0}" до "{1}"
tr: Sabit, '{1}' için '{0}' değer sınırlarına uymuyor
zh_hans: 该常量不适合 "{0}" 到 "{1}" 的值边界内
zh_hant: 常數不符合 '{0}' 到 '{1}' 的值範圍

# ConstantExpectedUsageDescription
source: The parameter expects a constant for optimal performance.
cs: Aby parametr fungoval optimálně, očekává konstantu.
de: Der Parameter erwartet eine Konstante, um eine optimale Leistung zu erzielen.
es: El parámetro espera una constante para un rendimiento óptimo.
fr: Le paramètre attend une constante pour des performances optimales.
it: Il parametro prevede una costante per prestazioni ottimali.
ja: パラメーターには、最適なパフォーマンスを得るための定数が必要です。
ko: 매개 변수에는 최적의 성능을 위해 상수가 필요합니다.
pl: Parametr oczekuje stałej w celu uzyskania optymalnej wydajności.
pt_br: O parâmetro espera uma constante para desempenho ideal.
ru: Параметр ожидает константу для оптимальной производительности.
tr: Parametre, en iyi performans için bir sabit bekliyor.
zh_hans: 该参数需要一个常量来获得最佳性能。
zh_hant: 參數需要常數，以獲得最佳效能。

# ConstantExpectedUsageTitle
source: A constant is expected for the parameter
cs: Pro parametr se očekává konstanta.
de: Für den Parameter wird eine Konstante erwartet.
es: Se espera una constante para el parámetro
fr: Une constante est attendue pour le paramètre
it: È prevista una costante per il parametro
ja: パラメーターには定数が必要です
ko: 매개 변수에 상수가 필요합니다.
pl: Oczekiwano stałej dla parametru
pt_br: Espera-se uma constante para o parâmetro
ru: Для параметра ожидается константа
tr: Parametre için bir sabit bekleniyor
zh_hans: 参数需要常量
zh_hant: 預期參數為常數

# DataSetDataTableInDeserializableObjectGraphMessage
source: When deserializing untrusted input, deserializing a {0} object is insecure. '{1}' either is or derives from {0}
cs: Při deserializaci nedůvěryhodného vstupu není deserializace objektu {0} bezpečná. Objekt {1} je buď objektem {0}, nebo je z tohoto objektu odvozený.
de: Beim Deserialisieren einer nicht vertrauenswürdigen Eingabe ist die Deserialisierung eines {0}-Objekts unsicher. "{1}" ist entweder "{0}" oder davon abgeleitet.
es: Cuando se deserializa una entrada que no es de confianza, no es segura la deserialización de un objeto {0}. "{1}" es {0} o se deriva de este.
fr: Quand vous désérialisez une entrée non fiable, la désérialisation d'un objet {0} n'est pas une action sécurisée. '{1}' est égal à ou dérive de {0}
it: Quando si deserializza input non attendibile, la deserializzazione di un oggetto {0} non è sicura. '{1}' è {0} o deriva da esso
ja: 信頼されていない入力を逆シリアル化する場合、{0} オブジェクトの逆シリアル化は安全ではありません。'{1}' は {0} であるか、それから派生しています
ko: 신뢰할 수 없는 입력을 역직렬화하는 경우 {0} 개체를 역직렬화하는 것은 안전하지 않습니다. '{1}'은(는) {0}이거나 이 항목에서 파생됩니다.
pl: Deserializowanie obiektu {0} podczas deserializacji niezaufanych danych wejściowych nie jest bezpieczne. Element „{1}” jest elementem {0} lub pochodzi od niego
pt_br: Ao desserializar uma entrada não confiável, a desserialização de um objeto {0} não é segura. '{1}' é {0} ou deriva-se dele
ru: При десериализации недоверенных входных данных десериализация объекта {0} является небезопасной. Объект "{1}" является объектом {0} или производным от него объектом.
tr: Güvenilmeyen giriş seri durumdan çıkarılırken, {0} nesnesinin seri durumdan çıkarılması güvenli değildir. '{1}', {0} nesnesidir veya bu nesneden türetilmiştir
zh_hans: 对不受信任的输入进行反序列化处理时，反序列化 {0} 对象是不安全的。“{1}”是或派生自 {0}
zh_hant: 還原序列化不受信任的輸入時，將 {0} 物件還原序列化並不安全。'{1}' 屬於或衍生自 {0}

# DataSetDataTableInDeserializableObjectGraphTitle
source: Unsafe DataSet or DataTable type found in deserializable object graph
cs: V grafu deserializovatelných objektů se našel nebezpečný typ DataSet nebo DataTable
de: Unsicherer DataSet- oder DataTable-Typ in deserialisiertem Objektgraph gefunden
es: Se encontró un tipo DataSet o DataTable no seguro en el gráfico de objetos deserializable
fr: Type DataSet ou DataTable non sécurisé trouvé dans le graphe d'objets désérialisable
it: Nel grafico di oggetti deserializzabile è stato trovato il tipo DataSet o DataTable non sicuro
ja: 逆シリアル化可能なオブジェクト グラフに、安全でない DataSet または DataTable 型が見つかりました
ko: 역직렬화 가능한 개체 그래프에서 안전하지 않은 DataSet 또는 DataTable 형식을 찾음
pl: W wykresie obiektu, który można deserializować, znaleziono niebezpieczny typ DataSet lub DataTable
pt_br: O tipo DataSet ou DataTable não seguro foi encontrado em um grafo de objetos desserializável
ru: На графе десериализуемого объекта обнаружен небезопасный тип набора данных или таблицы данных
tr: Seri durumdan çıkarılabilir nesne grafında güvenli olmayan DataSet veya DataTable türü bulundu
zh_hans: 在可反序列化的对象图中找到不安全的数据集或数据表类型
zh_hant: 在可還原序列化的物件圖形中，找到不安全的 DataSet 或 DataTable 類型

# DataSetDataTableInRceAutogeneratedSerializableTypeMessage
source: When deserializing untrusted input with an IFormatter-based serializer, deserializing a {0} object is insecure. '{1}' either is or derives from {0}. Ensure that the auto-generated type is never deserialized with untrusted data.
cs: Při deserializaci nedůvěryhodného vstupu pomocí serializátoru založeného na rozhraní IFormatter není deserializace objektu {0} bezpečná. Objekt {1} je buď objektem {0}, nebo je z tohoto objektu odvozený. Zajistěte, aby automaticky generovaný typ nikdy nebyl deserializovaný s nedůvěryhodnými daty.
de: Beim Deserialisieren einer nicht vertrauenswürdigen Eingabe mit einem IFormatter-basierten Serialisierungsmodul ist die Deserialisierung eines {0}-Objekts unsicher. "{1}" ist entweder "{0}" oder wird davon abgeleitet. Stellen Sie sicher, dass der automatisch generierte Typ ausschließlich mit vertrauenswürdigen Daten deserialisiert wird.
es: Cuando se deserializa una entrada que no es de confianza con un serializador basado en IFormatter, no es segura la deserialización de un objeto {0}. "{1}" es {0} o se deriva de este. Asegúrese de que el tipo autogenerado nunca se deserialice con datos que no son de confianza.
fr: Quand vous désérialisez une entrée non fiable avec un sérialiseur basé sur IFormatter, la désérialisation d'un objet {0} n'est pas une action sécurisée. '{1}' est égal à ou dérive de {0}. Vérifiez que le type généré automatiquement n'est jamais désérialisé avec des données non fiables.
it: Quando si deserializza input non attendibile con un serializzatore basato su IFormatter, la deserializzazione di un oggetto {0} non è sicura. '{1}' è {0} o deriva da esso. Assicurarsi che il tipo generato automaticamente non venga mai deserializzato con dati non attendibili.
ja: IFormatter ベースのシリアライザーを使用して信頼されていない入力を逆シリアル化する場合、{0} オブジェクトの逆シリアル化は安全ではありません。'{1}' は {0} であるか、それから派生しています。自動生成型が、信頼されていないデータで逆シリアル化されないようにしてください。
ko: IFormatter 기반 직렬 변환기를 사용하여 신뢰할 수 없는 입력을 역직렬화하는 경우 {0} 개체를 역직렬화하는 것은 안전하지 않습니다. '{1}'은(는) {0}이거나 이 항목에서 파생됩니다. 자동 생성된 형식이 신뢰할 수 없는 데이터로 역직렬화되지 않도록 하세요.
pl: Deserializowanie obiektu {0} podczas deserializacji niezaufanych danych wejściowych za pomocą serializatora opartego na elemencie IFormatter nie jest bezpieczne. Element „{1}” jest elementem {0} lub pochodzi od niego. Upewnij się, że automatycznie wygenerowany typ nie jest nigdy deserializowany za pomocą niezaufanych danych.
pt_br: Durante a desserialização de uma entrada não confiável com um serializador baseado em IFormatter, não é seguro desseriliarizar um objeto {0}. '{1}' é um objeto {0} ou deriva-se dele. Garanta que o tipo gerado automaticamente nunca seja desserializado usando dados não confiáveis.
ru: При десериализации недоверенных входных данных с помощью сериализатора на основе IFormatter десериализация объекта {0} является небезопасной. Объект "{1}" является объектом {0} или производным от него объектом. Убедитесь, что автоматически создаваемые типы не десериализуются с недоверенными данными.
tr: IFormatter tabanlı seri hale getirici ile güvenilmeyen giriş seri durumdan çıkarılırken, {0} nesnesinin seri durumdan çıkarılması güvenli değildir. '{1}', bir {0} nesnesidir veya bu nesneden türetilmiştir. Otomatik olarak oluşturulan türün hiçbir zaman güvenilmeyen verilerle seri durumdan çıkarılmadığından emin olun.
zh_hans: 在使用基于 IFormatter 的序列化程序对不受信任的输入进行反序列化处理时，反序列化 {0} 对象是不安全的。“{1}”是或派生自 {0}。请确保自动生成的类型绝不使用不受信任的数据进行反序列化。
zh_hant: 以 IFormatter 形式的序列化程式，還原序列化不受信任的輸入時，還原序列化 {0} 物件並不安全。'{1}' 屬於或衍生自 {0}。請確認自動產生的類型一律不會還原序列化不受信任的資料。

# DataSetDataTableInRceAutogeneratedSerializableTypeTitle
source: Unsafe DataSet or DataTable in auto-generated serializable type can be vulnerable to remote code execution attacks
cs: Nebezpečné DataSet nebo DataTable v automaticky generovaném serializovatelném typu můžou být ohrožené útoky spuštěním vzdáleného kódu
de: Ein unsicheres DataSet- oder DataTable-Element in einem automatisch generierten, serialisierbaren Typ kann für Angriffe durch Remotecodeausführung anfällig sein
es: Un elemento DataSet o DataTable no seguro en un tipo serializable autogenerado puede ser vulnerable a ataques de ejecución remota de código
fr: Un DataSet ou DataTable non sécurisé dans un type sérialisable généré automatiquement peut être vulnérable aux attaques par exécution de code à distance
it: L'oggetto DataSet o DataTable non sicuro nel tipo serializzabile generato automaticamente può essere vulnerabile ad attacchi di tipo esecuzione di codice remoto
ja: シリアル化可能な自動生成型に含まれる安全でない DataSet または DataTable は、リモート コード実行攻撃に対して脆弱になる可能性があります
ko: 자동 생성된 직렬화 가능한 형식의 안전하지 않은 DataSet 또는 DataTable은 원격 코드 실행 공격에 취약할 수 있음
pl: Niebezpieczny element DataSet lub DataTable w automatycznie wygenerowanym typie, który można serializować, może być podatny na zagrożenia polegające na zdalnym wykonaniu kodu
pt_br: Um DataSet ou uma DataTable não segura em um tipo serializável gerado automaticamente pode ser vulnerável a ataques de execução remota de código
ru: Небезопасный набор данных или небезопасная таблица данных в автоматически создаваемом сериализуемом типе могут быть подвержены атакам методом удаленного выполнения кода
tr: Otomatik oluşturulmuş seri hale getirilebilir türdeki güvenli olmayan DataSet veya DataTable, uzaktan kod yürütme saldırılarına karşı savunmasız olabilir
zh_hans: 自动生成的可序列化类型中不安全的数据集或数据表易受远程代码执行攻击
zh_hant: 自動產生的可序列化類型中，出現的不安全 DataSet 或 DataTable，容易受到遠端程式碼執行攻擊
