Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# JsonNetTypeNameHandlingMessage
source: Deserializing JSON when using a TypeNameHandling value other than None can be insecure.
cs: Deserializace JSON při použití hodnoty TypeNameHandling jiné než None nemůže být nebezpečné.
de: Die Deserialisierung von JSON bei Verwendung eines anderen TypeNameHandling-Werts als "None" kann unsicher sein.
es: La deserialización de JSON cuando se usa un valor TypeNameHandling distinto de None puede no ser segura.
fr: Si vous désérialisez JSON quand vous utilisez une autre valeur que None pour TypeNameHandling, cela peut présenter un risque de sécurité.
it: La deserializzazione di JSON quando si usa un valore TypeNameHandling diverso da None può essere insicura.
ja: None 以外の TypeNameHandling 値を使用する場合の JSON の逆シリアル化は、安全でない可能性があります。
ko: None 이외의 TypeNameHandling 값을 사용하는 경우 JSON deserialize가 안전하지 않을 수 있습니다.
pl: Deserializacja danych JSON, gdy używana jest wartość TypeNameHandling inna niż None, może być niebezpieczna.
pt_br: A desserialização do JSON ao usar um valor TypeNameHandling diferente de None pode não ser segura.
ru: Десериализация JSON при использовании значения TypeNameHandling, отличного от "None", может быть небезопасной.
tr: None dışında bir TypeNameHandling değeri kullanılırken JSON'nin seri durumundan çıkarılması güvenli olmayabilir.
zh_hans: 使用“无”以外的 TypeNameHandling 值时，进行 JSON 反序列化可能不安全。
zh_hant: 使用非 None 的 TypeNameHandling 值時，將 JSON 還原序列化可能不安全。

# JsonNetTypeNameHandlingTitle
source: Do not use TypeNameHandling values other than None
cs: Nepoužívat jiné hodnoty TypeNameHandling než None
de: Verwenden Sie keinen anderen TypeNameHandling-Wert als "None".
es: No usar valores TypeNameHandling distintos de None
fr: N'utilisez pas d'autre valeur que None pour TypeNameHandling
it: Non usare valori di TypeNameHandling diversi da None
ja: None 以外の TypeNameHandling 値を使用しないでください
ko: None 이외의 TypeNameHandling 값을 사용하지 마세요.
pl: Nie używaj wartości TypeNameHandling innych niż None
pt_br: Não use valores TypeNameHandling diferentes de None
ru: Не используйте значения TypeNameHandling, отличные от "None"
tr: None dışında bir TypeNameHandling değeri kullanmayın
zh_hans: 请勿使用“无”以外的 TypeNameHandling 值
zh_hant: 請勿使用非 None 的 TypeNameHandling 值

# LosFormatterMethodUsedMessage
source: The method '{0}' is insecure when deserializing untrusted data.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili.
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません。
ko: 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil.
zh_hans: 对不受信任的数据进行反序列化时，方法“{0}”不安全。
zh_hant: 將不受信任的資料還原序列化時，方法 '{0}' 不安全。

# LosFormatterMethodUsedTitle
source: Do not use insecure deserializer LosFormatter
cs: Nepoužívat nezabezpečený deserializátor LosFormatter
de: Nicht den unsicheren LosFormatter zur Deserialisierung verwenden
es: No usar el deserializador no seguro LosFormatter
fr: Ne pas utiliser le désérialiseur non sécurisé LosFormatter
it: Non usare il deserializzatore non sicuro LosFormatter
ja: 安全でないデシリアライザー LosFormatter を使用しない
ko: 안전하지 않은 역직렬 변환기 LosFormatter를 사용하지 마세요.
pl: Nie używaj niezabezpieczonego deserializatora LosFormatter
pt_br: Não use o desserializador LosFormatter não seguro
ru: Не используйте небезопасный десериализатор LosFormatter
tr: Güvenli olmayan seri kaldırıcı LosFormatter kullanmayın
zh_hans: 请勿使用不安全的反序列化程序 LosFormatter
zh_hant: 請勿使用不安全的還原序列化程式 LosFormatter

# MakeMethodDeclaredOnImplementationTypeStatic
source: Convert to static method
cs: Převést na statickou metodu
de: In statische Methode konvertieren
es: Convertir en método estático
fr: Convertir en méthode statique
it: Converti nel metodo statico
ja: 静的メソッドに変換する
ko: 정적 메서드로 변환
pl: Konwertuj na metodę statyczną
pt_br: Converta para o método estático
ru: Преобразовать в статический метод
tr: Statik yönteme dönüştür
zh_hans: 转换为静态方法
zh_hant: 轉換成靜態方法

# MakeMethodDeclaredOnImplementationTypeStaticMayProduceInvalidCode
source: Converting an instance method to a static method may produce invalid code
cs: Převod instanční metody na statickou metodu může způsobit neplatný kód.
de: Durch das Konvertieren einer Instanzmethode in eine statische Methode wird möglicherweise ungültiger Code generiert.
es: Convertir un método de instancia en un método estático puede producir código no válido
fr: La conversion d’une méthode d’instance en méthode statique risque de produire du code non valide
it: La conversione di un metodo di istanza in un metodo statico potrebbe produrre codice non valido
ja: インスタンス メソッドを静的メソッドに変換すると、無効なコードが生成される可能性があります
ko: 인스턴스 메서드를 정적 메서드로 변환하면 잘못된 코드가 생성될 수 있습니다.
pl: Konwertowanie metody wystąpienia na metodę statyczną może spowodować wygenerowanie nieprawidłowego kodu
pt_br: Converter um método de instância em um método estático pode produzir código inválido
ru: Преобразование метода экземпляра в статический метод может привести к недопустимому коду
tr: Örnek metodunu statik bir metoda dönüştürmek geçersiz kod üretebilir
zh_hans: 将实例方法转换为静态方法可能生成无效的代码
zh_hant: 將執行個體方法轉換為靜態方法可能會產生不正確的程式碼

# MakeParameterlessConstructorPublic
source: Make the constructor that takes zero parameters 'public'
cs: Nastavte konstruktor, který přijímá nulové parametry public.
de: Konstruktor ohne Parameter als "public" festlegen
es: Convertir el constructor que toma cero parámetros 'public'
fr: Rendre "public" le constructeur qui ne prend pas de paramètres
it: Impostare come 'public' il costruttore che accetta zero parametri
ja: 0 個のパラメーターを受け取るコンストラクターを 'public' にします
ko: 매개 변수가 0인 생성자를 '공개'로 설정
pl: Ustaw konstruktora publicznego, który przyjmuje zero parametrów jako „publiczny”
pt_br: Tornar o construtor que usa zero parâmetros 'public'
ru: Создать конструктор, принимающий нулевые параметры "public"
tr: Sıfır parametrelerini 'public' olarak alan bir oluşturucu oluşturun
zh_hans: 使采用零参数的构造函数成为 “public”
zh_hant: 將接受零個參數的建構函式設為 'public'

# MarkAllNonSerializableFieldsDescription
source: An instance field of a type that is not serializable is declared in a type that is serializable.
cs: Pole instance typu, který se nedá serializovat, je deklarované v typu, který se serializovat dá.
de: Ein Instanzfeld eines Typs, der nicht serialisierbar ist, wurde in einem Typ deklariert, der serialisierbar ist.
es: Un campo de instancia de un tipo que no es serializable se declara en un tipo que es serializable.
fr: Un champ d'instance d'un type non sérialisable est déclaré dans un type sérialisable.
it: Un campo di istanza di un tipo non serializzabile viene dichiarato in un tipo serializzabile.
ja: シリアル化可能ではない型のインスタンス フィールドが、シリアル化可能な型で宣言されています。
ko: 직렬화할 수 없는 형식의 인스턴스 필드는 직렬화할 수 있는 형식으로 선언됩니다.
pl: Wystąpienie pola typu, którego nie można serializować, jest zadeklarowane w typie, który można serializować.
pt_br: Um campo de instância de um tipo que não é serializável é declarado em um tipo que é serializável.
ru: Поле экземпляра типа, который не может быть сериализован, объявлено в типе, который может быть сериализован.
tr: Serileştirilebilir olmayan bir örnek alanı türü, serileştirilebilir bir türde bildirildi.
zh_hans: 不可序列化类型的实例字段在可序列化类型中声明。
zh_hant: 非可序列化類型的執行個體欄位，被宣告為可序列化的類型。

# MarkAllNonSerializableFieldsMessage
source: Field {0} is a member of type {1} which is serializable but is of type {2} which is not serializable
cs: Pole {0} je členem typu {1}, který je serializovatelný, ale je typu {2}, který serializovatelný není.
de: Das Feld "{0}" ist ein Member des Typs "{1}", der serialisierbar ist. Das Feld selbst weist jedoch Typ "{2}" auf, der nicht serialisierbar ist.
es: El campo {0} es un miembro de tipo {1}, que es serializable, pero es de tipo {2}, que no es serializable.
fr: Le champ {0} est membre du type {1}, qui est sérialisable, mais son type est {2}, lequel n'est pas sérialisable
it: Il campo {0} è un membro di tipo {1}, che è serializzabile, ma è di tipo {2}, che non è serializzabile
ja: フィールド {0} はシリアル化可能な型 {1} のメンバーですが、そのフィールド自体はシリアル化可能ではない型 {2} です
ko: {0} 필드는 직렬화할 수 있는 {1} 형식의 멤버이지만 직렬화할 수 없는 {2} 형식입니다.
pl: Pole {0} jest składową typu {1}, który można serializować, ale jest typu {2}, którego nie można serializować
pt_br: O campo {0} é membro do tipo {1}, que é serializável, mas é do tipo {2}, que não é serializável
ru: Поле {0} является членом сериализуемого типа {1}, но имеет несериализуемый тип {2}.
tr: {0} alanı serileştirilebilir {1} türünün bir üyesidir, ancak serileştirilebilir olmayan {2} türündendir
zh_hans: 字段 {0} 是可序列化类型 {1} 的成员，但该字段是不可序列化的类型 {2}。
zh_hant: 欄位 {0} 是可序列化類型 {1} 的成員，但其所屬類型 {2} 則不可序列化

# MarkAllNonSerializableFieldsTitle
source: Mark all non-serializable fields
cs: Označte všechny neserializovatelná pole
de: Alle nicht serialisierbaren Felder markieren
es: Marcar todos los campos no serializables
fr: Marquez tous les champs non sérialisés
it: Contrassegnare tutti i campi non serializzabili
ja: すべてのシリアル化不可能なフィールドを設定します
ko: 모두 serialize할 수 없는 필드로 표시하십시오.
pl: Oznacz wszystkie pola nieprzeznaczone do serializacji
pt_br: Marcar todos os campos não serializáveis
ru: Пометьте все несериализуемые поля
tr: Tüm serileştirilebilir olmayan alanları işaretleyin
zh_hans: 标记所有不可序列化的字段
zh_hant: 必須標記所有不可序列化的欄位

# MarkAssembliesWithNeutralResourcesLanguageDescription
source: The NeutralResourcesLanguage attribute informs the ResourceManager of the language that was used to display the resources of a neutral culture for an assembly. This improves lookup performance for the first resource that you load and can reduce your working set.
cs: Atribut NeutralResourcesLanguage informuje Správce prostředků o jazyce, který byl použit k zobrazení prostředků neutrální jazykové verze sestavení. Tím zlepší výkon vyhledávání prvního načítaného prostředku a může redukovat pracovní sadu.
de: Das NeutralResourcesLanguage-Attribut informiert den ResourceManager über die Sprache, die zum Anzeigen der Ressourcen einer neutralen Kultur für eine Assembly verwendet wurde. Dadurch wird die Suchleistung für die erste von Ihnen geladene Ressource verbessert, und Ihr Arbeitssatz wird möglicherweise reduziert.
es: El atributo NeutralResourcesLanguage informa a ResourceManager del lenguaje que se utilizó para mostrar los recursos de una cultura neutral para un ensamblado. Esto mejora el rendimiento de la búsqueda para el primer recurso que cargue y puede reducir el espacio de trabajo.
fr: L'attribut NeutralResourcesLanguage apporte des informations au ResourceManager du langage utilisé pour afficher les ressources d'une culture neutre d'un assembly. Cela améliore les performances de recherche de la première ressource que vous chargez et permet de réduire votre plage de travail.
it: L'attributo NeutralResourcesLanguage indica a ResourceManager la lingua usata per visualizzare le risorse delle impostazioni cultura per un assembly non associate ad alcun paese. Questo approccio migliora le prestazioni delle ricerche per la prima risorsa caricata e può ridurre il working set.
ja: NeutralResourcesLanguage 属性は、アセンブリ用のニュートラル カルチャのリソースを表示するために使用された言語を ResourceManager に通知します。これにより、最初に読み込むリソースのルックアップのパフォーマンスが向上し、ワーキング セットを減らすことができます。
ko: NeutralResourcesLanguage 특성은 어셈블리의 중립 문화권 리소스를 표시하는 데 사용된 언어 정보를 ResourceManager에 제공합니다. 그 결과 로드되는 첫 번째 리소스에 대한 조회 성능이 향상되고 작업 집합이 줄어듭니다.
pl: Atrybut NeutralResourcesLanguage informuje obiekt ResourceManager o języku, którego użyto do wyświetlenia zasobów kultury neutralnej dla zestawu. Podwyższa to wydajność wyszukiwania pierwszego ładowanego zasobu i umożliwia zmniejszenie zestawu roboczego.
pt_br: O atributo NeutralResourcesLanguage informa o ResourceManager do idioma usado para renderizar os recursos de uma cultura neutra para um assembly. Isso melhorará o desempenho da pesquisa para o primeiro recurso carregado e poderá reduzir o conjunto de trabalho.
ru: Атрибут NeutralResourcesLanguage сообщает ResourceManager о языке, использованном при отображении ресурсов нейтральной культуры для сборки. Это ускоряет поиск для первого загружаемого вами ресурса и может уменьшить рабочий набор.
tr: NeutralResourcesLanguage özniteliği ResourceManager’a bir derleme için nötr kültürdeki kaynakları görüntülemek için kullanılan dili bildirir. Bu, yüklediğiniz ilk kaynak için arama performansını iyileştirir ve çalışma kümenizi azaltabilir.
zh_hans: NeutralResourcesLanguage 特性将通知资源管理器用于显示程序集非特定区域性的资源的语言。这样可提高所加载的第一个资源的查找性能，并可减少工作集。
zh_hant: NeutralResourcesLanguage 屬性會通知 ResourceManager 用於顯示組件之中性文化特性 (Culture) 資源的語言。如此可改善載入第一項源的查閱效能，且可減少您的工作集。

# MarkAssembliesWithNeutralResourcesLanguageMessage
source: Mark assemblies with NeutralResourcesLanguageAttribute
cs: Označení sestavení atributem NeutralResourcesLanguageAttribute
de: Assemblys mit NeutralResourcesLanguageAttribute markieren
es: Marcar ensamblados con NeutralResourcesLanguageAttribute
fr: Marquer les assemblys avec NeutralResourcesLanguageAttribute
it: Contrassegnare gli assembly con NeutralResourcesLanguageAttribute
ja: アセンブリに NeutralResourcesLanguageAttribute を設定します
ko: NeutralResourcesLanguageAttribute로 어셈블리를 표시하세요.
pl: Oznacz zestawy atrybutem NeutralResourcesLanguageAttribute
pt_br: Marcar assemblies com NeutralResourcesLanguageAttribute
ru: Пометьте сборки с помощью NeutralResourcesLanguageAttribute
tr: Bütünleştirilmiş kodları NeutralResourcesLanguageAttribute ile işaretle
zh_hans: 用 NeutralResourcesLanguageAttribute 标记程序集
zh_hant: 將組件標記為 NeutralResourcesLanguageAttribute

# MarkAssembliesWithNeutralResourcesLanguageTitle
source: Mark assemblies with NeutralResourcesLanguageAttribute
cs: Označení sestavení atributem NeutralResourcesLanguageAttribute
de: Assemblys mit NeutralResourcesLanguageAttribute markieren
es: Marcar ensamblados con NeutralResourcesLanguageAttribute
fr: Marquer les assemblys avec NeutralResourcesLanguageAttribute
it: Contrassegnare gli assembly con NeutralResourcesLanguageAttribute
ja: アセンブリに NeutralResourcesLanguageAttribute を設定します
ko: NeutralResourcesLanguageAttribute로 어셈블리를 표시하세요.
pl: Oznacz zestawy atrybutem NeutralResourcesLanguageAttribute
pt_br: Marcar assemblies com NeutralResourcesLanguageAttribute
ru: Пометьте сборки с помощью NeutralResourcesLanguageAttribute
tr: Bütünleştirilmiş kodları NeutralResourcesLanguageAttribute ile işaretle
zh_hans: 用 NeutralResourcesLanguageAttribute 标记程序集
zh_hant: 將組件標記為 NeutralResourcesLanguageAttribute

# MarkBooleanPInvokeArgumentsWithMarshalAsDescription
source: The Boolean data type has multiple representations in unmanaged code.
cs: Logický datový typ má v nespravovaném kódu více reprezentací.
de: Der boolesche Datentyp verfügt über mehrere Darstellungen in nicht verwaltetem Code.
es: El tipo de datos booleano tiene múltiples representaciones en código sin administrar.
fr: Le type de données booléen a plusieurs représentations dans le code non managé.
it: Per il tipo di dati booleano sono disponibili più rappresentazioni nel codice non gestito.
ja: ブール型には、アンマネージ コードで複数の表現があります。
ko: 부울 데이터 형식은 비관리 코드에서 다양하게 표현됩니다.
pl: Typ danych boolean ma wiele reprezentacji w kodzie niezarządzanym.
pt_br: O tipo de dados Boolean tem várias representações no código não gerenciado.
ru: Логический тип данных имеет несколько представлений в неуправляемом коде.
tr: Boole veri türleri yönetilmeyen kodda birden çok gösterime sahiptir.
zh_hans: 布尔数据类型在非托管代码中有多个表示形式。
zh_hant: 布林值資料類型在非受控的程式碼中有多種表示法。

# MarkBooleanPInvokeArgumentsWithMarshalAsMessageDefault
source: Add the MarshalAsAttribute to parameter {0} of P/Invoke {1}. If the corresponding unmanaged parameter is a 4-byte Win32 'BOOL', use [MarshalAs(UnmanagedType.Bool)]. For a 1-byte C++ 'bool', use MarshalAs(UnmanagedType.U1).
cs: Přidejte MarshalAsAttribute do parametru {0} metody P/Invoke {1}. Pokud odpovídající nespravovaný parametr je 4bajtová hodnota Win32 BOOL, použijte [MarshalAs(UnmanagedType.Bool)]. Pro 1bajtovou hodnotu C++ bool použijte MarshalAs(UnmanagedType.U1).
de: Fügen Sie dem Parameter "{0}" von P/Invoke "{1}" das MarshalAsAttribute hinzu. Wenn der entsprechende nicht verwaltete Parameter "BOOL" für Win32 mit 4 Byte ist, verwenden Sie [MarshalAs(UnmanagedType.Bool)]. Für "bool" für C++ mit 1 Byte verwenden Sie "MarshalAs(UnmanagedType.U1)".
es: Agregue el atributo MarshalAsAttribute al parámetro {0} de P/Invoke {1}. Si el correspondiente parámetro sin asignar es un "BOOL" de Win32 de 4 bytes, utilice [MarshalAs(UnmanagedType.Bool)]. Para un valor "bool" de C++ de 1 byte, utilice MarshalAs(UnmanagedType.U1).
fr: Ajoutez MarshalAsAttribute au paramètre {0} de P/Invoke {1}. Si le paramètre non managé correspondant est un 'BOOL' Win32 de 4 octets, utilisez [MarshalAs(UnmanagedType.Bool)]. Pour un 'bool' C++ de 1 octet, utilisez MarshalAs(UnmanagedType.U1).
it: Aggiungere MarshalAsAttribute al parametro {0} di P/Invoke {1}. Se il valore del parametro non gestito corrispondente è di tipo 'BOOL' Win32 a 4 byte, usare [MarshalAs(UnmanagedType.Bool)]. Per un valore di tipo 'bool' C++ a 1 byte, usare MarshalAs(UnmanagedType.U1).
ja: P/Invoke {1} のパラメーター {0} に MarshalAsAttribute を追加します。対応するアンマネージ パラメーターが 4 バイトの Win32 'BOOL' である場合は、[MarshalAs(UnmanagedType.Bool)] を使用してください。1 バイト C++ 'bool' の場合は、MarshalAs(UnmanagedType.U1) を使用してください。
ko: P/Invoke {1}의 {0} 매개 변수에 MarshalAsAttribute를 추가하세요. 관리되지 않는 해당 매개 변수가 4바이트 Win32 'BOOL'인 경우 [MarshalAs(UnmanagedType.Bool)]를 사용하세요. 1바이트 C++ 'bool'인 경우 MarshalAs(UnmanagedType.U1)를 사용하세요.
pl: Dodaj atrybut MarshalAsAttribute do parametru {0} elementu P/Invoke {1}. Jeśli odpowiadającym parametrem niezarządzanym jest 4-bajtowy typ BOOL środowiska Win32, użyj wartości [MarshalAs(UnmanagedType.Bool)]. W przypadku 1-bajtowego typu bool języka C++ użyj wartości MarshalAs(UnmanagedType.U1).
pt_br: Adicione o MarshalAsAttribute ao parâmetro {0} de P/Invoke {1}. Se o parâmetro não gerenciado correspondente for 'BOOL' do Win32 de 4 bytes, use [MarshalAs(UnmanagedType.Bool)]. Para 'bool' do C++ de 1 byte, use MarshalAs(UnmanagedType.U1).
ru: Добавьте MarshalAsAttribute к параметру {0} P/Invoke {1}. Если соответствующий неуправляемый параметр является 4-байтным Win32 "BOOL", используйте [MarshalAs(UnmanagedType.Bool)]. Для 1-байтного "bool" C++ используйте MarshalAs(UnmanagedType.U1).
tr: MarshalAsAttribute’u P/Invoke {1} öğesinin {0} parametresine ekleyin. Karşılık gelen yönetilmeyen parametre bir 4 bayt Win32 'BOOL' ise, [MarshalAs(UnmanagedType.Bool)] kullanın. 1-byte C++ 'bool' için, MarshalAs(UnmanagedType.U1) kullanın.
zh_hans: 向 P/Invoke {1} 的参数 {0} 添加 MarshalAsAttribute。如果对应的非托管参数为 4 字节的 Win32 "BOOL"，则使用 [MarshalAs(UnmanagedType.Bool)]。对于 1 字节的 C++ "bool"，请使用 MarshalAs(UnmanagedType.U1)。
zh_hant: 將 MarshalAsAttribute 新增至 P/Invoke {1} 的參數 {0}。若相對應的非受控參數為 4 位元組的 Win32 'BOOL'，請使用 [MarshalAs(UnmanagedType.Bool)]。若為 1 位元組的 C++ 'bool'，請使用 MarshalAs(UnmanagedType.U1)。

# MarkBooleanPInvokeArgumentsWithMarshalAsMessageReturn
source: Add the MarshalAsAttribute to the return type of P/Invoke {0}. If the corresponding unmanaged return type is a 4-byte Win32 'BOOL', use MarshalAs(UnmanagedType.Bool). For a 1-byte C++ 'bool', use MarshalAs(UnmanagedType.U1).
cs: Přidejte MarshalAsAttribute do návratového typu metody P/Invoke {0}. Pokud odpovídající nespravovaný návratový typ je 4bajtová hodnota Win32 BOOL, použijte MarshalAs(UnmanagedType.Bool). Pro 1bajtovou hodnotu C++ bool použijte MarshalAs(UnmanagedType.U1).
de: Fügen Sie dem Rückgabetyp von P/Invoke "{0}" das MarshalAsAttribute hinzu. Wenn der entsprechende nicht verwaltete Rückgabetyp "BOOL" für Win32 mit 4 Byte ist, verwenden Sie "MarshalAs(UnmanagedType.Bool)". Für "bool" für C++ mit 1 Byte verwenden Sie "MarshalAs(UnmanagedType.U1)".
es: Agregue el atributo MarshalAsAttribute al tipo de devolución de P/Invoke {0}. Si el correspondiente tipo de devolución sin asignar es un "BOOL" de Win32 de 4 bytes, utilice [MarshalAs(UnmanagedType.Bool)]. Para un valor "bool" de C++ de 1 byte, utilice MarshalAs(UnmanagedType.U1).
fr: Ajoutez MarshalAsAttribute au type de retour de P/Invoke {0}. Si le type de retour non managé correspondant est un 'BOOL' Win32 de 4 octets, utilisez MarshalAs(UnmanagedType.Bool). Pour un 'bool' C++ de 1 octet, utilisez MarshalAs(UnmanagedType.U1).
it: Aggiungere MarshalAsAttribute al tipo restituito di P/Invoke {0}. Se il valore del tipo restituito non gestito corrispondente è di tipo 'BOOL' Win32 a 4 byte, usare MarshalAs(UnmanagedType.Bool). Per un valore di tipo 'bool' C++ a 1 byte, usare MarshalAs(UnmanagedType.U1).
ja: P/Invoke {0} の戻り値の型に MarshalAsAttribute を追加します。対応するアンマネージ戻り値の型が 4 バイトの Win32 'BOOL' である場合は、MarshalAs(UnmanagedType.Bool) を使用してください。1 バイト C++ 'bool' の場合は、MarshalAs(UnmanagedType.U1) を使用してください。
ko: P/Invoke {0}의 반환 형식에 MarshalAsAttribute를 추가하세요. 관리되지 않는 해당 반환 형식이 4바이트 Win32 'BOOL'인 경우 MarshalAs(UnmanagedType.Bool)를 사용하세요. 1바이트 C++ 'bool'인 경우 MarshalAs(UnmanagedType.U1)를 사용하세요.
pl: Dodaj atrybut MarshalAsAttribute do typu zwracanego elementu P/Invoke {0}. Jeśli odpowiadającym niezarządzanym typem zwracanym jest 4-bajtowy typ BOOL środowiska Win32, użyj wartości [MarshalAs(UnmanagedType.Bool)]. W przypadku 1-bajtowego typu bool języka C++ użyj wartości MarshalAs(UnmanagedType.U1).
pt_br: Adicione o MarshalAsAttribute ao tipo de retorno de P/Invoke {0}. Se o tipo de retorno não gerenciado correspondente for 'BOOL' do Win32 de 4 bytes, use MarshalAs(UnmanagedType.Bool). Para 'bool' do C++ de 1 byte, use MarshalAs(UnmanagedType.U1).
ru: Добавьте MarshalAsAttribute к типу возвращаемого значения P/Invoke {0}. Если соответствующий неуправляемый тип возвращаемого значения является 4-байтным Win32 "BOOL", используйте MarshalAs(UnmanagedType.Bool). Для 1-байтного "bool" C++ используйте MarshalAs(UnmanagedType.U1).
tr: MarshalAsAttribute’u P/Invoke {0} öğesinin dönüş türüne ekleyin. Karşılık gelen yönetilmeyen dönüş türü bir 4 bayt Win32 'BOOL' ise, [MarshalAs(UnmanagedType.Bool)] kullanın. 1-byte C++ 'bool' için, MarshalAs(UnmanagedType.U1) kullanın.
zh_hans: 向 P/Invoke {0} 的返回类型添加 MarshalAsAttribute。如果对应的非托管返回类型为 4 字节的 Win32 "BOOL"，则使用 MarshalAs(UnmanagedType.Bool)。对于 1 字节的 C++ "bool"，请使用 MarshalAs(UnmanagedType.U1)。
zh_hant: 將 MarshalAsAttribute 新增至 P/Invoke {0} 的傳回型別。若相對應的非受控傳回型別為 4 位元組的 Win32 'BOOL'，請使用 MarshalAs(UnmanagedType.Bool)。若為 1 位元組的 C++ 'bool'，請使用 MarshalAs(UnmanagedType.U1)。

# MarkBooleanPInvokeArgumentsWithMarshalAsTitle
source: Mark boolean PInvoke arguments with MarshalAs
cs: Označení logických argumentů PInvoke pomocí MarshalAs
de: Boolesche PInvoke-Argumente mit MarshalAs markieren
es: Marcar los argumentos booleanos de PInvoke con MarshalAs
fr: Marquer les arguments PInvoke booléens avec MarshalAs
it: Contrassegnare gli argomenti di PInvoke booleani con MarshalAs
ja: ブール型の PInvoke 引数を MarshalAs に設定します
ko: MarshalAs로 부울 PInvoke 인수를 표시하세요.
pl: Oznacz argumenty typu boolean elementu PInvoke argumentem MarshalAs
pt_br: Marcar argumentos PInvoke boolianos com MarshalAs
ru: Пометьте логические аргументы PInvoke с помощью MarshalAs
tr: Boolean PInvoke bağımsız değişkenlerini MarshalAs olarak işaretleyin
zh_hans: 用 MarshalAs 标记布尔型 PInvoke 参数
zh_hant: 將布林值 PInvoke 引數標記為 MarshalAs
