Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RecommendCaseInsensitiveStringComparerDescription
source: Avoid calling 'ToLower', 'ToUpper', 'ToLowerInvariant' and 'ToUpperInvariant' to perform case-insensitive string comparisons when using 'CompareTo', because they lead to an allocation. Instead, use 'StringComparer' to perform case-insensitive comparisons. Switching to using 'StringComparer' might cause subtle changes in behavior, so it's important to conduct thorough testing after applying the suggestion. Additionally, if a culturally sensitive comparison is not required, consider using 'StringComparer.OrdinalIgnoreCase'.
cs: Vyhněte se volání „ToLower, ToUpper“, „ToLowerInvariant“ a „ToUpperInvariant“ k provádění porovnávání řetězců bez rozlišování velkých a malých písmen při použití „CompareTo“, protože vedou k přidělení. Místo toho k porovnání bez rozlišování malých a velkých písmen použijte „StringComparer“. Přechod na použití „StringComparer“ může způsobit drobné změny v chování, takže je důležité provést důkladné testování po použití návrhu. Pokud navíc není vyžadováno kulturní porovnání, zvažte použití „stringcomparer.OrdinalIgnoreCase“.
de: Vermeiden Sie den Aufruf von "ToLower", "ToUpper", "ToLowerInvariant" und "ToUpperInvariant", um Zeichenfolgenvergleiche ohne Beachtung der Groß-/Kleinschreibung bei Verwendung von "CompareTo" durchzuführen, da sie zu einer Zuordnung führen. Verwenden Sie stattdessen "StringComparer", um Vergleiche ohne Beachtung der Groß-/Kleinschreibung durchzuführen. Der Wechsel zur Verwendung von "StringComparer" kann geringfügige Verhaltensänderungen verursachen. Daher ist es wichtig, nach der Anwendung des Vorschlags umfassende Tests durchzuführen. Wenn kein kulturabhängiger Vergleich erforderlich ist, sollten Sie außerdem die Verwendung von "StringComparer.OrdinalIgnoreCase" in Betracht ziehen.
es: Evite llamar a "ToLower", "ToUpper", "ToLowerInvariant" y "ToUpperInvariant" para realizar comparaciones de cadenas sin distinción de mayúsculas y minúsculas al usar "CompareTo", porque dan lugar a una asignación. En su lugar, use "StringComparer" para realizar comparaciones sin distinción de mayúsculas y minúsculas. Si cambia a "StringComparer", es posible que se produzcan cambios sutiles en el comportamiento, por lo que es importante realizar pruebas exhaustivas después de aplicar la sugerencia. Además, si no se requiere una comparación culturalmente confidencial, considere la posibilidad de usar "StringComparer.OrdinalIgnoreCase".
fr: Évitez d’appeler « ToLower », « ToUpper », « ToLowerInvariant » et « ToUpperInvariant » pour effectuer des comparaisons de chaînes sans respect de la casse lors de l’utilisation de « CompareTo », car elles entraînent une allocation. Utilisez plutôt « StringComparer » pour effectuer des comparaisons qui ne respectent pas la casse. Le passage à l’utilisation de « StringComparer » peut entraîner des modifications subtiles du comportement. Il est donc important d’effectuer des tests approfondis après l’application de la suggestion. En outre, si aucune comparaison sensible à la culture n’est nécessaire, envisagez d’utiliser « StringComparer.OrdinalIgnoreCase ».
it: Si sconsiglia di chiamare i metodi “ToLower”, “ToUpper”, “ToLowerInvariant” e “ToUpperInvariant” per confrontare le stringhe senza distinzione tra maiuscole e minuscole quando si usa “CompareTo”, perché portano a un'allocazione. È preferibile usare "StringComparer" per i confronti senza distinzione tra maiuscole e minuscole. Il passaggio all'uso di "StringComparer" potrebbe causare lievi modifiche nel comportamento, quindi è importante eseguire test completi dopo aver applicato il suggerimento. Inoltre, se non è necessario un confronto sensibile a livello di cultura, provare a usare "StringComparer.OrdinalIgnoreCase".
ja: 'CompareTo' を使用するときに大文字と小文字を区別しない文字列比較を実行するために、'ToLower'、'ToUpper'、'ToLowerInvariant'、および 'ToUpperInvariant' を呼び出さないようにしてください。これは、割り当てにつながるためです。代わりに、'StringComparer' を使用して、大文字と小文字を区別しない比較を実行してください。'StringComparer' の使用に切り替えると、動作が微妙に変化する可能性があるため、提案を適用した後に十分なテストを実施することが重要です。また、文化的に敏感な比較を行う必要がない場合は、'StringComparer.OrdinalIgnoreCase' の使用を検討してください。
ko: 'CompareTo'를 사용할 때 대/소문자를 구분하지 않는 문자열 비교를 수행하기 위해 'ToLower', 'ToUpper', 'ToLowerInvariant', 'ToUpperInvariant'를 호출하지 마세요. 이로 인해 할당이 발생하게 됩니다. 대신 'StringComparer'를 사용하여 대/소문자를 구분하지 않는 비교를 수행하세요. 'StringComparer' 사용으로 전환하면 동작이 미세하게 바뀔 수 있으므로 제안을 적용한 후 정밀한 테스트를 수행하는 것이 중요합니다. 또한 문화적으로 민감한 비교가 필요하지 않은 경우에는 'StringComparer.OrdinalIgnoreCase' 사용을 고려해 보세요.
pl: Unikaj wywoływania „ToLower”, „ToUpper”, „ToLowerInvariant” i „ToUpperInvariant” do wykonywania porównań ciągów bez uwzględniania wielkości liter podczas korzystania z „CompareTo”, ponieważ prowadzą one do alokacji. Zamiast tego użyj elementu „StringComparer”, aby wykonać porównania bez uwzględniania wielkości liter. Przełączenie się na używanie elementu „StringComparer” może spowodować subtelne zmiany w zachowaniu, dlatego ważne jest przeprowadzenie dokładnego testowania po zastosowaniu sugestii. Ponadto jeśli nie jest wymagane porównanie wrażliwe kulturowo, rozważ użycie metody „StringComparer.OrdinalIgnoreCase”.
pt_br: Evite chamar 'ToLower', 'ToUpper', 'ToLowerInvariant' e 'ToUpperInvariant' para realizar comparações de cadeias de caracteres que não diferenciam maiúsculas de minúsculas ao usar 'CompareTo', pois elas levam a uma alocação. Em vez disso, use 'StringComparer' para realizar comparações que não diferenciam maiúsculas de minúsculas. Mudar para o 'StringComparer' pode causar mudanças sutis no comportamento, por isso é importante realizar testes completos após aplicar a sugestão. Além disso, se uma comparação culturalmente sensível não for necessária, considere usar 'StringComparer.OrdinalIgnoreCase'.
ru: Не вызывайте "ToLower", "ToUpper", "ToLowerInvariant" и "ToUpperInvariant" для сравнения строк без учета регистра при использовании "CompareTo", поскольку это приведет к выделению. Вместо этого используйте "StringComparer" для сравнения без учета регистра. При переходе на использование "StringComparer" поведение может немного измениться, поэтому проведите тщательное тестирование после применения этой рекомендации. Кроме того, если сравнение с учетом культуры не требуется, попробуйте использовать "StringComparer.OrdinalIgnoreCase".
tr: Ayırmaya yol açtıklarından 'CompareTo' kullanırken büyük/küçük harfe duyarsız dize karşılaştırmaları gerçekleştirmek için 'ToLower', 'ToUpper', 'ToLowerInvariant' ve 'ToUpperInvariant' çağırmaktan kaçının. Büyük/küçük harfe duyarsız karşılaştırma yapmak için 'StringComparer' kullanmayı tercih edin. 'StringComparer' kullanımına geçmek davranışta küçük değişikliklere neden olabileceğinden öneriyi uyguladıktan sonra mutlaka kapsamlı test yapılmalıdır. Ayrıca, kültürel açıdan hassas karşılaştırma gerekmiyorsa 'StringComparer.OrdinalIgnoreCase' kullanmayı göz önünde bulundurun.
zh_hans: 避免在使用 "CompareTo" 时调用 "ToLower"、"ToUpper"、"ToLowerInvariant" 和"ToUpperInvariant" 来执行不区分大小写的字符串比较，因为它们会导致分配。相反，请使用 "StringComparer" 执行不区分大小写的比较。切换到使用 "StringComparer" 可能会导致行为发生细微变化，因此在应用建议后执行全面测试非常重要。此外，如果不需要区分区域性的比较，请考虑使用 "StringComparer.OrdinalIgnoreCase"。
zh_hant: 避免在使用 'CompareTo' 時呼叫 'ToLower'、'ToUpper'、'ToLowerInvariant' 和 'ToUpperInvariant' 來執行不區分大小寫的字串比較，因為它們會導致配置。請改用 'StringComparer' 來執行不區分大小寫的比較。切換至使用 'StringComparer' 可能會導致行為發生輕微變更，因此在套用建議之後，必須進行全面性測試。此外，如果不需要文化相關比較，請考慮使用 'StringComparer.OrdinalIgnoreCase'。

# RecommendCaseInsensitiveStringComparerMessage
source: Prefer using 'StringComparer' to perform a case-insensitive comparison, but keep in mind that this might cause subtle changes in behavior, so make sure to conduct thorough testing after applying the suggestion, or if culturally sensitive comparison is not required, consider using 'StringComparer.OrdinalIgnoreCase'
cs: Pokud chcete provést porovnání bez rozlišování velkých a malých písmen, raději použijte „StringComparer“, ale mějte na paměti, že to může způsobit drobné změny v chování. Proto po použití návrhu nezapomeňte provést důkladné testování nebo pokud není vyžadováno kulturní porovnání, zvažte použití „stringcomparer.OrdinalIgnoreCase“.
de: Verwenden Sie lieber "StringComparer", um einen Vergleich ohne Berücksichtigung der Groß-/Kleinschreibung durchzuführen. Beachten Sie jedoch, dass dies zu geringfügigen Verhaltensänderungen führen kann. Stellen Sie daher sicher, dass Sie nach dem Anwenden des Vorschlags gründlich testen. Falls kein kulturabhängiger Vergleich erforderlich ist, sollten Sie "StringComparer.OrdinalIgnoreCase" verwenden.
es: Prefiera usar "StringComparer" para realizar una comparación sin distinción de mayúsculas y minúsculas, pero tenga en cuenta que esto puede provocar cambios sutiles en el comportamiento, por lo que asegúrese de realizar pruebas exhaustivas después de aplicar la sugerencia, o si no se requiere una comparación culturalmente confidencial, considere la posibilidad de usar "StringComparer.OrdinalIgnoreCase"
fr: Utilisez de préférence « StringComparer » pour effectuer une comparaison sans respect de la casse, mais gardez à l’esprit que cela peut entraîner des modifications subtiles du comportement. Veillez donc à effectuer des tests approfondis après l’application de la suggestion ou, si la comparaison sensible à la culture n’est pas nécessaire, envisagez d’utiliser « StringComparer.OrdinalIgnoreCase »
it: Preferire l'uso di "StringComparer" per eseguire un confronto senza distinzione tra maiuscole e minuscole, ma tenere presente che ciò potrebbe causare lievi modifiche nel comportamento, quindi assicurarsi di eseguire test completi dopo l'applicazione del suggerimento o, se non è necessario un confronto sensibile a livello di cultura, provare a usare "StringComparer.OrdinalIgnoreCase"
ja: 大文字と小文字を区別しない比較を実行するには、'StringComparer' を使用することをお勧めしますが、これにより、動作が微妙に変化する可能性があることに注意してください。そのため、提案を適用した後に十分なテストを実施してください。また、文化的に敏感な比較を行う必要がない場合は、'StringComparer.OrdinalIgnoreCase' の使用を検討してください
ko: 대/소문자를 구분하지 않는 비교를 수행하기 위해 'StringComparer'를 사용하는 것을 선호하되 이로 인해 동작이 미세하게 바뀔 수 있으므로 제안을 적용한 후 정밀한 테스트를 수행하거나, 문화적으로 민감한 비교가 필요하지 않은 경우에는 'StringComparer.OrdinalIgnoreCase' 사용을 고려해 보세요.
pl: Preferuj używanie elementu „StringComparer” do porównywania bez uwzględniania wielkości liter, ale pamiętaj, że może to spowodować subtelne zmiany w zachowaniu, więc upewnij się, że przeprowadzasz dokładne testy po zastosowaniu sugestii lub jeśli porównanie wrażliwe kulturowo nie jest wymagane, rozważ użycie „StringComparer.OrdinalIgnoreCase”.
pt_br: Prefira usar 'StringComparer' para realizar uma comparação sem distinção entre maiúsculas e minúsculas, mas lembre-se de que isso pode causar mudanças sutis no comportamento, portanto, certifique-se de realizar testes completos após aplicar a sugestão ou, se a comparação culturalmente sensível não for necessária, considere usar 'StringComparer.OrdinalIgnoreCase'
ru: Для сравнения без учета регистра лучше использовать "StringComparer", но помните, что при этом поведение может немного измениться, поэтому проведите тщательное тестирование после применения этой рекомендации. Если же сравнение с учетом культуры не требуется, попробуйте использовать "StringComparer.OrdinalIgnoreCase".
tr: Büyük/küçük harfe duyarsız bir karşılaştırma gerçekleştirmek için 'StringComparer' kullanmayı tercih edin ancak bunun davranışta küçük değişikliklere neden olabileceğini unutmayın. Bu nedenle, öneriyi uyguladıktan sonra mutlaka kapsamlı testler yapın veya kültürel açıdan hassas karşılaştırma gerekmiyorsa 'StringComparer.OrdinalIgnoreCase' kullanmayı göz önünde bulundurun
zh_hans: 首选使用 "StringComparer" 执行不区分大小写的比较，但请记住，这可能会导致行为发生细微变化，因此请确保在应用建议后进行全面测试，或者如果不需要区分区域性的比较，请考虑使用 "StringComparer.OrdinalIgnoreCase"
zh_hant: 建議使用 'StringComparer' 執行不區分大小寫的比較，但請注意，這可能會導致行為發生輕微變更，因此請務必在套用建議之後進行全面測試，或者如果不需要文化相關比較，請考慮使用 'StringComparer.OrdinalIgnoreCase'

# RecommendCaseInsensitiveStringComparerStringComparisonCodeFixTitle
source: Use the 'string.{0}(string, StringComparison)' overload
cs: Použijte přetížení string.{0}(string, StringComparison)
de: Verwenden Sie die "string.{0}(string, StringComparison)"-Überladung
es: Usar la sobrecarga "string.{0}(string, StringComparison)"
fr: Utiliser la surcharge « string.{0}(string, StringComparison) »
it: Usare l'overload “string.{0}(string, StringComparison)"
ja: 'string.{0}(string, StringComparison)' オーバーロードを使用してください
ko: 'string.{0}(string, StringComparison)' 오버로드 사용
pl: Użyj obciążenia „string.{0}(string, StringComparison)”
pt_br: Use a 'cadeia de caracteres.{0}(cadeia de caracteres, StringComparison)' sobrecarga
ru: Используйте перегрузку "string.{0}(string, StringComparison)"
tr: 'string.{0}(string, StringComparison)' aşırı yüklemesini kullan
zh_hans: 使用 "string.{0}(string, StringComparison)" 重载
zh_hant: 使用 'string.{0}(string, StringComparison)' 多載

# RecommendCaseInsensitiveStringComparisonDescription
source: Avoid calling 'ToLower', 'ToUpper', 'ToLowerInvariant' and 'ToUpperInvariant' to perform case-insensitive string comparisons because they lead to an allocation. Instead, prefer calling the method overloads of 'Contains', 'IndexOf' and 'StartsWith' that take a 'StringComparison' enum value to perform case-insensitive comparisons. Switching to using an overload that takes a 'StringComparison' might cause subtle changes in behavior, so it's important to conduct thorough testing after applying the suggestion. Additionally, if a culturally sensitive comparison is not required, consider using 'StringComparison.OrdinalIgnoreCase'.
cs: Při provádění porovnávání řetězců bez rozlišování velkých a malých písmen se vyhněte volání „ToLower“, „ToUpper“, „ToLowerInvariant“ a „ToUpperInvariant“, protože vedou k přidělení. Místo toho upřednostňujte volání metody přetížení „Contains“, „IndexOf“ a „StartsWith“, která pro porovnání bez rozlišování malých a velkých písmen přijímají hodnotu výčtu „StringComparison“. Přechod na přetížení, které přijímá „StringComparison“, může způsobit drobné změny v chování, takže je důležité provést důkladné testování po použití návrhu. Pokud navíc není vyžadováno kulturní porovnání, zvažte použití „stringcomparison.OrdinalIgnoreCase“.
de: Vermeiden Sie den Aufruf von "ToLower", "ToUpper", "ToLowerInvariant" und "ToUpperInvariant", um Zeichenfolgenvergleiche ohne Beachtung der Groß-/Kleinschreibung durchzuführen, da sie zu einer Zuordnung führen. Rufen Sie stattdessen lieber die Methodenüberladungen von "Contains", "IndexOf" und "StartsWith" auf, die einen StringComparison-Enumerationswert verwenden, um Vergleiche ohne Beachtung der Groß-/Kleinschreibung durchzuführen. Der Wechsel zu einer Überladung, die einen "StringComparison" akzeptiert, kann geringfügige Verhaltensänderungen verursachen. Daher ist es wichtig, nach dem Anwenden des Vorschlags gründlich zu testen. Wenn kein kulturabhängiger Vergleich erforderlich ist, sollten Sie außerdem die Verwendung von "StringComparison.OrdinalIgnoreCase" in Betracht ziehen.
es: Evite llamar a "ToLower", "ToUpper", "ToLowerInvariant" y "ToUpperInvariant" para realizar comparaciones de cadenas sin distinción de mayúsculas y minúsculas, porque dan lugar a una asignación. En su lugar, es preferible llamar a las sobrecargas de método de "Contains", "IndexOf" y "StartsWith" que toman un valor de enumeración "StringComparison" para realizar comparaciones que no distinguen mayúsculas de minúsculas. Si cambia a una sobrecarga que toma una "StringComparison", es posible que se produzcan cambios sutiles en el comportamiento, por lo que es importante realizar pruebas exhaustivas después de aplicar la sugerencia. Además, si no se requiere una comparación culturalmente confidencial, considere la posibilidad de usar "StringComparison.OrdinalIgnoreCase".
fr: Évitez d’appeler « ToLower », « ToUpper », « ToLowerInvariant » et « ToUpperInvariant » pour effectuer des comparaisons de chaînes sans respect de la casse, car elles entraînent une allocation. Préférez plutôt appeler les surcharges de méthode de « Contains », d’« IndexOf » et de « StartsWith » qui acceptent une valeur enum « StringComparison » pour effectuer des comparaisons qui ne respectent pas la casse. Le passage à l’utilisation d’une surcharge qui accepte « StringComparison » peut entraîner des modifications subtiles du comportement. Il est donc important d’effectuer des tests approfondis après l’application de la suggestion. En outre, si aucune comparaison sensible à la culture n’est nécessaire, envisagez d’utiliser « StringComparison.OrdinalIgnoreCase ».
it: Si sconsiglia di chiamare i metodi "ToLower", "ToUpper", "ToLowerInvariant" e "ToUpperInvariant" per confrontare le stringhe senza distinzione tra maiuscole e minuscole perché portano a un'allocazione. Preferire invece chiamare gli overload del metodo di "Contains", "IndexOf" e "StartsWith" che richiedono un valore di enumerazione "StringComparison" per eseguire confronti senza distinzione tra maiuscole e minuscole. Il passaggio all'uso di un overload che richiede un valore "StringComparison" potrebbe causare lievi modifiche nel comportamento, quindi è importante eseguire test completi dopo aver applicato il suggerimento. Inoltre, se non è necessario un confronto sensibile a livello di cultura, provare a usare "StringComparison.OrdinalIgnoreCase".
ja: 大文字と小文字を区別しない文字列比較を実行するために、'ToLower'、'ToUpper'、'ToLowerInvariant'、および 'ToUpperInvariant' を呼び出さないようにしてください。これは、割り当てにつながるためです。代わりに、'StringComparison' 列挙値を受け取る 'Contains'、'IndexOf'、'StartsWith' のメソッド オーバーロードを呼び出すことをお勧めします。'StringComparison' を受け取るオーバーロードの使用に切り替えると、動作が微妙に変化する可能性があるため、提案を適用した後に十分なテストを実施することが重要です。また、文化的に敏感な比較を行う必要がない場合は、'StringComparison.OrdinalIgnoreCase' の使用を検討してください。
ko: 대/소문자를 구분하지 않는 문자열 비교를 수행하기 위해 'ToLower', 'ToUpper', 'ToLowerInvariant', 'ToUpperInvariant'를 호출하지 마세요. 이로 인해 할당이 발생하게 됩니다. 대신 대/소문자를 구분하지 않는 비교를 수행하기 위해 'StringComparison' 열거형 값을 사용하는 'Contains', 'IndexOf', 'StartsWith'의 메서드 오버로드를 호출하는 것이 좋습니다. 'StringComparison'을 사용하는 오버로드 사용으로 전환하면 동작이 미세하게 바뀔 수 있으므로 제안을 적용한 후 정밀한 테스트를 수행하는 것이 중요합니다. 또한 문화적으로 민감한 비교가 필요하지 않은 경우에는 'StringComparison.OrdinalIgnoreCase' 사용을 고려해 보세요.
pl: Unikaj wywoływania elementów „ToLower”, „ToUpper”, „ToLowerInvariant” i „ToUpperInvariant”, aby przeprowadzać porównania ciągów bez uwzględniania wielkości liter, ponieważ prowadzą do alokacji. Zamiast tego preferuj wywoływanie przeciążeń metod „Contains”, „IndexOf” i „StartsWith”, które przyjmują wartość wyliczenia „StringComparison”, aby wykonać porównania bez uwzględniania wielkości liter. Przełączenie się na użycie przeciążenia wykorzystującego element „StringComparison” może spowodować subtelne zmiany w zachowaniu, dlatego ważne jest przeprowadzenie dokładnego testowania po zastosowaniu sugestii. Ponadto jeśli nie jest wymagane porównanie wrażliwe kulturowo, rozważ użycie elementu „StringComparer.OrdinalIgnoreCase”.
pt_br: Evite chamar 'ToLower', 'ToUpper', 'ToLowerInvariant' e 'ToUpperInvariant' para realizar comparações de cadeias de caracteres que não diferenciam maiúsculas de minúsculas, pois elas levam a uma alocação. Em vez disso, prefira chamar as sobrecargas de método de 'Contains', 'IndexOf' e 'StartsWith' que usam um valor enum 'StringComparison' para realizar comparações que não diferenciam maiúsculas de minúsculas. Mudar para uma sobrecarga que utiliza um 'StringComparison' pode causar mudanças sutis no comportamento, por isso é importante realizar testes completos após aplicar a sugestão. Além disso, se uma comparação culturalmente sensível não for necessária, considere usar 'StringComparison.OrdinalIgnoreCase'.
ru: Не вызывайте "ToLower", "ToUpper", "ToLowerInvariant" и "ToUpperInvariant" для сравнения строк без учета регистра, поскольку это приведет к выделению. Вместо этого лучше вызывать перегрузки методов "Contains", "IndexOf" и "StartsWith", которые используют значение перечисления "StringComparison" для сравнения без учета регистра. При переходе на использование перегрузки, которая использует "StringComparison", поведение может немного измениться, поэтому проведите тщательное тестирование после применения этой рекомендации. Кроме того, если сравнение с учетом культуры не требуется, попробуйте использовать "StringComparison.OrdinalIgnoreCase".
tr: Ayırmaya yol açtıklarından büyük/küçük harfe duyarsız dize karşılaştırmaları gerçekleştirmek için 'ToLower', 'ToUpper', 'ToLowerInvariant' ve 'ToUpperInvariant' çağırmaktan kaçının. Bunun yerine, büyük/küçük harfe duyarsız karşılaştırmalar gerçekleştirmek için 'StringComparison' sabit listesi değeri alan 'Contains', 'IndexOf' ve 'StartsWith' metot aşırı yüklemelerini çağırmayı tercih edin. 'StringComparer' alan bir aşırı yüklemeye geçmek geçmek davranışta küçük değişikliklere neden olabileceğinden öneriyi uyguladıktan sonra mutlaka kapsamlı test yapılmalıdır. Ayrıca, kültürel açıdan hassas karşılaştırma gerekmiyorsa 'StringComparer.OrdinalIgnoreCase' kullanmayı göz önünde bulundurun.
zh_hans: 避免调用“ToLower”、“ToUpper”、“ToLowerInvariant”和“ToUpperInvariant”来执行不区分大小写的字符串比较，因为它们会导致分配。相反，首选调用采用“StringComparison”枚举值的“Contains”、“IndexOf”和“StartsWith”的方法重载来执行不区分大小写的比较。切换到使用采用“StringComparison”的重载可能会导致行为发生细微变化，因此在应用建议后执行全面测试非常重要。此外，如果不需要区分区域性的比较，请考虑使用“StringComparison.OrdinalIgnoreCase”。
zh_hant: 避免呼叫 'ToLower'、'ToUpper'、'ToLowerInvariant' 和 'ToUpperInvariant' 來執行不區分大小寫的字串比較，因為它們會導致配置。相反地，建議呼叫採用 'StringComparison' 列舉值的 'Contains'、'IndexOf' 和 'StartsWith' 方法多載，以執行不區分大小寫的比較。切換至使用多載 (其採用 'StringComparer') 可能會導致行為發生輕微變更，因此在套用建議之後，必須進行全面性測試。此外，如果不需要文化相關比較，請考慮使用 'StringComparison.OrdinalIgnoreCase'。
