Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseConcreteTypeDescription
source: Using concrete types avoids virtual or interface call overhead and enables inlining.
cs: Použití konkrétních typů zabraňuje režii virtuálního volání nebo volání rozhraní a umožňuje vkládání.
de: Die Verwendung von konkreten Typen vermeidet den Mehraufwand für virtuelle Aufrufe oder Schnittstellenaufrufe und ermöglicht das Inlining.
es: El uso de tipos concretos evita la sobrecarga de llamadas virtuales o de interfaz y habilita la inserción.
fr: L’utilisation de types concrets évite la surcharge des appels virtuels ou d’interface et active l’inlining.
it: L'uso di tipi concreti evita il sovraccarico delle chiamate virtuali o di interfaccia e abilita l'inlining.
ja: 具象型を使用すると、仮想呼び出しまたはインターフェイス呼び出しのオーバーヘッドが回避され、インライン化が有効になります。
ko: 구체적인 형식을 사용하면 가상 또는 인터페이스 호출 오버헤드를 방지하고 인라인을 사용할 수 있습니다.
pl: Użycie konkretnych typów pozwala uniknąć narzutu wywołań wirtualnych lub interfejsu i umożliwia podkreślenie.
pt_br: O uso de tipos concretos evita sobrecarga de chamada virtual ou de interface e permite inlining.
ru: Использование конкретных типов позволяет избежать потребления ресурсов на виртуальные вызовы и вызовы интерфейса и включить встраивание.
tr: Somut türlerin kullanımı, sanal veya arabirim çağrısı ek yükünü önler ve satır içine alma sağlar.
zh_hans: 使用具体类型可避免虚拟或接口调用开销，并启用内联。
zh_hant: 使用具象類型可以避免虛擬或介面呼叫額外負荷，並啟用內嵌。

# UseConcreteTypeForFieldMessage
source: Change type of field '{0}' from '{1}' to '{2}' for improved performance
cs: Pokud chcete zlepšit výkon, změňte typ pole {0} z {1} na {2}.
de: Ändern Sie den Typ des Felds "{0}" von "{1}" in "{2}", um die Leistung zu verbessern.
es: Cambiar el tipo de campo '{0}' de '{1}' a '{2}' para mejorar el rendimiento
fr: Modifier le type de champ « {0} » de « {1} » en « {2} » pour améliorer les performances
it: Modificare il tipo di campo '{0}' da '{1}' a '{2}' per migliorare le prestazioni
ja: パフォーマンスを向上させるために、フィールド '{0}' の型を '{1}' から '{2}' に変更します
ko: 성능 향상을 위해 '{0}' 필드 형식을 '{1}'에서 '{2}'(으)로 변경하세요.
pl: Zmień typ pola „{0}” z „{1}” na „{2}”, aby zwiększyć wydajność
pt_br: Altere o tipo de campo '{0}' de '{1}' para '{2}' para melhorar o desempenho
ru: Измените тип поля "{0}" с "{1}" на "{2}" для повышения производительности
tr: Daha iyi performans için '{1}' olan '{0}' alan türünü '{2}' olarak değiştirin
zh_hans: 将字段“{0}”的类型从“{1}”更改为“{2}”，以提高性能
zh_hant: 將欄位 '{0}' 的類型從 '{1}' 變更為 '{2}' 以提高效能

# UseConcreteTypeForLocalMessage
source: Change type of variable '{0}' from '{1}' to '{2}' for improved performance
cs: Pokud chcete zlepšit výkon, změňte typ proměnné {0} z {1} na {2}.
de: Ändern Sie den Typ der Variablen "{0}" von "{1}" in "{2}", um die Leistung zu verbessern.
es: Cambiar el tipo de variable '{0}' de '{1}' a '{2}' para mejorar el rendimiento
fr: Modifier le type de variable « {0} » de « {1} » en « {2} » pour améliorer les performances
it: Modificare il tipo di variabile '{0}' da '{1}' a '{2}' per migliorare le prestazioni
ja: パフォーマンスを向上させるために、変数 '{0}' の型を '{1}' から '{2}' に変更します
ko: 성능 향상을 위해 '{0}' 변수 형식을 '{1}'에서 '{2}'(으)로 변경하세요.
pl: Zmień typ zmiennej „{0}” z „{1}” na „{2}”, aby zwiększyć wydajność
pt_br: Altere o tipo de variável '{0}' de '{1}' para '{2}' para melhorar o desempenho
ru: Измените тип переменной "{0}" с "{1}" на "{2}" для повышения производительности
tr: Daha iyi performans için '{1}' olan '{0}' değişken türünü '{2}' olarak değiştirin
zh_hans: 将变量“{0}”的类型从“{1}”更改为“{2}”，以提高性能
zh_hant: 將變數 '{0}' 的類型從 '{1}' 變更為 '{2}' 以提高效能

# UseConcreteTypeForMethodReturnMessage
source: Change return type of method '{0}' from '{1}' to '{2}' for improved performance
cs: Pokud chcete zlepšit výkon, změňte návratový typ metody {0} z {1} na {2}.
de: Ändern Sie den Rückgabetyp der Methode "{0}" von "{1}" in "{2}", um die Leistung zu verbessern.
es: Cambiar el tipo de valor devuelto del método '{0}' de '{1}' a '{2}' para mejorar el rendimiento
fr: Modifier le type de retour de méthode « {0} » de « {1} » en « {2} » pour améliorer les performances
it: Modificare il tipo restituito del metodo '{0}' da '{1}' a '{2}' per migliorare le prestazioni
ja: パフォーマンスを向上させるために、メソッド '{0}' の戻り値の型を '{1}' から '{2}' に変更します
ko: 성능 향상을 위해 '{0}' 메서드 반환 형식을 '{1}'에서 '{2}'(으)로 변경하세요.
pl: Zmień zwracany typ metody „{0}” z „{1}” na „{2}”, aby zwiększyć wydajność
pt_br: Altere o tipo de retorno do método '{0}' de '{1}' para '{2}' para melhorar o desempenho
ru: Измените тип возвращаемого значения метода "{0}" с "{1}" на "{2}" для повышения производительности
tr: Daha performans için '{1}' olan '{0}' metot türünü '{2}' olarak değiştirin
zh_hans: 将方法“{0}”的返回类型从“{1}”更改为“{2}”以提高性能
zh_hant: 將方法 '{0}' 的傳回型別從 '{1}' 變更為 '{2}' 以提高效能

# UseConcreteTypeForParameterMessage
source: Change type of parameter '{0}' from '{1}' to '{2}' for improved performance
cs: Pokud chcete zlepšit výkon, změňte typ parametru {0} z {1} na {2}.
de: Ändern Sie den Typ des Parameters "{0}" von "{1}" in "{2}", um die Leistung zu verbessern.
es: Cambiar el tipo de parámetro '{0}' de '{1}' a '{2}' para mejorar el rendimiento
fr: Modifier le type de paramètre « {0} » de « {1} » en « {2} » pour améliorer les performances
it: Modificare il tipo di parametro '{0}' da '{1}' a '{2}' per migliorare le prestazioni
ja: パフォーマンスを向上させるために、パラメーター '{0}' の型を '{1}' から '{2}' に変更します
ko: 성능 향상을 위해 '{0}' 매개 변수 형식을 '{1}'에서 '{2}'(으)로 변경하세요.
pl: Zmień typ parametru „{0}” z „{1}” na „{2}”, aby zwiększyć wydajność
pt_br: Altere o tipo de parâmetro '{0}' de '{1}' para '{2}' para melhorar o desempenho
ru: Измените тип параметра "{0}" с "{1}" на "{2}" для повышения производительности
tr: Daha iyi performans için '{1}' olan '{0}' parametre türünü '{2}' olarak değiştirin
zh_hans: 将参数“{0}”的类型从“{1}”更改为“{2}”以提高性能
zh_hant: 將參數 '{0}' 的類型從 '{1}' 變更為 '{2}' 以提高效能

# UseConcreteTypeForPropertyMessage
source: Change type of property '{0}' from '{1}' to '{2}' for improved performance
cs: Pro zlepšení výkonu změňte typ vlastnosti {0} z {1} na {2}.
de: Ändern Sie den Typ der Eigenschaft „{0}“ von „{1}“ in „{2}“, um die Leistung zu verbessern.
es: Cambie el tipo de propiedad "{0}" de "{1}" a "{2}" para mejorar el rendimiento.
fr: Modifiez le type de propriété '{0}' de '{1}' à '{2}' pour améliorer les performances
it: Modificare il tipo di proprietà '{0}' da '{1}' a '{2}' per migliorare le prestazioni
ja: パフォーマンスを向上させるために、プロパティ '{0}' の型を '{1}' から '{2}' に変更してください
ko: 성능 향상을 위해 속성 형식 '{0}'을(를) '{1}'에서 '{2}'(으)로 변경
pl: Zmień typ właściwości „{0}” z „{1}” na „{2}”, aby zwiększyć wydajność
pt_br: Altere o tipo de propriedade '{0}' de '{1}' para '{2}' para melhorar o desempenho
ru: Измените тип свойства '{0}' с '{1}' на '{2}' для повышения производительности
tr: Daha iyi performans için '{0}' özelliğinin '{1}' olan türünü '{2}' olarak değiştirin
zh_hans: 将属性 '{0}' 的类型从 '{1}'更改为 '{2}'，以提高性能
zh_hant: 將屬性 '{0}' 的型別從 '{1}' 變更為 '{2}' 以提高效能

# UseConcreteTypeTitle
source: Use concrete types when possible for improved performance
cs: Pokud je to možné, používejte konkrétní typy pro zvýšení výkonu.
de: Verwenden Sie nach Möglichkeit konkrete Typen, um die Leistung zu verbessern.
es: Usar tipos concretos cuando sea posible para mejorar el rendimiento
fr: Utiliser des types concrets si possible pour améliorer les performances
it: Usare tipi concreti quando possibile per migliorare le prestazioni
ja: 可能な場合は具象型を使用してパフォーマンスを向上させる
ko: 성능 향상을 위해 가능한 경우 구체적인 형식 사용하세요.
pl: Używaj konkretnych typów, aby zwiększyć wydajność – gdy jest to możliwe
pt_br: Usar tipos concretos quando possível para melhorar o desempenho
ru: Используйте конкретные типы, когда это возможно, для повышения производительности
tr: Daha iyi performans için mümkün olduğunda somut türler kullanın
zh_hans: 尽可能使用具体类型以提高性能
zh_hant: 盡可能使用具象類型以提高效能

source: Use Container Level Access Policy
cs: Použít zásady přístupu na úrovni kontejneru
de: Zugriffsrichtlinie auf Containerebene verwenden
es: Usar una directiva de acceso de nivel de contenedor
fr: Utiliser une stratégie d'accès au niveau du conteneur
it: Usa criteri di accesso a livello di contenitore
ja: コンテナー レベルのアクセス ポリシーを使用する
ko: 컨테이너 수준 액세스 정책 사용
pl: Użyj zasad dostępu na poziomie kontenera
pt_br: Usar Política de Acesso no Nível de Contêiner
ru: Использовать политику доступа на уровне контейнера
tr: Kapsayıcı Düzeyinde Erişim İlkesi Kullan
zh_hans: 使用容器级别访问策略
zh_hant: 使用容器層級存取原則

# UseContainerLevelAccessPolicyDescription
source: No access policy identifier is specified, making tokens non-revocable.
cs: Není zadaný žádný identifikátor zásad přístupu, a tokeny jsou proto neodvolatelné.
de: Es ist kein Zugriffsrichtlinienbezeichner angegeben, dadurch können Token nicht widerrufen werden.
es: No se ha especificado ningún identificador de directiva de acceso, por lo que los tokens no son revocables.
fr: Aucun identificateur de stratégie d'accès n'est spécifié, ce qui rend les jetons non révocables.
it: Non è specificato alcun identificatore di criterio di accesso, di conseguenza i token sono non revocabili.
ja: アクセス ポリシー識別子が指定されていません。トークンが取消可能ではなくなります。
ko: 액세스 정책 식별자가 지정되지 않아 토큰을 해지 불가능으로 만듭니다.
pl: Nie określono identyfikatora zasad dostępu, co powoduje, że tokeny są nieodwoływalne.
pt_br: Não foi especificado um identificador de política de acesso, o que torna os tokens não revogáveis.
ru: Идентификатор политики доступа не указан. Невозможно отозвать токены.
tr: Erişim ilkesi tanımlayıcısı belirtilmediğinden belirteçler iptal edilemez.
zh_hans: 未指定访问策略标识符，这使得令牌不可撤消。
zh_hant: 因為未指定任何存取原則識別碼，所以使權杖無法撤銷。

# UseContainerLevelAccessPolicyMessage
source: Consider using Azure's role-based access control instead of a Shared Access Signature (SAS) if possible. If you still need to use a SAS, use a container-level access policy when creating a SAS.
cs: Pokud je to možné, zvažte použití řízení přístupu Azure na základě role namísto sdíleného přístupového podpisu (SAS). Pokud i přesto potřebujete používat sdílený přístupový podpis, použijte při jeho vytváření zásady přístupu na úrovni kontejneru.
de: Erwägen Sie (sofern möglich) die Verwendung der rollenbasierten Zugriffssteuerung von Azure anstelle einer Shared Access Signature (SAS). Wenn Sie weiterhin eine SAS benötigen, verwenden Sie beim Erstellen einer SAS eine Zugriffsrichtlinie auf Containerebene.
es: Considere la posibilidad de usar el control de acceso basado en rol de Azure en lugar de una firma de acceso compartido (SAS), si es posible. Si tiene que usar una firma de acceso compartido, utilice una directiva de acceso de nivel de contenedor al crear dicha firma.
fr: Si possible, utilisez le contrôle d'accès en fonction du rôle d'Azure à la place d'une signature d'accès partagé. Si vous devez quand même utiliser une signature d'accès partagé, utilisez une stratégie d'accès au niveau du conteneur quand vous la créez.
it: Se possibile, provare a usare il controllo degli accessi in base al ruolo di Azure, invece della firma di accesso condiviso. Se è necessaria una firma di accesso condiviso, usare un criterio di accesso a livello di contenitore quando si crea la firma.
ja: 可能な場合は、Shared Access Signature (SAS) の代わりに、Azure のロールベースのアクセス制御を使用することを検討してください。依然として SAS を使用する必要がある場合は、SAS の作成時にコンテナーレベルのアクセス ポリシーを使用します。
ko: 가능한 경우 SAS(공유 액세스 서명) 대신 Azure의 역할 기반 액세스 제어를 사용하는 것이 좋습니다. 계속 SAS를 사용해야 하는 경우 SAS를 만들 때 컨테이너 수준 액세스 정책을 사용하세요.
pl: Jeśli to możliwe, rozważ użycie kontroli dostępu opartej na rolach platformy Azure zamiast sygnatury dostępu współdzielonego (SAS). Jeśli nadal chcesz używać sygnatury SAS, podczas jej tworzenia użyj zasad dostępu na poziomie kontenera.
pt_br: Se possível, considere usar o controle de acesso baseado em função do Azure em vez de uma SAS (Assinatura de Acesso Compartilhado). Se você ainda precisar usar uma SAS, use uma política de acesso de nível de contêiner ao criar uma SAS.
ru: Если возможно, попробуйте использовать управление доступом на основе ролей Azure, а не подписанный URL-адрес (SAS). Если все-таки требуется использовать SAS, при его создании примените политику доступа на уровне контейнера.
tr: Mümkünse Paylaşılan Erişim İmzası (SAS) yerine Azure'un rol tabanlı erişim denetimini kullanmayı düşünün. Yine de SAS kullanmanız gerekiyorsa, SAS oluştururken kapsayıcı düzeyinde bir erişim ilkesi kullanın.
zh_hans: 如果可能，请考虑使用 Azure 基于角色的访问控制，而不是共享访问签名(SAS)。如果仍需使用 SAS，请在创建 SAS 时使用容器级别访问策略。
zh_hant: 如果可行的話，請考慮從共用存取簽章 (SAS) 改為使用 Azure 的角色型存取控制。如果您仍需要使用 SAS，請於建立 SAS 時使用容器層級存取原則。

# UseDefaultDllImportSearchPathsAttribute
source: Use DefaultDllImportSearchPaths attribute for P/Invokes
cs: Používat při voláních nespravovaného kódu atribut DefaultDllImportSearchPaths
de: DefaultDllImportSearchPaths-Attribut für P/Invokes verwenden
es: Usar el atributo DefaultDllImportSearchPaths para P/Invoke
fr: Utilisez l'attribut DefaultDllImportSearchPaths pour les P/Invoke
it: Usare l'attributo DefaultDllImportSearchPaths per i P/Invoke
ja: P/Invoke に対して DefaultDllImportSearchPaths 属性を使用する
ko: P/Invokes에 DefaultDllImportSearchPaths 특성 사용
pl: Użyj atrybutu DefaultDllImportSearchPaths dla elementów P/Invoke
pt_br: Use o atributo DefaultDllImportSearchPaths para P/Invokes
ru: Используйте атрибут DefaultDllImportSearchPaths для P/Invokes.
tr: P/Invokes için DefaultDllImportSearchPaths özniteliğini kullan
zh_hans: 对 P/Invoke 使用 DefaultDllImportSearchPaths 属性
zh_hant: 針對 P/Invoke 使用 DefaultDllImportSearchPaths 屬性

# UseDefaultDllImportSearchPathsAttributeDescription
source: By default, P/Invokes using DllImportAttribute probe a number of directories, including the current working directory for the library to load. This can be a security issue for certain applications, leading to DLL hijacking.
cs: Ve výchozím nastavení se při voláních nespravovaného kódu s atributem DllImportAttribute prohledává několik adresářů včetně aktuálního pracovního adresáře pro načtení knihovny. U určitých aplikací to představuje problém zabezpečení, který může vést k napadení DLL.
de: Standardmäßig wird von P/Invokes über DllImportAttribute eine Reihe von Verzeichnissen getestet, einschließlich des aktuellen Arbeitsverzeichnisses für die zu ladende Bibliothek. Dies kann für bestimmte Anwendungen ein Sicherheitsproblem darstellen, das zu DLL-Hijacking führt.
es: De forma predeterminada, los métodos de P/Invoke que usan DllImportAttribute sondean una serie de directorios, incluido el directorio de trabajo actual para cargar la biblioteca. Esto puede suponer un problema de seguridad para algunas aplicaciones y dar lugar a que se intercepten archivos .dll.
fr: Par défaut, les P/Invoke qui utilisent DllImportAttribute sondent un certain nombre de répertoires, notamment le répertoire de travail actuel de la bibliothèque à charger. Cela peut poser un problème de sécurité pour certaines applications, et se traduire par un détournement de DLL.
it: Per impostazione predefinita, i P/Invoke che usano DllImportAttribute esaminano un certo numero di directory, tra cui la directory di lavoro corrente per la libreria da caricare. Per alcune applicazioni questo comportamento può costituire un problema di sicurezza che permette di assumere il controllo delle DLL.
ja: 既定では、DllImportAttribute を使用している P/Invoke は、ライブラリが読み込むための現在の作業ディレクトリを含むいくつかのディレクトリを精査します。これは特定のアプリケーションでセキュリティ上の問題を引き起こし、DLL のハイジャックにつながる可能性があります。
ko: 기본적으로 DllImportAttribute를 사용하는 P/Invokes는 로드할 라이브러리의 현재 작업 디렉터리를 비롯한 여러 디렉터리를 프로브합니다. 이는 특정 애플리케이션에서 DLL 하이재킹으로 이어지는 보안 문제가 될 수 있습니다.
pl: Domyślnie elementy P/Invoke korzystające z atrybutu DllImportAttribute sondują określoną liczbę katalogów, w tym bieżący katalog roboczy biblioteki do załadowania. Może to stanowić problem z zabezpieczeniami dla pewnych aplikacji i prowadzić do przejęcia biblioteki DLL.
pt_br: Por padrão, P/Invokes que usam DllImportAttribute investigam diversos diretórios, incluindo o diretório de trabalho atual, para a biblioteca carregar. Isso pode ser um problema de segurança para determinados aplicativos, levando ao sequestro de DLL.
ru: По умолчанию P/Invokes, использующий атрибут DllImportAttribute, проверяет наличие загружаемой библиотеки в нескольких каталогах, включая рабочий каталог. Это может быть проблемой безопасности для некоторых приложений и привести к захвату DLL.
tr: DllImportAttribute kullanan P/Invokesusing varsayılan olarak, yüklenecek kitaplığın geçerli çalışma dizini de dahil olmak üzere birkaç dizini araştırır. Bu, belirli uygulamalar için DLL'nin ele geçirilmesine yol açan bir güvenlik sorunu olabilir.
zh_hans: 默认情况下，使用 DllImportAttribute 探测的 P/Invoke 包含许多目录，包括要加载的库的当前工作目录。对于某些应用程序，这可能是一个安全问题，它会导致 DLL 劫持。
zh_hant: 根據預設，使用 DllImportAttribute 的 P/Invoke 會探查許多目錄，包括目前正在運作的目錄以供程式庫載入。這可能成為部分應用程式的安全性問題，導致 DLL 劫持。

# UseDefaultDllImportSearchPathsAttributeMessage
source: The method {0} didn't use DefaultDllImportSearchPaths attribute for P/Invokes.
cs: Metoda {0} nepoužila při voláních nespravovaného kódu atribut DefaultDllImportSearchPaths.
de: Die Methode "{0}" hat das DefaultDllImportSearchPaths-Attribut für P/Invokes nicht verwendet.
es: El método {0} no ha usado el atributo DefaultDllImportSearchPaths para P/Invoke.
fr: La méthode {0} n'a pas utilisé l'attribut DefaultDllImportSearchPaths pour les P/Invoke.
it: Il metodo {0} non ha usato l'attributo DefaultDllImportSearchPaths per i P/Invoke.
ja: メソッド {0} で、P/Invoke に対して DefaultDllImportSearchPaths 属性が使用されませんでした。
ko: {0} 메서드는 P/Invokes에 DefaultDllImportSearchPaths 특성을 사용하지 않았습니다.
pl: Metoda {0} nie korzystała z atrybutu DefaultDllImportSearchPaths dla elementów P/Invoke.
pt_br: O método {0} não usou o atributo DefaultDllImportSearchPaths para P/Invokes.
ru: Метод {0} не использовал атрибут DefaultDllImportSearchPaths для P/Invokes.
tr: {0} metodu P/Invokes için DefaultDllImportSearchPaths özniteliğini kullanmadı.
zh_hans: 方法 {0} 未对 P/Invoke 使用 DefaultDllImportSearchPaths 属性。
zh_hant: 方法 {0} 未針對 P/Invoke 使用 DefaultDllImportSearchPaths 屬性。

# UseDisabledMarshallingEquivalentCodeFix
source: Use equivalent code that works when marshalling is disabled
cs: Použít ekvivalentní kód, který funguje při zakázání zařazování
de: Verwenden Sie äquivalenten Code, der funktioniert, wenn Marshalling deaktiviert ist
es: Usar código equivalente que funciona cuando el marshalling está deshabilitado
fr: Utiliser un code équivalent qui fonctionne lorsque le marshaling est désactivé
it: Usare codice equivalente che funziona quando il marshalling è disabilitato
ja: マーシャリングが無効な場合に機能する同等のコードを使用する
ko: 마샬링이 비활성화된 경우 작동하는 동등한 코드 사용
pl: Użyj równoważnego kodu, który działa, gdy kierowanie jest wyłączone
pt_br: Usar código equivalente que funciona quando o marshalling está desabilitado
ru: Использование эквивалентного кода, который работает при отключенном маршалировании
tr: Sıralama devre dışı bırakıldığında çalışan eşdeğer kodu kullanın
zh_hans: 使用在禁用封送时起作用的等效代码
zh_hant: 使用停用封送處理時可運作的對等程式碼

# UseEnvironmentCurrentManagedThreadIdDescription
source: 'Environment.CurrentManagedThreadId' is simpler and faster than 'Thread.CurrentThread.ManagedThreadId'.
cs: Environment.CurrentManagedThreadId je jednodušší a rychlejší než Thread.CurrentThread.ManagedThreadId.
de: "Environment.CurrentManagedThreadId" ist einfacher und schneller als "Thread.CurrentThread.ManagedThreadId".
es: 'Environment.CurrentManagedThreadId' es más sencillo y rápido que 'Thread.CurrentThread.ManagedThreadId'.
fr: « Environment. CurrentManagedThreadId » est plus simple et plus rapide que « thread. CurrentThread. ManagedThreadId ».
it: 'Environment.CurrentManagedThreadId' è più semplice e rapido di 'Thread.CurrentThread.ManagedThreadId'.
ja: 'Environment.CurrentManagedThreadId' は、'Thread.CurrentThread.ManagedThreadId' よりもシンプルで高速です。
ko: 'Environment.CurrentManagedThreadId'는 'Thread.CurrentThread.ManagedThreadId'보다 간단하고 빠릅니다.
pl: Element „Environment. CurrentManagedThreadId” jest prostszy i szybszy niż element „Thread.CurrentThread. ManagedThreadId”.
pt_br: 'Environment.CurrentManagedThreadId' é mais simples e mais rápido do que 'Thread.CurrentThread.ManagedThreadId'.
ru: "Environment.CurrentManagedThreadId" работает проще и быстрее, чем "Thread.CurrentThread.ManagedThreadId".
tr: 'Environment.CurrentManagedThreadId', 'Thread.CurrentThread.ManagedThreadId'den daha basit ve daha hızlıdır.
zh_hans: “Environment.CurrentManagedThreadId” 比 “Thread.CurrentThread.ManagedThreadId” 更加简单快速。
zh_hant: 'Environment.CurrentManagedThreadId' 比 'Thread.CurrentThread.ManagedThreadId' 更簡單快速。

# UseEnvironmentCurrentManagedThreadIdFix
source: Use 'Environment.CurrentManagedThreadId'
cs: Použít Environment.CurrentManagedThreadId
de: "Environment.CurrentManagedThreadId" verwenden
es: Usar "Environment.CurrentManagedThreadId"
fr: Utiliser 'Environment.CurrentManagedThreadId'
it: Usare 'Environment.CurrentManagedThreadId'
ja: 'Environment.CurrentManagedThreadId' を使用する
ko: 'Environment.CurrentManagedThreadId' 사용
pl: Użyj elementu „Environment.CurrentManagedThreadId”
ru: Использовать "Environment.CurrentManagedThreadId"
tr: 'Environment.CurrentManagedThreadId' kullanın
zh_hans: 使用 “Environment.CurrentManagedThreadId”
zh_hant: 請使用 'Environment.CurrentManagedThreadId'

# UseEnvironmentCurrentManagedThreadIdMessage
source: Use 'Environment.CurrentManagedThreadId' instead of 'Thread.CurrentThread.ManagedThreadId'
cs: Místo Thread.CurrentThread.ManagedThreadId použít Environment.CurrentManagedThreadId.
de: Verwenden Sie "Environment.CurrentManagedThreadId" anstelle von "Thread.CurrentThread.ManagedThreadId".
es: Use "Environment.CurrentManagedThreadId" en lugar de "Thread.CurrentThread.ManagedThreadId".
fr: Utilisez ’Environment. CurrentManagedThreadId ’à la place de ’thread. CurrentThread. ManagedThreadId'
it: Usare 'Environment.CurrentManagedThreadId' invece di 'Thread.CurrentThread.ManagedThreadId'
ja: 'Thread.CurrentThread.ManagedThreadId' ではなく 'Environment.CurrentManagedThreadId' を使用する
ko: 'Thread.CurrentThread.ManagedThreadId' 대신 'Environment.CurrentManagedThreadId' 사용
pl: Użyj elementu „Environment. CurrentManagedThreadId” zamiast elementu „Thread.CurrentThread.ManagedThreadId”
pt_br: Use 'Environment.CurrentManagedThreadId' em vez de 'Thread.CurrentThread.ManagedThreadId'
ru: Использовать "Environment.CurrentManagedThreadId" вместо "Thread.CurrentThread.ManagedThreadId"
tr: 'Thread.CurrentThread.ManagedThreadId' yerine 'Environment.CurrentManagedThreadId' kullanın
zh_hans: 使用 “Environment.CurrentManagedThreadId” 而不是 “Thread.CurrentThread.ManagedThreadId”
zh_hant: 請使用 'Environment.CurrentManagedThreadId' 而非 'Thread.CurrentThread.ManagedThreadId'

# UseEnvironmentCurrentManagedThreadIdTitle
source: Use 'Environment.CurrentManagedThreadId'
cs: Použít Environment.CurrentManagedThreadId
de: "Environment.CurrentManagedThreadId" verwenden
es: Usar "Environment.CurrentManagedThreadId"
fr: Utiliser 'Environment.CurrentManagedThreadId'
it: Usare 'Environment.CurrentManagedThreadId'
ja: 'Environment.CurrentManagedThreadId' を使用する
ko: 'Environment.CurrentManagedThreadId' 사용
pl: Użyj elementu „Environment.CurrentManagedThreadId”
ru: Использовать "Environment.CurrentManagedThreadId"
tr: 'Environment.CurrentManagedThreadId' kullanın
zh_hans: 使用 “Environment.CurrentManagedThreadId”
zh_hant: 請使用 'Environment.CurrentManagedThreadId'
