Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AddNonSerializedAttributeCodeActionTitle
source: Add the 'NonSerialized' attribute to this field.
cs: Přidejte k tomuto poli atribut NonSerialized
de: Fügen Sie diesem Feld das Attribut "NonSerialized" hinzu.
es: Agregue el atributo "NonSerialized" a este campo.
fr: Ajoutez l'attribut 'NonSerialized' à ce champ.
it: Aggiungere l'attributo 'NonSerialized' a questo campo.
ja: このフィールドに、'NonSerialized' 属性を追加します。
ko: 이 필드에 'NonSerialized' 특성을 추가합니다.
pl: Dodaj atrybut „NonSerialized” do tego pola.
pt_br: Adicione o atributo 'NonSerialized' a esse campo.
ru: Добавьте атрибут "NonSerialized" в это поле.
tr: Bu alana 'NonSerialized' özniteliğini ekleyin.
zh_hans: 将 "NonSerialized" 特性添加到此字段。
zh_hant: 將 'NonSerialized' 屬性新增至此欄位。

# AddSerializableAttributeCodeActionTitle
source: Add Serializable attribute
cs: Přidat atribut Serializable
de: Serializable-Attribut hinzufügen
es: Agregar el atributo Serializable
fr: Ajouter l'attribut Serializable
it: Aggiungere l'attributo Serializable
ja: Serializable 属性を追加する
ko: Serializable 특성 추가
pl: Dodaj atrybut Serializable
pt_br: Adicionar o atributo Serializable
ru: Добавить атрибут Serializable
tr: Serileştirilebilir öznitelik ekle
zh_hans: 添加 Serializable 特性
zh_hant: 新增可序列化屬性

# ApprovedCipherMode
source: Review cipher mode usage with cryptography experts
cs: Zkontrolovat využití režimu šifrování s odborníky na kryptografii
de: Verwendung des Verschlüsselungsmodus mit Kryptografieexperten überprüfen
es: Revisar el uso del modo de cifrado con expertos en criptografía
fr: Passer en revue l'utilisation du mode de chiffrement avec des experts en chiffrement
it: Verificare l'utilizzo della modalità crittografia con esperti di crittografia
ja: 暗号の専門家と暗号モードの使用を再検討する
ko: 암호화 전문가와 암호화 모드 사용 현황 검토
pl: Przejrzyj użycie trybu szyfrowania wspólnie z ekspertami od kryptografii
pt_br: Examine o uso do modo de criptografia com especialistas em criptografia
ru: Проверьте используемый режим шифрования с экспертами по криптографии
tr: Şifreleme uzmanları ile şifreleme modu kullanımını gözden geçirin
zh_hans: 与加密专家一起审阅密码模式使用情况
zh_hant: 與加密專家一同審查 Cipher 模式使用方式

# ApprovedCipherModeDescription
source: These cipher modes might be vulnerable to attacks. Consider using recommended modes (CBC, CTS).
cs: Tyto režimy šifrování můžou být ohrožené útoky. Zvažte možnost použít doporučené režimy (CBC, CTS).
de: Diese Verschlüsselungsmodi sind möglicherweise anfällig für Angriffe. Erwägen Sie die Verwendung empfohlener Modi (CBC, CTS).
es: Estos modos de cifrado pueden ser vulnerables a ataques. Use los modos recomendados (CBC, CTS).
fr: Ces modes de chiffrement peuvent être vulnérables aux attaques. Utilisez les modes recommandés (CBC, CTS).
it: Queste modalità di crittografia potrebbero essere vulnerabili ad attacchi. Provare a usare le modalità consigliate (CBC, CTS).
ja: これらの暗号モードは攻撃に対して脆弱である可能性があります。推奨モード (CBC、CTS) の使用をご検討ください。
ko: 이 암호화 모드는 공격에 취약할 수 있습니다. 권장 모드(CBC, CTS)를 사용하는 것이 좋습니다.
pl: Te tryby szyfrowania mogą być podatne na ataki. Rozważ użycie zalecanych trybów (CBC, CTS).
pt_br: Esses modos de criptografia podem ser vulneráveis a ataques. Considere o uso dos modos recomendados (CBC, CTS).
ru: Эти режимы шифрования могут быть уязвимы для атак. Используйте рекомендуемые режимы (CBC, CTS).
tr: Bu şifreleme modları saldırılara karşı savunmasız olabilir. Önerilen modları (CBC, CTS) kullanmayı düşünün.
zh_hans: 这些密码模式可能易受攻击。请考虑使用建议的模式(CBC、CTS)。
zh_hant: 這些 Cipher 模式可能容易遭受攻擊。請考慮使用建議的模式 (CBC、CTS)。

# ApprovedCipherModeMessage
source: Review the usage of cipher mode '{0}' with cryptography experts. Consider using recommended modes (CBC, CTS).
cs: Zkontrolujte využití režimu šifrování {0} s odborníky na kryptografii. Zvažte možnost použít doporučené režimy (CBC, CTS).
de: Überprüfen Sie die Verwendung des Verschlüsselungsmodus "{0}" mit Kryptografieexperten. Erwägen Sie die Verwendung empfohlener Modi (CBC, CTS).
es: Revise el uso del modo de cifrado "{0}" con expertos en criptografía. Use los modos recomendados (CBC, CTS).
fr: Passez en revue l'utilisation du mode de chiffrement '{0}' avec des experts en chiffrement. Utilisez les modes recommandés (CBC, CTS).
it: Verificare l'utilizzo della modalità crittografia '{0}' con esperti di crittografia. Provare a usare le modalità consigliate (CBC, CTS).
ja: 暗号の専門家と暗号モード '{0}' の使用を再検討してください。推奨モード (CBC、CTS) の使用をご検討ください。
ko: 암호화 전문가와 암호화 모드 '{0}'의 사용 현황을 검토합니다. 권장 모드(CBC, CTS)를 사용하는 것이 좋습니다.
pl: Przejrzyj użycie trybu szyfrowania „{0}” wspólnie z ekspertami od kryptografii. Rozważ użycie zalecanych trybów (CBC, CTS).
pt_br: Examine o uso do modo de criptografia '{0}' com especialistas em criptografia. Considere o uso dos modos recomendados (CBC, CTS).
ru: Проверьте используемый режим шифрования "{0}" с экспертами по криптографии. Используйте рекомендуемые режимы (CBC, CTS).
tr: Şifreleme uzmanlarıyla '{0}' şifreleme modunun kullanımını gözden geçirin. Önerilen modları (CBC, CTS) kullanmayı düşünün.
zh_hans: 与加密专家一起审阅密码模式“{0}”的使用情况。请考虑使用建议的模式(CBC、CTS)。
zh_hant: 與加密專家一同審查 Cipher 模式 '{0}' 的使用方式。請考慮使用建議的模式 (CBC、CTS)。

# AttributeStringLiteralsShouldParseCorrectlyDescription
source: The string literal parameter of an attribute does not parse correctly for a URL, a GUID, or a version.
cs: Pro adresu URL, identifikátor GUID nebo verzi se nesprávně parsuje parametr literálu řetězce nějakého atributu.
de: Der Zeichenfolgenliteralparameter eines Attributs wird für eine URL, eine GUID oder eine Version nicht richtig analysiert.
es: El parámetro de literal de cadena de un atributo no se analiza correctamente para una dirección URL, un GUID o una versión.
fr: Le paramètre de littéral de chaîne d'un attribut n'est pas correctement analysé pour une URL, un GUID ou une version.
it: Il parametro del valore letterale stringa di un attributo non viene analizzato correttamente per un URL, un GUID o una versione.
ja: 属性の文字列リテラル パラメーターが URL、GUID、またはバージョンを正しく解析しません。
ko: 특성의 문자열 리터럴 매개 변수가 URL, GUID 또는 버전에 대해 올바르게 구문 분석되지 않습니다.
pl: Analiza parametru literału ciągu atrybutu pod kątem adresu URL, identyfikatora GUID lub wersji nie powiodła się.
pt_br: O parâmetro literal de cadeia de caracteres de um atributo não é analisado corretamente para uma URL, um GUID ou uma versão.
ru: Параметр строкового литерала атрибута анализируется неправильно для URL-адреса, GUID или версии.
tr: Bir URL, GUID veya sürüm için bir özniteliğin dize sabit değeri parametresi doğru ayrıştırılmıyor.
zh_hans: 特性的字符串文本参数未正确解析 URL、GUID 或版本。
zh_hant: 屬性的字串常值參數並未正確剖析 URL、GUID 或版本。

# AttributeStringLiteralsShouldParseCorrectlyMessageDefault
source: In the constructor of '{0}', change the value of argument '{1}', which is currently "{2}", to something that can be correctly parsed as '{3}'
cs: V konstruktoru {0} změňte hodnotu argumentu {1}, která je aktuálně {2}, na hodnotu, která se dá správně parsovat jako {3}.
de: Ändern Sie im Konstruktor von "{0}" den Wert des Arguments "{1}", zurzeit "{2}", in einen Wert, der korrekt als "{3}" analysiert werden kann.
es: En el constructor de "{0}", cambie el valor del argumento "{1}", que es actualmente "{2}", a otro que se pueda analizar correctamente como "{3}".
fr: Dans le constructeur de '{0}', changez la valeur de l'argument '{1}', qui correspond à "{2}", et remplacez-la par une valeur pouvant être analysée correctement en tant que '{3}'
it: Nel costruttore di '{0}' modificare il valore dell'argomento '{1}', che è attualmente "{2}", in un valore correttamente analizzabile come '{3}'
ja: '{0}' のコンストラクター内にある引数 '{1}' の値 (現在は "{2}") を、'{3}' として正しく解析できる値に変更してください
ko: '{0}'의 생성자에서 현재 "{2}"인 '{1}' 인수 값을 '{3}'(으)로 올바르게 구문 분석될 수 있는 다른 값으로 변경하세요.
pl: W konstruktorze typu „{0}” zmień wartość argumentu „{1}” (aktualnie „{2}”) na wartość, którą można poprawnie przeanalizować jako „{3}”
pt_br: No construtor de '{0}', altere o valor do argumento '{1}', o qual atualmente é "{2}", para algo que possa ser analisado corretamente como '{3}'
ru: В конструкторе "{0}" измените аргумент "{1}", который сейчас равен "{2}", на значение, обеспечивающее правильный анализ в качестве "{3}".
tr: '{0}' öğesinin oluşturucusunda '{1}' bağımsız değişkeninin şu anda "{2}" olan değerini, '{3}' olarak doğru bir şekilde ayrıştırılabilecek bir değere değiştirin
zh_hans: 在“{0}”的构造函数中，将参数“{1}”的当前值“{2}”更改为可正确解析为“{3}”的某个值
zh_hant: 在 '{0}' 的建構函式中，將目前為 "{2}" 的引數值 '{1}'，變更為可正確剖析成 '{3}' 的值

# AttributeStringLiteralsShouldParseCorrectlyMessageEmpty
source: In the constructor of '{0}', change the value of argument '{1}', which is currently an empty string (""), to something that can be correctly parsed as '{2}'
cs: V konstruktoru {0} změňte hodnotu argumentu {1}, která je aktuálně prázdný řetězec (""), na hodnotu, která se dá správně parsovat jako {2}.
de: Ändern Sie im Konstruktor von "{0}" den Wert des Arguments "{1}", zurzeit eine leere Zeichenfolge (""), in einen Wert, der korrekt als "{2}" analysiert werden kann.
es: En el constructor de "{0}", cambie el valor del argumento "{1}", que es actualmente una cadena vacía (""), a otro que se pueda analizar correctamente como "{2}".
fr: Dans le constructeur de '{0}', changez la valeur de l'argument '{1}', qui correspond à une chaîne vide (""), et remplacez-la par une valeur pouvant être analysée correctement en tant que '{2}'
it: Nel costruttore di '{0}' modificare il valore dell'argomento '{1}', che è attualmente una stringa vuota (""), in un valore correttamente analizzabile come '{2}'
ja: '{0}' のコンストラクター内にある引数 '{1}' の値は現在空の文字列 ("") になっています。'{2}' として正しく解析できる値に変更してください
ko: '{0}'의 생성자에서 현재 빈 문자열("")인 '{1}' 인수 값을 '{2}'(으)로 올바르게 구문 분석될 수 있는 다른 값으로 변경하세요.
pl: W konstruktorze typu „{0}” zmień wartość argumentu „{1}” (aktualnie pusty ciąg — "") na wartość, którą można poprawnie przeanalizować jako „{2}”
pt_br: No construtor de '{0}', altere o valor do argumento '{1}', o qual é uma cadeia de caracteres vazia (""), para algo que possa ser analisado corretamente como '{2}'
ru: В конструкторе "{0}" измените аргумент "{1}", который сейчас равен пустой строке (""), на значение, обеспечивающее правильный анализ в качестве "{2}".
tr: '{0}' öğesinin oluşturucusunda '{1}' bağımsız değişkeninin şu anda boş bir dize ("") olan değerini, '{2}' olarak doğru bir şekilde ayrıştırılabilecek bir değere değiştirin
zh_hans: 在“{0}”的构造函数中，将参数“{1}”的值(此值当前为空字符串(""))更改为可正确解析为“{2}”的某个值
zh_hant: 在 '{0}' 的建構函式中，將目前為空字串 ("") 的引數值 '{1}'，變更為可正確剖析成 '{2}' 的值

# AttributeStringLiteralsShouldParseCorrectlyTitle
source: Attribute string literals should parse correctly
cs: Literály řetězců atributů by se měly správně parsovat
de: Attributzeichenfolgenliterale müssen richtig analysiert werden
es: Los literales de cadena de atributo se deben analizar correctamente
fr: Les littéraux de chaîne d'attribut doivent être analysés correctement
it: I valori letterali stringa dell'attributo devono essere analizzati correttamente
ja: 属性文字列リテラルは、正しく解析する必要があります
ko: 특성 문자열 리터럴이 올바르게 구문 분석되어야 합니다.
pl: Analiza literałów ciągu atrybutu powinna kończyć się powodzeniem
pt_br: Literais de cadeias de caracteres de atributos devem ser analisados corretamente
ru: Синтаксический анализ строковых литералов атрибута должен осуществляться правильно
tr: Öznitelik dizesinin sabit değerleri doğru ayrıştırılmalıdır
zh_hans: 特性字符串文本应正确分析
zh_hant: 屬性字串常值應正確剖析

# AvoidConstArraysCodeFixTitle
source: Extract to static readonly field
cs: Extrahovat do statického pole jen pro čtení
de: In statisches schreibgeschütztes Feld extrahieren
es: Extraer en campo estático de solo lectura
fr: Extraire dans un champ readonly statique
it: Estrarre nel campo statico di sola lettura
ja: 静的な読み取り専用フィールドに抽出する
ko: 정적 읽기 전용 필드로 추출
pl: Wyodrębnij do statycznego pola tylko do odczytu
pt_br: Extrair para o campo somente leitura estático
ru: Извлечь в поле "static readonly"
tr: Statik salt okunur alana ayıklayın
zh_hans: 提取到 static readonly 字段
zh_hant: 解壓縮至靜態唯讀欄位

# AvoidConstArraysDescription
source: Constant arrays passed as arguments are not reused when called repeatedly, which implies a new array is created each time. Consider extracting them to 'static readonly' fields to improve performance if the passed array is not mutated within the called method.
cs: Konstantní pole předaná jako argumenty se při opakovaném volání znovu nepoužívají, což znamená, že se pokaždé vytvoří nové pole. Zvažte možnost extrahovat je do polí static readonly, aby se zlepšil výkon, pokud předané pole není mutované v rámci volané metody.
de: Konstantenarrays, die als Argumente übergeben werden, werden beim wiederholten Aufruf nicht wiederverwendet, was bedeutet, dass jedes Mal ein neues Array erstellt wird. Ziehen Sie in Betracht, sie in "static readonly"-Felder zu extrahieren, um die Leistung zu verbessern, wenn das übergebene Array nicht innerhalb der aufgerufenen Methode mutiert wird.
es: Las matrices constantes pasadas como argumentos no se reutilizan cuando se llaman repetidamente, lo que implica que se cree una nueva matriz cada vez. Considere la posibilidad de extraerlas a campos "static readonly" para mejorar el rendimiento si la matriz pasada no se muta dentro del método llamado.
fr: Les tableaux constants passés en argument ne sont pas réutilisés en cas d’appels répétés, ce qui implique la création d’un nouveau tableau à chaque fois. Envisagez de les extraire vers des champs « static readonly » pour améliorer le niveau de performance si le tableau passé n’est pas modifié au sein de la méthode appelée.
it: Le matrici costanti passate come argomenti non vengono riutilizzate quando vengono chiamate ripetutamente, il che implica la creazione di una nuova matrice ogni volta. Prova a estrarli in campi 'static readonly' per migliorare le prestazioni, se la matrice passata non viene modificata all'interno del metodo chiamato.
ja: 引数として渡された定数配列は、繰り返し呼び出されても再利用されません。これは、毎回新しい配列が作成されることを意味します。渡された配列が呼び出されたメソッド内で変更されていない場合、パフォーマンスを向上させるために、それらを 'static readonly' フィールドに抽出することを検討してください。
ko: 인수로 전달된 상수 배열은 반복적으로 호출될 때 다시 사용되지 않으며, 이는 매번 새 배열이 생성됨을 의미합니다. 전달된 배열이 호출된 메서드 내에서 변경되지 않은 경우 'static readonly' 필드에 추출하여 성능을 향상하는 것이 좋습니다.
pl: Stałe macierze przekazywane jako argumenty nie są ponownie wykorzystywane podczas wielokrotnego wywoływania, co oznacza, że za każdym razem tworzona jest nowa macierz. Rozważ wyodrębnienie ich do pól 'static readonly', aby poprawić wydajność, jeśli przekazana macierz nie zostanie zmutowana w wywołanej metodzie.
pt_br: Matrizes constantes passadas como argumentos não são reutilizadas quando chamadas repetidamente, o que implica uma nova matriz sendo criada a cada vez. Considere extraí-las para campos 'static readonly' para melhorar o desempenho se a matriz passada não for modificada dentro do método chamado.
ru: Постоянные массивы, передаваемые в качестве аргументов, не будут использоваться при повторном вызове, что подразумевает создание нового массива каждый раз. Попробуйте извлечь их в статичные поля, доступные только для чтения ("static readonly"), чтобы повысить производительность, если переданный массив не был изменен в вызываемом методе.
tr: Bağımsız değişkenler olarak geçirilen sabit diziler art arda çağrıldığında yeniden kullanılmaz, yani her seferinde yeni bir dizi oluşturulur. Geçirilen dizi çağrılan yöntem içinde değiştirilmezse performansı iyileştirmek için 'static readonly' alanlarına ayıklamayı deneyin.
zh_hans: 重复调用时不会重复使用作为参数传递的常量数组，这意味着每次都会创建一个新数组。如果所传递的数组未在调用的方法中发生改变，请考虑将其提取到 "static readonly" 字段以提高性能。
zh_hant: 重複呼叫時不會重複使用以引數傳遞的常數陣列，這表示每次都會建立新的陣列。如果傳遞的陣列在呼叫的方法中未變動，請考慮將它們解壓縮至 'static readonly' 欄位，以提升效能。

# AvoidConstArraysMessage
source: Prefer 'static readonly' fields over constant array arguments if the called method is called repeatedly and is not mutating the passed array
cs: Upřednostňovat pole „static readonly“ před argumenty konstantního pole, pokud se volaná metoda volá opakovaně a nemutuje předané pole
de: "static readonly"-Felder gegenüber konstanten Arrayargumenten bevorzugen, wenn die aufgerufene Methode wiederholt aufgerufen wird und das übergebene Array nicht mutiert
es: Preferir campos "static readonly" frente a argumentos de matriz constantes si se llama repetidamente al método llamado y no muta la matriz pasada
fr: Préférer les champs 'static readonly' aux arguments de tableau de constantes si la méthode appelée est appelée à plusieurs reprises et ne mute pas le tableau passé
it: Preferisci i campi 'static readonly' rispetto agli argomenti di matrice costanti se il metodo chiamato viene chiamato ripetutamente e non modifica la matrice passata
ja: 呼び出されるメソッドが繰り返し呼び出され、渡された配列を変更しない場合は、定数配列引数よりも 'static readonly' フィールドを優先します。
ko: 호출된 메서드가 반복적으로 호출되고 전달된 배열을 변경하지 않는 경우 상수 배열 인수보다 'static readonly' 필드를 사용하세요.
pl: Preferowanie pól 'static readonly' zamiast stałych argumentów macierzy, jeśli wywoływana metoda jest wywoływana wielokrotnie i nie mutuje przekazanej macierzy .
pt_br: Prefira campos 'static readonly' em vez de argumentos de matriz constante se o método chamado for chamado repetidamente e não estiver modificando a matriz passada
ru: Выбирать статичные поля, доступные только для чтения ("static readonly"), вместо аргументов постоянного массива, если вызываемый метод вызывается повторно и не изменяет переданный массив
tr: Çağrılan yöntem art arda çağrılırsa ve geçirilen diziyi değiştirmezse 'static readonly' alanları sabit dizi bağımsız değişkenlerine tercih edilir
zh_hans: 如果调用的方法重复调用且未改变传递的数组，则首选 "static readonly" 字段而不是常量数组参数
zh_hant: 如果重複以呼叫的方法進行呼叫且未變動傳遞的陣列，則優先使用 'static readonly' 欄位，而不是常數陣列引數

# AvoidConstArraysTitle
source: Avoid constant arrays as arguments
cs: Vyhněte se konstantním polím jako argumentům
de: Konstantenmatrizen als Argumente vermeiden
es: Evitar matrices constantes como argumentos
fr: Éviter les tableaux constants en tant qu’arguments
it: Evitare matrici costanti come argomenti
ja: 引数として定数配列を使用しない
ko: 상수 배열을 인수로 사용하지 않습니다.
pl: Unikaj tablic stałych jako argumentów
pt_br: Evite matrizes constantes como argumentos
ru: Избегайте использования константных массивов в качестве аргументов
tr: Sabit dizileri bağımsız değişkenler olarak kullanmaktan sakının
zh_hans: 不要将常量数组作为参数
zh_hant: 避免常數陣列作為引數

# AvoidPotentiallyExpensiveCallWhenLoggingDescription
source: In many situations, logging is disabled or set to a log level that results in an unnecessary evaluation for this argument.
cs: V mnoha situacích je protokolování zakázáno nebo nastaveno na úroveň protokolu, která má za následek zbytečné vyhodnocení tohoto argumentu.
de: In vielen Situationen ist die Protokollierung deaktiviert oder auf einen Protokollierungsgrad festgelegt, der zu einer unnötigen Auswertung dieses Arguments führt.
es: En muchas situaciones, el registro se deshabilita o se establece en un nivel de registro que da como resultado una evaluación innecesaria para este argumento.
fr: Dans de nombreuses situations, la journalisation est désactivée ou configurée à un niveau qui entraîne une évaluation inutile pour cet argument.
it: In molte situazioni, la registrazione è disabilitata o impostata su un livello di log che comporta una valutazione non necessaria per questo argomento.
ja: 多くの場合、ログは無効化されているか、この引数に対して不要な評価を引き起こすログ レベルに設定されています。
ko: 많은 상황에서 로깅이 비활성화되거나 이 인수에 대해 불필요한 평가가 발생하는 로그 수준으로 설정됩니다.
pl: W wielu sytuacjach rejestrowanie jest wyłączone lub ustawione na poziom dziennika, co powoduje niepotrzebną ocenę tego argumentu.
pt_br: Em muitas situações, o registro em log é desabilitado ou configurado para um nível de log que resulta em uma avaliação desnecessária para este argumento.
ru: Во многих ситуациях ведение журнала отключено или установлено на уровне, который приводит к ненужной оценке этого аргумента.
tr: Birçok durumda günlüğe kaydetme devre dışı bırakılır ya da bu bağımsız değişken için gereksiz bir değerlendirmeye yol açacak düzeyde sonuçları günlüğe kaydedecek şekilde ayarlanır.
zh_hans: 在许多情况下，日志记录会被禁用，或设置为导致对此参数进行不必要的计算的日志级别。
zh_hant: 在許多情況下，記錄會被停用或設定為某個記錄層級，這會導致此引數進行不必要的評估。

# AvoidPotentiallyExpensiveCallWhenLoggingMessage
source: Evaluation of this argument may be expensive and unnecessary if logging is disabled
cs: Vyhodnocení tohoto argumentu může být nákladné a zbytečné, pokud je protokolování zakázané.
de: Die Auswertung dieses Arguments kann kostspielig und unnötig sein, wenn die Protokollierung deaktiviert ist.
es: La evaluación de este argumento puede ser costosa e innecesaria si el registro está deshabilitado
fr: L’évaluation de cet argument peut être coûteuse et inutile si la journalisation est désactivée
it: La valutazione di questo argomento può essere dispendiosa e non necessaria se la registrazione è disabilitata
ja: ログが無効になっている場合、この引数の評価は高価で不要である可能性があります
ko: 로깅이 비활성화되면 이 인수를 평가하는 데 비용이 많이 들고 불필요할 수 있습니다.
pl: Ocena tego argumentu może być kosztowna i niepotrzebna, jeśli rejestrowanie jest wyłączone
pt_br: A avaliação deste argumento pode ser cara e desnecessária se o registro em log estiver desabilitado
ru: Оценка этого аргумента может быть ресурсоемкой и ненужной, если ведение журнала отключено
tr: Günlüğe kaydetme devre dışı bırakılırsa bu bağımsız değişkenin değerlendirmesi pahalı ve gereksiz olabilir
zh_hans: 如果禁用日志记录，则计算此参数可能会成本高昂且不必要
zh_hant: 如果停用記錄，則此引數的評估可能會非常昂貴且不必要

# AvoidPotentiallyExpensiveCallWhenLoggingTitle
source: Avoid potentially expensive logging
cs: Vyhněte se potenciálně nákladnému protokolování
de: Potenziell kostspielige Protokollierung vermeiden
es: Evitar el registro potencialmente costoso
fr: Évitez une journalisation potentiellement coûteuse
it: Evita la registrazione potenzialmente costosa
ja: 潜在的に高価なログを避ける
ko: 비용이 많이 드는 로깅을 피하세요
pl: Unikaj potencjalnie kosztownego rejestrowania
pt_br: Evitar registros em log que possam ser caros
ru: Избегайте потенциально ресурсоемкого ведения журнала
tr: Pahalı olabilecek günlüğe kaydetme işlemlerinden kaçının
zh_hans: 避免进行可能成本高昂的日志记录
zh_hant: 避免潛在的昂貴記錄
