Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseSpanClearInsteadOfFillMessage
source: Prefer 'Span<T>.Clear()' instead of 'Span<T>.Fill(default)'
cs: Preferovat Span<T>.Clear() místo Span<T>.Fill(default)
de: „Span<T>.Clear()“ anstelle von „Span<T>.Fill(default)“ bevorzugen
es: Preferir "Span<T>.Clear()" en lugar de "Span<T>.Fill(default)"
fr: Préférez 'Span<T>.Clear()' au lieu de 'Span<T>.Fill(default)'
it: Preferisci 'Span<T>. Clear()' anziché 'Span<T>. Riempimento (predefinito)'
ja: 'Span<T>.Fill(default)' の代わりに 'Span<T>.Clear()' を優先する
ko: 'Span<T>.Fill(기본값)'보다 'Span<T>.Clear()' 선호
pl: Preferuj polecenie „Span<T>. Clear()” zamiast „Span<T>. Fill(domyślnie)”
pt_br: Preferir 'Span<T>.Clear()' em vez de 'Span<T>.Fill(default)'
ru: Предпочитать "Span<T>.Clear()" вместо "Span<T>.Fill(default)"
tr: 'Span<T>.Fill(default)' yerine 'Span<T>.Clear()' tercih et
zh_hans: 首选“Span<T>.Clear()”而不是“Span<T>.Fill(default)”
zh_hant: 優先使用 'Span<T>.Clear()'，而不是 'Span<T>.Fill(default)'

# UseSpanClearInsteadOfFillTitle
source: Prefer 'Clear' over 'Fill'
cs: Preferovat možnost Vymazat před možností Fill
de: „Clear“ vor „Fill“ bevorzugen
es: Preferir "Clear" en lugar de "Fill"
fr: Préférer 'Effacer' à 'Remplissage'
it: Preferisci 'Cancella' a 'Riempimento'
ja: '塗りつぶし' よりも 'クリア' を優先する
ko: '채우기'보다 '지우기' 선호
pl: Preferuj opcję „Wyczyść” niż „Wypełnij”
pt_br: Preferir 'Clear' ao invés de 'Fill'
ru: Предпочитать "Clear" вместо "Fill"
tr: 'Fill' yerine 'Clear' tercih et
zh_hans: 首选“清除”而不是“填充”
zh_hant: 優先使用 'Clear' 而不是 'Fill'

# UseStartsWithInsteadOfIndexOfComparisonWithZeroCodeFixTitle
source: Use 'StartsWith'
cs: Použít StartsWith
de: „StartsWith“ verwenden
es: Usar "StartsWith"
fr: Utiliser « StartsWith »
it: Usare 'StartsWith'
ja: 'StartsWith' を使用する
ko: 'StartsWith' 사용
pl: Użyj instrukcji „StartsWith”
pt_br: Usar "StartsWith"
ru: Используйте "'StartsWith"
tr: 'StartsWith' kullanın
zh_hans: 使用 "StartsWith"
zh_hant: 使用 'StartsWith'

# UseStartsWithInsteadOfIndexOfComparisonWithZeroDescription
source: It is both clearer and faster to use 'StartsWith' instead of comparing the result of 'IndexOf' to zero.
cs: Oproti porovnání výsledku IndexOf s hodnotou nula je použití startsWith srozumitelnější a rychlejší.
de: Es ist übersichtlicher und schneller, „StartsWith“ zu verwenden, statt das Ergebnis von „IndexOf“ mit null zu vergleichen.
es: Es más claro y rápido usar "StartsWith" en lugar de comparar el resultado de "IndexOf" con cero.
fr: Il est à la fois plus clair et plus rapide d’utiliser « StartsWith » au lieu de comparer le résultat de « IndexOf » à zéro.
it: È più chiaro e veloce usare 'StartsWith' anziché confrontare il risultato di 'IndexOf' con zero.
ja: 'IndexOf' の結果を 0 と比較するのではなく、'StartsWith' を使用する方が明確で迅速です。
ko: 'IndexOf'의 결과를 0과 비교하는 대신 'StartsWith'를 사용하는 것이 더 명확하고 빠릅니다.
pl: Użycie instrukcji „StartsWith” jest wyraźniejsze i szybsze niż porównywanie wyniku „IndexOf” z wartością zero.
pt_br: É mais claro e mais rápido usar "StartsWith" em vez de comparar o resultado de "IndexOf" com zero.
ru: Использовать "StartsWith" вместо сравнения результата "IndexOf" с нулем понятнее и быстрее.
tr: 'IndexOf' sonucunu sıfır ile karşılaştırmak yerine 'StartsWith' kullanmak hem daha net hem de daha hızlı.
zh_hans: 相较于将 "IndexOf" 的结果与零进行比较，使用 "StartsWith" 既更清晰又更快。
zh_hant: 使用 'StartsWith' 更清楚且更快速，而不是將 'IndexOf' 的結果與 0 比較。

# UseStartsWithInsteadOfIndexOfComparisonWithZeroMessage
source: Use 'StartsWith' instead of comparing the result of 'IndexOf' to 0
cs: Místo porovnání výsledku IndexOf s hodnotou 0 použijte StartsWith.
de: Verwenden Sie „StartsWith“, statt das Ergebnis von „IndexOf“ mit 0 zu vergleichen
es: Use "StartsWith" en lugar de comparar el resultado de "IndexOf" con 0.
fr: Utiliser « StartsWith » au lieu de comparer le résultat de « IndexOf » à 0
it: Usare 'StartsWith' anziché confrontare il risultato di 'IndexOf' con 0
ja: 'IndexOf' の結果を 0 と比較するのではなく、'StartsWith' を使用します
ko: 'IndexOf'의 결과를 0과 비교하는 대신 'StartsWith' 사용
pl: Użyj instrukcji „StartsWith” zamiast porównywania wyniku „IndexOf” z wartością 0
pt_br: Usar "StartsWith" em vez de comparar o resultado de "IndexOf" com 0
ru: Используйте "StartsWith" вместо сравнения результата "IndexOf" с 0
tr: 'IndexOf' sonucunu 0 ile karşılaştırmak yerine 'StartsWith' kullanın
zh_hans: 使用 "StartsWith"，而不是将 "IndexOf" 的结果与 0 进行比较
zh_hant: 使用 'StartsWith' 而不是將 'IndexOf' 的結果與 0 比較

# UseStartsWithInsteadOfIndexOfComparisonWithZeroTitle
source: Use 'StartsWith' instead of 'IndexOf'
cs: Namísto IndexOf použijte StartsWith
de: „StartsWith“ statt „IndexOf“ verwenden
es: Usar "StartsWith" en lugar de "IndexOf"
fr: Utiliser « StartsWith » à la place de « IndexOf »
it: Usare 'StartsWith' anziché 'IndexOf'
ja: 'IndexOf' の代わりに 'StartsWith' を使用する
ko: 'IndexOf' 대신 'StartsWith' 사용
pl: Użyj instrukcji „StartsWith” zamiast „IndexOf”
pt_br: Usar "StartsWith" em vez de "IndexOf"
ru: Используйте "StartsWith" вместо "IndexOf"
tr: 'IndexOf' yerine 'StartsWith' kullanın
zh_hans: 使用 "StartsWith" 而不是 "IndexOf"
zh_hant: 使用 'StartsWith' 代替 'IndexOf'

# UseStringContainsCharOverloadWithSingleCharactersDescription
source: 'string.Contains(char)' is available as a better performing overload for single char lookup.
cs: string.Contains(char) je k dispozici jako výkonnější přetížení pro vyhledávání s jedním znakem.
de: "string.Contains(char)" ist als leistungsfähigere Überladung für die Suche nach einzelnen Zeichen verfügbar.
es: 'string.Contains(char)' está disponible como una sobrecarga de mejor rendimiento para la búsqueda de caracteres únicos.
fr: String. Contains (Char)» est disponible en tant que surcharge d’amélioration pour une recherche de caractère unique.
it: Per la ricerca di caratteri singoli è possibile usare come overload 'string.Contains(char)' che offre prestazioni migliori.
ja: 'string.Contains(char)' は、単一文字検索のパフォーマンスのより高いオーバーロードとして使用できます。
ko: 'string.Contains(char)'는 단일 문자 조회를 위한 더 나은 성능의 오버로드로 사용할 수 있습니다.
pl: Ciąg „string.Contains(char)” jest dostępny jako przeciążenie o lepszej wydajności dla wyszukiwania pojedynczego znaku.
pt_br: 'cadeia de caracteres. Contains(char)' está disponível como uma sobrecarga de melhor desempenho para pesquisa de caractere único.
ru: "string.Contains(char)" доступен в качестве перегрузки с улучшенной производительностью для поиска одного знака.
tr: 'string.Contains(char)' tek karakter araması için daha iyi performanslı bir aşırı yükleme olarak kullanılabilir.
zh_hans: “string.Contains(char)” 可用作用于单个字符查找的性能更好的重载。
zh_hant: 'string.Contains(char)' 對單一字元查閱而言可做為更佳的執行多載。

# UseStringContainsCharOverloadWithSingleCharactersMessage
source: Use 'string.Contains(char)' instead of 'string.Contains(string)' when searching for a single character
cs: Při hledání jednoho znaku použijte string.Contains(char) místo string.Contains(řetězec)
de: Verwenden Sie "string.Contains(char)" anstelle von "string.Contains(string)" bei der Suche nach einem einzelnen Zeichen.
es: Use 'string.Contains(char)' en lugar de 'string.Contains(string)' al buscar un solo carácter
fr: Utilisez ’String. Contient (Char)' à la place de ’String. Contains (String)' lors de la recherche d’un caractère unique
it: Usare 'string.Contains(char)' invece di 'string.Contains(string)' durante la ricerca di un singolo carattere
ja: 単一の文字を検索する場合には 'string.Contains(char)' ではなく、'string' を使用します。
ko: 단일 문자 검색 시 'string.Contains(string)' 대신 'string.Contains(char)' 사용
pl: Użyj ciągu „string.Contains(char)”, zamiast ciągu „string.Contains(string)” podczas wyszukiwania pojedynczego znaku
pt_br: Use 'string. Contains(char)' em vez de 'string. Contains(string)' ao procurar um único caractere
ru: Использовать "string.Contains(char)" вместо "string.Contains(string)" при поиске одного знака
tr: Tek bir karakter ararken 'string.Contains(string)' yerine 'string.Contains(char)' kullanın
zh_hans: 在搜索单个字符时使用 “string.Contains(char)” 而不是 “string.Contain(string)”
zh_hant: 請在搜尋單一字元時使用 'string.Contains(char)' 而非 'string.Contains(string)'

# UseStringContainsCharOverloadWithSingleCharactersTitle
source: Use char literal for a single character lookup
cs: Použít znakový literál pro vyhledávání s jedním znakem
de: Zeichenliteral für die Suche nach einem einzelnen Zeichen verwenden
es: Usar literal de carácter para una búsqueda de caracteres individuales
fr: Utiliser le littéral char pour une recherche à caractère unique
it: Usare il valore letterale char per la ricerca di un singolo carattere
ja: 1 つの文字参照に単一文字検索を使用する
ko: 단일 문자 조회에 char 리터럴 사용
pl: Użyj literału char do wyszukiwania pojedynczego znaku
pt_br: Usar o literal char para uma pesquisa de caractere único
ru: Использовать знаковый литерал для поиска одного знака
tr: Tek bir karakter araması için sabit değerli karakter kullanın
zh_hans: 将字符型文本用于单个字符查找
zh_hant: 請為單一字元查閱使用字元常值

# UseStringEqualsOverStringCompareCodeFixTitle
source: Use 'string.Equals'
cs: Použít string.Equals
de: "string.Equals" verwenden
fr: Utilisez ’String. Equals
it: Usare 'string.Equals'
ja: 'string.Equals' を使用します。
ko: 'string.Equals' 사용
pl: Użyj ciągu „string. Equals”
pt_br: Use 'string. Igual a'
ru: Использовать "string.Equals"
tr: 'string.Equals' kullanın
zh_hans: 使用 “string.Equals”
zh_hant: 請使用 'string.Equals'

# UseStringEqualsOverStringCompareDescription
source: It is both clearer and likely faster to use 'string.Equals' instead of comparing the result of 'string.Compare' to zero.
cs: Použití string.Equals je jasnější a pravděpodobně rychlejší namísto porovnávání výsledku string.Compare s nulou.
de: Die Verwendung von "string.Equals" ist sowohl klarer als auch wahrscheinlich schneller als das Vergleichen des Ergebnisses von "string.Compare" mit null.
es: Es más claro y probablemente más rápido usar 'string.Equals' en lugar de comparar el resultado de 'string.Compare' con cero.
fr: Il est à la fois plus clair et probablement plus rapide d’utiliser «String. Equals ’au lieu de comparer le résultat de ’String. compare ’à zéro.
it: Risulta più immediato e probabilmente più rapido usare 'string.Equals' invece di confrontare il risultato di 'string.Compare' con zero.
ja: 'string.Compare' の結果を 0 と比較するよりも、'stringEquals' を使用する方が明確で、より高速である可能性があります。
ko: 'string.Compare'의 결과를 0과 비교하는 대신 'string.Equals'를 사용하는 것이 더욱 명확하고 빠를 가능성이 높습니다.
pl: Użycie ciągu „string.Equals” jest wyraźniejsze i prawdopodobnie szybsze zamiast porównywania wyniku „string.Compare” z zerem.
pt_br: É mais claro e provavelmente mais rápido usar 'string. É igual a em vez de comparar o resultado de 'string.Compare' com zero.
ru: Проще и, вероятно, быстрее использовать "string.Equals" вместо сравнения результата "string.Compare" с нулем.
tr: 'string.Compare' sonucunu sıfırla karşılaştırmak yerine 'string.Equals' kullanmak hem daha net hem de çoğu zaman daha hızlıdır.
zh_hans: 使用 “string.Equals” 更清晰还可能更快速，而不是将 “string.Compare” 的结果与零进行比较。
zh_hant: 使用 'string.Equals' 更清楚也更快，而不是將 'string.Compare' 的結果與 0 比較。

# UseStringEqualsOverStringCompareMessage
source: Use 'string.Equals' instead of comparing the result of 'string.Compare' to 0
cs: Použít string.Equals místo porovnání výsledku string.Compare s 0
de: Verwenden Sie "string.Equals", statt das Ergebnis von "string.Compare" mit 0 zu vergleichen.
es: Use 'string.Equals' en lugar de comparar el resultado de 'string.Compare' con 0
fr: Utilisez ’String. Equals’ au lieu de comparer le résultat de ’String. compare’ à 0
it: Usare 'string.Equals' invece di confrontare il risultato di 'string.Compare' con 0
ja: 'string' を使用します。'string.Compare' の結果を 0 と比較する代わりに 'string.Equals' を使用します
ko: 'string.Compare'의 결과를 0과 비교하는 대신 'string.Equals'를 사용하세요.
pl: Użyj ciągu „string.Equals” zamiast porównywania wyniku ciągu „string.Compare” z wartością 0
pt_br: Use 'string. Igual a' em vez de comparar o resultado de 'string.Compare' com 0
ru: Использовать "string.Equals" вместо сравнения результата "string.Compare" с 0
tr: 'string.Compare' sonucunu 0 ile karşılaştırmak yerine 'string.Equals' kullanın
zh_hans: 使用 “string.Equals”，而不是将 “string.Compare” 的结果与 0 进行比较
zh_hant: 請使用 'string.Equals' 而不是將 'string.Compare' 的結果與 0 比較

# UseStringEqualsOverStringCompareTitle
source: Use 'string.Equals'
cs: Použít string.Equals
de: "string.Equals" verwenden
fr: Utilisez ’String. Equals
it: Usare 'string.Equals'
ja: 'string.Equals' を使用します。
ko: 'string.Equals' 사용
pl: Użyj ciągu „string. Equals”
pt_br: Use 'string. Igual a'
ru: Использовать "string.Equals"
tr: 'string.Equals' kullanın
zh_hans: 使用 “string.Equals”
zh_hant: 請使用 'string.Equals'

# UseStringMethodCharOverloadWithSingleCharactersDescription
source: The char overload is a better performing overload than a string with a single char.
cs: Přetížení typu char je výkonnější přetížení než řetězec s jedním typem char.
de: Die Char-Überladung ist eine Überladung mit besserer Leistung als eine Zeichenfolge mit einem einzelnen Char.
es: La sobrecarga de caracteres es una sobrecarga con mejor rendimiento que una cadena con un solo carácter.
fr: La surcharge char est une surcharge plus performante qu’une chaîne avec un seul caractère.
it: L'overload char è un overload con prestazioni migliori rispetto a una stringa con un singolo char.
ja: char オーバーロードは、1 文字の文字列よりもパフォーマンスの高いオーバーロードです。
ko: 문자 오버로드는 단일 문자가 포함된 문자열보다 성능이 뛰어난 오버로드입니다.
pl: Przeciążenie znakiem jest bardziej wydajnym przeciążeniem niż ciąg z pojedynczym znakiem.
pt_br: A sobrecarga de caracteres é uma sobrecarga de melhor desempenho do que uma cadeia de caracteres com um único caractere.
ru: Перегрузка символа эффективнее, чем строка с одним символом.
tr: Karakter aşırı yüklemesi, tek karakterli bir dizeden daha iyi performans gösteren bir aşırı yüklemedir.
zh_hans: 与具有单个字符的字符串相比，字符重载的性能更好。
zh_hant: 與具有單一字元的字串相比，字元多載的效能較佳。

# UseStringMethodCharOverloadWithSingleCharactersMessage
source: Use 'string.{0}(char)' instead of 'string.{0}(string)' when you have a string with a single char
cs: Použijte string.{0}(char) místo string.{0}(string), pokud máte řetězec s jedním znakem
de: Verwenden Sie "string.{0}(char)" anstelle von "string.{0}(string)", wenn Sie eine Zeichenfolge mit einem einzelnen Zeichen verwenden
es: Use "string.{0}(char)" en lugar de "string.{0}(string)" cuando tenga una cadena con un solo carácter.
fr: Utilisez 'string.{0}(char)' à la place de 'string.{0}(string)' quand vous avez une chaîne avec un seul caractère
it: Usare 'string.{0}(char)' invece di 'string.{0}(string)' quando è disponibile una stringa con un singolo carattere
ja: 1 文字の文字列がある場合は、'string.{0}(string)' ではなく 'string.{0}(char)' を使用します
ko: 단일 문자가 포함된 문자열이 있는 경우 'string.{0}(string)' 대신 'string.{0}(char)'를 사용하세요.
pl: Użyj ciągu „string.{0}(char)” zamiast „string.{0}(string)” w przypadku ciągu z pojedynczym znakiem
pt_br: Use 'cadeia de caracteres.{0}(char)' em vez de 'cadeia de caracteres.{0}(cadeia de caracteres)' quando você tem uma cadeia de caracteres com um único caractere
ru: Используйте "string.{0}(char)" вместо "string.{0}(string)", когда у вас есть строка с одним символом
tr: Tek karakterli bir dizeniz varsa 'string.{0}(char)' instead of 'string.{0}(string)' parametresini kullanın
zh_hans: 当字符串具有单个字符时，请使用 "string.{0}(char)" 而不是 "string.{0}(string)"。
zh_hant: 字串含有單一字元時，請使用 'string.{0}(char)'，而非 'string.{0}(string)'

# UseStringMethodCharOverloadWithSingleCharactersTitle
source: Use char overload
cs: Použít přetížení typu char
de: Char-Überladung verwenden
es: Usar sobrecarga de caracteres
fr: Utiliser la surcharge char
it: Usa overload char
ja: char オーバーロードを使用する
ko: char 오버로드 사용
pl: Użyj przeciążenia znaków
pt_br: Usar sobrecarga de caractere
ru: Использовать перегрузку символов
tr: Karakter aşırı yüklemesini kullanın
zh_hans: 使用字符重载
zh_hant: 使用字元多載

# UseThrowHelperDescription
source: Throw helpers are simpler and more efficient than an if block constructing a new exception instance.
cs: Pomocné rutiny vyvolání jsou jednodušší a efektivnější než blok if vytvářející novou instanci výjimky.
de: Throw-Hilfsprogramme sind einfacher und effizienter als If-Blöcke, die eine neue Ausnahmeinstanz erstellen.
es: Los asistentes de inicio son más sencillos y eficaces que un bloque if que construye una nueva instancia de excepción.
fr: Les assistants de levée sont plus simples et plus efficaces qu’un bloc if construisant une nouvelle instance d’exception.
it: Gli helper throw sono più semplici ed efficienti di un blocco if che costruisce una nuova istanza di eccezione.
ja: スロー ヘルパーは、if ブロックが新しい例外インスタンスを構築する場合よりもシンプルで効率的です。
ko: throw 도우미는 새로운 예외 인스턴스를 구성하는 if 블록보다 간단하고 효율적입니다.
pl: Pomocnicy zgłaszania są prostsi i wydajniejsi niż blok if konstruujący nowe wystąpienie wyjątku.
pt_br: Auxiliares de lançamento são mais simples e eficientes do que um bloco if que constrói uma nova instância de exceção.
ru: Помощники по вызову являются более простыми и эффективными, чем блок if, создающий новый экземпляр исключения.
tr: Oluşturma yardımcıları, yeni bir özel durum örneği oluşturan bir if bloğundan daha basit ve daha verimlidir.
zh_hans: 在构造新的异常实例方面，引发帮助程序比 if 块更简单、更高效。
zh_hant: 擲回協助程式比建構新例外狀況執行個體的 if 區塊更簡單且更有效率。

# UseThrowHelperFix
source: Use '{0}.{1}'
cs: Použít {0}.{1}
de: "{0}.{1}" verwenden
fr: Utiliser « {0}.{1} »
it: Usare '{0}.{1}'
ja: '{0}.{1}' を使用します
ko: '{0}.{1}' 사용
pl: Użyj „{0}.{1}”
pt_br: Usar '{0}.{1}'
ru: Использовать "{0}.{1}"
tr: '{0}.{1}' kullan
zh_hans: 使用 "{0}.{1}"
zh_hant: 使用 '{0}.{1}'

# UseThrowHelperMessage
source: Use '{0}.{1}' instead of explicitly throwing a new exception instance
cs: Místo explicitního vyvolání nové instance výjimky použijte {0}.{1}.
de: Verwenden Sie "{0}.{1}", anstatt explizit eine neue Ausnahmeinstanz auszulösen.
es: Use '{0}.{1}' en lugar de iniciar explícitamente una nueva instancia de excepción
fr: Utilisez « {0}.{1} » au lieu de lever explicitement une nouvelle instance d’exception
it: Usare '{0}.{1}' anziché generare in modo esplicito una nuova istanza di eccezione
ja: 新しい例外インスタンスを明示的にスローするのではなく、'{0}.{1}' を使用してください
ko: 새 예외 인스턴스를 명시적으로 throw하는 대신 '{0}.{1}' 사용
pl: Użyj „{0}.{1}” zamiast jawnego zgłaszania nowego wystąpienia wyjątku
pt_br: Use '{0}.{1}' em vez de lançar explicitamente uma nova instância de exceção
ru: Используйте "{0}.{1}" вместо явного вызова нового экземпляра исключения
tr: Açıkça yeni bir özel durum örneği oluşturmak yerine '{0}.{1}' kullanın
zh_hans: 使用 "{0}.{1}"，而不是显式引发新的异常实例
zh_hant: 使用 '{0}.{1}'，而不是明確擲回新的例外狀況執行個體

# UseValidPlatformStringDescription
source: Platform compatibility analyzer requires a valid platform name and version.
cs: Analyzátor kompatibility platformy vyžaduje platný název a verzi platformy.
de: Das Analysetool für Plattformkompatibilität erfordert einen gültigen Plattformnamen und eine gültige Version.
es: El analizador de compatibilidad de plataforma requiere un nombre de plataforma y una versión válidos.
fr: Platform Analyzer requiert un nom de plateforme et une version valides.
it: Con l'analizzatore della compatibilità della piattaforma sono richiesti un nome e una versione di piattaforma validi.
ja: プラットフォーム互換性アナライザーには、有効なプラットフォーム名とバージョンが必要です。
ko: 플랫폼 호환성 분석기에는 유효한 플랫폼 이름과 버전이 필요합니다.
pl: Analizator zgodności platformy wymaga prawidłowej nazwy i wersji platformy.
pt_br: O analisador de compatibilidade de plataforma requer um nome de plataforma e uma versão válidos.
ru: Анализатору совместимости платформы требуется допустимое имя и версия платформы.
tr: Platform uyumluluğu çözümleyicisi geçerli bir platform adı ve sürümü gerektiriyor.
zh_hans: 平台兼容性分析器需要有效的平台名称和版本。
zh_hant: 平台相容性分析器需要有效的平台名稱和版本。

# UseValidPlatformStringInvalidVersion
source: Version '{0}' is not valid for platform '{1}'. Use a version with 2{2} parts for this platform.
cs: Verze {0} není pro platformu {1} platná. Pro tuto platformu použijte verzi se 2 {2} částmi.
de: Version {0} ist für die Plattform "{1}" ungültig. Verwenden Sie für diese Plattform eine Version mit 2{2} Teilen.
es: La versión "{0}" no es válida para la plataforma "{1}". Use una versión con 2{2}parts para esta plataforma.
fr: La version «{0}» n’est pas valide pour la plateforme «{1}». Utilisez une version avec 2 parties{2} pour cette plateforme.
it: La versione '{0}' non è valida per la piattaforma '{1}'. Usare una versione con 2{2} parti per questa piattaforma.
ja: バージョン '{0}' は、プラットフォーム '{1}' では無効です。このプラットフォームでは、2{2} パーツのあるバージョンを使用します。
ko: 버전 '{0}'은(는) 플랫폼 '{1}'에 유효하지 않습니다. 이 플랫폼에는 2{2} 부분이 있는 버전을 사용하세요.
pl: Wersja „{0}” jest nieprawidłowa dla platformy „{1}”. Użyj wersji z 2{2} częściami dla tej platformy.
pt_br: A versão '{0}' não é válida para a plataforma '{1}'. Use uma versão com 2{2} partes para esta plataforma.
ru: Версия "{0}" недопустима для платформы "{1}". Используйте версию с 2{2} частями для этой платформы.
tr: '{0}' sürümü '{1}' platformu için geçerli değil. Bu platform için 2{2} bölümden oluşan bir sürüm kullanın.
zh_hans: 版本“{0}”对于平台“{1}”无效。请为此平台使用包含 2{2} 部分的版本。
zh_hant: 版本 '{0}' 對平台 '{1}' 而言無效。請為此平台使用 2{2} 部分的版本。

# UseValidPlatformStringNoVersion
source: Version '{0}' is not valid for platform '{1}'. Do not use versions for this platform.
cs: Verze {0} není platná pro platformu {1}. Nepoužívejte verze pro tuto platformu.
de: Die Version "{0}" ist für die Plattform "{1}" ungültig. Verwenden Sie keine Versionen für diese Plattform.
es: La versión "{0}" no es válida para la plataforma "{1}". No use versiones para esta plataforma.
fr: La version « {0} » n’est pas valide pour la plateforme « {1} ». N’utilisez pas de versions pour cette plateforme.
it: La versione '{0}' non è valida per la piattaforma '{1}'. Non usare versioni per questa piattaforma.
ja: バージョン '{0}' は、プラットフォーム '{1}' では無効です。このプラットフォームにはバージョンを使用しないでください。
ko: 버전 '{0}'은(는) 플랫폼 '{1}'에 유효하지 않습니다. 이 플랫폼의 버전을 사용하지 마세요.
pl: Wersja „{0}” nie jest prawidłowa dla platformy „{1}”. Nie używaj wersji dla tej platformy.
pt_br: A versão '{0}' não é válida para a plataforma '{1}'. Não use versões para esta plataforma.
ru: Версия "{0}" недопустима для платформы "{1}". Не используйте версии для этой платформы.
tr: '{0}' sürümü '{1}' platformu için geçerli değil. Bu platform için olan sürümleri kullanmayın.
zh_hans: 版本“{0}”对于平台“{1}”无效。请勿对此平台使用版本。
zh_hant: 版本 '{0}' 對平台 '{1}' 而言無效。請不要為此平台使用版本。

# UseValidPlatformStringTitle
source: Use valid platform string
cs: Použít platný řetězec platformy
de: Gültige Plattformzeichenfolge verwenden
es: Usar cadena de plataforma válida
fr: Utiliser une chaîne de plateforme valide
it: Usare una stringa di piattaforma valida
ja: 有効なプラットフォーム文字列を使用する
ko: 유효한 플랫폼 문자열 사용
pl: Użyj prawidłowego ciągu platformy
pt_br: Usar cadeia de caracteres de plataforma válida
ru: Использовать допустимую строку платформы
tr: Geçerli platform dizesi kullanın
zh_hans: 使用有效的平台字符串
zh_hant: 請使用有效的平台字串

# UseValidPlatformStringUnknownPlatform
source: The platform '{0}' is not a known platform name
cs: Platforma {0} není známý název platformy.
de: Plattform "{0}" ist kein bekannter Plattformname.
es: La plataforma '{0}' no es un nombre de plataforma conocido
fr: La plateforme « {0} » n’est pas un nom de plateforme connu.
it: La piattaforma '{0}' non corrisponde a un nome di piattaforma noto
ja: プラットフォーム '{0}' は既知のプラットフォーム名ではありません
ko: 플랫폼 '{0}'은(는) 알려진 플랫폼 이름이 아닙니다.
pl: Platforma „{0}” nie jest znaną nazwą platformy
pt_br: A plataforma '{0}' não é um nome de plataforma conhecido
ru: Платформа "{0}" не является известным именем платформы
tr: '{0}' platformu bilinen bir platform adı değil
zh_hans: 平台“{0}”不是已知的平台名称
zh_hant: 平台 '{0}' 不是已知的平台名稱
