Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotCallDangerousMethodsInDeserializationDescription
source: Insecure Deserialization is a vulnerability which occurs when untrusted data is used to abuse the logic of an application, inflict a Denial-of-Service (DoS) attack, or even execute arbitrary code upon it being deserialized. It’s frequently possible for malicious users to abuse these deserialization features when the application is deserializing untrusted data which is under their control. Specifically, invoke dangerous methods in the process of deserialization. Successful insecure deserialization attacks could allow an attacker to carry out attacks such as DoS attacks, authentication bypasses, and remote code execution.
cs: Nezabezpečená deserializace je ohrožení zabezpečení, které nastane, když se nedůvěryhodná data použijí ke zneužití logiky aplikace, vyvolání útoku na dostupnost služby (DoS), nebo dokonce spuštění libovolného kódu při deserializaci. Možnost zneužití funkcí deserializace se pro kyberzločince často vyskytne, když aplikace deserializuje nedůvěryhodná data, která jsou pod jejich kontrolou. Konkrétně se stane to, že při deserializaci vyvoláte nebezpečné metody. Úspěšné útoky na nezabezpečenou deserializaci by mohly útočníkovi umožnit provedení útoků, jako jsou útoky DoS, obcházení ověřování a vzdálené spuštění kódu.
de: Bei der unsicheren Deserialisierung handelt es sich um ein Sicherheitsrisiko, das auftreten kann, wenn nicht vertrauenswürdige Daten verwendet werden, um die Logik einer Anwendung auf nicht beabsichtigte Weise zu verwenden, einen Denial-of-Service-Angriff (DoS) durchzuführen oder beliebigen Code auszuführen, um diese zu deserialisieren. Angreifer nutzen diese Deserialisierungsfeatures häufig aus, indem sie ihre nicht vertrauenswürdigen Daten von der Anwendung deserialisieren lassen. Während der Deserialisierung werden so insbesondere gefährliche Methoden aufgerufen. Eine erfolgreich durchgeführte unsichere Deserialisierung kann dazu führen, dass der Angreifer DoS-Angriffe durchführen, die Authentifizierung umgehen oder Code remote ausführen kann.
es: La Deserialización insegura es un problema de vulnerabilidad que se produce cuando se utilizan datos no fiables para abusar de la lógica de una aplicación, inflige un ataque de Denegacíón de servicio (DoS) o incluso ejecuta código arbitrario sobre la propia deserialización. A menudo, los usuarios malintencionados pueden abusar de estas funciones de deserialización cuando la aplicación deserializa datos no fiables que están bajo su control. Específicamente, pueden invocar métodos peligrosos para el proceso de deserialización. Los ataques de deserialización insegura que logran su cometido pueden permitir al atacante llevar a cabo ataques DoS, omisiones del método de autenticación y la ejecución remota de código.
fr: La désérialisation non sécurisée et une vulnérabilité qui se produit quand des données non approuvées sont utilisées pour exploiter la logique d'une application, infliger une attaque par déni de service (DoS) ou même exécuter du code arbitraire pendant leur désérialisation. Les utilisateurs malveillants peuvent souvent exploiter les fonctionnalités de ces désérialisations quand l'application désérialise des données non approuvées qui sont sous leur contrôle. Plus précisément, ils appellent des méthodes dangereuses dans le processus de désérialisation. Les attaques pendant une désérialisation non sécurisée peuvent permettre à un utilisateur malveillant d'effectuer des attaques de type attaques DoS, contournements d'authentification et exécution du code à distance.
it: La deserializzazione non sicura è una vulnerabilità che si riscontra quando vengono usati dati non attendibili per violare la logica di un'applicazione, causare un attacco Denial of Service (DoS) o persino eseguire codice arbitrario durante la deserializzazione. Gli utenti malintenzionati sfruttano spesso queste funzionalità di deserializzazione quando l'applicazione deserializza dati non attendibili controllati da loro, in particolare richiamando metodi pericolosi nel processo di deserializzazione. Attacchi riusciti di deserializzazione non sicura possono consentire a un utente malintenzionato di portare a termine attacchi di tipo DoS, bypass di autenticazione ed esecuzione di codice da remoto.
ja: 安全でない逆シリアル化は、アプリケーションのロジックを悪用したり、サービス拒否 (DoS) 攻撃を仕掛けたり、逆シリアル化されたときに任意のコードを実行したりすることさえあるために、信頼できないデータが使用される場合に発生する脆弱性です。 悪意のあるユーザーが、自分の管理下にある信頼できないデータをアプリケーションで逆シリアル化しているときに、これらの逆シリアル化機能を悪用することがよくあります。 具体的には、逆シリアル化の過程で危険なメソッドを呼び出します。 安全でない逆シリアル化攻撃が成功すると、攻撃者は DoS 攻撃、認証回避、リモートでのコード実行などの攻撃を仕掛ける可能性があります。
ko: 안전하지 않은 deserialization은 트러스트되지 않은 데이터를 사용하여 애플리케이션 논리를 남용할 때 발생하는 취약성이고, DoS(서비스 거부) 공격을 가하거나 deserialize될 때 임의의 코드를 실행하기도 합니다. 종종 악의적인 사용자가 제어하는 트리스트되지 않은 데이터를 애플리케이션에서 deserialize할 때 이러한 deserialization 기능을 사용할 수 있습니다. 특히 deserialization 과정에 위험한 메서드를 호출합니다. 안전하지 않은 deserialization 공격이 성공하면 공격자가 DoS 공격, 인증 건너뜀 및 원격 코드 실행과 같은 공격을 수행할 수 있습니다.
pl: Niezabezpieczona deserializacja to luka w zabezpieczeniach, która występuje, gdy niezaufane dane są używane w przypadku nadużywania logiki aplikacji, przeprowadzania ataku typu „odmowa usługi” (DoS), a nawet wykonywania kodu umownego w trakcie deserializacji. Złośliwi użytkownicy często mogą nadużywać tych funkcji deserializacji, gdy aplikacja deserializuje niezaufane dane, które są kontrolowane przez te funkcje. W szczególności może ona wywoływać niebezpieczne metody w procesie deserializacji. Skuteczne ataki typu „niezabezpieczona deserializacja” mogą pozwolić osobie atakującej na przeprowadzanie ataków, takich jak ataki DoS, pomijanie uwierzytelniania i zdalne wykonywanie kodu.
pt_br: A Desserialização Não Segura é uma vulnerabilidade que ocorre quando dados não confiáveis são usados para explorar a lógica de um aplicativo, causar um ataque de negação de serviço (DoS) ou até mesmo executar código arbitrário durante a desserialização. É frequentemente possível que usuários mal-intencionados explorem essas funcionalidades da desserialização quando o aplicativo desserializa dados não confiáveis sob seu controle. Especificamente, eles invocam métodos perigosos no processo de desserialização. Ataques de desserialização não segura bem sucedidos podem permitir que um invasor realize ataques como ataques de Negação de Serviço, bypass de autenticação e execução remota de código.
ru: Небезопасная десериализация — это уязвимость, которая возникает, когда недоверенные данные используются для нарушения логики работы приложения, проведения атак типа "отказ в обслуживании" или даже для выполнения произвольного кода при его десериализации. Злоумышленники часто используют эти возможности десериализации, контролируя недоверенные данные, которые десериализуются приложением, в частности, путем вызова опасных методов в ходе десериализации. При успешном проведении атак с небезопасной десериализацией злоумышленник может провести атаки типа "отказ в обслуживании", обойти проверку подлинности и выполнить код удаленно.
tr: Güvenli Olmayan Seri Durumdan Çıkarma, güvenilmeyen verilerin bir uygulamanın mantığını kötüye kullanmak, bir Hizmet Reddi (DoS) saldırısı gerçekleştirmek veya seri durumdan çıkarıldığında rastgele kod yürütmek için kullanılması durumunda oluşan bir güvenlik açığıdır. Kötü amaçlı kullanıcıların uygulama kendi denetimlerindeki güvenilmeyen verileri seri durumdan çıkarırken bu seri durumdan çıkarma özelliklerini kötüye kullanması mümkündür. Özellikle, seri durumdan çıkarma işleminde tehlikeli yöntemler çağrılabilir. Başarılı güvenli olmayan seri durumdan çıkarma salgırıları, saldırganların DoS saldırıları gerçekleştirmesine, kimlik doğrulamasını atlamasına ve uzaktan kod yürütmesine olanak sağlar.
zh_hans: 不安全反序列化是一种漏洞，当不受信任的数据被用来滥用应用程序的逻辑、实施拒绝服务(dos)攻击，甚至在反序列化时执行任意代码时发生。当应用程序反序列化由其控制的不受信任的数据时，恶意用户通常可能会滥用这些反序列化功能。具体来说，在反序列化过程中调用危险方法。成功的不安全反序列化攻击可能允许攻击者执行攻击，例如 dos 攻击、身份验证绕过和远程代码执行。
zh_hant: 不安全的還原序列化是一種弱點，會在有人使用未受信任的資料來不當使用應用程式的邏輯、發動拒絕服務的攻擊 (DoS)，甚至是在任何程式碼的還原序列化期間執行該程式碼時出現。惡意使用者經常會在應用程式將他們控制的未受信任資料還原序列化時，濫用這些還原序列化功能 (基本上就是在還原序列化期間叫用危險的方法)。不安全的還原序列化攻擊一旦成功，攻擊者就有機會發動後續攻擊，例如 DoS 攻擊、驗證略過和遠端程式碼執行。

# DoNotCallDangerousMethodsInDeserializationMessage
source: When deserializing an instance of class '{0}', method '{1}' can directly or indirectly call dangerous method '{2}'
cs: Při deserializaci instance třídy{{0} může metoda{1} přímo nebo nepřímo volat nebezpečnou metodu {2}.
de: Beim Deserialisieren einer Instanz der Klasse „{0}“ kann die Methode „{1}“ die gefährliche Methode „{2}“ direkt oder indirekt aufrufen.
es: Al deserializar una instancia de la clase "{0}", el método "{1}" puede llamar directa o indirectamente a un método peligroso "{2}".
fr: Lors de la désérialisation d’une instance de la classe '{0}', la méthode '{1}' peut appeler directement ou indirectement la méthode dangereuse '{2}'
it: Quando si deserializza un'istanza della classe '{0}', il metodo '{1}' può chiamare direttamente o indirettamente il metodo pericoloso '{2}'
ja: クラス '{0}' のインスタンスを逆シリアル化するときに、メソッド '{1}' が危険なメソッド '{2}' を直接的または間接的に呼び出すことができます
ko: 클래스 '{0}'의 인스턴스를 역직렬화할 때 '{1}' 메서드가 위험한 메서드 '{2}'을(를) 직접 또는 간접적으로 호출할 수 있습니다.
pl: Podczas deserializacji wystąpienia klasy „{0}” metoda „{1}” może bezpośrednio lub pośrednio wywoływać niebezpieczną metodę „{2}”
pt_br: Ao desserializar uma instância da classe '{0}', o método '{1}' pode chamar direta ou indiretamente um método perigoso '{2}'
ru: При десериализации экземпляра класса '{0}' метод '{1}' может прямо или косвенно вызывать опасный метод '{2}'
tr: '{0}' sınıfının bir örneği seri durumdan getirilirken '{1}' metodu tehlikeli olan '{2}' metodunu doğrudan veya dolaylı olarak çağırabilir
zh_hans: 反序列化类'{0}'的实例时，方法'{1}'可以直接或间接调用危险方法'{2}'
zh_hant: 將類別 '{0}' 的執行個體還原序列化時，方法 '{1}' 可以直接或間接呼叫危險的方法 '{2}'

# DoNotCallDangerousMethodsInDeserializationTitle
source: Do Not Call Dangerous Methods In Deserialization
cs: Nevolejte nebezpečné metody při deserializaci
de: Keine gefährlichen Methoden bei der Deserialisierung aufrufen
es: No llame a métodos peligrosos durante la deserialización
fr: Ne pas appeler de méthodes dangereuses dans la désérialisation
it: Non chiamare metodi pericolosi durante la deserializzazione
ja: 逆シリアル化で危険なメソッドを呼び出さないでください
ko: 역직렬화에서 위험한 메서드를 호출하면 안 됨
pl: Nie wywołuj niebezpiecznych metod w deserializacji
pt_br: Não Chame Métodos Perigosos Durante a Desserialização
ru: Не вызывать опасные методы десериализации
tr: Seri Durumdan Çıkarırken Tehlikeli Metotlar Çağırma
zh_hans: 在反序列化中不要调用危险方法
zh_hant: 不要在還原序列化期間呼叫危險的方法

# DoNotCallEnumerableCastOrOfTypeWithIncompatibleTypesDescription
source: Enumerable.Cast<T> and Enumerable.OfType<T> require compatible types to function expectedly. The generic cast (IL 'unbox.any') used by the sequence returned by Enumerable.Cast<T> will throw InvalidCastException at runtime on elements of the types specified. The generic type check (C# 'is' operator/IL 'isinst') used by Enumerable.OfType<T> will never succeed with elements of types specified, resulting in an empty sequence. Widening and user defined conversions are not supported with generic types.
cs: Metody Enumerable.Cast<T> a Enumerable.OfType<T> vyžadují k očekávané funkci kompatibilní typy. Obecné přetypování (IL unbox.any) používané sekvencí vrácenou metodou Enumerable.Cast<T> vyvolá výjimku InvalidCastException za běhu u prvků zadaných typů. Ověření obecného typu (operátor is v jazyce C# /isinst převodního jazyka IL) metodou Enumerable.OfType<T> nebude nikdy úspěšné s prvky zadaných typů a výsledkem bude prázdná sekvence. Rozšíření a uživatelem definované převody se u obecných typů nepodporují.
de: Enumerable.Cast<T> und Enumerable.OfType<T> erfordern kompatible Typen, um ordnungsgemäß zu funktionieren. Die generische Umwandlung (IL „unbox.any“), die der von der von Enumerable.Cast<T> zurückgegebenen Sequenz verwendet wird, löst zur Laufzeit bei Elementen der angegebenen Typen eine InvalidCastException-Ausnahme aus. Die von Enumerable.OfType<T> verwendete generische Typüberprüfung (C# „is“-Operator/IL „isinst“) wird nie erfolgreich ausgeführt, wenn Elemente von Typen angegeben werden, die in einer leeren Sequenz resultieren. Erweiterungen und benutzerdefinierte Konvertierungen werden bei generischen Typen nicht unterstützt.
es: Enumerable.Cast<T> y Enumerable.OfType<T> requieren tipos compatibles para funcionar de forma esperada. La conversión genérica ("unbox.any" de IL) usada por la secuencia devuelta por Enumerable.Cast<T> iniciará InvalidCastException en tiempo de ejecución en los elementos de los tipos especificados. La comprobación de tipos genéricos (operador "is" de C# o "isinst" de IL) usada por Enumerable.OfType<T> nunca se completará correctamente con los elementos de tipos especificados, lo que provocará una secuencia vacía. La ampliación y las conversiones definidas por el usuario no se admiten con tipos genéricos.
fr: Enumerable.Cast<T> et Enumerable.OfType<T> nécessitent des types compatibles pour fonctionner normalement. Le cast générique (IL 'unbox.any') utilisé par la séquence retournée par Enumerable.Cast<T> lève InvalidCastException au moment de l’exécution sur les éléments des types spécifiés. La vérification de type générique (opérateur C# 'is'/IL 'isinst') utilisée par Enumerable.OfType<T> ne réussira jamais avec les éléments de types spécifiés, ce qui entraîne une séquence vide. Les conversions étendues et définies par l’utilisateur ne sont pas prises en charge avec les types génériques.
it: Enumerable.Cast<T> e Enumerable.OfType<T> richiedono tipi compatibili per funzionare correttamente. Il cast generico (IL 'unbox.any') usato dalla sequenza restituita da Enumerable.Cast<T> genererà InvalidCastException in fase di esecuzione sugli elementi dei tipi specificati. Il controllo di tipo generico (C# 'is' operator/IL 'isinst') usato da Enumerable.OfType<T> non avrà mai esito positivo con gli elementi di tipi specificati, generando una sequenza vuota. L'ampliamento e le conversioni definite dall'utente non sono supportate con tipi generici.
ja: Enumerable.Cast<T> と Enumerable.OfType<T> が正常に機能するには、互換性のある型が必要です。 Enumerable.Cast<T> によって返されるシーケンスによって使用されるジェネリック キャスト (IL 'unbox.any') は、指定された型の要素で実行時に InvalidCastException をスローします。 Enumerable.OfType<T> で使用されるジェネリック型チェック (C# 'is' operator/IL 'isinst') は、指定された型の要素では成功しないため、空のシーケンスになります。 拡大およびユーザー定義の変換は、ジェネリック型ではサポートされていません。
ko: Enumerable.Cast<T> 및 Enumerable.OfType<T>가 제대로 작동하려면 호환되는 형식이 필요합니다. Enumerable.Cast<T>에서 반환된 시퀀스에서 사용하는 일반 캐스트(IL 'unbox.any')는 지정된 형식의 요소에서 런타임에 InvalidCastException을 발생시킵니다. Enumerable.OfType<T>에서 사용하는 제네릭 형식 검사(C# 'is' 연산자/IL 'isinst')는 지정된 형식의 요소로 성공하지 못하여 결과적으로 빈 시퀀스가 됩니다. 확대 및 사용자 정의 변환은 일반 형식에서 지원되지 않습니다.
pl: Elementy Enumerable.Cast<T> i Enumerable.OfType<T> wymagają oczekiwanych zgodnych typów. Rzutowanie ogólne (IL „unbox.any”) używane przez sekwencję zwracaną przez element Enumerable.Cast<T> zgłosi wyjątek InvalidCastException w środowisku uruchomieniowym dla elementów określonych typów. Sprawdzanie typu ogólnego (operator „is” języka C# /IL „isinst”) używane przez element Enumerable.OfType<T> nigdy nie powiedzie się z określonymi elementami typów, co spowoduje powstanie pustej sekwencji. Konwersje poszerzane i zdefiniowane przez użytkownika nie są obsługiwane w przypadku typów ogólnych.
pt_br: Enumerable.Cast<T> e Enumerable.OfType<T> requerem tipos compatíveis para funcionar corretamente. A conversão genérica (IL ''unbox.any'') usada pela sequência retornada por Enumerable.Cast<T> lançará InvalidCastException em runtime em elementos dos tipos especificados. A verificação do tipo genérico (C# ''is'' operator/IL ''isinst'') usada por Enumerable.OfType<T> nunca será bem-sucedido com OS elementos de tipos especificados, resultando em uma sequência vazia. As ampliação e conversões definidas pelo usuário não são compatíveis com tipos genéricos.
ru: Для нормальной работы Enumerable.Cast<T> и Enumerable.OfType<T> требуются совместимые типы. Универсальное приведение (выражение промежуточного языка "unbox.any"), используемое последовательностью, возвращенной enumerable.Cast<T>, вызовет исключение InvalidCastException во время выполнения для элементов указанных типов. Проверка универсального типа (оператор C# "is"/выражение промежуточного языка "isinst"), используемая Enumerable.OfType<T>, никогда не будет выполнена успешно с элементами указанных типов, что приведет к получению пустой последовательности. Расширяемые и определяемые пользователем преобразования не поддерживаются для универсальных типов.
tr: Enumerable.Cast<T> ve Enumerable.OfType<T> metotları, beklendiği gibi çalışmaları için uyumlu türler gerektirir. Enumerable.Cast<T> tarafından döndürülen dizi tarafından kullanılan genel tür dönüştürme (IL 'unbox.any'), belirtilen türdeki öğelerde çalışma zamanında InvalidCastException oluşturur. Enumerable.OfType<T> tarafından kullanılan genel tür denetimi (C# 'is' işleci/IL 'isinst'), belirtilen türdeki öğelerle hiçbir zaman başarılı olamaz ve bu çağrı boş bir dizi ile sonuçlanır. Genel türlerde genişletme ve kullanıcı tanımlı dönüştürmeler desteklenmez.
zh_hans: Enumerable.Cast<T> 和 Enumerable.OfType<T> 需要兼容类型才能按预期工作。 由 Enumerable.Cast<T> 返回的序列所使用的泛型强制转换(IL 'unbox.any')将在运行时对指定类型的元素引发 InvalidCastException。 Enumerable.OfType<T> 使用的泛型类型检查(C# 'is' operator/IL 'isinst')对于指定类型的元素将永远不会成功，因此会生成一个空序列。 泛型类型不支持拓宽转换和用户定义的转换。
zh_hant: Enumerable.Cast<T> 和 Enumerable.OfType<T> 需要相容的型別，以預期運作。 Enumerable.Cast<T> 返回序列所使用的一般轉換 (IL 'unbox.any') 將在執行階段的指定型別元素上擲回 InvalidCastException。 Enumerable.OfType<T> 使用的一般型別檢查 (C# 'is' operator/IL 'isinst') 永遠不會與指定的型別元素成功，因而產生空的順序。 一般型別不支援擴大和使用者定義的轉換。

# DoNotCallEnumerableCastOrOfTypeWithIncompatibleTypesMessageCast
source: Type '{0}' is incompatible with type '{1}' and cast attempts will throw InvalidCastException at runtime
cs: Typ {0} není kompatibilní s typem {1} a pokusy o přetypování vyvolají výjimku InvalidCastException za běhu.
de: Der Typ „{0}“ ist nicht mit dem Typ „{1}“ kompatibel, und Umwandlungsversuche verursachen zur Laufzeit eine InvalidCastException-Ausnahme.
es: El tipo "{0}" es incompatible con el tipo "{1}", y los intentos de conversión producirán InvalidCastException en tiempo de ejecución.
fr: Le type '{0}' n’est pas compatible avec le type '{1}' et les tentatives de cast lèvent InvalidCastException au moment de l’exécution
it: Il tipo '{0}' non è compatibile con il tipo '{1}' e i tentativi di cast genereranno InvalidCastException in fase di esecuzione
ja: 型 '{0}' は型 '{1}' と互換性がありません。キャストの試行により、実行時に InvalidCastException がスローされます
ko: 형식 '{0}'은(는) 형식 '{1}'과(와) 호환되지 않으며 캐스트 시도에서 런타임에 InvalidCastException이 발생합니다.
pl: Typ „{0}” jest niezgodny z typem „{1}”, a próby rzutowania zgłoszą wyjątek InvalidCastException w środowisku uruchomieniowym
pt_br: O tipo '{0}' é incompatível com o tipo '{1}' e as tentativas de conversão lançarão InvalidCastException em tempo de execução
ru: Тип '{0}' несовместим с типом '{1}', и приведение типов вызовет исключение InvalidCastException во время выполнения
tr: '{0}' türü '{1}' türüyle uyumsuz olduğundan tür dönüştürme girişimleri çalışma zamanında InvalidCastException oluşturur
zh_hans: 类型'{0}'与类型'{1}'不兼容，强制转换尝试将在运行时引发 InvalidCastException
zh_hant: 型別 '{0}' 與型別 '{1}' 不相容，轉換嘗試將在執行階段擲出 InvalidCastException

# DoNotCallEnumerableCastOrOfTypeWithIncompatibleTypesMessageOfType
source: This call will always result in an empty sequence because type '{0}' is incompatible with type '{1}'
cs: Výsledkem tohoto volání bude vždy prázdná sekvence, protože typ {0} není kompatibilní s typem {1}.
de: Dieser Aufruf führt immer zu einer leeren Sequenz, weil der Typ „{0}“ nicht mit dem Typ „{1}“ kompatibel ist.
es: Esta llamada siempre dará lugar a una secuencia vacía, ya que el tipo "{0}" es incompatible con el tipo "{1}".
fr: Cet appel entraîne toujours une séquence vide, car le type '{0}' est incompatible avec le type '{1}'
it: Questa chiamata darà sempre come risultato una sequenza vuota, perché il tipo '{0}' è incompatibile con il tipo '{1}'.
ja: 型 '{0}' が型 '{1}' と互換性がないため、この呼び出しの結果は常に空のシーケンスになります
ko: 형식 '{0}'이(가) 형식 '{1}'과(와) 호환되지 않기 때문에 이 호출은 항상 빈 시퀀스를 생성합니다.
pl: To wywołanie zawsze spowoduje powstanie pustej sekwencji, ponieważ typ „{0}” jest niezgodny z typem „{1}”
pt_br: Essa chamada sempre resultará em uma sequência vazia porque o tipo '{0}' é incompatível com o tipo '{1}'
ru: Этот вызов всегда приведет к пустой последовательности, так как тип '{0}' несовместим с типом '{1}'
tr: '{0}' türü '{1}' türüyle uyumsuz olduğundan bu çağrı her zaman boş bir dizi ile sonuçlanır
zh_hans: 此调用将始终导致空序列，因为类型'{0}'与类型'{1}'不兼容
zh_hant: 因為型別 '{0}' 與型別 '{1}' 不相容，所以此呼叫一定會產生空的順序

# DoNotCallEnumerableCastOrOfTypeWithIncompatibleTypesTitle
source: Do not call Enumerable.Cast<T> or Enumerable.OfType<T> with incompatible types
cs: Nevolejte metodu Enumerable.Cast<T> nebo Enumerable.OfType<T> s nekompatibilními typy
de: Enumerable.Cast<T>- oder Enumerable.OfType-<T> nicht mit inkompatiblen Typen aufrufen
es: No llamar a Enumerable.Cast<T> ni Enumerable.OfType<T> con tipos incompatibles
fr: N’appelez pas Enumerable.Cast<T> ou Enumerable.OfType<T> avec des types incompatibles
it: Non chiamare Enumerable.Cast<T> o Enumerable.OfType<T> con tipi incompatibili.
ja: Enumerable.Cast<T> または Enumerable.OfType<T> を互換性のない型を使用して呼び出さないでください
ko: 호환되지 않는 형식으로 Enumerable.Cast<T> 또는 Enumerable.OfType<T>를 호출하지 마세요.
pl: Nie wywołuj metody Enumerable.Cast<T> ani Enumerable.OfType<T> z niezgodnymi typami
pt_br: Não chame Enumerable.Cast<T> ou Enumerable.OfType<T> com tipos incompatíveis
ru: Не вызывайте Enumerable.Cast<T> или Enumerable.OfType<T> с несовместимыми типами
tr: Uyumsuz türlerle Enumerable.Cast<T> veya Enumerable.OfType<T> metotlarını çağırmayın
zh_hans: 请勿使用不兼容的类型调用 Enumerable.Cast<T> 或 Enumerable.OfType<T>
zh_hant: 請勿呼叫型別不相容的 Enumerable.Cast<T> 或 Enumerable.OfType<T>

# DoNotCallToImmutableCollectionOnAnImmutableCollectionValueMessage
source: Do not call {0} on an {1} value
cs: Nevolejte {0} pro hodnotu {1}.
de: "{0}" nicht für einen {1}-Wert aufrufen
es: No llame a {0} en un valor {1}
fr: Ne pas appeler {0} sur une valeur {1}
it: Non chiamare {0} su un valore {1}
ja: {1} 値で {0} を呼び出さないでください
ko: {1} 값의 {0}을(를) 호출하지 마세요.
pl: Nie wywołuj elementu {0} dla wartości {1}
pt_br: Não chamar {0} em um valor {1}
ru: Не вызывайте {0} для значения {1}
tr: Bir {1} değeri üzerinde {0} çağırmayın
zh_hans: 请勿对 {1} 值调用 {0}
zh_hant: 請勿對 {1} 值呼叫 {0}

# DoNotCallToImmutableCollectionOnAnImmutableCollectionValueTitle
source: Do not call ToImmutableCollection on an ImmutableCollection value
cs: Nevolejte ToImmutableCollection pro hodnotu ImmutableCollection
de: "ToImmutableCollection" nicht für einen ImmutableCollection-Wert aufrufen
es: No llame a ToImmutableCollection en un valor ImmutableCollection
fr: Ne pas appeler ToImmutableCollection sur une valeur ImmutableCollection
it: Non chiamare ToImmutableCollection su un valore ImmutableCollection
ja: ImmutableCollection 値で ToImmutableCollection を呼び出さないでください
ko: ImmutableCollection 값의 ToImmutableCollection을 호출하지 마세요.
pl: Nie wywołuj elementu ToImmutableCollection dla wartości ImmutableCollection
pt_br: Não chamar ToImmutableCollection em um valor ImmutableCollection
ru: Не вызывайте ToImmutableCollection для значения ImmutableCollection
tr: Bir ImmutableCollection değeri üzerinde ToImmutableCollection çağırmayın
zh_hans: 请勿对 ImmutableCollection 值调用 ToImmutableCollection
zh_hant: 請勿對 ImmutableCollection 值呼叫 TolmmutableCollection
