Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DefinitelyInstallRootCertMessage
source: Adding certificates to the operating system's trusted root certificates increases the risk of incorrectly authenticating an illegitimate certificate
cs: Když se certifikáty přidají mezi důvěryhodné kořenové certifikáty operačního systému, zvýší se riziko, že se nesprávně ověří nelegitimní certifikát.
de: Durch das Hinzufügen von Zertifikaten zu den vertrauenswürdigen Stammzertifikaten des Betriebssystems erhöht sich das Risiko, dass ein unzulässiges Zertifikat fälschlicherweise authentifiziert wird.
es: La adición de certificados a los certificados raíz de confianza del sistema operativo aumenta el riesgo de autenticar incorrectamente un certificado ilegítimo
fr: L'ajout de certificats aux certificats racines approuvés du système d'exploitation augmente le risque d'authentification incorrecte d'un certificat illégitime
it: L'aggiunta di certificati a certificati radice attendibili del sistema operativo aumenta il rischio di autenticazione non corretta di un certificato illegittimo
ja: オペレーティング システムの信頼されたルート証明書に証明書を追加すると、不正な証明書を誤って認証するリスクが高くなります
ko: 운영 체제의 신뢰할 수 있는 루트 인증서에 인증서를 추가하면 불법 인증서를 잘못 인증하게 될 위험이 늘어납니다.
pl: Dodanie certyfikatów do zaufanych certyfikatów głównych systemu operacyjnego zwiększa ryzyko niepoprawnego uwierzytelniania nieuprawnionego certyfikatu
pt_br: A adição de certificados aos certificados raiz confiáveis do sistema operacional aumenta o risco de autenticar incorretamente um certificado ilegítimo
ru: Добавление сертификатов в доверенные корневые сертификаты операционной системы увеличивает риск неправильной проверки подлинности сертификатов
tr: Sertifikaların, işletim sisteminin güvenilen kök sertifikalarına eklenmesi, geçerli olmayan bir sertifikanın hatalı bir şekilde kimliğinin doğrulanması riskini artırır
zh_hans: 如果将证书添加到操作系统受信任的根证书中，则会增加非法证书验证不当的风险
zh_hant: 將憑證新增至作業系統的受信任根憑證，會增加驗證非法憑證不正確的風險

# DefinitelyUseCreateEncryptorWithNonDefaultIV
source: Do not use CreateEncryptor with non-default IV
cs: Nepoužívat CreateEncryptor s nevýchozím inicializačním vektorem
de: CreateEncryptor nicht mit Nicht-Standard-Initialisierungsvektoren verwenden
es: No usar CreateEncryptor con un vector de inicialización no predeterminado
fr: Ne pas utiliser CreateEncryptor avec une valeur IV non définie par défaut
it: Non usare CreateEncryptor con il vettore di inizializzazione non predefinito
ja: 既定以外の IV で CreateEncryptor を使用しない
ko: 기본이 아닌 IV와 함께 CreateEncryptor 사용 안 함
pl: Nie używaj metody CreateEncryptor w wektorem inicjowania innym niż domyślny
pt_br: Não usar CreateEncryptor com IV não padrão
ru: Не используйте CreateEncryptor с вектором инициализации, отличным от значения по умолчанию.
tr: Varsayılan olmayan IV ile CreateEncryptor kullanma
zh_hans: 不要将 CreateEncryptor 与非默认 IV 结合使用
zh_hant: 請勿使用具有非預設 IV 的 CreateEncryptor

# DefinitelyUseCreateEncryptorWithNonDefaultIVMessage
source: Symmetric encryption uses non-default initialization vector, which could be potentially repeatable
cs: Symetrické šifrování používá nevýchozí inicializační vektor, který by se potenciálně mohl dát opakovat.
de: Die symmetrische Verschlüsselung verwendet einen nicht standardmäßigen Initialisierungsvektor, der potenziell wiederholbar sein könnte.
es: La clave de cifrado simétrica usa un vector de inicialización no predeterminado, que puede repetirse
fr: Le chiffrement symétrique utilise un vecteur d'initialisation non défini par défaut potentiellement répétable
it: La crittografia simmetrica usa un vettore di inizializzazione non predefinito, che potrebbe essere potenzialmente ripetibile
ja: 対称暗号化で既定以外の初期化ベクトルが使用されています。これは反復使用できる可能性があります
ko: 대칭형 암호화는 잠재적으로 반복할 수 있는, 기본이 아닌 초기화 벡터를 사용합니다.
pl: Szyfrowanie symetryczne używa wektora inicjowania innego niż domyślny, który potencjalnie może być powtarzalny
pt_br: A criptografia simétrica usa um vetor de inicialização não padrão, que pode ser repetido
ru: Для симметричного шифрования используется вектор инициализации, отличный от значения по умолчанию, что может привести к воспроизводимости.
tr: Simetrik şifreleme, yinelenmesi olası, varsayılan olmayan başlatma vektörü kullanıyor
zh_hans: 对称加密使用非默认初始化向量，该向量可能是可重复的
zh_hant: 對稱式加密使用可能可重複的非預設初始化向量

# DefinitelyUseSecureCookiesASPNetCore
source: Use Secure Cookies In ASP.NET Core
cs: Používat zabezpečené soubory cookie v ASP.NET Core
de: Sichere Cookies in ASP.NET Core verwenden
es: Usar cookies seguras en ASP.NET Core
fr: Utiliser des cookies sécurisés en ASP.NET Core
it: Usa cookie protetti in ASP.NET Core
ja: ASP.NET Core で安全な Cookie を使用します
ko: ASP.NET Core에서 보안 쿠키 사용
pl: Użyj bezpiecznych plików cookie na platformie ASP.NET Core
pt_br: Usar Cookies Seguros no ASP.Net Core
ru: Использовать защищенные файлы cookie в ASP.NET Core
tr: ASP.NET Core'da Güvenli Tanımlama Bilgileri Kullan
zh_hans: 在 ASP.NET Core 中使用安全 Cookie
zh_hant: 在 ASP.Net Core 中使用安全 Cookie

# DefinitelyUseSecureCookiesASPNetCoreMessage
source: Set CookieOptions.Secure = true when setting a cookie
cs: Při nastavování souboru cookie nastavte CookieOptions.Secure = true.
de: Beim Festlegen eines Cookies "CookieOptions.Secure = true" festlegen
es: Establecer CookieOptions.Secure en true al establecer una cookie
fr: Définir CookieOptions.Secure = true au moment de définir un cookie
it: Impostare CookieOptions.Secure = true durante l'impostazione di un cookie
ja: Cookie を設定する場合は、CookieOptions.Secure = true と設定してください。
ko: 쿠키를 설정할 때 CookieOptions.Secure = true를 설정합니다.
pl: Ustaw wartość CookieOptions.Secure = true podczas ustawiania pliku cookie
pt_br: Defina CookieOptions.Secure = true ao configurar um cookie
ru: Установить значение true для параметра CookieOptions.Secure при настройке файла cookie
tr: Tanımlama bilgisi ayarlarken CookieOptions.Secure = true olarak ayarlayın
zh_hans: 设置 Cookie 时设置 CookieOptions.Secure = true
zh_hant: 在設定 Cookie 時設定 CookieOptions.Secure = true

# DefinitelyUseWeakKDFInsufficientIterationCount
source: Do Not Use Weak Key Derivation Function With Insufficient Iteration Count
cs: Nepoužívat slabou funkci odvození klíče (KDF) s nedostatečným počtem iterací
de: Schwache Schlüsselableitungsfunktion nicht mit unzureichender Iterationsanzahl verwenden
es: No usar una función de derivación de claves débiles con un recuento de iteraciones insuficiente
fr: N'utilisez pas la fonction de dérivation de clés faibles avec un nombre insuffisant d'itérations
it: Non usare la funzione di derivazione di chiave vulnerabile con un numero di iterazioni insufficiente
ja: 反復回数が十分でない弱いキー派生関数は使用しないでください
ko: 부족한 반복 횟수로 취약한 키 파생 함수를 사용하면 안 됨
pl: Nie używaj funkcji wyprowadzania klucza słabego z niewystarczającą liczbą iteracji
pt_br: Não Use a Função de Derivação de Chaves Fraca com uma Contagem de Iteração Insuficiente
ru: Не использовать ненадежную функцию формирования ключа с недостаточным числом итераций
tr: Yetersiz Sayıda Yineleme ile Zayıf Anahtar Türetme İşlevi Kullanmayın
zh_hans: 请勿使用迭代计数不足的弱密钥派生功能
zh_hant: 不要使用反覆運算計數不足的弱式金鑰衍生函數 (Key Derivation Function)

# DefinitelyUseWeakKDFInsufficientIterationCountMessage
source: Use at least {0} iterations when deriving a cryptographic key from a password. By default, Rfc2898DeriveByte's IterationCount is only 1000
cs: Při odvozování kryptografického klíče z hesla používejte alespoň {0} iterací. Ve výchozím nastavení má atribut IterationCount pro Rfc2898DeriveByte hodnotu pouze 1000.
de: Verwenden Sie mindestens {0} Iterationen, wenn Sie einen kryptografischen Schlüssel aus einem Kennwort ableiten. Standardmäßig beträgt IterationCount von Rfc2898DeriveByte nur 1000.
es: Use al menos {0} iteraciones al derivar una clave criptográfica de una contraseña. De forma predeterminada, el valor IterationCount de Rfc2898DeriveByte es solo 1000
fr: Utilisez au moins {0} itérations quand vous dérivez une clé de chiffrement à partir d'un mot de passe. Par défaut, le IterationCount de Rfc2898DeriveByte est seulement égal à 1 000
it: Usare almeno {0} iterazioni durante la derivazione di una chiave crittografica da una password. Per impostazione predefinita, il valore di IterationCount per Rfc2898DeriveByte è solo 1000
ja: パスワードから暗号化キーを派生させる場合は、少なくとも {0} 回の反復を使用してください。既定では、Rfc2898DeriveByte の IterationCount は 1000 のみです
ko: 암호에서 암호화 키를 파생할 때 {0}회 이상의 반복을 사용하세요. 기본적으로 Rfc2898DeriveByte의 IterationCount는 1,000뿐입니다.
pl: Użyj co najmniej {0} iteracji przy wyprowadzaniu klucza kryptograficznego z hasła. Domyślnie wartość IterationCount dla klasy Rfc2898DeriveByte to tylko 1000
pt_br: Use pelo menos {0} iterações ao derivar uma chave de criptografia de uma senha. Por padrão, a IterationCount de Rfc2898DeriveByte é de apenas 1000
ru: Используйте число итераций не меньше {0} при формировании криптографического ключа из пароля. По умолчанию значение IterationCount для Rfc2898DeriveByte равно всего 1000
tr: Bir paroladan şifreleme anahtarı türetirken en az {0} yineleme kullanın. Varsayılan olarak, Rfc2898DeriveByte'ın IterationCount değeri yalnızca 1000'dir
zh_hans: 基于密码派生加密密钥时，请至少进行 {0} 次迭代。默认情况下，Rfc2898DeriveByte 的 IterationCount 仅为 1000
zh_hant: 當從密碼衍生密碼編譯金鑰時，請至少使用 {0} 個反覆項目。根據預設，Rfc2898DeriveByte 的 IterationCount 只有 1000

# DeprecatedSslProtocolsDescription
source: Older protocol versions of Transport Layer Security (TLS) are less secure than TLS 1.2 and TLS 1.3, and are more likely to have new vulnerabilities. Avoid older protocol versions to minimize risk.
cs: Starší verze protokolu zabezpečení TLS (Transport Layer Security) jsou méně bezpečné než TLS 1.2 a TLS 1.3 a mají větší pravděpodobnost výskytu nových ohrožení zabezpečení. Nepoužívejte starší verze protokolu, aby se riziko minimalizovalo.
de: Ältere Protokollversionen von Transport Layer Security (TLS) sind weniger sicher als TLS 1.2 und TLS 1.3 und weisen eine höhere Wahrscheinlichkeit für neue Sicherheitsrisiken auf. Vermeiden Sie ältere Protokollversionen, um das Risiko zu minimieren.
es: Las versiones anteriores del protocolo Seguridad de la capa de transporte (TLS) son menos seguras que las versiones TLS 1.2 y TLS 1.3, y es más probable que tengan nuevas vulnerabilidades. Evite las versiones anteriores del protocolo para minimizar el riesgo.
fr: Les anciennes versions du protocole TLS (Transport Layer Security) sont moins sécurisées que TLS 1.2 et TLS 1.3, et sont plus susceptibles de comporter de nouvelles vulnérabilités. Évitez les anciennes versions de protocole pour réduire les risques.
it: Le versioni precedenti del protocollo Transport Layer Security (TLS) sono meno sicure rispetto a TLS 1.2 e TLS 1.3 e presentano maggiori probabilità di includere nuove vulnerabilità. Evitare le versioni precedenti del protocollo per ridurre al minimo i rischi.
ja: トランスポート層セキュリティ (TLS) の以前のプロトコル バージョンは、TLS 1.2 および TLS 1.3 よりも安全性が低く、新しい脆弱性が見つかる可能性が高くなります。リスクを最小限に抑えるため、以前のプロトコル バージョンは使用しないでください。
ko: TLS(전송 계층 보안)의 이전 프로토콜 버전은 TLS 1.2 및 TLS 1.3보다 보안 수준이 낮으며 새로운 취약성이 발생할 가능성이 더 높습니다. 위험을 최소화하려면 이전 프로토콜 버전을 사용하지 마세요.
pl: Starsze wersje protokołu Transport Layer Security (TLS) są mniej bezpieczne niż TLS 1.2 i TLS 1.3 i mogą być bardziej podatne na luki w zabezpieczeniach. Aby zminimalizować ryzyko, unikaj używania starszych wersji protokołu.
pt_br: Versões de protocolo mais antigas do TLS (protocolo TLS) são menos seguras do que TLS 1.2 e TLS 1.3, e a probabilidade de que tenham novas vulnerabilidades é maior. Evite versões de protocolo mais antigas para minimizar o risco.
ru: Более старые версии протокола TLS менее безопасны, чем TLS 1.2 и TLS 1.3 и скорее всего имеют новые уязвимости. Избегайте использования ранних версий протокола, чтобы минимизировать риски.
tr: Aktarım Katmanı Güvenliği'nin (TLS) eski protokol sürümleri TLS 1.2 ve TLS 1.3'ten daha az güvenli olduğundan yeni güvenlik açıkları oluşma olasılığı daha yüksektir. Riski en aza indirmek için eski protokol sürümlerini kullanmaktan kaçının.
zh_hans: 旧协议版本的传输层安全性(TLS)不如 TLS 1.2 和 TLS 1.3 安全，更有可能存在新的漏洞。请避免使用旧协议版本，以将风险降至最低。
zh_hant: 較舊的通訊協定版本的傳輸層安全性 (TLS) 比 TLS 1.2 和 TLS 1.3 不安全，而且更可能有新的弱點。請避免較舊的通訊協定版本，以將風險降至最低。

# DeprecatedSslProtocolsMessage
source: Transport Layer Security protocol version '{0}' is deprecated. Use 'None' to let the Operating System choose a version.
cs: Verze protokolu TLS (Transport Layer Security) {0} je zastaralá. Pokud chcete, aby operační systém mohl zvolit verzi, použijte možnost None.
de: Die Transport Layer Security-Protokollversion {0} ist veraltet. Verwenden Sie "None", um dem Betriebssystem die Auswahl einer Version zu ermöglichen.
es: La versión "{0}" del protocolo Seguridad de la capa de transporte está en desuso. Utilice "None" para permitir que el sistema operativo elija una versión.
fr: La version '{0}' du protocole TLS (Transport Layer Security) est dépréciée. Utilisez 'None' pour laisser le système d'exploitation choisir une version.
it: La versione '{0}' del protocollo Transport Layer Security è deprecata. Usare 'None' per consentire al sistema operativo di scegliere una versione.
ja: トランスポート層セキュリティ プロトコルのバージョン '{0}' は非推奨です。オペレーティング システムがバージョンを選択できるようにするには、'None' を使用します。
ko: 전송 계층 보안 프로토콜 버전 '{0}'은(는) 사용되지 않습니다. 운영 체제에서 버전을 선택하도록 하려면 '없음'을 사용하세요.
pl: Wersja protokołu Transport Layer Security „{0}” jest przestarzała. Użyj opcji „Brak”, aby umożliwić systemowi operacyjnemu wybranie wersji.
pt_br: A versão do protocolo TLS '{0}' foi preterida. Use 'None' para permitir que o Sistema Operacional escolha uma versão.
ru: Версия протокола TLS "{0}" является устаревшей. Используйте "None", чтобы операционная система самостоятельно выбрала версию протокола.
tr: Aktarım Katmanı Güvenliği protokol sürümü '{0}' kullanımdan kaldırılmış. İşletim Sistemi'nin sürüm seçmesine izin vermek için 'Yok' seçeneğini belirleyin.
zh_hans: 传输层安全协议版本“{0}”已被弃用。请使用“无”，让操作系统选择一个版本。
zh_hant: 傳輸層安全性通訊協定版本 '{0}' 已淘汰。請使用 'None' 讓作業系統選擇版本。

# DeprecatedSslProtocolsTitle
source: Do not use deprecated SslProtocols values
cs: Nepoužívat zastaralé hodnoty SslProtocols
de: Keine veralteten SslProtocols-Werte verwenden
es: No usar valores de SslProtocols en desuso
fr: N'utilisez pas de valeurs dépréciées pour SslProtocols
it: Non usare valori SslProtocols deprecati
ja: SslProtocols の非推奨の値を使用しない
ko: 사용되지 않는 SslProtocols 값 사용 안 함
pl: Nie używaj przestarzałych wartości SslProtocols
pt_br: Não usar valores de SslProtocols preteridos
ru: Не используйте устаревшие значения параметра SslProtocols
tr: Kullanımdan kaldırılmış SslProtocols değerlerini kullanma
zh_hans: 请勿使用已弃用的 SslProtocols 值
zh_hant: 不要使用已淘汰的 SslProtocols 值

# DerivesFromPreviewClassMessage
source: '{0}' derives from preview class '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {0} je odvozen od třídy preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: „{0}“ wird von der Vorschauklasse „{1}“ abgeleitet, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: '{0}' deriva de la clase de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{0}' dérive de la classe de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2} pour plus d'informations.
it: '{0}' deriva dalla classe di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: '{0}' はプレビュー クラス '{1}' から派生しているため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: '{0}'은(는) 미리 보기 클래스 '{1}'에서 파생되므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}을(를) 참조하세요.
pl: „{0}” jest elementem pochodnym klasy w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: “{0}” deriva da classe de visualização “{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2}para obter mais informações.
ru: "{0}" является производным от предварительной версии класса "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: '{0}', '{1}' önizleme sınıfından türetildiğinden önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: “{0}”派生自预览类“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: '{0}' 衍生自預覽類別 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# DerivesFromPreviewClassMessageWithCustomMessagePlaceholder
source: {3} '{0}' derives from preview class '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {3}{0} je odvozen od třídy preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: {3} „{0}“ wird von der Vorschauklasse „{1}“ abgeleitet, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: {3} '{0}' deriva de la clase de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{3}' {0} dérive de la classe de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2} pour plus d'informations.
it: {3} '{0}' deriva dalla classe di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: {3} '{0}' はプレビュー クラス '{1}' から派生しているため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: {3} '{0}'은(는) 미리 보기 클래스 '{1}'에서 파생되므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}(을)를 참조하세요.
pl: {3} „{0}” jest elementem pochodnym klasy w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: {3}“{0}” deriva da classe de visualização“{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2}para obter mais informações.
ru: "{0}" {3} является производным от предварительной версии класса "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: {3} '{0}', '{1}' önizleme sınıfından türetildiğinden önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: {3}.“{0}”派生自预览类“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: {3} '{0}' 衍生自預覽類別 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# DetectPreviewFeaturesDescription
source: An assembly has to opt into preview features before using them.
cs: Sestavení musí před jejich použitím vyjádřit výslovný souhlas s funkcemi ve verzi Preview.
de: Eine Assembly muss Vorschaufeatures abonnieren, damit sie diese verwenden kann.
es: Un ensamblado tiene que participar en las características en versión preliminar antes de usarlos.
fr: Un assembly doit choisir des fonctionnalités en préversion avant de les utiliser.
it: Un assembly deve acconsentire esplicitamente alle funzionalità di anteprima prima di usarle.
ja: アセンブリを使用する前に、プレビュー機能を選択する必要があります。
ko: 어셈블리는 기능을 사용하기 전에 미리 보기 기능을 선택해야 합니다.
pl: Zestaw musi wyrazić zgodę na korzystanie z funkcji w wersji zapoznawczej przed ich użyciem.
pt_br: Um assembly precisa optar por visualizar recursos antes de usá-los.
ru: В сборке должно быть предоставлено согласие на использование предварительных функций, прежде чем применять их.
tr: Bir derlemenin kullanmadan önce önizleme özelliklerini kabul etmesi gerekiyor.
zh_hans: 程序集必须先选择加入预览功能，然后才能使用它们。
zh_hant: 組合在使用前必須先加入預覽功能。

# DetectPreviewFeaturesMessage
source: Using '{0}' requires opting into preview features. See {1} for more information.
cs: Použití {0} vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {1}.
de: Die Verwendung von „{0}“ erfordert das Abonnieren von Vorschaufeatures. Weitere Informationen finden Sie unter {1}.
es: El uso de '{0}' requiere la participación en las características en versión preliminar. Consulte {1} para obtener más información.
fr: L'utilisation de '{0}' nécessite d'opter pour les fonctions de prévisualisation. Voir {1}pour plus d'informations.
it: L'uso di '{0}' richiede il consenso esplicito per le funzionalità di anteprima. Per altre informazioni, vedere {1}.
ja: '{0}' を使用するには、プレビュー機能を選択する必要があります。詳細については、「{1}」を参照してください。
ko: '{0}'을(를) 사용하려면 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {1}(을)를 참조하세요.
pl: Korzystanie z „{0}” wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {1}.
pt_br: Usar “{0}” requer a aceitação dos recursos de visualização. Consulte {1} para obter mais informações.
ru: Для использования "{0}" требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {1}.
tr: '{0}' kullanabilmeniz için önizleme özelliklerinin kabul edilmesi gerekir. Daha fazla bilgi için bkz. {1}.
zh_hans: 使用“{0}”需要选择加入预览功能。有关详细信息，请参阅 {1}。
zh_hant: 使用 '{0}' 必須加入預覽功能。如需詳細資訊，請參閱 {1}。

# DetectPreviewFeaturesMessageWithCustomMessagePlaceholder
source: {2} Using '{0}' requires opting into preview features. See {1} for more information.
cs: {2} Použití {0} vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {1}.
de: {2} Die Verwendung von „{0}“ erfordert das Abonnieren von Vorschaufeatures. Weitere Informationen finden Sie unter {1}.
es: {2} El uso de '{0}' requiere la participación en las características en versión preliminar. Consulte {1} para obtener más información.
fr: L'utilisation de '{2}' {0} nécessite d'opter pour les fonctions de prévisualisation. Voir {1}pour plus d'informations.
it: {2} L'uso di '{0}' richiede il consenso esplicito per le funzionalità di anteprima. Per altre informazioni, vedere {1}.
ja: {2} '{0}' を使用するには、プレビュー機能を選択する必要があります。詳細については、「{1}」を参照してください。
ko: {2} '{0}'을(를) 사용하려면 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {1}을(를) 참조하세요.
pl: {2} Korzystanie z „{0}” wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {1}.
pt_br: {2}Usar “{0}” requer a aceitação dos recursos de visualização. Consulte {1} para obter mais informações.
ru: {2} Для использования "{0}" требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {1}.
tr: {2} '{0}' kullanabilmeniz için önizleme özelliklerinin kabul edilmesi gerekir. Daha fazla bilgi için bkz. {1}.
zh_hans: {2} 使用“{0}”需要选择加入预览功能。有关详细信息，请参阅 {1}。
zh_hant: {2} 使用 '{0}' 必須加入預覽功能。如需詳細資訊，請參閱 {1}。

# DetectPreviewFeaturesTitle
source: This API requires opting into preview features
cs: Toto rozhraní API vyžaduje vyjádření výslovného souhlasu s funkcemi ve verzi Preview.
de: Für diese API müssen Vorschaufeatures abonniert werden
es: Esta API requiere la participación en las características en versión preliminar.
fr: Cette API requiert l’option d’évaluation des fonctionnalités en préversion.
it: Per questa API è necessario acconsentire esplicitamente alle funzionalità di anteprima
ja: この API では、プレビュー機能をオプトインする必要があります
ko: 이 API는 미리 보기 기능을 선택해야 합니다.
pl: Ten interfejs API wymaga zgody na funkcje w wersji zapoznawczej
pt_br: Esta API requer a aceitação de recursos de visualização
ru: Этот API требует согласия на использование предварительных функций
tr: Bu API, önizleme özelliklerini kabul etmeyi gerektirir
zh_hans: 此 API 需要选择加入预览功能
zh_hant: 此 API 需要加入預覽功能
