Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseWeakCryptographicAlgorithmsDescription
source: Cryptographic algorithms degrade over time as attacks become for advances to attacker get access to more computation. Depending on the type and application of this cryptographic algorithm, further degradation of the cryptographic strength of it may allow attackers to read enciphered messages, tamper with enciphered messages, forge digital signatures, tamper with hashed content, or otherwise compromise any cryptosystem based on this algorithm. Replace encryption uses with the AES algorithm (AES-256, AES-192 and AES-128 are acceptable) with a key length greater than or equal to 128 bits. Replace hashing uses with a hashing function in the SHA-2 family, such as SHA-2 512, SHA-2 384, or SHA-2 256.
cs: Výkonnost kryptografických algoritmů časem klesá, protože útoky se stávají stále sofistikovanější a útočníci získávají přístup k vyššímu výpočetnímu výkonu. Podle typu aplikace a kryptografického algoritmu může další snižování jeho kryptografické síly umožnit útočníkovi číst šifrované zprávy, upravovat je, falšovat digitální podpisy, upravovat hodnotu hash obsahu nebo jinak útočit na kryptografický systém založený na tomto algoritmu. Nahraďte místa, kde se používá šifrování, algoritmem AES (přípustné jsou varianty AES-256, AES-192 a AES-128) s délkou klíče alespoň 128 bitů. Nahraďte místa, kde se používá algoritmus hash, hashovací funkcí řady SHA-2, třeba SHA-2 512, SHA-2 384 nebo SHA-2 256.
de: Kryptografische Algorithmen verlieren mit der Zeit ihre Wirkung, weil Angreifer ihre Methoden verbessern und Zugang zu umfangreicheren Berechnungsalgorithmen erhalten. Je nach Typ und Anwendung dieses kryptografischen Algorithmus können Angreifer durch eine weitere Herabsetzung der kryptografischen Stärke verschlüsselte Nachrichten lesen, verschlüsselte Nachrichten manipulieren, digitale Signaturen fälschen, Hashinhalte manipulieren oder jedes auf diesem Algorithmus basierende Verschlüsselungssystem in anderer Hinsicht kompromittieren. Ersetzen Sie die Verwendung von Verschlüsselungen durch den AES-Algorithmus (AES-256, AES-192 und AES-128 sind zulässig) mit einer Schlüssellänge von mindestens 128 Bit. Ersetzen Sie die Verwendung von Hashing durch eine Hashfunktion in der SHA-2-Familie, beispielsweise SHA-2 512, SHA-2 384 oder SHA-2 256.
es: Los algoritmos criptográficos se degradan con el tiempo a medida que los ataques evolucionan y permiten al atacante obtener mayor cantidad de computación. En función del tipo y la aplicación de este algoritmo criptográfico, una mayor degradación de la solidez criptográfica podría permitir a los atacantes leer mensajes cifrados, alterar con mensajes cifrados, forzar firmas digitales, alterar con contenido con hash o poner en riesgo de otro modo cualquier sistema criptográfico basado en este algoritmo. Reemplace los usos del cifrado por el algoritmo AES (se aceptan AES-256, AES-192 y AES-128) con una longitud de clave igual o superior a 128 bits. Reemplace los usos del hash por una función hash de la familia de SHA-2, como SHA-2 512, SHA-2 384 o SHA-2 256.
fr: Les algorithmes de chiffrement se dégradent au fil du temps, car les pirates accèdent à une puissance de calcul toujours plus importante. En fonction du type et de l'application de cet algorithme de chiffrement, plus sa force de chiffrement se dégrade, plus les pirates peuvent lire des messages chiffrés, falsifier des messages chiffrés, falsifier des signatures numériques, falsifier du contenu basé sur un code de hachage ou compromettre d'une façon ou d'une autre tout système de chiffrement reposant sur cet algorithme. Remplacez la clé de chiffrement de l'algorithme AES (les algorithmes AES-256, AES-192 et AES-128 sont acceptables) par une clé de longueur supérieure ou égale à 128 bits. Remplacez l'utilisation des codes de hachage par une fonction de hachage de la famille SHA-2, par exemple SHA-2 512, SHA-2 384 ou SHA-2 256.
it: Gli algoritmi di crittografia degradano col passare del tempo quando gli attacchi si fanno più sofisticati consentendo a utenti malintenzionati di accedere a un maggior numero di dati di calcolo. A seconda del tipo e dell'applicazione di questo algoritmo di crittografia, nonché della riduzione dell'efficacia crittografica, questo potrebbe consentire agli utenti malintenzionati di leggere messaggi crittografati, manomettere messaggi crittografati, falsare firme digitali, manomettere contenuto con hash o compromettere in altro modo eventuali sistemi di crittografia basati su questo algoritmo. Sostituire la crittografia usata con l'algoritmo AES (sono accettabili AES-256, AES-192 e AES-128) con una lunghezza di chiave maggiore o uguale a 128 bit. Sostituire gli hash usati con una funzione hash della famiglia SHA-2, ad esempio SHA-2 512, SHA-2 384, or SHA-2 256.
ja: 攻撃が進化し、攻撃者がアクセスできる計算が増えるにつれ、暗号アルゴリズムは徐々に弱まっていきます。この暗号アルゴリズムの種類とアプリケーションによっては、暗号の強度がさらに弱くなると、攻撃者は、暗号化されたメッセージの読み取り、暗号化されたメッセージの改ざん、デジタル署名の偽造、ハッシュされたコンテンツの改ざん、またはこのアルゴリズムに基づく暗号システムの侵害を実行できるようになる可能性があります。暗号化の使用を、キーの長さが 128 ビット以上の AES アルゴリズム (AES-256、AES-192、および AES-128 が使用可能) に置き換えます。ハッシュの使用を、SHA-2 512、SHA-2 384、SHA-2 256 などの SHA-2 ファミリのハッシュ関数に置き換えます。
ko: 암호화 알고리즘의 성능이 점점 저하되어 공격자가 더 많은 계산에 액세스할 수 있도록 공격이 진화합니다. 암호화 알고리즘의 형식과 애플리케이션 및 계속 저하되는 암호화 기능에 따라 공격자가 암호화된 메시지를 읽고, 암호화된 메시지를 변조하고, 디지털 서명을 위조하고, 해시된 콘텐츠를 변조하거나 이 알고리즘 기반의 암호화 시스템을 손상시킬 수 있습니다. 암호화를 키 길이가 128비트보다 크거나 같은 AES 알고리즘(AES-256, AES-192 및 AES-128 사용 가능)으로 바꾸세요. 해시를 SHA-2 512, SHA-2 384 또는 SHA-2 256과 같은 SHA-2 패밀리의 해시 알고리즘으로 바꾸세요.
pl: Algorytmy kryptograficzne pogarszają się z upływem czasu, ponieważ ataki stają się coraz bardziej zaawansowane, a atakujący zyskują dostęp do większej ilości zasobów obliczeniowych. W zależności od typu i zastosowania tego algorytmu kryptograficznego dalsze osłabianie siły kryptograficznej algorytmu może umożliwić atakującemu odczytanie zaszyfrowanych wiadomości, ingerowanie w zaszyfrowane wiadomości, fałszowanie podpisów cyfrowych, ingerowanie w mieszaną zawartość lub inne naruszenie systemu kryptograficznego opartego na tym algorytmie. Zastąp użycia szyfrowane algorytmem AES (akceptowane są algorytmy AES-256, AES-192 i AES-128) z kluczem o długości równej lub większej niż 128 bitów. Zastąp użycia mieszane funkcją skrótu z rodziny SHA-2, taką jak SHA-2 512, SHA-2 384 lub SHA-2 256.
pt_br: Os algoritmos de criptografia são afetados com o tempo à medida que os ataques avançam para que o invasor obtenha acesso a mais computação. Dependendo do tipo e da aplicação desse algoritmo de criptografia, uma degradação maior da força criptográfica dele pode permitir que os invasores leiam e adulterem mensagens cifradas, forjem assinaturas digitais, adulterem conteúdo com hash ou, de outra forma, comprometam qualquer sistema de criptografia baseado nesse algoritmo. Substitua os usos de criptografia com o algoritmo AES (AES-256, AES-192 e AES-128 são aceitáveis) por um comprimento de chave maior ou igual a 128 bits. Substitua os usos de hash por uma função de hash na família SHA-2, como SHA-2 512, SHA-2 384 ou SHA-2 256.
ru: Алгоритмы шифрования постепенно устаревают, так как злоумышленники получают в свое распоряжение все большие вычислительные мощности, а их атаки становятся все изощреннее. В зависимости от типа и способа применения алгоритма шифрования снижение его криптографической стойкости может позволить злоумышленникам считать или незаконно изменить зашифрованные сообщения, подделать цифровые подписи, незаконно изменить хэшированное содержимое, а также скомпрометировать любую систему шифрования, основанную на этом алгоритме. Замените средства шифрования на алгоритм AES (допустимы AES-256, AES-192 и AES-128) с длиной ключа не меньше 128 бит. Замените средства хэширования на хэш-функцию из семейства SHA-2, например SHA-2 512, SHA-2 384 или SHA-2 256.
tr: Saldırgan daha fazla işlem erişimi elde ettikçe kriptografik algoritmalar zaman içinde zayıflar. Bu kriptografik algoritmanın türü ve uygulamasına bağlı olarak, kriptografik gücün daha da zayıflatılması saldırganların şifrelenmiş iletileri okumasına, şifrelenmiş iletilen üzerinde oynamasına, dijital imza sahteciliği yapmasına, karma içerik üzerinde oynamasına veya bu algoritmayı temel alan herhangi bir kriptosistemin güvenliğini bozmasına neden olabilir. AES algoritması (AES-256, AES-192 ve AES-128 kabul edilebilir) ile şifreleme kullanımlarını 128 bit veya daha büyük bir anahtar uzunluğuyla değiştirin. Karma kullanımlarını SHA-2 512, SHA-2 384 veya SHA-2 256 gibi SHA-2 ailesindeki bir karma işleviyle değiştirin.
zh_hans: 加密算法随时间的推移而变弱，因为攻击成为攻击者获取更多计算的推动因素。根据此加密算法的类型和应用情况，其加密强度逐渐降低可能会使攻击者读取加密消息、篡改加密消息、伪造数字签名、篡改哈希内容，或以其他方式危害任何基于该算法的加密系统。将加密用法替换为密钥长度大于或等于 128 位的 AES 算法(AES-256、AES-192 和 AES-128 均可)。将哈希用法替换为 SHA-2 系列中的哈希函数，例如 SHA-2 512、SHA-2 384 或 SHA-2 256。
zh_hant: 因為攻擊者取得更多的運算存取，讓攻擊升級，以致密碼編譯演算法隨著時間減弱。視此密碼編譯演算法的類型及應用方式之不同，密碼編譯強度日益減弱，會讓攻擊者能讀取加密的訊息、竄改加密的訊息、偽造數位簽章、竄改雜湊內容，或危害任何以此演算法為基礎的密碼系統。以長度大於或等於 128 位元的金鑰，取代搭配 AES (可接受 AES-256、AES-192 和 AES-128) 演算法的加密。以 SHA-2 512、SHA-2 384 或 SHA-2 256 等 SHA-2 系列中的雜湊函數，取代雜湊用途。

# DoNotUseWeakCryptographicAlgorithmsMessage
source: {0} uses a weak cryptographic algorithm {1}
cs: {0} používá slabý kryptografický algoritmus {1}.
de: "{0}" verwendet einen schwachen kryptografischen Algorithmus: {1}
es: {0} usa un algoritmo criptográfico poco seguro {1}.
fr: {0} utilise un algorithme de chiffrement faible {1}
it: {0} usa un algoritmo di crittografia vulnerabile {1}
ja: {0} が、脆弱な暗号アルゴリズム {1} を使用します
ko: {0}이(가) 취약한 암호화 알고리즘 {1}을(를) 사용합니다.
pl: Element {0} używa słabych algorytmów kryptograficznych {1}
pt_br: {0} usa um algoritmo de criptografia fraco {1}
ru: {0} использует слабый алгоритм шифрования {1}
tr: {0} zayıf {1} kriptografik algoritmasını kullanıyor
zh_hans: {0} 使用弱加密算法 {1}
zh_hant: {0} 使用弱式密碼編譯演算法 {1}

# DoNotUseWeakKDFAlgorithm
source: Ensure Key Derivation Function algorithm is sufficiently strong
cs: Ujistěte se, že algoritmus KDF (key derivation function) je dostatečně silný.
de: Sicherstellen eines ausreichend starken Algorithmus für die Schlüsselableitungsfunktion
es: Asegurarse de que el algoritmo de función de derivación de claves es suficientemente seguro
fr: Vérifier que l'algorithme de la fonction de dérivation de clés est suffisamment fort
it: Verifica che l'algoritmo della funzione di derivazione di chiave sia sufficientemente complesso
ja: キー派生関数アルゴリズムが十分に強力であることを確認します
ko: 키 파생 함수 알고리즘이 충분히 강력한지 확인
pl: Upewnij się, że algorytm funkcji wyprowadzania klucza jest dostatecznie silny
pt_br: Garanta que o algoritmo da Função de Derivação de Chaves seja suficientemente forte
ru: Убедитесь, что алгоритм функции формирования ключа достаточно надежен.
tr: Anahtar Türetme İşlevi algoritmasının yeterince güçlü olduğundan emin olun
zh_hans: 确保密钥派生功能算法足够强大
zh_hant: 確認金鑰衍生函數 (Key Derivation Function) 演算法是否夠強

# DoNotUseWeakKDFAlgorithmDescription
source: Some implementations of the Rfc2898DeriveBytes class allow for a hash algorithm to be specified in a constructor parameter or overwritten in the HashAlgorithm property. If a hash algorithm is specified, then it should be SHA-256 or higher.
cs: Některé implementace třídy Rfc2898DeriveBytes umožňují, aby se algoritmus hash zadal v parametru konstruktoru nebo přepsal ve vlastnosti HashAlgorithm. V případě zadání algoritmu hash by se mělo jednat o SHA-256 nebo vyšší.
de: Einige Implementierungen der Rfc2898DeriveBytes-Klasse ermöglichen das Angeben eines Hashalgorithmus in einem Konstruktorparameter oder das Überschreiben in der HashAlgorithm-Eigenschaft. Wird ein Hashalgorithmus angegeben, muss SHA-256 oder höher verwendet werden.
es: Algunas implementaciones de la clase Rfc2898DeriveBytes permiten especificar un algoritmo hash en un parámetro de constructor o sobrescribirlo en la propiedad HashAlgorithm. Si se especifica un algoritmo hash, debe ser SHA-256 o una versión posterior.
fr: Certaines implémentations de la classe Rfc2898DeriveBytes permettent de spécifier un algorithme de hachage dans un paramètre de constructeur ou de le remplacer dans la propriété HashAlgorithm. Si un algorithme de hachage est spécifié, il doit correspondre à un chiffrement SHA-256 ou supérieur.
it: Alcune implementazioni della classe Rfc2898DeriveBytes consentono di specificare un algoritmo hash in un parametro del costruttore o di sovrascriverlo nella proprietà HashAlgorithm. Se si specifica un algoritmo hash, è necessario specificare almeno quello SHA-256.
ja: Rfc2898DeriveBytes クラスの一部の実装では、ハッシュ アルゴリズムをコンストラクターのパラメーターで指定するか、HashAlgorithm プロパティで上書きすることができます。ハッシュ アルゴリズムが指定されている場合、SHA-256 またはそれ以上でなければなりません。
ko: Rfc2898DeriveBytes 클래스의 일부 구현에서는 해시 알고리즘을 생성자 매개 변수에 지정하거나 HashAlgorithm 속성에서 덮어쓸 수 있도록 허용합니다. 해시 알고리즘이 지정된 경우 SHA-256 이상의 해시 알고리즘이어야 합니다.
pl: Niektóre implementacje klasy Rfc2898DeriveBytes umożliwiają określenie algorytmu wyznaczania wartości skrótu w parametrze konstruktora lub jego zastąpienie we właściwości HashAlgorithm. Jeśli algorytm wyznaczania wartości skrótu istnieje, powinien być to SHA-256 lub wyższy.
pt_br: Algumas implementações da classe Rfc2898DeriveBytes permitem que um algoritmo de hash seja especificado no parâmetro do construtor ou substituído na propriedade HashAlgorithm. Se um algoritmo de hash for especificado, ele deverá ser um SHA-256 ou superior.
ru: Некоторые реализации класса Rfc2898DeriveBytes позволяют указать алгоритм хэша в параметре конструктора или перезаписать его в свойстве HashAlgorithm. Если алгоритм хэша указан, это должен быть алгоритм SHA-256 или выше.
tr: Rfc2898DeriveBytes sınıfının bazı uygulamaları, bir karma algoritması değerinin oluşturucu parametresinde belirtilmesine veya HashAlgorithm özelliğinde üzerine yazılmasına olanak sağlar. Bir karma algoritması belirtilirse SHA-256 veya üzeri olmalıdır.
zh_hans: Rfc2898DeriveBytes 类的某些实现允许在构造函数参数中指定哈希算法或在 HashAlgorithm 属性中覆盖它。如果指定了哈希算法，则它应为 SHA-256 或更高版本。
zh_hant: Rfc2898DeriveBytes 類別的部分實作使雜湊演算法能在建構函式參數中指定，或在 HashAlgorithm 屬性中覆寫。如果指定雜湊演算法，則其應為 SHA-256 以上 (含)。

# DoNotUseWeakKDFAlgorithmMessage
source: {0} might be using a weak hash algorithm. Use SHA256, SHA384, or SHA512 to create a strong key from a password.
cs: {0} možná používá slabý algoritmus hash. Pokud chcete vytvořit silný klíč z hesla, použijte SHA256, SHA384 nebo SHA512.
de: "{0}" verwendet möglicherweise einen schwachen Hashalgorithmus. Verwenden Sie SHA256, SHA384 oder SHA512, um einen sicheren Schlüssel aus einem Kennwort zu erstellen.
es: Puede que {0} esté usando un algoritmo hash débil. Use SHA256, SHA384 o SHA512 para crear una clave segura a partir de una contraseña.
fr: {0} utilise peut-être un algorithme de hachage faible. Utilisez SHA256, SHA384 ou SHA512 pour créer une clé forte à partir d'un mot de passe.
it: {0} potrebbe usare un algoritmo hash vulnerabile. Usare SHA256, SHA384 o SHA512 per creare una chiave avanzata da una password.
ja: {0} に弱いハッシュ アルゴリズムが使用されている可能性があります。SHA256、SHA384、SHA512 を使用してパスワードから強力なキーを作成してください。
ko: {0}이(가) 취약한 해시 알고리즘을 사용하고 있을 수 있습니다. 암호에서 강력한 키를 만들려면 SHA256, SHA384 또는 SHA512를 사용하세요.
pl: Element {0} prawdopodobnie używa słabego algorytmu wyznaczania wartości skrótu. Aby utworzyć silny klucz na podstawie hasła, użyj algorytmu SHA256, SHA384 lub SHA512.
pt_br: É possível que {0} esteja usando um algoritmo de hash fraco. Use o SHA256, o SHA384 ou o SHA512 para criar uma chave forte por meio de uma senha.
ru: {0} создан с использованием слабого хэш-алгоритма. Для создания надежного ключа на основе пароля используйте алгоритм SHA256, SHA384 или SHA512.
tr: {0}, zayıf bir karma algoritması kullanıyor olabilir. Paroladan güçlü bir anahtar oluşturmak için SHA256, SHA384 veya SHA512 kullanın.
zh_hans: {0} 可能正在使用弱哈希算法。请使用 SHA256、SHA384 或 SHA512 根据密码创建强密钥。
zh_hant: {0} 可能使用的是弱式雜湊演算法。請使用 SHA256、SHA384 或 SHA512，從密碼建立增強式金鑰。

# DoNotUseWeakKDFInsufficientIterationCountDescription
source: When deriving cryptographic keys from user-provided inputs such as password, use sufficient iteration count (at least 100k).
cs: Při odvozování kryptografických klíčů z uživatelem zadaných vstupů, jako je například heslo, používejte dostatečný počet iterací (alespoň 100 000).
de: Verwenden Sie beim Ableiten kryptografischer Schlüssel aus Benutzereingaben (z. B. Kennwort) eine ausreichende Anzahl von Iterationen (mindestens 100.000).
es: Al derivar claves criptográficas de entradas proporcionadas por el usuario, como la contraseña, use un recuento de iteraciones suficiente (al menos 100 k).
fr: Quand vous dérivez des clés de chiffrement à partir d'entrées fournies par l'utilisateur, par exemple un mot de passe, utilisez un nombre suffisant d'itérations (au moins 100 000).
it: Durante la derivazione di chiavi crittografiche dagli input forniti dall'utente, come la password, usare un numero di iterazioni sufficiente (almeno 100.000).
ja: パスワードなど、ユーザーが指定した入力から暗号化キーを派生させる場合は、十分な反復回数を使用してください (少なくとも 10 万)。
ko: 암호와 같은 사용자 제공 입력에서 암호화 키를 파생할 때 충분한 반복 횟수(10만 이상)를 사용하세요.
pl: Wyprowadzając klucze kryptograficzne z danych wejściowych wprowadzonych przez użytkownika, takich jak hasło, użyj wystarczającej liczby iteracji (co najmniej 100 tys.).
pt_br: Ao derivar chaves de criptografia de entradas fornecidas pelo usuário, como uma senha, use a contagem de iteração suficiente (de pelo menos 100 mil).
ru: При формировании криптографических ключей из предоставленных пользователем входных данных, таких как пароль, используйте достаточное число итераций (не менее 100 тыс.).
tr: Parola gibi kullanıcı tarafından sağlanan girişlerden şifreleme anahtarları türetirken, yeterli sayıda yineleme (en az 100.000) kullanın.
zh_hans: 基于用户提供的输入(如密码)派生加密密钥时，请使用足够大的迭代计数(至少 100,000 次)。
zh_hant: 當從密碼等使用者提供的輸入衍生密碼編譯金鑰時，請使用足夠的反覆項目計數 (至少 100k)。

# DoNotUseWhenAllWithSingleTaskDescription
source: Using 'WhenAll' with a single task may result in performance loss, await or return the task instead.
cs: Použití whenall s jednou úlohou může vést ke ztrátě výkonu, čekání nebo vrácení úlohy.
de: Die Verwendung von "WhenAll" mit einer einzelnen Aufgabe kann zu Leistungseinbußen führen. Verwenden Sie stattdessen "await", oder geben Sie die Aufgabe zurück.
es: El uso de "WhenAll" con una sola tarea puede provocar una pérdida de rendimiento, esperar o devolver la tarea en su lugar.
fr: L’utilisation de ’WhenAll’ avec une seule tâche peut entraîner une perte de performance, attendre ou retourner la tâche à la place.
it: L'uso di 'WhenAll' con una singola attività potrebbe influire negativamente sulle prestazioni. In alternativa, attendere o restituire l'attività.
ja: 1 つのタスクで 'WhenAll' を使用すると、パフォーマンスが低下したり、代わりにタスクを待機または返したりする可能性があります。
ko: 단일 작업에 'WhenAll'을 사용하면 대신 성능이 저하되거나 작업을 기다리거나 반환할 수 있습니다.
pl: Użycie wywołania „WhenAll” z pojedynczym zadaniem może spowodować utratę wydajności, pojawienie się parametru await lub zwrócenie zadania.
pt_br: Usar 'WhenAll' com uma única tarefa pode resultar em perda de desempenho, aguardar ou retornar a tarefa.
ru: Использование "WhenAll" с одной задачей может привести к снижению производительности. Вместо этого ожидайте или возвратите задачу.
tr: Tek bir görevle 'WhenAll' kullanılması performans kaybına neden olabilir. Bunun yerine bekleyin veya göreve geri dönün.
zh_hans: 将 “WhenAll” 与单个任务一起使用可能导致性能丢失、等待或返回任务。
zh_hant: 對單一工作使用 'WhenAll' 可能會造成效能降低，請改為等待或返回工作。

# DoNotUseWhenAllWithSingleTaskFix
source: Replace 'WhenAll' call with argument
cs: Nahradit volání WhenAll argumentem
de: Aufruf von "WhenAll" durch Argument ersetzen
es: Reemplazar la llamada 'WhenAll' por el argumento
fr: Remplacer l’appel ’WhenAll’ par l’argument
it: Sostituire la chiamata 'WhenAll' con argomento
ja: 'WhenAll' 呼び出しを引数に置き換えます
ko: 'WhenAll' 호출을 인수로 대체
pl: Zastąp wywołanie „WhenAll” argumentem
pt_br: Substituir chamada 'WhenAll' por argumento
ru: Заменить вызов "WhenAll" аргументом
tr: 'WhenAll' çağrısını bağımsız değişkenle değiştirin
zh_hans: 将 “WhenAll” 调用替换为参数
zh_hant: 請以引數取代 'WhenAll' 呼叫

# DoNotUseWhenAllWithSingleTaskTitle
source: Do not use 'WhenAll' with a single task
cs: Nepoužívejte WhenAll s jedním úkolem.
de: "WhenAll" nicht mit einer einzelnen Aufgabe verwenden
es: No usar "WhenAll" con una sola tarea
fr: Ne pas utiliser ’WhenAll’ avec une seule tâche
it: Non usare 'WhenAll' con una singola attività
ja: 1 つのタスクで 'WhenAll' を使用しない
ko: 단일 작업에 'WhenAll'을 사용하지 마세요.
pl: Nie używaj wywołania „WhenAll” z pojedynczym zadaniem
pt_br: Não use 'WhenAll' com uma única tarefa
ru: Не использовать "WhenAll" с одной задачей
tr: Tek bir görevle 'WhenAll' kullanmayın
zh_hans: 不要对单个任务使用 “WhenAll”
zh_hant: 不要對單一工作使用 'WhenAll'

source: Do Not Use XslTransform
cs: Nepoužívat XslTransform
de: Kein XslTransform verwenden
es: No utilizar XslTransform
fr: Ne pas utiliser XslTransform
it: Non usare XslTransform
ja: XslTransform を使用しないでください
ko: XslTransform 사용 안 함
pl: Nie używaj klasy XslTransform
pt_br: Não Use XslTransform
ru: Не используйте XslTransform.
tr: XslTransform Kullanma
zh_hans: 请勿使用 XslTransform
zh_hant: 請勿使用 XslTransform

# DoNotUseXslTransformMessage
source: Do not use XslTransform. It does not restrict potentially dangerous external references.
cs: Nepoužije XslTransform. Neomezí se tím potenciálně nebezpečné externí odkazy.
de: Verwenden Sie kein XslTransform. Es schränkt potenziell gefährliche externe Verweise nicht ein.
es: No utilice XslTransform. No restringe las referencias externas potencialmente peligrosas.
fr: N'utilisez pas XslTransform car il ne restreint pas les références externes potentiellement dangereuses.
it: Non usare XslTransform. Non limita i riferimenti esterni potenzialmente pericolosi.
ja: XslTransform を使用しないでください。危険性のある外部参照は制限されません。
ko: XslTransform을 사용하지 마세요. 잠재적으로 위험한 외부 참조를 제한하지 않습니다.
pl: Nie używaj klasy XslTransform. Nie ogranicza to potencjalnie niebezpiecznych odwołań zewnętrznych.
pt_br: Não use XslTransform. Ele não restringe referências externas potencialmente perigosas.
ru: Не используйте XslTransform. Он не ограничивает потенциально опасные внешние ссылки.
tr: XslTransform kullanmayın. Tehlikeli olabilecek dış başvuruları kısıtlamaz.
zh_hans: 请勿使用 XslTransform。它对具有潜在危险的外部引用并没有限制。
zh_hant: 請勿使用 XslTransform。它不會限制可能引發危險的外部參考。
