Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetCore.Analyzers/xlf/MicrosoftNetCoreAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MembersDeclaredOnImplementationTypeMustBeStaticMessage
source: The '{0}' member on the '{1}' type should be marked 'static' as '{1}' has the 'DynamicInterfaceImplementationAttribute' applied
cs: Člen {0} v typu {1} by měl být označen jako static, protože {1} používa atribut DynamicInterfaceImplementationAttribute.
de: Der Member "{0}" für den Typ "{1}" sollte als "static" gekennzeichnet werden, weil auf "{1}" das Attribut "DynamicInterfaceImplementationAttribute" angewendet wird.
es: El miembro '{0}' del tipo "{1}debe marcarse como "static" como "{1}" tiene aplicado "DynamicInterfaceImplementationAttribute".
fr: Le membre «{0}» sur le type «{1}» doit être marqué comme «static», car «{1}» a l’application «DynamicInterfaceImplementationAttribute».
it: Il membro '{0}' nel tipo '{1}' deve essere contrassegnato come 'static' perché a '{1}' è stato applicato l'attributo 'DynamicInterfaceImplementationAttribute'
ja: '{1}' 型の '{0}' メンバーは、'{1}' が 'DynamicInterfaceImplementationAttribute' に適用されているため、'static' としてマークする必要があります
ko: '{1}' 형식의 '{0}' 멤버는 '{1}'에 'DynamicInterfaceImplementationAttribute'가 적용되었으므로 '정적'으로 표시되어야 합니다.
pl: Składowa „{0}” w typie „{1}” powinna być oznaczony jako „statyczny”, ponieważ element „{1}” ma zastosowany atrybut „DynamicInterfaceImplementationAttribute”
pt_br: O membro '{0}' no tipo '{1}' deve ser marcado como 'static' como '{1}' tem o 'DynamicInterfaceImplementationAttribute' aplicado
ru: Элемент "{0}" в типе "{1}" должен быть помечен как "static", так как для "{1}" применен атрибут "DynamicInterfaceImplementationAttribute"
tr: '{1}' türü üzerindeki '{0}' 'static' olarak işaretlenmeli çünkü '{1}' için 'DynamicInterfaceImplementationAttribute' uygulanmış
zh_hans: “{0}”成员(在“{1}”类型上)应标记为 “static”，因为“{1}”应用了 “DaynamicInterfaceImplementationAttribute”
zh_hant: '{1}' 類型的 '{0}' 成員應該標記為 'static'，因為 '{1}' 已套用 'DynamicInterfaceImplementationAttribute'

# MembersDeclaredOnImplementationTypeMustBeStaticTitle
source: Members defined on an interface with the 'DynamicInterfaceCastableImplementationAttribute' should be 'static'
cs: Členy definované v rozhraní s atributem DynamicInterfaceCastableImplementationAttribute by měly mít hodnotu Static.
de: Die für eine Schnittstelle mit dem "DynamicInterfaceCastableImplementationAttribute" definierten Member müssen "static" sein
es: Los miembros definidos en una interfaz con 'DynamicInterfaceCastableImplementationAttribute' deben ser 'static'
fr: Les membres définis sur une interface avec ’DynamicInterfaceCastableImplementationAttribute’ doivent être ’static'
it: I membri definiti in un'interfaccia con 'DynamicInterfaceCastableImplementationAttribute' devono essere 'static'
ja: 'DynamicInterfaceCastableImplementationAttribute' を持つインターフェイスで定義されたメンバーは 'static' である必要があります
ko: 'DynamicInterfaceCastableImplementationAttribute'가 있는 인터페이스에 정의된 멤버는 '정적'이어야 합니다.
pl: Składowe zdefiniowane w interfejsie z atrybutem „DynamicInterfaceCastableImplementationAttribute” powinny mieć wartość „statyczne”
pt_br: Os membros definidos em uma interface com 'DynamicInterfaceCastableImplementationAttribute' devem ser 'static'
ru: Элементы, определенные в интерфейсе с помощью "DynamicInterfaceCastableImplementationAttribute", должны быть "static"
tr: Bir arabirimde 'DynamicInterfaceCastableImplementationAttribute' ile tanımlanan üyeler 'static' olmalıdır
zh_hans: 在具有 “DynamicInterfaceCastableImplementationAttribute” 的接口上定义的成员应为 “static”
zh_hant: 在有 'DynamicInterfaceCastableImplementationAttribute' 介面上定義的成員應為 'static'

# MethodReturnsPreviewTypeMessage
source: '{0}' returns the preview type '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {0} vrací typ preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: „{0}“ gibt den Vorschautyp „{1}“ zurück, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: '{0}' devuelve el tipo de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{0}' retourne le type de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: '{0}' restituisce il tipo di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: '{0}' はプレビュー型 '{1}' を返すため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: '{0}'은(는) 미리 보기 유형 '{1}'을(를) 반환하므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}을(를) 참조하세요.
pl: „{0}” zwraca typ w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: “{0}” retorna o tipo de visualização “{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2} para obter mais informações.
ru: "{0}" возвращает предварительную версию типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: '{0}', '{1}' önizleme türünü döndürdüğünden önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: “{0}”返回预览类型“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: '{0}' 會傳回預覽類型 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# MethodReturnsPreviewTypeMessageWithCustomMessagePlaceholder
source: {3} '{0}' returns the preview type '{1}' and therefore needs to opt into preview features. See {2} for more information.
cs: {3}{0} vrací typ preview {1} a proto vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: {3} „{0}“ gibt den Vorschautyp „{1}“ zurück, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter{2}.
es: {3} '{0}' devuelve el tipo de vista previa '{1}' y, por lo tanto, debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{3}' {0} retourne le type de prévisualisation '{1}' et doit donc opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: {3} '{0}' restituisce il metodo di anteprima '{1}' e deve quindi acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: {3} '{0}' はプレビュー型 '{1}' を返すため、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: {3} '{0}'은(는) 미리 보기 유형 '{1}'을 반환하므로 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}(을)를 참조하세요.
pl: {3} „{0}” zwraca typ w wersji zapoznawczej „{1}” i dlatego wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: {3}“{0}” retorna o tipo de visualização “{1}” e, portanto, precisa aceitar os recursos de visualização. Consulte {2}para obter mais informações.
ru: "{0}" {3} возвращает предварительную версию типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: {3} '{0}', '{1}' önizleme türünü döndürdüğünden önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: {3}.“{0}”返回预览类型“{1}”，因此需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: {3} '{0}' 會傳回預覽類型 '{1}'，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# MethodUsesPreviewTypeAsParameterMessage
source: '{0}' takes in a preview parameter of type '{1}' and needs to opt into preview features. See {2} for more information.
cs: {0} používá typ preview {1} a vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: „{0}“ akzeptiert den Vorschauparametertyp „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: '{0}' toma un parámetro de vista previa de tipo '{1}' y debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: '{0}' reçoit un paramètre de prévisualisation de type '{1}' et doit opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: '{0}' accetta un parametro di anteprima di tipo '{1}' e deve acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: '{0}' は、'{1}' 型のプレビュー パラメーターを受け取り、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: '{0}'은(는) '{1}' 유형의 미리 보기 매개 변수를 사용하며 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}을(를) 참조하세요.
pl: „{0}” przyjmuje parametr w wersji zapoznawczej typu „{1}” i wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: “{0}” usa um parâmetro de visualização do tipo “{1}” e precisa aceitar os recursos de visualização. Consulte {2}para obter mais informações.
ru: "{0}" принимает предварительную версию параметра типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: '{0}', '{1}' türünün önizleme parametresinde olduğundan önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: “{0}”接受类型“{1}”的预览参数，并且需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: '{0}' 接受類型 '{1}' 的預覽參數，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# MethodUsesPreviewTypeAsParameterMessageWithCustomMessagePlaceholder
source: {3} '{0}' takes in a preview parameter of type '{1}' and needs to opt into preview features. See {2} for more information.
cs: {3}{0} používá typ preview {1} a vyžaduje vyjádření výslovného souhlasu s funkcemi preview. Další informace najdete v {2}.
de: {3} „{0}“ akzeptiert den Vorschauparametertyp „{1}“, daher müssen Vorschaufeatures abonniert werden. Weitere Informationen finden Sie unter {2}.
es: {3} '{0}' toma un parámetro de vista previa de tipo '{1}' y debe participar en las características en versión preliminar. Consulte {2} para obtener más información.
fr: {3} '{0}' reçoit un paramètre de prévisualisation de type '{1}' et doit opter pour les fonctionnalités de prévisualisation. Voir {2}pour plus d'informations.
it: '{3} '{0}' accetta un parametro di anteprima di tipo '{1}' e deve acconsentire esplicitamente alle funzionalità di anteprima. Per altre informazioni, vedere {2}.
ja: {3} '{0}' は、'{1}' 型のプレビュー パラメーターを受け取り、プレビュー機能を選択する必要があります。詳細については、「{2}」を参照してください。
ko: {3} '{0}'은(는) '{1}' 유형의 미리 보기 매개 변수를 사용하며 미리 보기 기능을 선택해야 합니다. 자세한 내용은 {2}(을)를 참조하세요.
pl: {3} „{0}” przyjmuje parametr w wersji zapoznawczej typu „{1}” i wymaga wyrażenia zgody na korzystanie z funkcji w wersji zapoznawczej. Aby uzyskać więcej informacji, zobacz {2}.
pt_br: {3}“{0}” usa um parâmetro de visualização do tipo “{1}” e precisa aceitar os recursos de visualização. Consulte {2}para obter mais informações.
ru: "{0}" {3} принимает предварительную версию параметра типа "{1}", поэтому требуется согласие на использование предварительных версий функций. Дополнительные сведения см. в разделе {2}.
tr: {3} '{0}', '{1}' türünün önizleme parametresinde olduğundan önizleme özelliklerini kabul etmesi gerekir. Daha fazla bilgi için bkz. {2}.
zh_hans: {3}.“{0}”接受类型“{1}”的预览参数，并且需要选择加入预览功能。有关详细信息，请参阅 {2}。
zh_hant: {3} '{0}' 接受類型 '{1}' 的預覽參數，因此必須加入預覽功能。如需詳細資訊，請參閱 {2}。

# MethodUsesRuntimeMarshallingEvenWhenMarshallingDisabledDescription
source: This method uses runtime marshalling even when runtime marshalling is disabled, which can cause unexpected behavior differences at runtime due to different expectations of a type's native layout.
cs: Tato metoda používá zařazování modulu runtime i tehdy, když je zařazování modulu runtime zakázáno, což může mít za následek neočekávané rozdíly v chování během doby spuštění vzhledem k různým očekáváním nativního rozložení typu.
de: Diese Methode verwendet Runtime-Marshalling auch dann, wenn das Runtime-Marshalling deaktiviert ist. Dies kann aufgrund unterschiedlicher Erwartungen an das native Layout eines Typs zu unerwarteten Verhaltensunterschieden zur Runtime führen.
es: Este método usa el marshalling en tiempo de ejecución incluso cuando el marshalling en tiempo de ejecución está deshabilitado, lo que puede provocar diferencias de comportamiento inesperadas durante el tiempo de ejecución debido a diferentes expectativas del diseño nativo de un tipo.
fr: Cette méthode utilise le marshaling d’exécution même lorsque le marshaling d’exécution est désactivé, ce qui peut entraîner des différences de comportement inattendues au moment de l’exécution en raison des attentes différentes de la disposition native d’un type.
it: Questo metodo usa il marshalling di runtime anche quando il marshalling di runtime è disabilitato, il che può causare differenze di comportamento impreviste in fase di esecuzione a causa di aspettative diverse del layout nativo di un tipo.
ja: このメソッドは、ランタイム マーシャリングが無効になっている場合でもランタイム マーシャリングを使用します。これにより、型のネイティブ レイアウトの想定が異なるため、実行時に予期しない動作の違いが発生する可能性があります。
ko: 이 메서드는 런타임 마샬링이 비활성화된 경우에도 런타임 마샬링을 사용하므로 형식의 기본 레이아웃에 대한 기대치가 다르기 때문에 런타임에 예기치 않은 동작 차이가 발생할 수 있습니다.
pl: Ta metoda używa kierowania środowiska uruchomieniowego nawet wtedy, gdy kierowanie środowiska uruchomieniowego jest wyłączone, co może powodować nieoczekiwane różnice w zachowaniu środowiska uruchomieniowego ze względu na różne oczekiwania dotyczące układu natywnego typu.
pt_br: Este método usa marshalling em tempo de execução mesmo quando o marshalling de tempo de execução está desabilitado, o que pode causar diferenças de comportamento inesperadas em tempo de execução devido a diferentes expectativas do layout nativo de um tipo.
ru: Этот метод использует маршалирование среды выполнения, даже если оно отключено, что может привести к непредвиденным различиям в работе во время выполнения из-за разных ожиданий собственного макета типа.
tr: Bu yöntem, çalışma zamanı sıralaması devre dışı bırakıldığında bile çalışma zamanı sıralaması kullanır; bu, bir türün yerel düzeninin farklı beklentileri nedeniyle çalışma zamanında beklenmeyen davranış farklılıklarına neden olabilir.
zh_hans: 即使禁用运行时封送，此方法也使用运行时封送，这可能会由于类型的本机布局的不同期望导致在运行时出现意外的行为差异。
zh_hant: 即使停用執行階段封送處理，此方法也會使用執行階段封送處理，這可能會在執行階段造成未預期的行為差異，因為對類型原生配置有不同的期望。

# MethodUsesRuntimeMarshallingEvenWhenMarshallingDisabledMessage
source: '{0}' uses runtime marshalling even when 'DisableRuntimeMarshallingAttribute' is applied. Use features like 'sizeof' and pointers directly to ensure accurate results.
cs: {0} používá zařazování modulu runtime i tehdy, když se používá „DisableRuntimeMarshallingAttribute“. Abyste zajistili přesné výsledky, použijte funkce jako „sizeof“ a ukazatele.
de: „{0}“ verwendet das Runtime-Marshalling auch dann, wenn das „DisableRuntimeMarshallingAttribute“ angewendet wird. Verwenden Sie Features wie „sizeof“ und Zeiger direkt, um genaue Ergebnisse sicherzustellen.
es: \"{0}\" usa el marshalling en tiempo de ejecución incluso cuando se aplica \"DisableRuntimeMarshallingAttribute\". Use características como \"sizeof\" y punteros directamente para garantizar resultados precisos.
fr: « {0} » utilise le marshaling d’exécution même quand « DisableRuntimeMarstribute » est appliqué. Utilisez des fonctionnalités telles que « sizeof » et des pointeurs directement pour garantir des résultats précis.
it: '{0}' usa il marshalling di runtime anche quando viene applicato 'DisableRuntimeMarshallingAttribute'. Usare funzionalità come 'sizeof' e puntatori direttamente per garantire risultati accurati.
ja: '{0}' は、'DisableRuntimeMarsattribute' が適用されている場合でもランタイム マーシャリングを使用します。正確な結果を得るには、'sizeof' やポインターなどの機能を直接使用します。
ko: '{0}'은(는) 'DisableRuntimeMarshallingAttribute'가 적용된 경우에도 런타임 마샬링을 사용합니다. 정확한 결과를 보장하기 위해 'sizeof' 및 포인터와 같은 기능을 직접 사용하세요.
pl: Element „{0}“ używa kierowania środowiska uruchomieniowego nawet wtedy, gdy jest zastosowany atrybut „DisableRuntimeMarsbezpieczeńingAttribute“. Użyj bezpośrednio funkcji, takich jak „sizeof“ i wskaźników, aby zapewnić dokładne wyniki.
pt_br: '{0}' usa marshalling de tempo de execução mesmo quando 'DisableRuntimeMarshallingAttribute' é aplicado. Use recursos como 'sizeof' e ponteiros diretamente para garantir resultados precisos.
ru: \"{0}\" использует маршалирование среды выполнения даже при применении параметра DisableRuntimeMarshallingAttribute. Используйте такие функции, как sizeof и указатели, непосредственно для получения точных результатов.
tr: “{0}”, “DisableRuntimeMarshallingAttribute” uygulandığında bile çalışma zamanı sıralamasını kullanıyor. Doğru sonuçlar sağlamak için doğrudan “sizeof” gibi özellikleri ve işaretçileri kullanın.
zh_hans: 即使应用了 “DisableRuntimeMarshallingAttribute”，“{0}”也使用运行时封送。直接使用 “sizeof” 和指针等功能可确保结果准确。
zh_hant: 即使已套用 'DisableRuntimeMarshallingAttribute'，'{0}' 也會使用執行階段封送處理。直接使用 'sizeof' 和指標等功能，以確保結果正確。

# MethodUsesRuntimeMarshallingEvenWhenMarshallingDisabledTitle
source: This method uses runtime marshalling even when the 'DisableRuntimeMarshallingAttribute' is applied
cs: Tato metoda používá vyžaduje zařazování modulu runtime i tehdy, když se používá „DisableRuntimeMarshallingAttribute“.
de: Diese Methode verwendet das Runtime-Marshalling auch dann, wenn „DisableRuntimeMarshallingAttribute“ angewendet wird.
es: Este método usa el mashalling en tiempo de ejecución incluso cuando se aplica \"DisableRuntimeMarshallingAttribute\".
fr: Cette méthode utilise le marshaling d’exécution même lorsque l’option « DisableRuntimeMarstribute » est appliquée
it: Questo metodo usa il marshalling di runtime anche quando viene applicato 'DisableRuntimeMarshallingAttribute'
ja: このメソッドは、'DisableRuntimeMarsattribute' が適用されている場合でもランタイム マーシャリングを使用します
ko: 이 메서드는 'DisableRuntimeMarshallingAttribute'가 적용된 경우에도 런타임 마샬링을 사용합니다.
pl: Ta metoda używa kierowania środowiska uruchomieniowego nawet wtedy, gdy jest stosowany atrybut „DisableRuntimeMarsbezpieczeńingAttribute“
pt_br: Este método usa marshalling em tempo de execução mesmo quando o 'DisableRuntimeMarshallingAttribute' é aplicado
ru: Этот метод использует маршалирование среды выполнения даже при применении атрибута DisableRuntimeMarshallingAttribute
tr: Bu yöntem, “DisableRuntimeMarshallingAttribute” uygulandığında bile çalışma zamanı sıralamasını kullanır
zh_hans: 即使应用了 “DisableRuntimeMarshallingAttribute”，此方法也会使用运行时封送
zh_hant: 即使已套用 'DisableRuntimeMarshallingAttribute'，此方法也會使用執行階段封送處理

# MissHttpVerbAttribute
source: Miss HttpVerb attribute for action methods
cs: Chybějící atribut HttpVerb pro metody akce
de: Fehlendes HttpVerb-Attribut für Aktionsmethoden
es: Falta el atributo HttpVerb para los métodos de acción
fr: Attribut HttpVerb manquant pour les méthodes d'action
it: Attributo HttpVerb mancante per i metodi di azione
ja: アクション メソッドの HttpVerb 属性がない
ko: 작업 메서드의 HttpVerb 특성 누락
pl: Pomiń atrybut HttpVerb dla metod akcji
pt_br: Atributo HttpVerb ignorado para métodos de ação
ru: Отсутствует атрибут HttpVerb для методов действия.
tr: Eylem metotları için HttpVerb özniteliği eksik
zh_hans: 缺少操作方法的 HttpVerb 属性
zh_hant: 缺少動作方法的 HttpVerb 屬性

# MissHttpVerbAttributeDescription
source: All the methods that create, edit, delete, or otherwise modify data do so in the [HttpPost] overload of the method, which needs to be protected with the anti forgery attribute from request forgery. Performing a GET operation should be a safe operation that has no side effects and doesn't modify your persisted data.
cs: Všechny metody, které vytvářejí, upravují, odstraňují nebo jinak modifikují data, tak činí při přetížení metody [HttpPost], což vyžaduje ochranu pomocí atributu proti padělkům v požadavku. Provedení operace GET by mělo představovat bezpečnou operaci, která nemá žádné vedlejší účinky a neupravuje trvalá data.
de: Alle Methoden, die Daten erstellen, bearbeiten, löschen oder anderweitig ändern, führen diese Vorgänge in der [HttpPost]-Überladung der Methode durch, die mit dem Fälschungssicherheitsattribut vor Anforderungsfälschung geschützt werden muss. Das Ausführen eines GET-Vorgangs muss ein sicherer Vorgang sein, der keine Nebenwirkungen hat und Ihre persistenten Daten nicht ändert.
es: Todos los métodos que crean, editan, eliminan o modifican de otro modo los datos, lo hacen en la sobrecarga de [HttpPost] del método, que debe protegerse de la falsificación de solicitudes con el atributo antifalsificación. La ejecución de GET debe ser una operación segura que no tenga efectos secundarios y no modifique los datos guardados.
fr: Toutes les méthodes permettant de créer, modifier ou supprimer des données, ou de les changer de quelque façon que ce soit, le font dans la surcharge [HttpPost] de la méthode, laquelle doit être protégée avec l'attribut antifalsification relatif à la falsification de requête. L'exécution d'une opération GET doit être une opération sécurisée qui n'a aucun effet secondaire et ne modifie pas vos données persistantes.
it: Tutti i metodi che consentono di creare, modificare, eliminare o cambiare in altro modo i dati usano l'overload [HttpPost] del metodo, che deve essere protetto dalla falsificazione delle richieste con l'apposito attributo antifalsificazione. L'esecuzione di un'operazione GET deve essere un'operazione sicura che non presenta effetti collaterali e non modifica i dati persistenti.
ja: データの作成、編集、削除、または変更を行うすべてのメソッドでは、メソッドの [HttpPost] オーバーロードでそれらの操作が実行されます。これは、リクエスト フォージェリからの偽造防止属性を使用して保護する必要があります。取得操作の実行は副作用がなく、持続データを変更しない安全な操作である必要があります。
ko: 데이터를 생성, 편집, 삭제 또는 수정하는 모든 메서드는 위조 방지 특성을 사용하여 요청 위조로부터 보호되어야 하는 메서드의 [HttpPost] 오버로드에서 해당 작업을 수행합니다. GET 작업 수행은 부작용이 없고 영구 데이터를 수정하지 않는 안전한 작업이어야 합니다.
pl: Wszystkie metody, które tworzą, edytują, usuwają lub w inny sposób modyfikują dane, dokonują tego w przeciążeniu [HttpPost] metody, która musi być chroniona przy użyciu atrybutu zabezpieczającego przed fałszerstwem przez sfałszowanie żądania. Wykonanie operacji GET powinno być bezpieczną operacją, która nie ma żadnych efektów ubocznych i nie powoduje modyfikacji utrwalonych danych.
pt_br: Todos os métodos que criam, editam, excluem ou modificam de qualquer forma os dados fazem isso na sobrecarga [HttpPost] do método, que precisa ser protegida com o atributo antifalsificação contra a falsificação de solicitações. A execução de uma operação GET deve ser uma operação segura que não tenha efeitos colaterais e não modifique os seus dados persistentes.
ru: Все методы, которые создают, изменяют, удаляют или иным образом модифицируют данные, делают это в перегрузке [HttpPost] метода, которую необходимо защитить от подделки запроса с помощью атрибута для защиты от подделки. Выполнение операции GET должно быть безопасным, не должно иметь побочных эффектов и не должно изменять сохраненные данные.
tr: Metodun [HttpPost] aşırı yüklemesinde verileri oluşturan, düzenleyen, silen veya değiştiren tüm metotların, istek sahteciliğine karşı sahteciliğe karşı koruma özniteliği ile korunması gerekir. GET işlemi, yan etki içermeyen ve kalıcı verilerinizi değiştirmeyen güvenli bir işlem olmalıdır.
zh_hans: 创建、编辑、删除或以其他方式修改数据的所有方法都在方法的 [HttpPost] 重载中执行，这需要使用来自请求伪造的防伪造属性来保护。执行 GET 操作应是不具有任何副作用且不会修改永久性数据的安全操作。
zh_hant: 建立、編輯、刪除或修改資料的所有方法，都會在方法的 [HttpPost] 多載中進行，其需要由反偽造屬性保護免受偽造要求侵害。執行 GET 作業是安全的操作，沒有任何副作用且不會修改保存的資料。
