Repository: dotnet/sdk
Catalog: src/Cli/dotnet/commands/dotnet-list/dotnet-list-package/xlf/LocalizableStrings.*.xlf
Languages: it

# AppFullName
source: List all package references of the project or solution.
it: Elenca tutti i riferimenti al pacchetto del progetto o della soluzione.

# CmdDeprecatedDescription
source: Lists packages that have been deprecated. Cannot be combined with '--vulnerable' or '--outdated' options.
it: Elenca i pacchetti che sono stati deprecati.

# CmdFrameworkDescription
source: Chooses a framework to show its packages. Use the option multiple times for multiple frameworks.
it: Consente di scegliere un framework per mostrarne i pacchetti. Usare l'opzione più volte in caso di framework multipli.

# CmdOutdatedDescription
source: Lists packages that have newer versions. Cannot be combined with '--deprecated' or '--vulnerable' options.
it: Elenca i pacchetti per cui esistono versioni più recenti.

# CmdTransitiveDescription
source: Lists transitive and top-level packages.
it: Elenca i pacchetti transitivi e di primo livello.

# NoProjectsOrSolutions
source: A project or solution file could not be found in {0}. Specify a project or solution file to use.
it: Non è stato possibile trovare un file di progetto o di soluzione in {0}. Specificare un file di progetto o di soluzione da usare.

# CmdConfigDescription
source: The path to the NuGet config file to use. Requires the '--outdated', '--deprecated' or '--vulnerable' option.
it: Percorso del file config NuGet da usare. Richiede l'opzione '--outdated' o '--deprecated'.

# CmdHighestMinorDescription
source: Consider only the packages with a matching major version number when searching for newer packages. Requires the '--outdated' option.
it: Prende in considerazione solo i pacchetti con il numero di versione principale corrispondente quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.

# CmdHighestPatchDescription
source: Consider only the packages with a matching major and minor version numbers when searching for newer packages. Requires the '--outdated' option.
it: Prende in considerazione solo i pacchetti con i numeri di versione principale e secondaria corrispondenti quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.

# CmdPrereleaseDescription
source: Consider packages with prerelease versions when searching for newer packages. Requires the '--outdated' option.
it: Prende in considerazione i pacchetti con versioni preliminari quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.

# CmdSourceDescription
source: The NuGet sources to use when searching for newer packages. Requires the '--outdated', '--deprecated' or '--vulnerable' option.
it: Origini NuGet da usare quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.

# FileNotFound
source: Could not find file or directory '{0}'.
it: Non è stato possibile trovare il file o la directory '{0}'.
