Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DefineAccessorsForAttributeArgumentsTitle
source: Define accessors for attribute arguments
cs: Definujte přístupové objekty pro argumenty atributů.
de: Zugriffsmethoden für Attributargumente definieren
es: Definir descriptores de acceso para los argumentos de atributo
fr: Définir des accesseurs pour les arguments d'attribut
it: Definire le funzioni di accesso per gli argomenti degli attributi
ja: 属性引数にアクセサーを定義します
ko: 특성 인수의 접근자를 정의하세요.
pl: Zdefiniuj metody dostępu dla argumentów atrybutów
pt_br: Definir acessadores para argumentos de atributo
ru: Определите методы доступа для аргументов атрибута
tr: Öznitelik bağımsız değişkenleri için erişimciler tanımlayın
zh_hans: 定义属性参数的访问器
zh_hant: 為屬性引數定義存取子

# DefineAccessorsForAttributeArgumentsMessageDefault
source: Add a public read-only property accessor for positional argument {0} of Attribute {1}
cs: Přidejte přístupový objekt veřejné vlastnosti jen pro čtení pro poziční argument {0} atributu {1}.
de: Fügen Sie eine öffentliche schreibgeschützte Zugriffsmethode für das positionelle Argument "{0}" des Attributs "{1}" hinzu.
es: Agregue un descriptor de acceso de propiedades público de solo lectura para el argumento posicional {0} del atributo {1}.
fr: Ajoutez un accesseur de propriété en lecture seule pour l'argument positionnel {0} de l'attribut {1}
it: Aggiungere una funzione di accesso alla proprietà di sola lettura public per l'argomento posizionale {0} dell'attributo {1}
ko: {1} 특성의 위치 인수 {0}에 대한 공개 읽기 전용 속성 접근자를 추가하세요.
pl: Dodaj publiczną metodę dostępu do właściwości tylko do odczytu dla argumentu pozycyjnego {0} atrybutu {1}
pt_br: Adicione um acessador de propriedade pública somente leitura para o argumento posicional {0} do atributo {1}
ru: Добавьте открытый метод доступа для свойства доступа только для чтения к позиционному аргументу {0} для атрибута {1}.
tr: {1} Özniteliğinin {0} konumsal bağımsız değişkeni için genel bir salt okunur özellik erişimcisi ekleyin
zh_hans: 为特性 {1} 的位置参数 {0} 添加一个公共的只读属性访问器
zh_hant: 為屬性 (Attribute) {1} 的位置引數 {0} 新增公用唯讀屬性 (Property) 存取子

# DefineAccessorsForAttributeArgumentsMessageRemoveSetter
source: Remove the property setter from {0} or reduce its accessibility because it corresponds to positional argument {1}
cs: Odeberte z {0} metodu setter nebo omezte její přístupnost, protože odpovídá pozičnímu argumentu {1}.
de: Entfernen Sie den Eigenschaftensetter aus "{0}", oder schränken Sie seine Zugänglichkeit ein, weil er dem positionellen Argument "{1}" entspricht.
es: Quite el establecedor de propiedades de {0} o reduzca su accesibilidad, dado que corresponde al argumento posicional {1}.
fr: Supprimez la méthode setter de propriété de {0}, ou réduisez son accessibilité, car il correspond à l'argument positionnel {1}
it: Rimuovere il setter di proprietà da {0} o ridurne l'accessibilità perché corrisponde all'argomento posizionale {1}
ko: 속성 setter가 위치 인수 {1}에 해당하므로 이 속성 setter를 {0}에서 제거하거나 해당 접근성을 낮추세요.
pl: Usuń metodę ustawiającą właściwość z argumentu {0} lub ogranicz jej dostępność, ponieważ odpowiada ona argumentowi pozycyjnemu {1}
pt_br: Remova o setter da propriedade de {0} ou reduza a acessibilidade dele porque ele corresponde ao argumento posicional {1}
ru: Удалите метод задания свойства из {0} или уменьшите область его доступности, так как он соответствует позиционному аргументу {1}.
tr: {1} konumsal bağımsız değişkenine karşılık geldiğinden, {0} öğesinden özellik ayarlayıcısını kaldırın veya erişilebilirliğini azaltın
zh_hans: 由于属性 setter 对应于位置参数 {1}，因此请将它从 {0} 中删除或者降低它的可访问性
zh_hant: 因為屬性 setter 會對應到位置引數 {1}，所以請從 {0} 移除屬性 setter 或縮小其存取範圍

# DefineAccessorsForAttributeArgumentsMessageIncreaseVisibility
source: If {0} is the property accessor for positional argument {1}, make it public
cs: Pokud je {0} přístupový objekt vlastnosti pozičního argumentu {1}, nastavte ho jako veřejný.
de: Wenn "{0}" die Eigenschaftszugriffsmethode für das positionelle Argument "{1}" ist, machen Sie sie öffentlich.
es: Si {0} es el descriptor de acceso de propiedades para el argumento posicional {1}, hágalo público.
fr: Si {0} est l'accesseur de propriété pour l'argument positionnel {1}, déclarez-le public
it: Impostare {0} come public se è la funzione di accesso alla proprietà per l'argomento posizionale {1}
ko: {0}이(가) 위치 인수 {1}에 대한 속성 접근자인 경우 공개로 설정하세요.
pl: Jeśli {0} to metoda dostępu do właściwości dla argumentu pozycyjnego {1}, zadeklaruj ją jako publiczną
pt_br: Se {0} for o acessador de propriedade para o argumento posicional {1}, torne-o público
ru: Если {0} — это метод доступа к свойству для позиционного аргумента {1}, сделайте его открытым.
tr: {0}, {1} konumsal bağımsız değişkeninin özellik erişimcisiyse bunu genel yapın
zh_hans: 如果 {0} 是位置参数 {1} 的属性访问器，请使它成为公共访问器
zh_hant: 若 {0} 是位置引數 {1} 的屬性存取子，請將其設為公用

# UsePropertiesWhereAppropriateTitle
source: Use properties where appropriate
cs: Tam, kde je to vhodné, použijte vlastnosti.
de: Nach Möglichkeit Eigenschaften verwenden
es: Usar propiedades donde corresponda
fr: Utiliser des propriétés quand cela est approprié
it: Usare le proprietà dove appropriato
ja: 適切な場所にプロパティを使用します
ko: 적합한 속성 사용하세요.
pl: Użyj właściwości w odpowiednich miejscach
pt_br: Usar propriedades sempre que apropriado
ru: Используйте свойства, когда это уместно
tr: Uygun yerlerde özellikleri kullanın
zh_hans: 在适用处使用属性
zh_hant: 適當時機使用屬性

# UsePropertiesWhereAppropriateDescription
source: A public or protected method has a name that starts with ""Get"", takes no parameters, and returns a value that is not an array. The method might be a good candidate to become a property.
cs: Veřejná nebo chráněná metoda má název, který začíná na Get, nepřebírá žádné parametry a vrací hodnotu, která není polem. Tato metoda může být vhodným kandidátem na vlastnost.
de: Eine öffentliche oder geschützte Methode besitzt einen Namen, der mit ""Get"" beginnt, akzeptiert keine Parameter und gibt einen Wert zurück, der kein Array ist. Die Methode ist möglicherweise ein guter Kandidat für eine Eigenschaft.
es: Un método público o protegido tiene un nombre que comienza por “Get”, no toma ningún parámetro y devuelve un valor que no es una matriz. El método puede ser un buen candidato para convertirse en propiedad.
fr: Le nom d'une méthode publique ou protégée commence par ""Get"", n'accepte aucun paramètre et retourne une valeur qui n'est pas un tableau. La méthode est susceptible de devenir une propriété.
it: Un metodo public o protected è contraddistinto da un nome che inizia con ""Get"", non accetta parametri e restituisce un valore diverso da una matrice. Il metodo potrebbe essere un candidato ideale per diventare una proprietà.
ja: パブリック メソッドまたは保護されたメソッドは、""Get"" で始まる名前を持ち、パラメーターを受け取らず、配列ではない値を返します。このメソッドは、プロパティに変更できる可能性があります。
ko: public 또는 protected 메서드는 ""Get""으로 시작하는 이름을 가지며 매개 변수를 사용하지 않고 배열이 아닌 값을 반환합니다. 이 메서드는 속성에 사용하기 적합할 수 있습니다.
pl: Metoda publiczna lub chroniona ma nazwę zaczynającą się od „Get”, nie pobiera parametrów i zwraca wartość, która nie jest tablicą. Ta metoda może być dobrym kandydatem na właściwość.
pt_br: Um método público ou protegido tem um nome que começa com ""Get"", não aceita nenhum parâmetro e retorna um valor que não é uma matriz. O método pode ser um bom candidato para se tornar uma propriedade.
ru: Общедоступный метод имеет имя, начинающееся с "Get", не принимает параметры и возвращает значение, отличное от массива. Этот метод может быть хорошим кандидатом на то, чтобы стать свойством.
tr: Genel veya korumalı bir yöntem, ""Get"" ile başlayan bir ada sahip olur, parametre almaz ve dizi olmayan bir değer döndürür. Yöntem, bir özelliğe dönüşmek için iyi bir aday olabilir.
zh_hans: 公共或受保护的方法具有以 "Get" 开头的名称，不包含参数，并返回非数组的值。该方法可能是成为属性的不错选择。
zh_hant: 公用或受保護的方法具有以 ""Get"" 開頭的名稱，該名稱沒有使用任何參數，且會傳回不是陣列的值。此方法可能很適合成為屬性。

# UsePropertiesWhereAppropriateMessage
source: Use properties where appropriate
cs: Tam, kde je to vhodné, použijte vlastnosti.
de: Nach Möglichkeit Eigenschaften verwenden
es: Usar propiedades donde corresponda
fr: Utiliser des propriétés quand cela est approprié
it: Usare le proprietà dove appropriato
ja: 適切な場所にプロパティを使用します
ko: 적합한 속성 사용하세요.
pl: Użyj właściwości w odpowiednich miejscach
pt_br: Usar propriedades sempre que apropriado
ru: Используйте свойства, когда это уместно
tr: Uygun yerlerde özellikleri kullanın
zh_hans: 在适用处使用属性
zh_hant: 適當時機使用屬性

# MarkEnumsWithFlagsTitle
source: Mark enums with FlagsAttribute
cs: Označte výčty atributem FlagsAttribute.
de: Enumerationen mit FlagsAttribute markieren
es: Marcar las enumeraciones con FlagsAttribute
fr: Marquer les enums avec FlagsAttribute
it: Contrassegnare le enumerazioni con FlagsAttribute
ja: 列挙型を FlagsAttribute に設定します
ko: FlagsAttribute로 열거형을 표시하세요.
pl: Oznacz wyliczenia atrybutem FlagsAttribute
pt_br: Marcar enums com FlagsAttribute
ru: Пометьте перечисления с помощью FlagsAttribute
tr: Sabit listelerini FlagsAttribute ile işaretleyin
zh_hans: 用 FlagsAttribute 标记枚举
zh_hant: 將列舉標記為 FlagsAttribute

# MarkEnumsWithFlagsDescription
source: An enumeration is a value type that defines a set of related named constants. Apply FlagsAttribute to an enumeration when its named constants can be meaningfully combined.
cs: Výčet je typ hodnoty, který definuje sadu souvisejících pojmenovaných konstant. Použijte u výčtu atribut FlagsAttribute, pokud se jeho pojmenované konstanty dají smysluplně kombinovat.
de: Eine Enumeration ist ein Werttyp, der eine Menge von verwandten benannten Konstanten definiert. Wenden Sie FlagsAttribute auf eine Enumeration an, wenn die zugehörigen benannten Konstanten sinnvoll zusammengefasst werden können.
es: Una enumeración es un tipo de valor que define un conjunto de constantes con nombre relacionadas. Aplique FlagsAttribute a una enumeración cuando sus constantes con nombre se pueden combinar con sentido.
fr: Une énumération est un type valeur qui définit un ensemble de constantes nommées associées. Appliquez FlagsAttribute à une énumération quand ses constantes nommées peuvent être combinées de manière pertinente.
it: Un'enumerazione è un tipo valore che definisce un set di costanti denominate correlate. Applicare FlagsAttribute a un'enumerazione quando le relative costanti denominate possono essere combinate in modo significativo.
ja: 列挙型は、関連する一連の名前付き定数を定義する値型です。名前付き定数を意味を持つように組み合わせることができる場合は、列挙型に FlagsAttribute を適用します。
ko: 열거형은 관련된 명명된 상수의 집합을 정의하는 값 형식입니다. 명명된 상수가 의미 있게 결합될 수 있을 때 FlagsAttribute를 열거형에 적용하세요.
pl: Wyliczenie to typ wartości, który definiuje zestaw powiązanych stałych nazwanych. Zastosuj atrybut FlagsAttribute do wyliczenia, jeśli jego stałe nazwane można połączyć w znaczący sposób.
pt_br: Uma enumeração é um tipo de valor que define um conjunto de constantes nomeadas relacionadas. Aplique FlagsAttribute a uma enumeração quando suas constantes nomeadas puderem ser combinadas de forma significativa.
ru: Перечисление — это тип значения, определяющий набор связанных именованных констант. Примените FlagsAttribute к перечислению, когда его именованные константы можно объединить значимым образом.
tr: Sabit listesi, bir ilgili adlandırılmış sabitler kümesini tanımlayan bir değer türüdür. Bir sabit listesinin adlandırılmış sabitleri anlamlı bir şekilde birleştirilebiliyorsa sabit listesine FlagsAttribute uygulayın.
zh_hans: 枚举是一种值类型，它定义一组相关的命名常量。可以有意地合并 FlagsAttribute 的命名常量时，将其应用于枚举。
zh_hant: 列舉是一種實值型別，用以定義一組相關的具名常數。當列舉的具名常數可以有意義地加以合併時，可將 FlagsAttribute 套用至此列舉。

# MarkEnumsWithFlagsMessage
source: Mark enums with FlagsAttribute
cs: Označte výčty atributem FlagsAttribute.
de: Enumerationen mit FlagsAttribute markieren
es: Marcar las enumeraciones con FlagsAttribute
fr: Marquer les enums avec FlagsAttribute
it: Contrassegnare le enumerazioni con FlagsAttribute
ja: 列挙型を FlagsAttribute に設定します
ko: FlagsAttribute로 열거형을 표시하세요.
pl: Oznacz wyliczenia atrybutem FlagsAttribute
pt_br: Marcar enums com FlagsAttribute
ru: Пометьте перечисления с помощью FlagsAttribute
tr: Sabit listelerini FlagsAttribute ile işaretleyin
zh_hans: 用 FlagsAttribute 标记枚举
zh_hant: 將列舉標記為 FlagsAttribute

# InterfaceMethodsShouldBeCallableByChildTypesTitle
source: Interface methods should be callable by child types
cs: Metody rozhraní mají být volatelné podřízenými typy.
de: Schnittstellenmethoden müssen von untergeordneten Typen aufgerufen werden können
es: Los tipos secundarios deben poder llamar a los métodos de interfaz
fr: Les méthodes d'interface doivent pouvoir être appelées par les types enfants
it: Deve essere possibile chiamare i metodi di interfaccia da tipi figlio
ja: インターフェイス メソッドは、子型によって呼び出し可能でなければなりません
ko: 인터페이스 메서드는 자식 형식에서 호출할 수 있어야 합니다.
pl: Typy podrzędne powinny móc wywoływać metody interfejsu
pt_br: Métodos de interface devem poder ser chamados por tipos filho
ru: Методы интерфейса должны быть доступны для вызова дочерним типам
tr: Arabirim yöntemleri alt türler tarafından çağrılabilir olmalıdır
zh_hans: 接口方法应可由子类型调用
zh_hant: 介面方法應可由子類型呼叫

# InterfaceMethodsShouldBeCallableByChildTypesDescription
source: An unsealed externally visible type provides an explicit method implementation of a public interface and does not provide an alternative externally visible method that has the same name.
cs: Nezapečetěný externě viditelný typ poskytuje explicitní implementaci metody veřejného rozhraní a neposkytuje alternativní externě viditelnou metodu, která má stejný název.
de: Ein nicht versiegelter, extern sichtbarer Typ stellt eine explizite Methodenimplementierung einer öffentlichen Schnittstelle bereit, aber keine alternative extern sichtbare Methode desselben Namens.
es: Un tipo no sellado visible externamente proporciona un método explícito de implementación de una interfaz pública, pero no proporciona un método visible externamente alternativo con el mismo nombre.
fr: Un type unsealed visible de manière externe fournit une implémentation de méthode explicite d'une interface publique mais ne fournit aucune méthode de remplacement visible de manière externe ayant le même nom.
it: Un tipo visibile esternamente unsealed offre un'implementazione di metodo esplicita di un'interfaccia public e non fornisce un metodo visibile esternamente alternativo con lo stesso nome.
ja: 外部から参照可能なアンシールド型により、メソッドによるパブリック インターフェイスの明示的な実装が提供されます。また、同じ名前が付いた外部から参照可能な代替のメソッドは提供されていません。
ko: 봉인되지 않고 외부에 표시되는 형식은 공용 인터페이스의 명시적 메서드 구현을 제공하며 동일한 이름의 외부에 표시되는 대체 메서드를 제공하지 않습니다.
pl: Niezapieczętowany typ widoczny zewnętrznie udostępnia jawną implementację metody interfejsu publicznego i nie udostępnia alternatywnej metody widocznej zewnętrznie o tej samej nazwie.
pt_br: Um tipo não selado visível externamente oferece uma implementação de método explícita de uma interface pública e não oferece um método alternativo visível externamente que tem o mesmo nome.
ru: Незапечатанный и видимый снаружи тип предоставляет явную реализацию метода для общедоступного интерфейса и не предоставляет альтернативный видимый снаружи метод с таким же именем.
tr: Dışarıdan görünen mühürsüz bir tür, genel bir arabirimin açık yöntem uygulamasını sağlar ve aynı ada sahip alternatif bir dışarıdan görünen yöntem sağlamaz.
zh_hans: 外部可见的非密封类型提供公共接口的显式方法实现，不提供外部可见的同名备用方法。
zh_hant: 外部可見的非密封類型，可提供公用介面的明確方法實作，但不會提供外部可見的同名替代方法。

# InterfaceMethodsShouldBeCallableByChildTypesMessage
source: Make '{0}' sealed (a breaking change if this class has previously shipped), implement the method non-explicitly, or implement a new method that exposes the functionality of '{1}' and is visible to derived classes
cs: Zapečeťte {0} (rozbíjející změna, pokud se předtím tato třída dodala), implementujte metodu neexplicitně nebo implementujte novou metodu, která zveřejňuje funkčnost {1} a je viditelná pro odvozené třídy.
de: Versiegeln Sie "{0}" (ein Breaking Change, wenn diese Klasse bereits versandt wurde), implementieren Sie die Methode nicht explizit, oder implementieren Sie eine neue Methode, die die Funktionalität von "{1}" verfügbar macht und für abgeleitete Klassen sichtbar ist.
es: Convierta "{0}" en sealed (un cambio importante si ya se envió la clase), implemente el método de forma no explícita o implemente un método nuevo que exponga la funcionalidad de "{1}" y que sea visible para las clases derivadas.
fr: Affectez à '{0}' un type sealed (changement cassant, si cette classe existe déjà), implémentez la méthode de manière non explicite, ou implémentez une nouvelle méthode qui expose les fonctionnalités de '{1}' et qui est visible par les classes dérivées
it: Impostare '{0}' come sealed (modifica che causa un'interruzione se la classe è già stata distribuita), implementare il metodo in modo non esplicito o implementare un nuovo metodo che espone la funzionalità di '{1}' ed è visibile alle classi derivate
ko: '{0}'을(를) sealed로 설정(이 클래스가 이전에 제공된 경우 호환성이 손상되는 변경)하거나, 메서드를 비명시적으로 구현하거나, '{1}'의 기능을 노출하고 파생 클래스에 표시되는 새 메서드를 구현하세요.
pl: Zapięczętuj element „{0}” (zmiana powodująca niezgodność, jeśli ta klasa została wcześniej dostarczona), wdróż metodę niejawnie lub wdróż nową metodę, która ujawnia funkcjonalność {1} i jest widoczna dla klas pochodnych
pt_br: Torne o '{0}' selado (uma alteração interruptiva se esta classe foi enviada anteriormente), implemente o método de modo não explícito ou implemente um novo método que expõe a funcionalidade de '{1}' e é visível para todas as classes derivadas
ru: Сделайте "{0}" запечатанным (критическое изменение, если этот класс уже был поставлен), реализуйте метод неявно или реализуйте новый метод, который предоставляет доступ к функциям "{1}" и видим производным классам.
tr: '{0}' öğesini mühürlü yapın (bu sınıf daha önceden gönderildiyse hataya neden olan bir değişikliktir), metodu açık olmayan bir şekilde uygulayın veya '{1}' işlevini açığa çıkaran ve türetilen sınıflara görünür olan yeni bir metot uygulayın
zh_hans: 将“{0}”设置为密封(如果以前提供过此类，则属于重大更改)，非显式实现该方法，或实现一个公开“{1}”的功能且对派生类可见的新方法
zh_hant: 密封 '{0}' (若先前已發佈這個類別則為中斷變更)、以非明確的方式實作方法，或是實作會公開 '{1}' 功能並向衍生類別顯示的新方法

# OverrideMethodsOnComparableTypesTitle
source: Override methods on comparable types
cs: Přepište metody u srovnatelných typů.
de: Methoden bei vergleichbaren Typen außer Kraft setzen
es: Invalidar métodos en tipos comparables
fr: Remplacer les méthodes sur les types Comparable
it: Eseguire l'override di metodi su tipi confrontabili
ja: 比較可能な型でメソッドをオーバーライドします
ko: 비교 가능한 형식에서 메서드를 재정의하세요.
pl: Przesłoń metody porównywalnych typów
pt_br: Substituir métodos em tipos comparáveis
ru: Переопределите методы в сопоставимых типах
tr: Karşılaştırılabilir türlerde yöntemleri geçersiz kılın
zh_hans: 重写可比较类型中的方法
zh_hant: 在 Comparable 類型上覆寫方法

# OverrideMethodsOnComparableTypesDescription
source: A public or protected type implements the System.IComparable interface. It does not override Object.Equals nor does it overload the language-specific operator for equality, inequality, less than, less than or equal, greater than or greater than or equal.
cs: Veřejný nebo chráněný typ implementuje rozhraní System.IComparable. Nepřepisuje Object.Equals ani nepřetěžuje jazykově specifický operátor pro je rovno, není rovno, je menší než, je menší než nebo rovno, je větší než nebo je větší než nebo rovno.
de: Ein öffentlicher oder geschützter Typ implementiert die System.IComparable-Schnittstelle. Er setzt "Object.Equals" nicht außer Kraft und überlädt nicht den sprachspezifischen Operator für Gleichheit, Ungleichheit, kleiner als, kleiner oder gleich, größer als oder größer oder gleich.
es: Un tipo público o protegido implementa la interfaz System.IComparable. No invalida Object.Equals ni sobrecarga el operador específico del lenguaje por un operador de igualdad, desigualdad, menor que, menor o igual que, mayor que o bien mayor o igual que.
fr: Un type public ou protégé implémente l'interface System.IComparable. Il ne remplace pas Object.Equals. De même, il ne surcharge pas l'opérateur égal à, différent de, inférieur à, inférieur ou égal à, supérieur à, supérieur ou égal à propre au langage.
it: Un tipo public o protected implementa l'interfaccia System.IComparable. Non esegue l'override di Object.Equals né l'overload dell'operatore specifico del linguaggio per uguaglianza, disuguaglianza, minore di, minore o uguale a, maggiore di o maggiore o uguale a.
ja: パブリック型または保護された型で System.IComparable インターフェイスを実装します。これにより、Object.Equals はオーバーライドされません。また、"等しい"、"等しくない"、"未満"、"以下"、"より大きい"、または "以上" を示す言語固有の演算子はオーバーロードされません。
ko: public 또는 protected 형식은 System.IComparable 인터페이스를 구현합니다. Object.Equals를 재정의하지도 않고 같음, 같지 않음, 작음, 작거나 같음, 큼, 크거나 같음에 대한 언어 특정 연산자를 오버로드하지도 않습니다.
pl: Typ publiczny lub chroniony implementuje interfejs System.IComparable. Nie przesłania on metody Object.Equals ani nie przeciąża specyficznego dla języka operatora równości, nierówności, mniejszości, mniejszości lub równości, większości ani większości lub równości.
pt_br: Um tipo público ou protegido implementa a interface System.IComparable. Ele não substitui Object.Equals nem sobrecarrega o operador específico a um idioma para igualdade, desigualdade, menor que, menor ou igual a, maior que ou maior ou igual a.
ru: Общедоступный или защищенный тип реализует интерфейс System.IComparable. Он не переопределяет Object.Equals и не перегружает языковой оператор на предмет сравнений равно, неравно, меньше, меньше или равно, больше, больше или равно.
tr: Genel veya korumalı bir tür, System.IComparable arabirimini uygular. Object.Equals’ı geçersiz kılmaz veya eşitlik, eşitsizlik, küçüktür, küçük eşittir, büyüktür ya da büyük eşittir için dile özgü işleci aşırı yüklemez.
zh_hans: 公共类型或受保护的类型实现 System.IComparable 接口。它不重写 Object.Equals，也不重载用于等式、不等式、小于、小于等于、大于或大于等于的语言特定的运算符。
zh_hant: 公用或受保護的類型會實作 System.IComparable 介面。它不會覆寫 Object.Equals，也不會多載語言專屬的等號比較、不相等比較、小於、小於或等於、大於或是大於或等於運算子。

# OverrideMethodsOnComparableTypesMessageEquals
source: {0} should override Equals since it implements IComparable
cs: {0} má přepisovat Je rovno, protože implementuje rozhraní IComparable.
de: "{0}" muss "Equals" außer Kraft setzen, weil IComparable implementiert wird.
es: {0} debe invalidar Equals, porque implementa IComparable.
fr: {0} doit remplacer Égal, car il implémente IComparable
it: {0} deve eseguire l'override di Equals perché implementa IComparable
ko: {0}은(는) IComparable을 구현하므로 Equals를 재정의해야 합니다.
pl: Typ {0} powinien przesłaniać metodę Equals, ponieważ implementuje interfejs IComparable
pt_br: {0} deve substituir Equals, pois implementa IComparable
ru: {0} должен переопределить оператор Equals, так как он реализует IComparable.
tr: {0}, IComparable'ı uyguladığından Equals'ı geçersiz kılmalıdır
zh_hans: 由于 {0} 实现 IComparable，因此，它应重写等于运算符
zh_hant: 因為 {0} 會實作 IComparable，所以應該覆寫 Equals

# OverrideMethodsOnComparableTypesMessageOperator
source: {0} should define operator(s) '{1}' since it implements IComparable
cs: {0} má definovat operátory {1}, protože implementuje rozhraní IComparable.
de: "{0}" muss die Operatoren "{1}" definieren, weil IComparable implementiert wird.
es: {0} debe definir los operadores "{1}", porque implementa IComparable.
fr: {0} doit définir le ou les opérateurs '{1}', car il implémente IComparable
it: {0} deve definire l'operatore o gli operatori '{1}' perché implementa IComparable
ko: {0}은(는) IComparable을 구현하므로 '{1}' 연산자를 정의해야 합니다.
pl: Typ {0} powinien definiować operatory „{1}”, ponieważ implementuje interfejs IComparable
pt_br: {0} deve definir os operadores '{1}', pois ele implementa IComparable
ru: {0} должен определять операторы "{1}", так как он реализует IComparable.
tr: {0}, IComparable'ı uyguladığından '{1}' işleçlerini tanımlamalıdır
zh_hans: 由于 {0} 实现 IComparable，因此它应定义“{1}”运算符
zh_hant: 因為 {0} 會實作 IComparable，所以應該定義運算子 '{1}'
