Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AvoidExcessiveComplexityDescription
source: Cyclomatic complexity measures the number of linearly independent paths through the method, which is determined by the number and complexity of conditional branches. A low cyclomatic complexity generally indicates a method that is easy to understand, test, and maintain. The cyclomatic complexity is calculated from a control flow graph of the method and is given as follows: `cyclomatic complexity = the number of edges - the number of nodes + 1`, where a node represents a logic branch point and an edge represents a line between nodes.
cs: Cyklomatická složitost měří počet lineárně nezávislých cest přes metodu, který se určuje jako počet a složitost podmíněných větví. Nízká cyklomatická složitost obecně naznačuje, že metodě je snadné porozumět a že se dá snadno testovat a udržovat. Cyklomatická složitost se počítá z grafu toků řízení metody a je daná tímto vztahem: cyklomatická složitost = počet hran − počet uzlů + 1, kde uzel představuje bod logické větve a hrana představuje čáru mezi uzly.
de: Zyklomatische Komplexität misst die Anzahl der linear unabhängigen Pfade über die Methode, die durch die Anzahl und Komplexität der bedingten Verzweigungen festgelegt wird. Eine niedrige zyklomatische Komplexität weist im Allgemeinen auf eine Methode hin, die einfach zu verstehen, zu testen und zu verwalten ist. Die zyklomatische Komplexität wird aus einem Ablaufsteuerungsgraphen der Methode berechnet und wie folgt angegeben: "Zyklomatische Komplexität = Anzahl der Edges – Anzahl der Knoten + 1", wobei ein Knoten für einen logischen Verzweigungspunkt und ein Edge für eine Linie zwischen Knoten steht.
es: La complejidad ciclomática mide el número de rutas de acceso independientes linealmente a través del método, que viene determinado por el número y la complejidad de las ramas condicionales. Una complejidad ciclomática baja indica un método que es fácil de entender, probar y mantener. Dicha complejidad se calcula a partir de un gráfico de flujos de control del método e indica lo siguiente: "complejidad ciclomática = número de bordes - número de nodos + 1", donde un nodo representa un punto de la rama de tipo lógico y un borde representa una línea entre los nodos.
fr: La complexité cyclomatique mesure le nombre de chemins linéairement indépendants dans la méthode, en fonction du nombre et de la complexité des branches conditionnelles. Une faible complexité cyclomatique indique généralement une méthode facile à comprendre, à tester et à tenir à jour. La complexité cyclomatique est calculée à partir d'un graphe de flux de contrôle de la méthode. Elle se présente comme suit : 'complexité cyclomatique = nombre d'arêtes - nombre de nœuds + 1', où un nœud représente un point de branchement logique et une arête représente une ligne entre les nœuds.
it: La complessità ciclomatica misura il numero di percorsi indipendenti in modo lineare nel metodo. Tale numero è determinato dal numero e dalla complessità dei rami condizionali. Una bassa complessità ciclomatica indica in genere un metodo facile da comprendere, testare e gestire. La complessità ciclomatica viene calcolata da un grafico del flusso di controllo del metodo ed è data dalla formula seguente: `complessità ciclomatica = numero di bordi - numero di nodi + 1`, dove un nodo rappresenta un punto ramo logico e un bordo rappresenta una linea tra nodi.
ja: サイクロマティック複雑度は、メソッドにより線形的に独立したパスの数を測定します。これは、条件分岐の数と複雑さによって決定されます。低いサイクロマティック複雑度は一般的に、メソッドの理解、テスト、維持が容易であることを示しています。サイクロマティック複雑度は、メソッドの制御フロー グラフから計算され、次のように表されます。`サイクロマティック複雑度 = エッジの数 - ノードの数 + 1`。ここでノードはロジック ブランチ ポイントを表しており、エッジはノード間のラインを表しています。
ko: 순환 복잡성은 조건부 분기의 개수 및 복잡성에 따라 결정되는 메서드를 통해 선형 독립 경로 수를 측정합니다. 낮은 순환 복잡성은 일반적으로 이해, 테스트 및 유지 관리하기 쉬운 메서드를 나타냅니다. 순환 종속성은 메서드의 제어 흐름 그래프에서 계산되고 다음과 같이 지정됩니다. '순환 복잡성 = 에지 수 - 노드 수 + 1'. 여기서 노드는 논리 분기 지점을 나타내고 에지는 노드 사이 줄을 나타냅니다.
pl: Złożoność cyklomatyczna mierzy liczbę liniowo niezależnych ścieżek prowadzących przez metodę, która jest określana przez liczbę i złożoność gałęzi warunkowych. Niska złożoność cyklomatyczna zwykle wskazuje metodę, którą łatwo zrozumieć, testować i utrzymywać. Złożoność cyklomatyczna jest obliczana na podstawie grafu przepływu sterowania metody i podawana w następujący sposób: złożoność cyklomatyczna = liczba granic - liczba węzłów + 1, gdzie węzeł reprezentuje rozgałęzienie logiki, a granica — linię między węzłami.
pt_br: A complexidade ciclomática mede o número de caminhos linearmente independentes no método, que é determinado pelo número e a complexidade dos branches condicionais. Uma complexidade ciclomática baixa geralmente indica um método fácil de entender, testar e manter. Ela é calculada usando um grafo de fluxo de controle do método, da seguinte forma: 'complexidade ciclomática = o número de bordas - o número de nós + 1', em que um nó representa um ponto do branch lógico e uma borda representa uma linha entre os nós.
ru: Цикломатическая сложность измеряет число линейно-независимых путей через метод, что определяется числом и сложностью условных ветвлений. Низкая цикломатическая сложность обычно указывает на метод, который легко понять, тестировать и обслуживать. Цикломатическая сложность вычисляется по графу потока управления по следующей формуле: "цикломатическая сложность = число краев – число узлов + 1", где узел представляет логическую точку ветвления, а край — линию между узлами.
tr: Döngüsel karmaşıklık, metodun içerdiği doğrusal olarak bağımsız yolların sayısını ölçer. Bu ölçüm koşullu dalların sayısı ve karmaşıklığı ile belirlenir. Düşük döngüsel karmaşıklık genellikle bir metodun anlaşılmasının, test edilmesinin ve bakımının kolay olduğunu gösterir. Döngüsel karmaşıklık, metodun denetim akışı grafiğinden hesaplanır ve şu şekilde verilir: ‘döngüsel karmaşıklık = kenar sayısı – düğüm sayısı + 1’. Burada düğüm bir mantık dalı noktasını, kenar ise düğümler arasındaki bir çizgiyi temsil eder.
zh_hans: 圈复杂度通过此方法测量线性独立路径的数量，它由条件分支的数量和复杂度决定。低圈复杂度通常表示易于理解、测试和维护的方法。圈复杂度是由该方法的控制流图形计算得出，并如下给出:“圈复杂度 = 边缘数 - 节点数 + 1”，其中节点表示逻辑分支点，边缘表示节点之间的行。
zh_hant: 循環複雜度會透過方法來測量線性獨立路徑的數目，而其取決於條件分支的數目及複雜度。循環複雜度較低通常表示方法很容易明瞭、測試及維護。循環複雜度由方法的控制流程圖進行計算，同時假設: '循環複雜度 = 邊緣數目 - 節點數目 + 1'，而節點則代表邏輯分支點，同時邊緣代表節點之間的線條。

# AvoidExcessiveComplexityMessage
source: '{0}' has a cyclomatic complexity of '{1}'. Rewrite or refactor the code to decrease its complexity below '{2}'.
cs: {0} má cyklomatickou složitost na úrovni {1}. Přepište nebo refaktorujte kód tak, aby se složitost snížila pod úroveň {2}.
de: "{0}" weist eine zyklomatische Komplexität von "{1}" auf. Schreiben Sie den Code neu, oder gestalten Sie ihn um, um die Komplexität auf einen Wert unter "{2}" zu senken.
es: "{0}" tiene una complejidad ciclomática de "{1}". Escriba o refactorice el código para reducir su complejidad a continuación "{2}".
fr: '{0}' a une complexité cyclomatique de '{1}'. Réécrivez ou refactorisez le code pour baisser sa complexité en dessous de '{2}'.
it: '{0}' contiene una complessità ciclomatica di '{1}'. Riscrivere il codice o effettuare il refactoring per diminuire la complessità sotto '{2}'.
ja: '{0}' のサイクロマティック複雑度は '{1}' です。コードを書き換えるか、リファクタリングし、複雑度を '{2}' 未満に緩和します。
ko: '{0}'의 순환 복잡성이 '{1}'입니다. 코드를 다시 작성하거나 리펙터링하여 복잡성을 '{2}' 이하로 줄이세요.
pl: Element „{0}” ma złożoność cyklomatyczną wynoszącą „{1}”. Ponownie napisz kod lub refaktoryzuj go w taki sposób, aby złożoność była niższa niż „{2}”.
pt_br: '{0}' tem uma complexidade ciclomática de '{1}'. Reescreva ou refatore o código para diminuir sua complexidade abaixo de '{2}'.
ru: '{0}' имеет цикломатическую сложность '{1}'. Перепишите или оптимизируйте код, чтобы уменьшить его сложность ниже '{2}'.
tr: '{0}', '{1}' düzeyinde döngüsel karmaşıklığa sahip. Kodu yeniden yazarak veya yeniden düzenleyerek karmaşıklığı '{2}' düzeyinin altına düşürün.
zh_hans: “{0}”的圈复杂度为“{1}”。请重写或重构代码以将其复杂度降低到“{2}”以下。
zh_hant: ‘{0}’ 的循環複雜度為 ‘{1}’。請重寫或重構程式碼，以將其複雜度降低至 ‘{2}’ 以下。

# AvoidExcessiveComplexityTitle
source: Avoid excessive complexity
cs: Vyhněte se nadměrné složitosti
de: Übermäßige Komplexität vermeiden
es: Evite la excesiva complejidad
fr: Éviter la complexité excessive
it: Evita complessità eccessiva
ja: 複雑にしすぎない
ko: 지나치게 복잡하게 만들지 마십시오.
pl: Unikaj nadmiernej złożoności
pt_br: Evitar complexidade excessiva
ru: Избегать чрезмерной сложности
tr: Aşırı karmaşıklıktan kaçının
zh_hans: 避免过度复杂性
zh_hant: 避免過度複雜

# AvoidExcessiveInheritanceDescription
source: Deeply nested type hierarchies can be difficult to follow, understand, and maintain. This rule limits analysis to hierarchies in the same module. To fix a violation of this rule, derive the type from a base type that is less deep in the inheritance hierarchy or eliminate some of the intermediate base types.
cs: Hluboce vnořené hierarchie typů můžou být složité na sledování, pochopení a údržbu. Toto pravidlo omezuje analýzu na hierarchie ve stejném modulu. Pokud chcete porušení tohoto pravidla opravit, odvoďte typ od základního typu, který je méně hluboko v hierarchii dědičnosti, nebo eliminujte některé z mezilehlých základních typů.
de: Es kann schwierig sein, stark verschachtelte Typhierarchien nachzuverfolgen, nachzuvollziehen und zu verwalten. Diese Regel schränkt Analysen auf Hierarchien im selben Modul ein. Wenn Sie einen Verstoß gegen diese Regel beheben möchten, leiten Sie den Typ von einem Basistypen ab, dessen Vererbungshierarchie weniger stark verschachtelt ist, oder löschen Sie einige der Zwischenbasistypen.
es: Las jerarquías de tipo profundamente anidado pueden ser difíciles de seguir, entender y mantener. Esta regla limita el análisis a las jerarquías en el mismo módulo. Para corregir una infracción de esta regla, derive el tipo de un tipo base que es menos profundo en la jerarquía de herencia o elimine algunos de los tipos base intermedios.
fr: Les hiérarchies de type profondément imbriquées peuvent être difficiles à suivre, comprendre et maintenir. Cette règle limite l'analyse aux hiérarchies d'un même module. Pour corriger une infraction à cette règle, dérivez le type à partir d'un type de base ancré moins profondément dans la hiérarchie héritée ou éliminez des types de base intermédiaires.
it: Le gerarchie dei tipi con molti livelli di nidificazione possono essere difficili da seguire, comprendere e gestire. Questa regola consente di limitare l'analisi alle gerarchie presenti nello stesso modulo. Per correggere una violazione di questa regola, derivare il tipo da un tipo di base che si trova a un livello più superficiale della gerarchia di ereditarietà oppure eliminare alcuni dei tipi di base intermedi.
ja: 入れ子の深度が深い型階層はフォロー、理解、保守が難しくなることがあります。このルールは、同じモジュールの階層にのみ分析対象を制限します。このルール違反を修正するには、継承階層にある深度の深くない基本型から型を派生させるか、一部の中間基本型を削除します。
ko: 계층 구조가 많이 중첩된 형식은 추적, 이해 및 유지 관리하기 어려울 수 있습니다. 이 규칙은 분석을 같은 모듈 내의 계층 구조로 제한합니다. 이 규칙의 위반을 해결하려면 상속 계층 구조에서 수준이 낮은 기본 형식에서 형식을 파생하거나 중간 기본 형식 중 일부를 제거하세요.
pl: Głęboko zagnieżdżone hierarchie typów mogą być trudne w zrozumieniu i utrzymaniu. Ta reguła ogranicza analizę do hierarchii w tym samym module. Aby naprawić naruszenie tej reguły, utwórz typ jako pochodny typu podstawowego o mniejszej głębokości w hierarchii dziedziczenia lub wyeliminuj niektóre pośrednie typy podstawowe.
pt_br: Hierarquias de tipo profundamente aninhadas podem ser difíceis de seguir, entender e manter. Esta regra limita a análise a hierarquias no mesmo módulo. Para corrigir uma violação desta regra, derive o tipo de um tipo básico menos profundo na hierarquia de herança ou elimine alguns dos tipos básicos intermediários.
ru: Иерархии типов с высоким уровнем вложенности могут представлять сложности в понимании и поддержке. Это правило ограничивает анализ, включая в него только иерархии в том же модуле. Чтобы устранить нарушение этого правила, определите производный тип из базового типа с более низким уровнем вложенности в иерархии наследования или исключите некоторые из промежуточных базовых типов.
tr: Çok fazla iç içe girmiş tür hiyerarşileri izlemeyi, anlamayı ve bakım yapmayı zorlaştırabilir. Bu kural, analizi aynı modül içindeki hiyerarşilerle sınırlı tutar. Bu kuralın ihlal edildiği bir durumu düzeltmek için türü devralınan hiyerarşiden daha az iç içe geçmiş bir hiyerarşiden alın veya ara taban türlerin bir kısmını kaldırın.
zh_hans: 很难跟踪、理解和维护深度嵌套的类型层次结构。该规则将分析限制在同一模块内的层次结构中。要纠正违反此规则的情况，请从继承层次结构中不太深入的基类中派生类型，或者删除部分中间基类型。
zh_hant: 深度巢狀類型階層可能難以遵循、了解及維護。此規則會限制對同一個模組中階層的分析。若要修正違規，請從繼承階層較淺層的基底類型衍生類型，或去除部分中層基底類型。

# AvoidExcessiveInheritanceMessage
source: '{0}' has an object hierarchy '{1}' levels deep within the defining module. If possible, eliminate base classes within the hierarchy to decrease its hierarchy level below '{2}': '{3}'.
cs: {0} má hierarchii objektů, která v definujícím modulu dosahuje hloubky {1} úrovní. Pokud je to možné, eliminujte v hierarchii základní třídy tak, aby se počet úrovní v hierarchii snížil pod {2}: {3}
de: "{0}" weist eine {1} Ebenen tiefe Objekthierarchie innerhalb des definierenden Moduls auf. Löschen Sie nach Möglichkeit Basisklassen innerhalb der Hierarchie, um die Hierarchieebene auf einen Wert unter {2} zu senken: {3}.
es: "{0}" tiene un nivel de jerarquía de objetos "{1}" en el interior del módulo de definición. Si es posible, elimine las clases base dentro de la jerarquía para disminuir su nivel de jerarquía por debajo de "{2}": "{3}"
fr: '{0}' a une hiérarchie d'objets située à '{1}' niveaux de profondeur dans le module de définition. Si possible, éliminez des classes de base dans la hiérarchie pour baisser celle-ci sous le niveau '{2}' : '{3}'.
it: '{0}' contiene una gerarchia di oggetti a '{1}' livelli nel modulo che si sta definendo. Se possibile, eliminare le classi base dalla gerarchia per ridurre il livello della gerarchia al di sotto di '{2}': '{3}'.
ko: 정의 모듈 내에서 '{0}'의 개체 계층 구조가 '{1}' 수준 깊습니다. 가능한 경우 계층 구조 내에서 기본 클래스를 제거하여 해당 계층 구조 수준을 '{2}' 아래('{3}')로 낮추세요.
pl: Element „{0}” ma w definiującym module hierarchię obiektów o następującej liczbie poziomów głębokości: „{1}”. Jeśli to możliwe, wyeliminuj klasy podstawowe z hierarchii, aby obniżyć poziom hierarchii poniżej „{2}”: „{3}”.
pt_br: '{0}' tem uma hierarquia de objetos com profundidade de '{1}' níveis no módulo de definição. Se possível, elimine as classes base na hierarquia para diminuir o nível de hierarquia abaixo de '{2}': '{3}'.
ru: "{0}" имеет уровень вложенности иерархии "{1}" в определяющем модуле. Если возможно, исключите базовые классы из иерархии, чтобы уменьшить уровень вложенности иерархии ниже "{2}": "{3}"
tr: '{0}', tanımlandığı modül içinde '{1}' düzey derinliğinde bir nesne hiyerarşisine sahip. Mümkünse hiyerarşideki temel sınıfları ortadan kaldırarak hiyerarşi düzeyini '{2}' seviyesinin altına düşürün: '{3}'.
zh_hans: “{0}”的对象层次结构在定义模块内的深度为“{1}” 层。如有可能，请消除层次结构中的基类，将其层次结构级别降到“{2}”以下:“{3}”。
zh_hant: '{0}' 的物件階層 '{1}' 層級，位於定義模組深層。請盡可能去除階層中的基底類別，以將其階層層級降低至 '{2}': '{3}' 以下。

# AvoidExcessiveInheritanceTitle
source: Avoid excessive inheritance
cs: Vyhněte se nadměrné dědičnosti
de: Übermäßige Vererbung vermeiden
es: Evite una herencia excesiva
fr: Éviter les héritages excessifs
it: Evita ereditarietà eccessiva
ja: 継承を使用しすぎない
ko: 상속성을 너무 많이 사용하지 마십시오.
pl: Unikaj nadmiernego dziedziczenia
pt_br: Evitar herança excessiva
ru: Избегать чрезмерного наследования
tr: Aşırı devralmadan kaçının
zh_hans: 避免过度继承
zh_hant: 避免過度繼承

# AvoidUnmantainableCodeDescription
source: The maintainability index is calculated by using the following metrics: lines of code, program volume, and cyclomatic complexity. Program volume is a measure of the difficulty of understanding of a symbol that is based on the number of operators and operands in the code. Cyclomatic complexity is a measure of the structural complexity of the type or method. A low maintainability index indicates that code is probably difficult to maintain and would be a good candidate to redesign.
cs: Index udržovatelnosti se počítá pomocí těchto metrik: řádky kódu, objem programu a cyklomatická složitost. Objem programu je míra, jak obtížné je porozumět symbolu založenému na počtu operátorů a operandů v kódu. Cyklomatická složitost je míra strukturální složitosti typu nebo metody. Nízký index udržovatelnosti může znamenat, že kód bude pravděpodobně obtížné udržovat a byl by vhodným kandidátem na změnu návrhu.
de: Der Wartbarkeitsindex wird mithilfe der folgenden Metriken berechnet: Codezeilen, Programmvolumen und zyklomatische Komplexität. Das Programmvolumen ist ein Maß für die Verständnisschwierigkeit für ein Symbol, das auf der Anzahl von Operatoren und Operanden im Code basiert. Zyklomatische Komplexität ist ein Maß für die strukturelle Komplexität des Typs oder der Methode. Ein niedriger Wartbarkeitsindex weist darauf hin, dass Code wahrscheinlich schwer zu warten ist und ein guter Kandidat für eine Neuentwicklung wäre.
es: El índice de mantenimiento se calcula con las métricas siguientes: líneas de código, volumen del programa y complejidad ciclomática. El volumen del programa es una medida de la dificultad para entender un símbolo que se basa en el número de operadores y de operandos en el código. La complejidad ciclomática es una medida de la complejidad estructural del tipo o método. Un índice de mantenimiento bajo indica que el código es probablemente difícil de mantener y sería un buen candidato para rediseñarlo.
fr: L'indice de maintenabilité est calculé à l'aide des métriques suivantes : lignes de code, volume de programme et complexité cyclomatique. Le volume de programme est une mesure de la difficulté de compréhension d'un symbole en fonction du nombre d'opérateurs et d'opérandes dans le code. La complexité cyclomatique est une mesure de la complexité structurelle du type ou de la méthode. Un faible indice de maintenabilité indique que le code est probablement difficile à tenir à jour, et qu'il est préférable de revoir sa conception.
it: Per calcolare l'indice di manutenibilità, si usano le metriche seguenti: righe di codice, volume del programma e complessità ciclomatica. Il volume del programma misura la difficoltà di comprensione di un simbolo sulla base del numero di operatori e operandi presenti nel codice. La complessità ciclomatica misura la complessità strutturale del tipo o del metodo. Un indice di manutenibilità basso indica che il codice è probabilmente più difficile da gestire ed è quindi un valido candidato per la riprogettazione.
ja: 保守容易性指数は、メトリックスとして、コード行、プログラム ボリューム、サイクロマティック複雑度を使用して計算されます。プログラム ボリュームは、コード内の演算子やオペランドの数に基づく、シンボルを理解する難しさの度合いです。サイクロマティック複雑度は、型またはメソッドの構造的な複雑さの度合いです。保守容易性指数が低いと、コードの保守が難しい可能性が高く、再設計の候補になり得ることを示しています。
ko: 유지 관리 인덱스는 코드, 프로그램 볼륨 및 순환 복잡성 줄과 같은 메트릭을 사용하여 계산됩니다. 프로그램 볼륨은 코드에 있는 연산자 및 피연산자 개수에 따른 기호 이해도의 측정값입니다. 순환 복잡성은 형식이나 메서드에 대한 구조적 복잡성의 측정값입니다. 낮은 유지 관리 인덱스는 코드를 유지 관리하기 어려울 수 있어 다시 설계하기 좋은 후보임을 나타냅니다.
pl: Indeks dostępności jest obliczany przy użyciu następujących metryk: wiersze kodu, ilość programu i złożoność cyklomatyczna. Ilość programu to miara trudności w zrozumieniu symbolu oparta na liczbie operatorów i operandów w kodzie. Złożoność cyklomatyczna to miara złożoności strukturalnej typu lub metody. Niski indeks dostępności wskazuje kod, który jest prawdopodobnie trudny w konserwacji. Byłby to dobry kandydat do przeprojektowania.
pt_br: O índice de facilidade de manutenção é calculado usando as seguintes métricas: linhas de código, volume do programa e complexidade ciclomática. O volume do programa é uma medida da dificuldade de entender um símbolo baseado no número de operadores e operandos no código. A complexidade ciclomática é uma medida da complexidade estrutural do tipo ou do método. Um índice de facilidade de manutenção baixo indica que, provavelmente, o código é difícil de ser mantido e seria um bom candidato para a reformulação.
ru: Индекс удобства поддержки вычисляется с помощью следующих метрик: строк кода, объема программы и цикломатической сложности. Объем программы — это мера сложности понимания символа, основанная на количестве операторов и операндов в коде. Цикломатическая сложность — это мера структурной сложности типа или метода. Низкий индекс удобства поддержки означает, что код, скорее всего, сложно обслуживать, поэтому следует рассмотреть возможность его переработки.
tr: Bakım endeksi şu ölçümler kullanılarak hesaplanır: kod satırları, program hacmi ve döngüsel karmaşıklık. Program hacmi, koddaki işleç ve işlenen sayısına bağlı olarak bir sembolün anlaşılma zorluğu ölçüsüdür. Döngüsel karmaşıklık, türün veya metodun yapısal karmaşıklık ölçüsüdür. Düşük bakım endeksi, kodun bakımının zor olabileceğini ve yeniden tasarlanmak için iyi bir aday olduğunu gösterir.
zh_hans: 使用以下指标计算可维护性指数: 行代码、程序量和圈复杂度。程序量是基于代码中的运算符和操作数数量来理解符号的难度的度量值。圈复杂度是类型或方法的结构化复杂度的度量值。可维护性指数低表示代码可能难以维护，适合重新设计。
zh_hant: 使用下列度量可計算維護性指數: 程式碼行數、程式量以及循環複雜度。從程式量可測出了解符號的困難度，而其取決於程式碼中的運算子與運算元數目。而循環複雜度可測出類型或方法的結構性複雜度。維護指數低，表示程式碼的維護可能較困難，而重新設計會是比較好的選擇。

# AvoidUnmantainableCodeMessage
source: '{0}' has a maintainability index of '{1}'. Rewrite or refactor the code to increase its maintainability index (MI) above '{2}'.
cs: {0} má index udržovatelnosti {1}. Přepište nebo refaktorujte kód tak, aby se index udržovatelnosti zvýšil nad {2}.
de: "{0}" hat einen Wartbarkeitsindex von "{1}". Schreiben Sie den Code neu, oder gestalten Sie ihn um, um den Wartbarkeitsindex auf einen Wert über "{2}" zu erhöhen.
es: "{0}" tiene un índice de mantenimiento de "{1}". Escriba o refactorice el código para aumentar su índice de mantenimiento sobre "{2}".
fr: '{0}' a un indice de maintenabilité de '{1}'. Réécrivez ou refactorisez le code pour monter son indice de maintenabilité au-dessus de '{2}'.
it: L'indice di manutenibilità di '{0}' è '{1}'. Riscrivere il codice o effettuarne il refactoring per aumentare l'indice di manutenibilità sopra '{2}'.
ja: '{0}' の保守容易性指数は '{1}' です。コードを書き直すかリファクタリングを行い、保守容易性指数 (MI) が '{2}' より大きくなるようにしてください。
ko: '{0}'의 유지 관리 인덱스가 '{1}'입니다. 코드를 다시 작성하거나 리펙터링하여 MI(유지 관리 인덱스)를 '{2}' 이상으로 늘리세요.
pl: Element „{0}” ma indeks dostępności „{1}”. Ponownie napisz kod lub refaktoryzuj go w taki sposób, aby indeks dostępności był wyższy niż „{2}”.
pt_br: '{0}' tem um índice de manutenção de '{1}'. Reescreva ou refatore o código para aumentar o seu índice de manutenção (MI) acima de '{2}'.
ru: '{0}' имеет индекс удобства поддержки '{1}'. Перепишите или оптимизируйте код, чтобы уменьшить индекс удобства поддержки ниже '{2}'.
tr: '{0}' öğesinin bakım endeksi '{1}'. Kodu yeniden yazarak veya yeniden düzenleyerek bakım endeksini (MI) '{2}' düzeyinin üstüne çıkarın.
zh_hans: “{0}”具有可维护性指数“{1}”。请重新编写或重构代码，将其可维护性指数(MI)增加到“{2}”以上。
zh_hant: '{0}' 的可維護性指數為 '{1}'。請重寫或重構程式碼，以將其可維護性指數 (MI) 提高到 '{2}' 以上。

# AvoidUnmantainableCodeTitle
source: Avoid unmaintainable code
cs: Vyhněte se neudržovatelnému kódu
de: Nicht wartbaren Code vermeiden
es: Evite código que no se puede mantener
fr: Éviter le code impossible à maintenir
it: Evita codice non gestibile
ja: メンテナンスできないコードを使用しない
ko: 유지 관리할 수 없는 코드는 사용하지 마십시오.
pl: Unikaj kodu trudnego w utrzymaniu
pt_br: Evitar código de difícil manutenção
ru: Разрешить неподдерживаемый код
tr: Sürdürülemeyen koddan kaçın
zh_hans: 避免使用无法维护的代码
zh_hant: 避免無法維護的程式碼
