Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TypesThatOwnDisposableFieldsShouldBeDisposableDescription
source: A class declares and implements an instance field that is a System.IDisposable type, and the class does not implement IDisposable. A class that declares an IDisposable field indirectly owns an unmanaged resource and should implement the IDisposable interface.
cs: Třída deklaruje a implementuje pole instance, které je typu System.IDisposable, přičemž tato třída neimplementuje IDisposable. Třída, která deklaruje pole IDisposable nepřímo, vlastní nespravovaný prostředek a měla by implementovat rozhraní IDisposable.
de: Eine Klasse deklariert und implementiert ein Instanzenfeld vom Typ "System.IDisposable", und IDisposable wird von der Klasse nicht implementiert. Eine Klasse, die ein IDisposable-Feld indirekt deklariert, besitzt eine nicht verwaltete Ressource und muss die IDisposable-Schnittstelle implementieren.
es: Una clase declara e implementa un campo de instancia que es un tipo System.IDisposable y la clase no implementa IDisposable. Una clase que declara un campo IDisposable indirectamente tiene un recurso no administrado y debe implementar la interfaz IDisposable.
fr: Une classe déclare et implémente un champ d'instance qui représente le type System.IDisposable, et la classe n'implémente pas IDisposable. Une classe qui déclare un champ IDisposable est indirectement propriétaire d'une ressource non managée et doit implémenter l'interface IDisposable.
it: Una classe dichiara e implementa un campo di istanza che è un tipo System.IDisposable, ma non implementa IDisposable. Una classe che dichiara un campo IDisposable è indirettamente proprietaria di una risorsa non gestita e deve implementare l'interfaccia IDisposable.
ja: クラスが System.IDisposable 型であるインスタンス フィールドを宣言および実装していますが、IDisposable を実装していません。IDisposable フィールドを宣言するクラスは間接的にアンマネージ リソースを所有しているため、IDisposable インターフェイスを実装する必要があります。
ko: 클래스는 System.IDisposable 형식인 인스턴스 필드를 선언하고 구현하지만, IDisposable을 구현하지 않습니다. IDisposable 필드를 선언하는 클래스는 관리되지 않는 리소스를 간접적으로 소유하며, IDisposable 인터페이스를 구현해야 합니다.
pl: Klasa deklaruje i implementuje pole wystąpienia typu System.IDisposable oraz nie implementuje interfejsu IDisposable. Klasa deklarująca pole IDisposable jest pośrednio właścicielem zasobu niezarządzanego i powinna implementować interfejs IDisposable.
pt_br: Uma classe declara e implementa um campo de instância que é um tipo System.IDisposable e a classe não implementa IDisposable. Uma classe que declara um campo IDisposable é proprietária indireta de um recurso não gerenciado e deve implementar a interface IDisposable.
ru: Класс объявляет и реализует поле экземпляра, имеющее тип System.IDisposable, и не реализует IDisposable. Класс, который объявляет поле IDisposable, косвенно владеет неуправляемым ресурсом и должен реализовывать интерфейс IDisposable.
tr: Bir sınıf, System.IDisposable türü olan bir örnek alanını bildirip uygular ve sınıf tarafından IDisposable uygulanmaz. IDisposable alanı bildiren bir sınıf dolaylı olarak yönetilmeyen bir kaynağa sahip olur ve IDisposable arabirimini uygulamalıdır.
zh_hans: 一个类，它声明和实现 System.IDisposable 类型的实例字段，且它不实现 IDisposable。声明 IDisposable 字段的类间接拥有非托管资源，并且应该实现 IDisposable 接口。
zh_hant: 類別會宣告及實作類型為 System.IDisposable 的執行個體欄位，且該類別不會實作 IDisposable。宣告 IDisposable 欄位的類別會間接擁有非受控資源，且應實作 IDisposable 介面。

# TypesThatOwnDisposableFieldsShouldBeDisposableMessageNonBreaking
source: Type '{0}' owns disposable field(s) '{1}' but is not disposable
cs: Typ {0} vlastní jednoúčelová pole {1}, ale není jednoúčelový.
de: Der Typ "{0}" besitzt verwerfbare Felder "{1}", ist jedoch nicht verwerfbar.
es: El tipo "{0}" tiene campos descartables "{1}" pero no es descartable
fr: Le type '{0}' a un ou plusieurs champs supprimables '{1}', mais n'est pas supprimable
it: Il tipo '{0}' è proprietario di campi Disposable '{1}' ma non è Disposable
ja: 型 '{0}' は破棄可能なフィールド '{1}' を所有しますが、破棄可能ではありません
ko: 삭제 가능한 필드 '{1}'이(가) 있는 '{0}' 형식을 삭제할 수 없습니다.
pl: Typ „{0}” zawiera pola możliwe do likwidacji („{1}”), ale sam nie jest możliwy do likwidacji
pt_br: O tipo '{0}' tem campos descartáveis '{1}', mas não é descartável
ru: Тип "{0}" владеет высвобождаемыми полями "{1}", но не является высвобождаемым
tr: '{0}' türü '{1}' atılabilir alanlarını içeriyor ancak atılabilir değil
zh_hans: 类型“{0}”具有可释放的字段“{1}”，但该类型是不可释放的
zh_hant: 類型 '{0}' 擁有可處置的欄位 '{1}' 但其本身並非可處置項目

# UriParametersShouldNotBeStringsCodeFixTitle
source: Add 'System.Uri' overloads
cs: Přidat přetížení System.Uri
de: „System.Uri“-Überladungen hinzufügen
es: Agregar sobrecargas de 'System.Uri'
fr: Ajouter une surcharge « System.Uri »
it: Aggiungi overload 'System.Uri'
ko: 'System.Uri' 오버로드 추가
pl: Dodaj przeciążenia 'System.Uri'
pt_br: Adicionar sobrecarga 'System.Uri'
ru: Добавить перегрузки 'System.Uri'
tr: 'System.Uri' aşırı yüklemeleri ekle
zh_hans: 添加 “System.Uri” 过载
zh_hant: 新增 'System.Uri' 多載

# UseCrossPlatformIntrinsicsDescription
source: This rule detects usage of platform-specific intrinsics that can be replaced with an equivalent cross-platform intrinsic instead.
cs: Toto pravidlo detekuje použití vnitřních hodnot specifických pro platformu, které lze místo toho nahradit ekvivalentními vnitřními hodnotami pro různé platformy.
de: Diese Regel erkennt die Verwendung plattformspezifischer systeminterner Funktionen, die durch ein entsprechendes plattformübergreifendes Äquivalent ersetzt werden können.
es: Esta regla detecta el uso de intrínsecos específicos de la plataforma que se pueden reemplazar por un intrínseco multiplataforma equivalente en su lugar.
fr: Cette règle détecte l’utilisation d’intrinsèques spécifiques à la plateforme qui peuvent être remplacés par un équivalent multiplateforme.
it: Questa regola rileva l'utilizzo di intrinseci specifici della piattaforma che possono essere sostituiti con un intrinseco equivalente multipiattaforma.
ko: 이 규칙은 플랫폼별 내장 기능의 사용을 감지하며, 이를 동일한 플랫폼 간 내장으로 대체할 수 있습니다.
pl: Ta reguła wykrywa użycie funkcji wewnętrznych specyficznych dla platformy, które można zastąpić równoważną wewnętrzną funkcją międzyplatformową.
pt_br: Esta regra detecta o uso de intrínsecos específicos da plataforma que podem ser substituídos por um intrínseco multiplataforma equivalente.
ru: Это правило обнаруживает использование встроенных функций, специфичных для платформы, которые можно заменить эквивалентной кроссплатформенной встроенной функцией.
tr: Bu kural, eşdeğer platformlar arası iç öğe ile değiştirilebilecek, platforma özgü iç öğe kullanımını algılar.
zh_hans: 此规则检测特定于平台的内部函数的使用情况，这些内部函数可以替换为等效的跨平台内部函数。
zh_hant: 此規則會偵測平台特定的內建使用情況，這些內建可以被對應的跨平台內建所取代。

# UseCrossPlatformIntrinsicsMessage_opAddition
source: The addition operator should be preferred
cs: Upřednostňuje se operátor sčítání.
de: Der Additionsoperator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de suma
fr: L’opérateur d’addition doit être préféré
it: È consigliabile preferire l'operatore di addizione
ko: 더하기 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator addition
pt_br: Deve-se dar preferência ao operador de adição
ru: Следует предпочитать оператор сложения
tr: Toplama işleci tercih edilmelidir
zh_hans: 应优先使用加法运算符
zh_hant: 應優先使用加法運算子

# UseCrossPlatformIntrinsicsMessage_opBitwiseAnd
source: The bitwise-and operator should be preferred
cs: Měl by být upřednostňován bitový operátor.
de: Der bitweise UND-Operator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador y bit a bit
fr: L’opérateur ET binaire est à privilégier
it: È consigliabile usare l'operatore AND bit per bit
ko: 비트 AND 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator bitwise-and
pt_br: Deve-se dar preferência ao operador E bit a bit
ru: Следует предпочитать побитовый оператор И
tr: Bit düzeyinde VE işleci tercih edilmelidir
zh_hans: 应优先使用按位和运算符
zh_hant: 應優先使用位元 AND 運算子

# UseCrossPlatformIntrinsicsMessage_opBitwiseOr
source: The bitwise-or operator should be preferred
cs: Měl by být upřednostňován operátor bitwise-or.
de: Der bitweise ODER-Operator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador bit a bit OR.
fr: L’opérateur OU binaire (|) est à privilégier
it: È consigliabile usare l'operatore OR bit per bit
ko: 비트 또는 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator bitwise-or
pt_br: Deve-se dar preferência ao operador OU bit a bit
ru: Следует предпочитать побитовый оператор ИЛИ
tr: Bit düzeyinde VEYA işleci tercih edilmelidir
zh_hans: 应优先使用按位或运算符
zh_hant: 應優先使用位元 OR 運算子

# UseCrossPlatformIntrinsicsMessage_opDivison
source: The division operator should be preferred
cs: Upřednostňuje se operátor dělení.
de: Der Divisionsoperator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de división
fr: L’opérateur de division doit être préféré
it: È consigliabile preferire l'operatore di divisione
ko: 빼기 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator division
pt_br: Deve-se dar preferência ao operador de divisão
ru: Следует предпочитать оператор деления
tr: Bölme işleci tercih edilmelidir
zh_hans: 应优先使用除法运算符
zh_hant: 應優先使用除法運算子

# UseCrossPlatformIntrinsicsMessage_opExclusiveOr
source: The exclusive-or operator should be preferred
cs: Měl by být upřednostňován operátor exclusive-or.
de: Der exklusive ODER-Operator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador exclusivo o
fr: L’opérateur OU exclusif (^) est à privilégier
it: È consigliabile usare l'operatore OR esclusivo
ko: 배타적 OR 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator exclusive-or
pt_br: Deve-se dar preferência ao operador OU exclusivo
ru: Следует предпочитать оператор исключающего ИЛИ
tr: Münhasır VEYA işleci tercih edilmelidir
zh_hans: 应优先使用异或运算符
zh_hant: 應優先使用排除 OR 運算子

# UseCrossPlatformIntrinsicsMessage_opLeftShift
source: The left-shift operator should be preferred
cs: Měl by být upřednostňován operátor levého posunu.
de: Der Links-Shift-Operator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de desplazamiento a la izquierda
fr: L’opérateur de décalage à gauche doit être préféré
it: È consigliabile utilizzare l'operatore di spostamento a sinistra
ko: 왼쪽 시프트 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator left-shift
pt_br: Deve-se dar preferência ao operador de deslocamento à esquerda
ru: Следует предпочитать оператор левого сдвига
tr: Sol kaydırma işleci tercih edilmelidir
zh_hans: 应优先使用左移运算符
zh_hant: 應優先使用左移運算子

# UseCrossPlatformIntrinsicsMessage_opMultiply
source: The multiply operator should be preferred
cs: Měl by být upřednostňován operátor násobení.
de: Der Multiplikationsoperator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de multiplicación
fr: L’opérateur de multiplication doit être préféré
it: È consigliabile utilizzare l'operatore di moltiplicazione
ko: 곱하기 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator multiply
pt_br: Deve-se dar preferência ao operador de multiplicação
ru: Следует предпочитать оператор умножения
tr: Çarpma işleci tercih edilmelidir
zh_hans: 应优先使用乘法运算符
zh_hant: 應優先使用乘法運算子

# UseCrossPlatformIntrinsicsMessage_opOnesComplement
source: The ones-complement operator should be preferred
cs: Upřednostňuje se operátor doplňku ones.
de: Der Einerkomplement-Operator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de complemento a uno
fr: L’opérateur complément à un (~) est à privilégier
it: È consigliabile preferire l'operatore di complemento a uno
ko: 1의 보수 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator ones-complement
pt_br: Deve-se dar preferência ao operador de complemento de um
ru: Следует предпочитать оператор дополнения до единицы
tr: Bire tümleme işleci tercih edilmelidir
zh_hans: 应优先使用一的补码运算符
zh_hant: 應優先使用一補位運算子

# UseCrossPlatformIntrinsicsMessage_opRightShift
source: The right-shift operator should be preferred
cs: Měl by být upřednostňován operátor pravého posunu.
de: Der Rechts-Shift-Operator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de desplazamiento a la derecha
fr: L’opérateur de décalage vers la droite doit être préféré
it: È consigliabile preferire l'operatore di spostamento a destra
ko: 오른쪽 시프트 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator right-shift
pt_br: Deve-se dar preferência ao operador de deslocamento à direita
ru: Следует предпочитать оператор правого сдвига
tr: Sağ kaydırma işleci tercih edilmelidir
zh_hans: 应优先使用右移运算符
zh_hant: 應優先使用右移運算子

# UseCrossPlatformIntrinsicsMessage_opSubtraction
source: The subtraction operator should be preferred
cs: Upřednostňuje se operátor odčítání.
de: Der Subtraktionsoperator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de resta
fr: L’opérateur de soustraction doit être préféré
it: È consigliabile utilizzare l'operatore di sottrazione
ko: 빼기 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator subtraction
pt_br: Deve-se dar preferência ao operador de subtração
ru: Следует предпочитать оператор вычитания
tr: Çıkarma işleci tercih edilmelidir
zh_hans: 应优先使用减法运算符
zh_hant: 應優先使用減法運算子

# UseCrossPlatformIntrinsicsMessage_opUnaryNegation
source: The unary-negation operator should be preferred
cs: Upřednostňuje se operátor unární negace.
de: Der Operator für die unäre Negation sollte bevorzugt verwendet werden.
es: Se debe preferir el operador unario-negación
fr: L’opérateur de négation unaire doit être préféré
it: È consigliabile utilizzare l'operatore di negazione unario
ko: 단항 부정 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator unary-negation
pt_br: Deve-se dar preferência ao operador de negação unária
ru: Следует предпочитать оператор унарного отрицания
tr: Birli olumsuzlama işleci tercih edilmelidir
zh_hans: 应优先使用一元否定运算符
zh_hant: 應優先使用一元否定運算子

# UseCrossPlatformIntrinsicsMessage_opUnsignedRightShift
source: The unsigned right-shift operator should be preferred
cs: Měl by být upřednostňován nepodepsaný operátor pravého posunu.
de: Der unsignierte Rechts-Shift-Operator sollte bevorzugt verwendet werden.
es: Se debe preferir el operador de desplazamiento a la derecha sin signo
fr: L’opérateur de décalage vers la droite non signé doit être préféré
it: È consigliabile preferire l'operatore di spostamento a destra senza segno
ko: 부호 없는 오른쪽 시프트 연산자를 선호해야 합니다.
pl: Preferowany powinien być operator bez podpisu right-shift
pt_br: Deve-se dar preferência ao operador de deslocamento à direita sem sinal
ru: Следует предпочитать оператор беззнакового правого сдвига
tr: İşaretsiz sağ kaydırma işleci tercih edilmelidir
zh_hans: 应优先使用无符号右移运算符
zh_hant: 應優先使用未簽署右移運算子

# UseCrossPlatformIntrinsicsTitle
source: Use cross-platform intrinsics
cs: Použití vnitřních hodnot pro různé platformy
de: Verwenden Sie plattformübergreifende systeminterne Funktionen.
es: Uso de intrínsecos multiplataforma
fr: Utilisez des intrinsèques multiplateformes
it: Usa intrinseci multipiattaforma
ko: 크로스 플랫폼 내장 기능을 사용하세요.
pl: Korzystanie z funkcji wewnętrznych międzyplatformowych
pt_br: Use intrínsecos multiplataforma
ru: Используйте кроссплатформенные встроенные функции
tr: Platformlar arası iç öğeleri kullanın
zh_hans: 使用跨平台内部函数
zh_hant: 使用跨平台的內建項目

# UseGenericEventHandlerInstancesTitle
source: Use generic event handler instances
cs: Použijte obecné instance obslužné rutiny události.
de: Generische Ereignishandlerinstanzen verwenden
es: Usar instancias genéricas del controlador de eventos
fr: Utiliser les instances du gestionnaire d'événements génériques
it: Usare istanze del gestore dell'evento generico
ja: 汎用イベント ハンドラーのインスタンスを使用します
ko: 제네릭 이벤트 처리기 인스턴스를 사용하세요.
pl: Używaj ogólnych wystąpień procedur obsługi zdarzeń
pt_br: Usar instâncias do manipulador de eventos genéricos
ru: Используйте экземпляры обработчика универсальных событий
tr: Genel olay işleyicisi örnekleri kullanın
zh_hans: 使用泛型事件处理程序实例
zh_hant: 使用泛型事件處理常式執行個體

# EnumsShouldHaveZeroValueTitle
source: Enums should have zero value
cs: Výčty mají mít nulovou hodnotu.
de: Enumerationen müssen einen Wert von null aufweisen.
es: Las enumeraciones deben tener un valor igual a cero
fr: Les enums doivent avoir la valeur zéro
it: Le enumerazioni devono avere valore zero
ja: 列挙型は 0 値を含んでいなければなりません
ko: 열거형에는 0 값이 있어야 합니다.
pl: Wyliczenia powinny mieć wartość zero
pt_br: Enums devem ter valor zero
ru: Перечисления должны иметь нулевое значение
tr: Sabit listelerinin sıfır değeri olmalıdır
zh_hans: 枚举应具有零值
zh_hant: 列舉應要零值

# EnumsShouldHaveZeroValueDescription
source: The default value of an uninitialized enumeration, just as other value types, is zero. A nonflags-attributed enumeration should define a member by using the value of zero so that the default value is a valid value of the enumeration. If an enumeration that has the FlagsAttribute attribute applied defines a zero-valued member, its name should be ""None"" to indicate that no values have been set in the enumeration.
cs: Výchozí hodnota neinicializovaného výčtu, stejně jako jiných typů hodnot, je nulová. Výčet s atributy bez příznaků by měl definovat člena pomocí nulové hodnoty, aby výchozí hodnota byla platnou hodnotou tohoto výčtu. Pokud výčet, u kterého se používá atribut FlagsAttribute, definuje člena s nulovou hodnotou, měl by mít název None, což značí, že v tomto výčtu nejsou nastavené žádné hodnoty.
de: Der Standardwert einer nicht initialisierten Enumeration beträgt wie bei anderen Werttypen null. Eine Enumeration ohne Flags und mit Attributen muss einen Member über den Wert null definieren, damit der Standardwert ein gültiger Wert der Enumeration ist. Wenn eine Enumeration, auf die das FlagsAttribute-Attribut angewendet wurde, einen Member vom Wert null definiert, muss dessen Name ""None"" lauten, um darauf hinzuweisen, dass in der Enumeration keine Werte festgelegt wurden.
es: El valor predeterminado de una enumeración no inicializada, al igual que otros tipos de valor, es cero. Una enumeración con atributo y sin marcas debe definir un miembro con el valor de cero, de modo que el valor predeterminado es un valor válido de la enumeración. Si una enumeración a la que se le haya aplicado el atributo FlagsAttribute define un miembro con valor cero, su nombre debe ser "None" para indicar que no se han establecido valores en la enumeración.
fr: La valeur par défaut d'une énumération non initialisée, comme d'autres types valeur, est zéro. Une énumération attribuée sans indicateur doit définir un membre de valeur zéro pour que la valeur par défaut soit une valeur valide de l'énumération. Si une énumération à laquelle est appliqué l'attribut FlagsAttribute définit un membre de valeur zéro, son nom doit être "None" pour indiquer qu'aucune valeur n'a été définie dans l'énumération.
it: Il valore predefinito di un'enumerazione non inizializzata, come altri tipi di valore, è zero. Un'enumerazione senza attributi flag deve definire un membro usando il valore zero, in modo che il valore predefinito sia un valore valido dell'enumerazione. Se un'enumerazione a cui è applicato l'attributo FlagsAttribute definisce un membro con valore zero, il relativo nome deve essere ""None"" per indicare che nell'enumerazione non è stato impostato alcun valore.
ja: 初期化されていない列挙型の既定値は、他の値型と同様に、ゼロです。Flags 属性以外が指定された列挙型では、既定値が有効な列挙値になるように、値 0 を使用してメンバーを定義する必要があります。FlagsAttribute 属性が適用されている列挙型で 0 値のメンバーを定義する場合は、その名前を ""None"" にして、列挙型に値が設定されていないことを示す必要があります。
ko: 다른 값 형식과 마찬가지로 초기화되지 않은 열거형의 기본값은 0입니다. 플래그가 없는 특성을 가진 열거형이 0 값을 사용하여 멤버를 정의하므로 기본값은 유효한 열거형 값입니다. FlagsAttribute 특성이 적용된 열거형이 0 값을 가진 멤버를 정의하는 경우 멤버 이름이 ""None""으로 명명되어 열거형에 값이 설정되지 않았음을 표시해야 합니다.
pl: Wartość domyślna niezainicjowanego wyliczenia to zero, tak samo jak w przypadku innych typów. Wyliczenie bez atrybutu FlagsAttribute powinno definiować element członkowski za pomocą wartości zero, tak aby wartość domyślna była prawidłową wartością wyliczenia. Jeśli wyliczenie z zastosowanym atrybutem FlagsAttribute definiuje element członkowski o wartości zero, powinien on mieć nazwę „None”, co wskazuje, że w wyliczeniu nie ustawiono żadnych wartości.
pt_br: O valor padrão de uma enumeração não inicializada, assim como outros tipos de valor, é zero. Uma enumeração atribuída a nonflags deve definir um membro usando o valor de zero para que o valor padrão seja um valor válido da enumeração. Se uma enumeração que tem o atributo FlagsAttribute aplicado definir um membro com valor zero, seu nome deverá ser ""None"" para indicar que nenhum valor foi definido na enumeração.
ru: Значение по умолчанию для неинициализированного перечисления, как и другие типы значений, равно нулю. Перечисление без атрибута Flags должно определять член с использованием нулевого значения, чтобы значение по умолчанию было допустимым значение перечисления. Если перечисление с примененным атрибутом FlagsAttribute определяет нулевой член, его имя должно быть равно "None", указывая, что в этом перечислении нет заданных значений.
tr: Başlatılmamış bir sabit listesinin varsayılan değeri, diğer değer türleri gibi sıfır olmalıdır. Bir nonflags-attributed sabit listesi, sabit listesinin varsayılan değerinin geçerli bir değer olması için sıfır değerini kullanarak bir üye tanımlamalıdır. FlagsAttribute özniteliği uygulanmış bir sabit listesi sıfır değerli bir üye tanımlarsa, sabit listesinde değer ayarlanmadığını göstermek için adı ""None"" olmalıdır.
zh_hans: 与其他值类型一样，未初始化的枚举的默认值为零。无标记、带属性的枚举应使用零值来定义成员，使默认值为枚举的有效值。如果应用 FlagsAttribute 属性的枚举定义了一个零值成员，该枚举的名称应为 "None"，指示尚未在枚举中设置任何值。
zh_hant: 如同其他實值型別一般，未初始化的列舉之預設值為零。非旗標屬性的列舉應以使用零值的方法來定義成員，讓預設值成為列舉的有效值。若已套用 FlagsAttribute 屬性的列舉定義了零值成員，則其名稱應為 "None"，以表示列舉中未設定任何值。

# EnumsShouldHaveZeroValueMessageFlagsRename
source: In enum {0}, change the name of {1} to 'None'
cs: Ve výčtu {0} změňte název pro {1} na None.
de: Ändern Sie in der Enumeration "{0}" den Namen von "{1}" in "None".
es: En la enumeración {0}, cambie el nombre de {1} a "None".
fr: Dans l'enum {0}, changez le nom de {1} en 'None'
it: Nell'enumerazione {0} modificare il nome di {1} in 'None'
ko: {0} 열거형에서 {1}의 이름을 'None'으로 변경하세요.
pl: W wyliczeniu {0} zmień nazwę elementu {1} na „None”
pt_br: Na enumeração {0}, altere o nome de {1} para 'None'
ru: В перечислении {0} измените имя {1} на "None".
tr: {0} sabit listesinde {1} öğesinin adını 'None' olarak değiştirin
zh_hans: 在枚举 {0} 中，将 {1} 的名称改为 "None"
zh_hant: 在列舉 {0} 中，將 {1} 的名稱變更為 'None'

# EnumsShouldHaveZeroValueMessageFlagsMultipleZeros
source: Remove all members that have the value zero from {0} except for one member that is named 'None'
cs: Odeberte z {0} všechny členy, které mají nulovou hodnotu, s výjimkou jednoho člena s názvem None.
de: Entfernen Sie alle Member mit dem Wert null aus "{0}", mit Ausnahme des einen Members mit dem Namen "None".
es: Quite todos los miembros que tienen valor cero de {0}, excepto uno denominado "None".
fr: Supprimez de {0} tous les membres ayant la valeur zéro, à l'exception d'un membre nommé 'None'
it: Rimuovere da {0} tutti i membri con valore zero ad eccezione dell'unico membro denominato 'None'
ko: {0}에서 'None'으로 명명된 하나의 멤버를 제외하고 0 값이 있는 모든 멤버를 제거하세요.
pl: Usuń wszystkie składowe o wartości zero z wyliczenia {0}, z wyjątkiem jednej składowej o nazwie „None”
pt_br: Remova todos os membros que têm valor zero de {0}, exceto o membro chamado 'None'
ru: Удалите из {0} все члены с нулевым значением, за исключением одного, с именем "None".
tr: {0} öğesinden 'None' olarak adlandırılmış tek üye dışındaki sıfır değerine sahip tüm üyeleri kaldırın
zh_hans: 从 {0} 中删除所有值为零的成员(名为 "None" 的成员除外)
zh_hant: 從 {0} 中移除值為零的所有成員，但名為 'None' 的成員除外
