Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IdentifiersShouldNotMatchKeywordsMessageMemberParameter
source: In virtual/interface member {0}, rename parameter {1} so that it no longer conflicts with the reserved language keyword '{2}'. Using a reserved keyword as the name of a parameter on a virtual/interface member makes it harder for consumers in other languages to override/implement the member.
cs: Přejmenujte parametr {1} ve virtuálním členovi nebo členovi rozhraní {0} tak, aby už nebyl v konfliktu s rezervovaným klíčovým slovem {2} jazyka. Použití rezervovaného klíčového slova jako názvu parametru u virtuálního člena nebo člena rozhraní znesnadňuje konzumentům v jiných jazycích přepis nebo implementaci tohoto člena.
de: Benennen Sie im virtuellen/Schnittstellenmember "{0}" den Parameter "{1}" so um, dass er keinen Konflikt mit dem reservierten Sprachschlüsselwort "{2}" mehr verursacht. Durch die Verwendung eines reservierten Schlüsselworts als Name eines Parameters für einen virtuellen/Schnittstellenmember ist es für Endverbraucher in anderen Sprachen schwieriger, den Member außer Kraft zu setzen bzw. zu implementieren.
es: En el miembro virtual o de interfaz {0}, cambie el nombre del parámetro {1} para que deje de estar en conflicto con la palabra clave reservada del lenguaje “{2}”. El uso de una palabra clave reservada como nombre de un parámetro en un miembro virtual o de interfaz dificulta que consumidores de otros lenguajes invaliden o implementen el miembro.
fr: Dans le membre virtuel/membre d'interface {0}, renommez le paramètre {1} pour qu'il ne soit plus en conflit avec le mot clé de langage réservé '{2}'. L'utilisation d'un mot clé réservé comme nom de paramètre pour un membre virtuel/membre d'interface rend plus difficile le remplacement/l'implémentation du membre par les contrôles serveur consommateurs dans d'autres langages.
it: Nel membro di interfaccia/virtuale {0}, rinominare il parametro {1} in modo che non sia più in conflitto con la parola chiave del linguaggio riservata '{2}'. L'uso di una parola chiave riservata come nome di un parametro di un membro di interfaccia/virtuale può causare complicazioni quando consumer in altri linguaggi eseguono l'override o l'implementazione del membro.
ja: 仮想メンバーまたはインターフェイス メンバー {0} のパラメーター {1} の名前を変更して、予約されている言語キーワード '{2}' と競合しないようにしてください。仮想メンバーまたはインターフェイス メンバーのパラメーター名として、予約されているキーワードを使用すると、他の言語を使用するユーザーがそのメンバーをオーバーライドまたは実装することが困難になります。
ko: 가상/인터페이스 멤버 {0}에서 예약된 언어 키워드 '{2}'과(와) 더 이상 충돌하지 않도록 매개 변수 {1}의 이름을 바꾸세요. 가상/인터페이스 멤버에서 예약된 키워드를 매개 변수의 이름으로 사용하면 다른 언어 소비자가 해당 멤버를 재정의/구현하기 어렵습니다.
pl: W elemencie członkowskim interfejsu lub wirtualnym elemencie członkowskim {0} zmień nazwę parametru {1} tak, aby nie powodowała konfliktu z zastrzeżonym słowem kluczowym języka „{2}”. Użycie zastrzeżonego słowa kluczowego jako nazwy parametru w elemencie członkowskim interfejsu lub wirtualnym elemencie członkowskim utrudnia klientom w innych językach przesłonięcie/zaimplementowanie tego elementu członkowskiego.
pt_br: No membro virtual/de interface {0}, renomeie o parâmetro {1} de forma que ele não fique mais em conflito com a palavra-chave reservada de linguagem '{2}'. Se você usar uma palavra-chave reservada como o nome de um parâmetro em um membro virtual/de interface, ficará mais difícil para os consumidores de outras linguagens substituírem/implementarem o membro.
ru: В виртуальном члене или в члене интерфейса {0} переименуйте параметр {1} так, чтобы он больше не находился в конфликте с зарезервированным ключевым словом языка "{2}". Использование зарезервированного ключевого слова в качестве имени параметра виртуального члена или члена интерфейса затрудняет переопределение или реализацию члена для потребителей в других языках.
tr: {0} sanal/arabirim üyesinde, {1} parametresini ayrılmış dil anahtar sözcüğü '{2}' ile çakışmayacak şekilde yeniden adlandırın. Bir sanal/arabirim üyesindeki bir parametrenin adı olarak ayrılmış bir anahtar sözcüğün kullanılması, diğer dillerde kullanıcıların üyeyi geçersiz kılmasını/uygulamasını zorlaştırır.
zh_hans: 在虚拟/接口成员 {0} 中，重命名参数 {1}，使它不再与保留的语言关键字“{2}”冲突。如果使用保留的关键字作为虚拟/接口成员上参数的名称，则会使其他语言的使用者很难重写/实现该成员。
zh_hant: 在虛擬/介面成員 {0} 中，重新命名參數 {1}，使其不再與保留的語言關鍵字 '{2}' 相衝突。將保留關鍵字用作為虛擬/介面成員上參數的名稱，會讓其他語言的消費者難以覆寫/實作該成員。

# IdentifiersShouldNotMatchKeywordsMessageMember
source: Rename virtual/interface member {0} so that it no longer conflicts with the reserved language keyword '{1}'. Using a reserved keyword as the name of a virtual/interface member makes it harder for consumers in other languages to override/implement the member.
cs: Přejmenujte virtuálního člena nebo člena rozhraní {0} tak, aby už nebyl v konfliktu s rezervovaným klíčovým slovem {1} jazyka. Použití rezervovaného klíčového slova jako názvu virtuálního člena nebo člena rozhraní znesnadňuje konzumentům v jiných jazycích přepis nebo implementaci tohoto člena.
de: Benennen Sie den virtuellen/Schnittstellenmember "{0}" so um, dass er keinen Konflikt mit dem reservierten Sprachschlüsselwort "{1}" mehr verursacht. Durch die Verwendung eines reservierten Schlüsselworts als Name eines virtuellen/Schnittstellenmembers ist es für Endverbraucher in anderen Sprachen schwieriger, den Member außer Kraft zu setzen bzw. zu implementieren.
es: Cambie el nombre del miembro virtual o de interfaz {0} para que deje de estar en conflicto con la palabra clave reservada del lenguaje “{1}”. El uso de una palabra clave reservada como nombre de un miembro virtual o de interfaz dificulta que usuarios de otros lenguajes invaliden o implementen el miembro.
fr: Renommez le membre virtuel/membre d'interface {0} pour qu'il ne soit plus en conflit avec le mot clé de langage réservé '{1}'. L'utilisation d'un mot clé réservé comme nom de membre virtuel/membre d'interface rend plus difficile le remplacement/l'implémentation du membre par les contrôles serveur consommateurs dans d'autres langages.
it: Rinominare il membro di interfaccia/virtuale {0} in modo che non sia più in conflitto con la parola chiave del linguaggio riservata '{1}'. L'uso di una parola chiave riservata come nome di un membro di interfaccia/virtuale può causare complicazioni quando consumer in altri linguaggi eseguono l'override o l'implementazione del membro.
ja: 仮想メンバーまたはインターフェイス メンバー {0} の名前を変更して、予約されている言語キーワード '{1}' と競合しないようにしてください。仮想メンバーまたはインターフェイス メンバーの名前として、予約されているキーワードを使用すると、他の言語を使用するユーザーがそのメンバーをオーバーライドまたは実装することが困難になります。
ko: 예약된 언어 키워드 '{1}'과(와) 더 이상 충돌하지 않도록 가상/인터페이스 멤버 {0}의 이름을 바꾸세요. 예약된 키워드를 가상/인터페이스 멤버의 이름으로 사용하면 다른 언어 소비자가 해당 멤버를 재정의/구현하기 어렵습니다.
pl: Zmień nazwę elementu członkowskiego interfejsu lub wirtualnego elementu członkowskiego {0} tak, aby nie powodowała konfliktu z zastrzeżonym słowem kluczowym języka „{1}”. Użycie zastrzeżonego słowa kluczowego jako nazwy elementu członkowskiego interfejsu lub wirtualnego elementu członkowskiego utrudnia klientom w innych językach przesłonięcie/zaimplementowanie tego elementu członkowskiego.
pt_br: Renomeie o membro virtual/de interface {0} de forma que ele não fique mais em conflito com a palavra-chave reservada de linguagem '{1}'. Se você usar uma palavra-chave reservada como o nome de um membro virtual/de interface, ficará mais difícil para os consumidores de outras linguagens substituírem/implementarem o membro.
ru: Переименуйте виртуальный член или член интерфейса {0}, чтобы он больше не находился в конфликте с зарезервированным ключевым словом языка "{1}". Использование зарезервированного ключевого слова в качестве имени виртуального члена или члена интерфейса затрудняет переопределение или реализацию члена для потребителей в других языках.
tr: {0} sanal/arabirim üyesini, ayrılmış dil anahtar sözcüğü '{1}' ile çakışmayacak şekilde yeniden adlandırın. Bir sanal/arabirim üyesinin adı olarak ayrılmış bir anahtar sözcüğün kullanılması, diğer dillerde kullanıcıların üyeyi geçersiz kılmasını/uygulamasını zorlaştırır.
zh_hans: 重命名虚拟/接口成员 {0}，使它不再与保留的语言关键字“{1}”冲突。如果使用保留的关键字作为虚拟/接口成员的名称，则会使其他语言的使用者很难重写/实现该成员。
zh_hant: 重新命名虛擬/介面成員 {0}，使其不再與保留的語言關鍵字 '{1}' 相衝突。將保留關鍵字用作為虛擬/介面成員的名稱，會讓其他語言的消費者難以覆寫/實作該成員。

# IdentifiersShouldNotMatchKeywordsMessageType
source: Rename type {0} so that it no longer conflicts with the reserved language keyword '{1}'. Using a reserved keyword as the name of a type makes it harder for consumers in other languages to use the type.
cs: Přejmenujte typ {0} tak, aby už nebyl v konfliktu s rezervovaným klíčovým slovem {1} jazyka. Použití rezervovaného klíčového slova jako názvu typu znesnadňuje konzumentům v jiných jazycích použití tohoto typu.
de: Benennen Sie den Typ "{0}" so um, dass er keinen Konflikt mit dem reservierten Sprachschlüsselwort "{1}" mehr verursacht. Durch die Verwendung eines reservierten Schlüsselworts als Name eines Typs ist es für Endverbraucher in anderen Sprachen schwieriger, den Typ zu verwenden.
es: Cambie el nombre del tipo {0} para que deje de estar en conflicto con la palabra clave reservada del lenguaje “{1}”. El uso de una palabra clave reservada como nombre de un tipo dificulta que los consumidores de otros lenguajes usen el tipo.
fr: Renommez le type {0} pour qu'il ne soit plus en conflit avec le mot clé de langage réservé '{1}'. L'utilisation d'un mot clé réservé comme nom de type rend plus difficile l'utilisation du type par les contrôles serveur consommateurs dans d'autres langages.
it: Rinominare il tipo {0} in modo che non sia più in conflitto con la parola chiave del linguaggio riservata '{1}'. L'uso di una parola chiave riservata come nome di un tipo può causare complicazioni quando consumer in altri linguaggi usano il tipo.
ja: 型 {0} の名前を変更して、予約されている言語キーワード '{1}' と競合しないようにしてください。型の名前として、予約されているキーワードを使用すると、他の言語を使用するユーザーがその型を使用することが困難になります。
ko: 예약된 언어 키워드 '{1}'과(와) 더 이상 충돌하지 않도록 형식{0}의 이름을 바꾸세요. 예약된 키워드를 형식의 이름으로 사용하면 다른 언어 소비자가 형식을 사용하기 어렵습니다.
pl: Zmień nazwę typu {0} tak, aby nie powodowała konfliktu z zastrzeżonym słowem kluczowym języka „{1}”. Użycie zastrzeżonego słowa kluczowego jako nazwy typu utrudnia klientom użycie tego typu w innych językach.
pt_br: Renomeie o tipo {0} de forma que ele não fique mais em conflito com a palavra-chave reservada de linguagem '{1}'. Se você usar uma palavra-chave reservada como o nome de um tipo, ficará mais difícil para os consumidores de outras linguagens utilizarem o tipo.
ru: Переименуйте тип {0}, чтобы он больше не находился в конфликте с зарезервированным ключевым словом языка "{1}". Использование зарезервированного ключевого слова в качестве имени типа затрудняет использование этого типа потребителями в других языках.
tr: {0} türünü, ayrılmış dil anahtar sözcüğü '{1}' ile çakışmayacak şekilde yeniden adlandırın. Bir türün adı olarak ayrılmış bir anahtar sözcüğün kullanılması, diğer dillerde kullanıcıların türü kullanmasını zorlaştırır.
zh_hans: 重命名类型 {0}，使它不再与保留的语言关键字“{1}”冲突。如果使用保留的关键字作为类型的名称，则会使其他语言的使用者很难使用该类型。
zh_hant: 重新命名類型 {0}，使其不再與保留的語言關鍵字 '{1}' 相衝突。將保留關鍵字用作為類型的名稱，會讓其他語言的消費者難以使用該類型。

# IdentifiersShouldNotMatchKeywordsMessageNamespace
source: Rename namespace {0} so that it no longer conflicts with the reserved language keyword '{1}'. Using a reserved keyword as the name of a namespace makes it harder for consumers in other languages to use the namespace.
cs: Přejmenujte názvový prostor {0} tak, aby už nebyl v konfliktu s rezervovaným klíčovým slovem {1} jazyka. Použití rezervovaného klíčového slova jako názvu názvového prostoru znesnadňuje konzumentům v jiných jazycích použití tohoto názvového prostoru.
de: Benennen Sie den Namespace "{0}" so um, dass er keinen Konflikt mit dem reservierten Sprachschlüsselwort "{1}" mehr verursacht. Durch die Verwendung eines reservierten Schlüsselworts als Name eines Namespace ist es für Endverbraucher in anderen Sprachen schwieriger, den Namespace zu verwenden.
es: Cambie el nombre del espacio de nombres {0} para que deje de estar en conflicto con la palabra clave reservada del lenguaje “{1}”. El uso de una palabra clave reservada como nombre de un espacio de nombres dificulta que los consumidores de otros lenguajes usen el espacio de nombres.
fr: Renommez l'espace de noms {0} pour qu'il ne soit plus en conflit avec le mot clé de langage réservé '{1}'. L'utilisation d'un mot clé réservé comme nom d'espace de noms rend plus difficile l'utilisation de l'espace de noms par les contrôles serveur consommateurs dans d'autres langages.
it: Rinominare lo spazio dei nomi {0} in modo che non sia più in conflitto con la parola chiave del linguaggio riservata '{1}'. L'uso di una parola chiave riservata come nome di uno spazio dei nomi può causare complicazioni quando consumer in altri linguaggi usano lo spazio dei nomi.
ja: 名前空間 {0} の名前を変更して、予約されている言語キーワード '{1}' と競合しないようにしてください。名前空間の名前として、予約されているキーワードを使用すると、他の言語を使用するユーザーがその名前空間を使用することが困難になります。
ko: 예약된 언어 키워드 '{1}'과(와) 더 이상 충돌하지 않으려면 네임스페이스 {0}의 이름을 바꾸세요. 예약된 키워드를 네임스페이스의 이름으로 사용하면 다른 언어 소비자가 네임스페이스를 사용하기 어렵습니다.
pl: Zmień nazwę przestrzeni nazw {0} tak, aby nie powodowała konfliktu z zastrzeżonym słowem kluczowym języka „{1}”. Użycie zastrzeżonego słowa kluczowego jako nazwy przestrzeni nazw utrudnia klientom użycie tej przestrzeni nazw w innych językach.
pt_br: Renomeie o namespace {0} de forma que ele não fique mais em conflito com a palavra-chave reservada de linguagem '{1}'. Se você usar uma palavra-chave reservada como o nome de um namespace, ficará mais difícil para os consumidores de outras linguagens utilizarem o namespace.
ru: Переименуйте пространство имен {0}, чтобы оно больше не находилось в конфликте с зарезервированным ключевым словом языка "{1}". Использование зарезервированного ключевого слова в качестве имени пространства имен затрудняет использование этого пространства имен потребителями в других языках.
tr: {0} ad alanını, ayrılmış dil anahtar sözcüğü '{1}' ile çakışmayacak şekilde yeniden adlandırın. Bir ad alanının adı olarak ayrılmış bir anahtar sözcüğün kullanılması, diğer dillerde kullanıcıların ad alanını kullanmasını zorlaştırır.
zh_hans: 重命名命名空间 {0}，使它不再与保留的语言关键字“{1}”冲突。如果使用保留的关键字作为命名空间的名称，则会使其他语言的使用者很难使用该命名空间。
zh_hant: 重新命名命名空間 {0} ，使其不再與保留的語言關鍵字 '{1}' 相衝突。將保留關鍵字用作為命名空間的名稱，會讓其他語言的消費者難以使用該命名空間。

# PropertyNamesShouldNotMatchGetMethodsTitle
source: Property names should not match get methods
cs: Názvy vlastností se nemají shodovat s metodami Get.
de: Eigenschaftennamen dürfen nicht mit Get-Methoden übereinstimmen
es: Los nombres de propiedades no deben coincidir con los métodos get
fr: Les noms de propriétés ne doivent pas correspondre à ceux des méthodes get
it: I nomi delle proprietà non devono corrispondere a metodi get
ja: プロパティ名は get メソッドと同一にすることはできません
ko: 속성 이름은 get 메서드와 달라야 합니다.
pl: Nazwy właściwości nie powinny być takie same jak nazwy metod pobierających
pt_br: Nomes de propriedades não devem corresponder a métodos get
ru: Имена свойств не должны совпадать с именами методов get
tr: Özellik adları get yöntemleri ile eşleşmemelidir
zh_hans: 属性名不应与 get 方法匹配
zh_hant: 屬性名稱不應與 get 方法相符

# PropertyNamesShouldNotMatchGetMethodsDescription
source: The name of a public or protected member starts with ""Get"" and otherwise matches the name of a public or protected property. ""Get"" methods and properties should have names that clearly distinguish their function.
cs: Název veřejného nebo chráněného člena začíná na Get a také jinak se shoduje s názvem veřejné nebo chráněné vlastnosti. Metody a vlastnosti Get by měly mít název, který jasně rozlišuje jejich funkci.
de: Der Name eines öffentlichen oder geschützten Members beginnt mit ""Get"" und entspricht ansonsten dem Namen einer öffentlichen oder geschützten Eigenschaft. Get-Methoden und -Eigenschaften müssen Namen aufweisen, die ihre Funktionen klar unterscheiden.
es: El nombre de un miembro público o protegido comienza con "Get" y en cualquier otro caso coincide con el nombre de una propiedad pública o protegida. Las propiedades y métodos “Get” deben tener nombres que distingan claramente su función.
fr: Le nom d'un membre public ou protégé commence par ""Get"". Sinon, il correspond au nom d'une propriété publique ou protégée. Les méthodes et propriétés ""Get"" doivent porter des noms qui distinguent clairement leur fonction.
it: Il nome di un membro public o protected inizia con ""Get"" o diversamente corrisponde al nome di una proprietà public o protected. Ai metodi e alle proprietà ""Get"" devono essere assegnati nomi che consentano di distinguere chiaramente la loro funzione.
ja: パブリック メンバーまたは保護されたメンバーの名前が、""Get"" から始まっているか、パブリック プロパティまたは保護されたプロパティの名前と一致します。""Get"" メソッドおよびプロパティには、その機能を明確に区別する名前が必要です。
ko: Public 또는 protected 멤버의 이름이 ""Get""으로 시작하고 나머지 부분이 public 또는 protected 속성의 이름과 일치합니다. ""Get"" 메서드 및 속성은 기능과 완전히 다른 이름을 사용해야 합니다.
pl: Nazwa publicznego lub chronionego elementu członkowskiego zaczyna się od „Get” i jest taka sama jak nazwa właściwości publicznej lub chronionej. Metody i właściwości „Get” powinny mieć nazwy jasno określające ich funkcję.
pt_br: O nome de um membro público ou protegido começa com ""Get"" e, caso contrário, corresponde ao nome de uma propriedade pública ou protegida. Métodos e propriedades ""Get"" devem ter nomes que distinguem claramente sua função.
ru: Имя общего или защищенного члена начинается с "Get" и по остальным признакам соответствует имени общего или защищенного свойства. Свойства и методы "Get" должны иметь имена, явно различающие их функции.
tr: Genel veya korumalı bir üyenin adı ""Get"" ile başlar ve diğer durumlarda genel veya korumalı bir özelliğin adıyla eşleşir. ""Get"" yöntemleri ve özellikleri, işlevlerini açıkça ayırt eden adlara sahip olmalıdır.
zh_hans: 公共或受保护成员的名称以 "Get" 开头，否则与公共或受保护属性的名称相匹配。"Get" 方法和属性应具有明确区分其功能的名称。
zh_hant: 公用或受保護成員的名稱以 ""Get"" 開頭，否則需與公用或受保護屬性的名稱相符。""Get"" 方法與屬性的名稱，皆應該清楚區別其功能。

# PropertyNamesShouldNotMatchGetMethodsMessage
source: The property name '{0}' is confusing given the existence of method '{1}'. Rename or remove one of these members.
cs: Název vlastnosti {0} je matoucí vzhledem k existenci metody {1}. Přejmenujte nebo odeberte jednoho z těchto členů.
de: Der Eigenschaftenname "{0}" kann aufgrund der vorhandenen Methode "{1}" zu Verwirrungen führen. Benennen Sie einen dieser Member um, oder entfernen Sie ihn.
es: El nombre de la propiedad “{0}” es confuso debido a la existencia del método “{1}”. Cambie el nombre o quite uno de estos miembros.
fr: Le nom de propriété '{0}' est source de confusion étant donné l'existence de la méthode '{1}'. Renommez ou supprimez l'un de ces membres.
it: Il nome proprietà '{0}' si confonde con il metodo '{1}'. Rinominare o rimuovere uno di questi membri.
ja: メソッド '{1}' の存在が指定されているため、プロパティ名 '{0}' は混乱を招きます。これらのメンバーの 1 つの名前を変更するか、削除してください。
ko: '{1}' 메서드가 있으므로 속성 이름 '{0}'이(가) 혼동됩니다. 이 멤버 중 하나의 이름을 바꾸거나 멤버를 제거하세요.
pl: Nazwa właściwości „{0}” jest myląca ze względu na istnienie metody „{1}”. Zmień nazwę jednego z tych elementów członkowskich lub usuń go.
pt_br: O nome de propriedade {0} é confuso considerando a existência do método '{1}'. Renomeie ou remova um desses membros.
ru: Ошибочное имя свойства "{0}", уже существует метод "{1}". Переименуйте или удалите один из этих членов.
tr: '{1}' yönteminin varlığı nedeniyle '{0}' özellik adı kafa karıştırıcı. Bu üyelerden birini adlandırın veya kaldırın.
zh_hans: 由于存在方法“{1}”，属性名“{0}”会造成混淆。请重命名或删除这二者之一。
zh_hant: 若存在有方法 '{1}'，屬性名稱 '{0}' 易使人混淆。重新命名或移除其中一個成員。

# TypeNamesShouldNotMatchNamespacesTitle
source: Type names should not match namespaces
cs: Názvy typů se nemají shodovat s názvovými prostory.
de: Typnamen dürfen nicht mit Namespaces übereinstimmen
es: Los nombres de tipo no deben coincidir con los espacios de nombres
fr: Les noms de types ne doivent pas correspondre à des espaces de noms
it: I nomi di tipo non devono corrispondere a spazi dei nomi
ja: 型名は名前空間と同一にすることはできません
ko: 형식 이름은 네임스페이스와 달라야 합니다.
pl: Nazwy typów nie powinny być takie same jak przestrzenie nazw
pt_br: Nomes de tipo não devem corresponder a namespaces
ru: Имена типов не должны совпадать с именами пространств имен
tr: Tür adları ad alanlarıyla eşleşmemelidir.
zh_hans: 类型名不应与命名空间匹配
zh_hant: 類型名稱不應與命名空間相符

# TypeNamesShouldNotMatchNamespacesDescription
source: Type names should not match the names of namespaces that are defined in the .NET Framework class library. Violating this rule can reduce the usability of the library.
cs: Názvy typů by se neměly shodovat s názvy názvových prostorů, které jsou definované v knihovně tříd rozhraní .NET Framework. Porušení tohoto pravidla může omezit použitelnost knihovny.
de: Typnamen dürfen nicht mit den Namen von Namespaces übereinstimmen, die in der .NET Framework-Klassenbibliothek definiert sind. Durch die Verletzung dieser Regel kann sich die Nutzbarkeit der Bibliothek verringern.
es: Los nombres de tipo no deben coincidir con los nombres de espacios de nombres definidos en la biblioteca de clases .NET Framework. Infringir esta regla puede reducir la utilidad de la biblioteca.
fr: Les noms de types ne doivent pas correspondre aux noms d'espaces de noms définis dans la bibliothèque de classes .NET Framework. Enfreindre cette règle peut réduire la facilité d'utilisation de la bibliothèque.
it: I nomi di tipo non devono corrispondere ai nomi di spazi dei nomi definiti nella libreria di classi .NET Framework. La violazione di questa regola può ridurre l'usabilità della libreria.
ja: 型名は、.NET Framework クラス ライブラリで定義されている名前空間の名前と一致しないようにする必要があります。この規則に違反すると、ライブラリが使いにくくなります。
ko: 형식 이름은 .NET Framework 클래스 라이브러리에서 정의된 네임스페이스의 이름과 달라야 합니다. 이 규칙을 위반하면 라이브러리의 유용성이 감소할 수 있습니다.
pl: Nazwy typów nie powinny być takie same jak nazwy przestrzeni nazw zdefiniowane w bibliotece klas programu .NET Framework. Naruszenie tej reguły może zmniejszyć użyteczność biblioteki.
pt_br: Nomes de tipo não devem corresponder aos nomes de namespaces definidos na biblioteca de classes .NET Framework. Violar essa regra pode reduzir a usabilidade da biblioteca.
ru: Имена типов не должны совпадать с именами пространств имен, определенными в библиотеке классов .NET Framework. Нарушение этого правила ограничит возможности по использованию библиотеки.
tr: Tür adları, .NET Framework sınıf kitaplığında tanımlanan ad alanlarının adlarıyla eşleşmemelidir. Bu kuralın ihlal edilmesi, kitaplığın kullanılabilirliğini azaltabilir.
zh_hans: 类型名不应与在 .NET Framework 类库中定义的命名空间名称相匹配。违背此规则会降低库的可用性。
zh_hant: 類型名稱不與 .NET Framework Class Library 中定義的命名空間名稱相符。違反此規則可能會降低程式庫的可用性。
