Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IdentifiersShouldNotContainUnderscoresMessageMethodTypeParameter
source: On method {0}, remove the underscores from generic type parameter name {1}
cs: U metody {0} odeberte podtržítka z názvu parametru obecného typu {1}.
de: Entfernen Sie in der Methode "{0}" die Unterstriche aus dem Namen des generischen Typparameters ({1}).
es: En el método {0}, quite los caracteres de subrayado del nombre de parámetro de tipo genérico {1}.
fr: Dans la méthode {0}, supprimez les traits de soulignement du nom de paramètre de type générique {1}
it: Nel metodo {0} rimuovere i caratteri di sottolineatura dal nome di parametro di tipo generico {1}
ko: {0} 메서드의 제네릭 형식 매개 변수 이름 {1}에서 밑줄을 제거하세요.
pl: W metodzie {0} usuń znaki podkreślenia z nazwy parametru typu ogólnego {1}
pt_br: No método {0}, remova os sublinhados do nome de parâmetro de tipo genérico {1}
ru: В методе {0} удалите символы подчеркивания из имени параметра универсального типа {1}.
tr: {0} metodunda, {1} genel tür parametre adından alt çizgileri kaldırın
zh_hans: 在方法 {0} 上，从泛型类型参数名称 {1} 中删除下划线
zh_hant: 在方法 {0} 上，移除泛型型別參數名稱 {1} 中的底線

# IdentifiersShouldNotContainUnderscoresMessageMemberParameter
source: In member {0}, remove the underscores from parameter name {1}
cs: U člena {0} odeberte podtržítka z názvu parametru {1}.
de: Entfernen Sie im Member "{0}" die Unterstriche aus dem Parameternamen "{1}".
es: En el miembro {0}, quite los caracteres de subrayado del nombre de parámetro {1}.
fr: Dans le membre {0}, supprimez les traits de soulignement du nom de paramètre {1}
it: Nel membro {0} rimuovere i caratteri di sottolineatura dal nome di parametro {1}
ko: {0} 멤버의 매개 변수 이름 {1}에서 밑줄을 제거하세요.
pl: W składowej {0} usuń znaki podkreślenia z nazwy parametru {1}
pt_br: No membro {0}, remova os sublinhados do nome de parâmetro {1}
ru: В члене {0} удалите символы подчеркивания из имени параметра {1}.
tr: {0} üyesinde, {1} parametre adından alt çizgileri kaldırın
zh_hans: 在成员 {0} 中，从参数名称 {1} 中删除下划线
zh_hant: 在成員 {0} 中，移除參數名稱 {1} 中的底線

# IdentifiersShouldNotContainUnderscoresMessageDelegateParameter
source: In delegate {0}, remove the underscores from parameter name {1}
cs: V delegátovi {0} odeberte podtržítka z názvu parametru {1}.
de: Entfernen Sie im Delegaten "{0}" die Unterstriche aus dem Parameternamen "{1}".
es: En el delegado {0}, quite los caracteres de subrayado del nombre de parámetro {1}.
fr: Dans le délégué {0}, supprimez les traits de soulignement du nom de paramètre {1}
it: Nel delegato {0} rimuovere i caratteri di sottolineatura dal nome di parametro {1}
ko: {0} 대리자의 매개 변수 이름 {1}에서 밑줄을 제거하세요.
pl: W delegacie {0} usuń znaki podkreślenia z nazwy parametru {1}
pt_br: No delegado {0}, remova os sublinhados do nome de parâmetro {1}
ru: В делегате {0} удалите символы подчеркивания из имени параметра {1}.
tr: {0} temsilcisinde, {1} parametre adından alt çizgileri kaldırın
zh_hans: 在委托 {0} 中，从参数名称 {1} 中删除下划线
zh_hant: 在委派 {0} 中，移除參數名稱 {1} 中的底線

# IdentifiersShouldHaveCorrectSuffixTitle
source: Identifiers should have correct suffix
cs: Identifikátory mají mít správnou příponu.
de: Bezeichner müssen ein korrektes Suffix aufweisen
es: Los identificadores deben tener un sufijo correcto
fr: Les identificateurs doivent avoir un suffixe correct
it: Gli identificatori devono includere il suffisso corretto
ja: 識別子は、正しいサフィックスを含んでいなければなりません
ko: 식별자에는 올바른 접미사를 사용해야 합니다.
pl: Identyfikatory powinny mieć poprawny sufiks
pt_br: Os identificadores devem ter o sufixo correto
ru: Идентификаторы должны иметь правильные суффиксы
tr: Tanımlayıcılar doğru son eke sahip olmalıdır
zh_hans: 标识符应具有正确的后缀
zh_hant: 識別項應使用正確的尾碼

# IdentifiersShouldHaveCorrectSuffixDescription
source: By convention, the names of types that extend certain base types or that implement certain interfaces, or types that are derived from these types, have a suffix that is associated with the base type or interface.
cs: Názvy typů, které rozšiřují určité základní typy nebo implementují určitá rozhraní, nebo typy, které jsou od těchto typů odvozené, mají mít podle dohody příponu, která je přidružená k tomuto základnímu typu nebo rozhraní.
de: Gemäß Konvention besitzen die Namen von Typen, die bestimmte Basistypen erweitern oder bestimmte Schnittstellen implementieren, bzw. Typen, die von solchen Typen abgeleitet werden, ein Suffix, das dem Basistyp oder der Schnittstelle zugeordnet ist.
es: Por convención, los nombres de tipos que extienden determinados tipos base o que implementan ciertas interfaces, así como los tipos derivados de estos tipos, tienen un sufijo asociado a la interfaz o tipo base.
fr: Par convention, les noms des types qui étendent certains types de base ou qui implémentent certaines interfaces, ou les types dérivés de ces types, ont un suffixe associé au type de base ou à l'interface.
it: Per convenzione, i nomi di tipi che estendono determinati tipi di base o implementano determinate interfacce o di tipi derivati da questi tipi includono un suffisso associato all'interfaccia o al tipo di base.
ja: 規則によると、特定の基本型を拡張する型、特定のインターフェイスを実装する型、またはそのような型から派生した型の名前には、基本型またはインターフェイスに関連付けられているサフィックスが付きます。
ko: 규칙에 따라 특정 기본 형식을 확장하거나 특정 인터페이스를 구현하는 형식 또는 이러한 형식에서 파생된 형식의 이름은 기본 형식 또는 인터페이스와 연결된 접미사를 사용합니다.
pl: Według konwencji nazwy typów rozszerzających pewne typy podstawowe, implementujące pewne interfejsy lub pochodzące od tych typów mają sufiks skojarzony z podstawowym typem lub interfejsem.
pt_br: Por convenção, os nomes dos tipos que estendem determinados tipos base ou que implementam determinadas interfaces, ou então os tipos derivados desses tipos, têm um sufixo associado a um tipo base ou interface.
ru: По соглашению имена типов, расширяющих определенные базовые типы или реализующих определенные интерфейсы, или производных от них типов имеют суффикс, связанный с базовым типом или интерфейсом.
tr: Kurallar gereği, belirli temel türleri genişleten veya belirli arabirimleri uygulayan türlerin ya da bu türlerden türetilen türlerin adları, temel tür veya arabirimle ilişkili bir son eke sahip olur.
zh_hans: 按照惯例，扩展某些基类型或实现某些接口的类型，或者派生自这些类型的类型，其名称都具有一个与基类型或接口相关的后缀。
zh_hant: 依照慣例，擴充特定基底類型或實作特定介面的類型名稱，或是從這些類型衍生的類型，其尾碼才可與基底類型或介面相關聯。

# IdentifiersShouldHaveCorrectSuffixMessageDefault
source: Rename {0} to end in '{1}'
cs: Přejmenujte {0} tak, aby název končil na {1}.
de: Benennen Sie "{0}" so um, dass der Name auf "{1}" endet.
es: Cambie el nombre de {0} para que termine en "{1}".
fr: Renommez {0} pour qu'il finisse par '{1}'
it: Rinominare {0} in modo che termini con '{1}'
ko: {0}이(가) '{1}'(으)로 끝나도록 이름을 바꾸세요.
pl: Zmień nazwę elementu {0} tak, aby kończyła się sufiksem „{1}”
pt_br: Renomeie {0} para terminar em '{1}'
ru: Переименуйте {0}, чтобы в конце стояло "{1}".
tr: {0} öğesini '{1}' ile bitecek şekilde yeniden adlandırın
zh_hans: 重命名 {0}，使其以“{1}”结尾
zh_hant: 重新命名 {0}，使其以 '{1}' 結尾

# IdentifiersShouldNotHaveIncorrectSuffixTitle
source: Identifiers should not have incorrect suffix
cs: Identifikátory nemají mít nesprávnou příponu.
de: Bezeichner dürfen kein falsches Suffix aufweisen
es: Los identificadores no deben tener un sufijo incorrecto
fr: Les identificateurs ne doivent pas avoir un suffixe incorrect
it: Gli identificatori non devono includere un suffisso errato
ja: 識別子は、不適切なサフィックスを含むことはできません
ko: 식별자에는 올바른 접미사를 사용해야 합니다.
pl: Identyfikatory nie powinny mieć niepoprawnego sufiksu
pt_br: Identificadores não devem ter um sufixo incorreto
ru: Идентификаторы не должны иметь неправильных суффиксов
tr: Tanımlayıcılar yanlış son ek içermemelidir
zh_hans: 标识符应采用正确的后缀
zh_hant: 識別項不應使用不正確的尾碼

# IdentifiersShouldNotHaveIncorrectSuffixDescription
source: By convention, only the names of types that extend certain base types or that implement certain interfaces, or types that are derived from these types, should end with specific reserved suffixes. Other type names should not use these reserved suffixes.
cs: Na určité rezervované přípony mají podle dohody končit jenom názvy typů, které rozšiřují určité základní typy nebo implementují určitá rozhraní, nebo typy, které jsou od těchto typů odvozené. Jiné typy by tyto rezervované přípony neměly používat.
de: Gemäß Konvention enden nur die Namen von Typen, die bestimmte Basistypen erweitern oder bestimmte Schnittstellen implementieren, bzw. die Namen von Typen, die von solchen Typen abgeleitet werden, auf ein spezifisches reserviertes Suffix. Andere Typnamen dürfen diese reservierten Suffixe nicht verwenden.
es: Por convención, solo los nombres de tipos que extienden determinados tipos base o que implementan ciertas interfaces, así como los tipos derivados de estos tipos, deben terminar con sufijos reservados específicos. Otros nombres de tipo no deben usar estos sufijos reservados.
fr: Par convention, seuls les noms des types qui étendent certains types de base ou qui implémentent certaines interfaces, ou les types dérivés de ces types, doivent finir par des suffixes réservés spécifiques. Les autres noms de types ne doivent pas utiliser ces suffixes réservés.
it: Per convenzione, solo i nomi di tipi che estendono determinati tipi di base o che implementano determinate interfacce o di tipi derivati da questi tipi devono terminare con suffissi riservati specifici. Gli altri nomi di tipo non devono usare questi suffissi riservati.
ja: 規則によると、特定の基本型を拡張する型、特定のインターフェイスを実装する型、またはそのような型から派生した型の名前のみ、末尾に特定の予約済みサフィックスが付きます。その他の型名では、これらの予約済みサフィックスを使用しないでください。
ko: 규칙에 따라 특정 기본 형식을 확장하거나 특정 인터페이스를 구현하는 형식 또는 이러한 형식에서 파생된 형식의 이름의 끝에만 예약된 특정 접미사를 사용할 수 있습니다. 다른 형식 이름에는 이러한 예약된 접미사를 사용할 수 없습니다.
pl: Według konwencji tylko nazwy typów rozszerzających pewne typy podstawowe, implementujące pewne interfejsy lub pochodzące od tych typów powinny kończyć się określonymi zastrzeżonymi sufiksami. Inne nazwy typów nie powinny używać tych zastrzeżonych sufiksów.
pt_br: Por convenção, somente os nomes de tipos que estendem determinados tipos base ou que implementam determinadas interfaces, ou então tipos derivados desses tipos, devem terminar com sufixos reservados específicos. Outros nomes de tipo não devem usar esses sufixos reservados.
ru: По соглашению только имена типов, расширяющих определенные базовые типы или реализующих определенные интерфейсы, или производных от них типов должны заканчиваться определенными зарезервированными суффиксами. Другие имена типов эти суффиксы содержать не должны.
tr: Kurallar gereği, yalnızca belirli temel türleri genişleten veya belirli arabirimleri uygulayan türlerin ya da bu türlerden türetilen türlerin adları belirli ayrılmış son eklerle bitmelidir. Diğer tür adları bu ayrılmış son ekleri kullanmamalıdır.
zh_hans: 按照惯例，只有扩展某些基类型或实现某些接口的类型，或者派生自这些类型的类型，其名称才应以保留的特定后缀结尾。其他类型名称不应使用这些保留的后缀。
zh_hant: 依照慣例，只有擴充特定基底類型或實作特定介面的類型名稱，或是從這些類型衍生的類型，才可用專屬的保留尾碼作為結尾。其他類型名稱不應使用這些保留尾碼。

# IdentifiersShouldNotHaveIncorrectSuffixMessageTypeNoAlternate
source: Rename type name {0} so that it does not end in '{1}'
cs: Přejmenujte název typu {0} tak, aby nekončil na {1}.
de: Benennen Sie den Typnamen "{0}" so um, dass er nicht auf "{1}" endet.
es: Cambie el nombre del tipo {0} para que no termine en "{1}".
fr: Renommez le nom de type {0} pour qu'il ne finisse pas par '{1}'
it: Rinominare il nome di tipo {0} in modo che non termini con '{1}'
ko: '{1}'(으)로 끝나지 않도록 형식 이름 {0}을(를) 바꾸세요.
pl: Zmień nazwę typu {0} tak, aby nie kończyła się sufiksem „{1}”
pt_br: Renomeie o nome de tipo {0} para que ele não termine em '{1}'
ru: Измените имя типа {0}, чтобы оно не заканчивалось на "{1}".
tr: {0} tür adını '{1}' ile bitmeyecek şekilde yeniden adlandırın
zh_hans: 重命名类型名称 {0}，使其不以“{1}”结尾
zh_hant: 重新命名型別名稱 {0}，使其結尾不是 '{1}'

# IdentifiersShouldNotHaveIncorrectSuffixMessageMemberNewerVersion
source: Either replace the suffix '{0}' in member name {1} with the suggested numeric alternate '2' or provide a more meaningful suffix that distinguishes it from the member it replaces
cs: Buď nahraďte příponu {0} v názvu člena {1} navrhovanou číselnou alternativou 2, nebo zadejte výstižnější příponu, která ho odliší od člena, kterého nahrazuje.
de: Ersetzen Sie entweder das Suffix "{0}" im Membernamen "{1}" durch die vorgeschlagene numerische Alternative "2", oder geben Sie ein aussagekräftigeres Suffix an, das den Namen von dem des ersetzten Members unterscheidet.
es: Reemplace el sufijo "{0}" en el nombre del miembro {1} por la alternativa numérica "2" sugerida o proporcione un sufijo más significativo que lo distinga del miembro al que reemplaza.
fr: Remplacez le suffixe '{0}' dans le nom de membre {1} par le substitut numérique suggéré '2', ou fournissez un suffixe plus significatif qui le distingue du membre qu'il remplace
it: Sostituire il suffisso '{0}' nel nome di membro {1} con l'alternativa numerica suggerita '2' o fornire un suffisso più significativo che lo distingua dal membro che sostituisce
ko: 멤버 이름 {1}의 '{0}' 접미사를 제안된 대체 숫자 '2'로 바꾸거나 대체될 멤버와 구별되는 더 의미 있는 접미사를 제공하세요.
pl: Zamień sufiks „{0}” w nazwie składowej {1} na zalecany alternatywny sufiks liczbowy „2” lub określ bardziej opisowy sufiks, który umożliwi odróżnienie go od zamienianej składowej
pt_br: Substitua o sufixo '{0}' no nome de membro {1} pela alternativa numérica sugerida '2' ou forneça um sufixo mais significativo que o distinga do membro que ele substitui
ru: Либо замените суффикс "{0}" в имени члена {1} предложенным числом "2", либо подберите более значимый суффикс, который отличит его от заменяемого члена.
tr: {1} üye adındaki '{0}' sonekini önerilen '2' sayısal alternatifi ile değiştirin ya da bunu, yerini aldığı üyeden ayırt edecek daha anlamlı bir sonek sağlayın
zh_hans: 要么将成员名称 {1} 中的后缀“{0}”替换为所建议的数值“2”，要么提供一个更能体现其意义的后缀，将它与它所替换的成员区分开来
zh_hant: 以建議的數字替代項 '2' 取代成員名稱 {1} 中的尾碼 '{0}'，或是提供區分此成員與其所取代之成員而更具意義的尾碼

# IdentifiersShouldNotHaveIncorrectSuffixMessageTypeNewerVersion
source: Either replace the suffix '{0}' in type name {1} with the suggested numeric alternate '2' or provide a more meaningful suffix that distinguishes it from the type it replaces
cs: Buď nahraďte příponu {0} v názvu typu {1} navrhovanou číselnou alternativou 2, nebo zadejte výstižnější příponu, která ho odliší od typu, kterého nahrazuje.
de: Ersetzen Sie entweder das Suffix "{0}" im Typnamen "{1}" durch die vorgeschlagene numerische Alternative "2", oder geben Sie ein aussagekräftigeres Suffix an, das den Namen von dem des ersetzten Typs unterscheidet.
es: Reemplace el sufijo "{0}" en el nombre del tipo {1} por la alternativa numérica "2" sugerida o proporcione un sufijo más significativo que lo distinga del tipo al que reemplaza.
fr: Remplacez le suffixe '{0}' dans le nom de type {1} par le substitut numérique suggéré '2', ou fournissez un suffixe plus significatif qui le distingue du type qu'il remplace
it: Sostituire il suffisso '{0}' nel nome di tipo {1} con l'alternativa numerica suggerita '2' o fornire un suffisso più significativo che lo distingua dal tipo che sostituisce
ko: 형식 이름 {1}의 '{0}' 접미사를 제안된 대체 숫자 '2'로 바꾸거나 대체될 형식과 구별되는 더 의미 있는 접미사를 제공하세요.
pl: Zamień sufiks „{0}” w nazwie typu {1} na zalecany alternatywny sufiks liczbowy „2” lub określ bardziej opisowy sufiks, który umożliwi odróżnienie go od zamienianego typu
pt_br: Substitua o sufixo '{0}' no nome de tipo {1} pela alternativa numérica sugerida '2' ou forneça um sufixo mais significativo que o diferencie do tipo que ele substitui
ru: Либо замените суффикс "{0}" в имени типа {1} предложенным числом "2", либо подберите более значимый суффикс, который отличит его от заменяемого типа.
tr: {1} tür adındaki '{0}' sonekini önerilen '2' sayısal alternatifi ile değiştirin ya da bunu, yerini aldığı türden ayırt edecek daha anlamlı bir sonek sağlayın
zh_hans: 要么将类型名称 {1} 中的后缀“{0}”替换为所建议的数值“2”，要么提供一个更能体现其意义的后缀，将它与它所替换的类型区分开来
zh_hant: 以建議的數字替代項 '2' 取代型別名稱 {1} 中的尾碼 '{0}'，或是提供區分此型別與其所取代之型別而更具意義的尾碼

# IdentifiersShouldNotHaveIncorrectSuffixMessageMemberWithAlternate
source: Either replace the suffix '{0}' in member name '{1}' with the suggested alternate '{2}' or remove the suffix completely
cs: Buď nahraďte příponu {0} v názvu člena {1} navrhovanou alternativou {2}, nebo příponu úplně odeberte.
de: Ersetzen Sie das Suffix "{0}" im Membernamen "{1}" durch die vorgeschlagene Alternative "{2}", oder entfernen Sie das Suffix vollständig.
es: Reemplace el sufijo "{0}" en el nombre del miembro "{1}" por la alternativa "{2}" sugerida o quite el sufijo por completo.
fr: Remplacez le suffixe '{0}' dans le nom de membre '{1}' par le substitut suggéré '{2}', ou supprimez complètement le suffixe
it: Sostituire il suffisso '{0}' nel nome di membro '{1}' con l'alternativa suggerita '{2}' o rimuovere completamente il suffisso
ko: 멤버 이름 '{1}'의 '{0}' 접미사를 제안된 대체 접미사 '{2}'(으)로 바꾸거나 접미사를 완전히 제거하세요.
pl: Zamień sufiks „{0}” w nazwie składowej „{1}” na zalecany alternatywny sufiks „{2}” lub całkowicie usuń sufiks
pt_br: Substitua o sufixo '{0}' no nome de membro '{1}' pela alternativa sugerida '{2}' ou remova o sufixo por completo
ru: Либо замените суффикс "{0}" в имени члена "{1}" предложенной альтернативой "{2}", либо полностью удалите суффикс.
tr: {1} üye adındaki '{0}' sonekini önerilen '{2}' alternatifi ile değiştirin ya da soneki tamamen kaldırın
zh_hans: 要么将成员名称“{1}”中的后缀“{0}”替换为所建议的数值“{2}”，要么完全删除后缀
zh_hant: 以建議的替代項 '{2}' 取代成員名稱 '{1}' 中的尾碼 '{0}'，或是完全移除尾碼

# IdentifiersShouldNotMatchKeywordsTitle
source: Identifiers should not match keywords
cs: Identifikátory se nemají shodovat s klíčovými slovy.
de: Bezeichner dürfen nicht mit Schlüsselwörtern übereinstimmen
es: Los identificadores no deben coincidir con palabras clave
fr: Les identificateurs ne doivent pas correspondre à des mots clés
it: Gli identificatori non devono corrispondere a parole chiave
ja: 識別子はキーワードと同一にすることはできません
ko: 식별자는 키워드와 달라야 합니다.
pl: Identyfikatory nie powinny być takie same jak słowa kluczowe
pt_br: Identificadores não devem corresponder a palavras-chave
ru: Идентификаторы не должны совпадать с ключевыми словами
tr: Tanımlayıcılar anahtar sözcüklerle eşleşmemelidir
zh_hans: 标识符不应与关键字匹配
zh_hant: 識別項不應該與關鍵字相符

# IdentifiersShouldNotMatchKeywordsDescription
source: A namespace name or a type name matches a reserved keyword in a programming language. Identifiers for namespaces and types should not match keywords that are defined by languages that target the common language runtime.
cs: Název názvového prostoru nebo název typu se shoduje s rezervovaným klíčovým slovem programovacího jazyka. Identifikátory názvových prostorů a typů by se neměly shodovat s klíčovými slovy definovanými jazyky, jejichž cílem je modul CLR (Common Language Runtime).
de: Ein Namespacename oder ein Typname entspricht einem reservierten Schlüsselwort in einer Programmiersprache. Bezeichner für Namespaces und Typen dürfen nicht mit Schlüsselwörtern übereinstimmen, die durch Sprachen definiert sind, die auf die Common Language Runtime ausgelegt sind.
es: Un nombre de un espacio de nombres o de un tipo coincide con una palabra clave reservada de un lenguaje de programación. Los identificadores de espacios de nombres y tipos no deben coincidir con las palabras clave definidas por los lenguajes destinados a Common Language Runtime.
fr: Un nom d'espace de noms ou un nom de type correspond à un mot clé réservé dans un langage de programmation. Les identificateurs des espaces de noms et des types ne doivent pas correspondre aux mots clés définis par les langages qui ciblent le Common Language Runtime.
it: Un nome di spazio dei nomi o di tipo corrisponde a una parola chiave riservata in un linguaggio di programmazione. Gli identificatori di spazi dei nomi e tipi non devono corrispondere a parole chiave definite dai linguaggi destinati a Common Language Runtime.
ja: 名前空間名または型名が、プログラミング言語の予約済みのキーワードと一致します。名前空間と型の識別子は、共通言語ランタイムを対象とする言語で定義されているキーワードと一致しないようにする必要があります。
ko: 프로그래밍 언어에서 네임스페이스 이름 또는 형식 이름이 예약된 키워드와 일치합니다. 네임스페이스와 형식에 대한 식별자는 공용 언어 런타임을 대상으로 하는 언어가 정의하는 키워드와 달라야 합니다.
pl: Nazwa przestrzeni nazw lub nazwa typu jest taka sama jak zastrzeżone słowo kluczowe języka programowania. Identyfikatory przestrzeni nazw i typów nie powinny być takie same jak słowa kluczowe zdefiniowane przez języki docelowe środowiska uruchomieniowego języka wspólnego.
pt_br: Um nome de namespace ou de tipo corresponde a uma palavra-chave reservada em uma linguagem de programação. Os identificadores para namespaces e tipos não devem corresponder a palavras-chaves definidas por linguagens direcionadas ao Common Language Runtime.
ru: Имя пространства имен или типа совпадает с зарезервированным ключевым словом в языке программирования. Идентификаторы для пространств имен и типов не должны совпадать с ключевыми словами, определенными в языках, которые ориентированы на среду CLR.
tr: Bir ad alanı adı veya tür adı, bir programlama dilindeki ayrılmış bir anahtar sözcükle eşleşiyor. Ad alanlarının ve türlerin tanımlayıcıları, ortak dil çalışma zamanını hedefleyen diller tarafından tanımlanmış anahtar sözcüklerle eşleşmemelidir.
zh_hans: 命名空间名称或类型名称与编程语言中保留的关键字相匹配。命名空间和类型的标识符不应与目标为公共语言运行时的语言所定义的关键字相匹配。
zh_hant: 命名空間名稱或類型名稱符合程式設計語言中的保留關鍵字。命名空間與類型的識別項，不應與以 Common Language Runtime 為目標之語言所定義的關鍵字相符。
