Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MovePInvokesToNativeMethodsClassTitle
source: Move pinvokes to native methods class
cs: Přesuňte volání nespravovaného kódu do třídy nativních metod.
de: Pinvokes in native Methodenklasse verschieben
es: Mover elementos PInvoke a clases de métodos nativos
fr: Déplacer les P/Invoke vers une classe NativeMethods
it: Spostare le istanze di PInvoke nella classe NativeMethods
ja: pinvoke をネイティブ メソッド クラスに移動します
ko: PInvoke를 네이티브 메서드 클래스로 이동하세요.
pl: Przenieś metody pinvoke do klasy metod natywnych
pt_br: Mover pinvokes para a classe de métodos nativos
ru: Переместите вызовы PInvoke в класс собственных методов
tr: Pinvoke’ları yerel yöntemler sınıfına taşıyın
zh_hans: 将 pinvoke 移到本机方法类
zh_hant: 將 PInvoke 移到原生方法類別

# MovePInvokesToNativeMethodsClassDescription
source: Platform Invocation methods, such as those that are marked by using the System.Runtime.InteropServices.DllImportAttribute attribute, or methods that are defined by using the Declare keyword in Visual Basic, access unmanaged code. These methods should be of the NativeMethods, SafeNativeMethods, or UnsafeNativeMethods class.
cs: Metody volání nespravovaného kódu, například označené atributem System.Runtime.InteropServices.DllImportAttribute, nebo metody definované klíčovým slovem Declare ve Visual Basicu, mají přístup k nespravovanému kódu. Tyto metody mají být třídy NativeMethods, SafeNativeMethods nebo UnsafeNativeMethods.
de: Methoden zum Plattformaufruf, beispielsweise diejenigen, die durch das Attribut "System.Runtime.InteropServices.DllImportAttribute" markiert werden, oder Methoden, die anhand des Schlüsselworts "Declare" in Visual Basic definiert werden, greifen auf nicht verwalteten Code zu. Diese Methoden müssen der Klasse "NativeMethods", "SafeNativeMethods" oder "UnsafeNativeMethods" angehören.
es: Los métodos de invocación de plataforma, como aquellos marcados con el atributo System.Runtime.InteropServices.DllImportAttribute o los métodos definidos con la palabra clave Declare en Visual Basic, tienen acceso al código no administrado. Estos métodos deben ser de la clase NativeMethods, UnsafeNativeMethods o SafeNativeMethods.
fr: Les méthodes d'appel de code non managé, comme celles qui sont marquées avec l'attribut System.Runtime.InteropServices.DllImportAttribute, ou les méthodes définies à l'aide du mot clé Declare en Visual Basic, accèdent à du code non managé. Ces méthodes doivent se trouver dans l'une des classes suivantes : NativeMethods, SafeNativeMethods ou UnsafeNativeMethods.
it: I metodi Pinvoke, ad esempio quelli contrassegnati tramite l'attributo System.Runtime.InteropServices.DllImportAttribute o i metodi definiti tramite la parola chiave Declare in Visual Basic, accedono a codice non gestito. Questi metodi devono appartenere alla classe NativeMethods, SafeNativeMethods o UnsafeNativeMethods.
ja: プラットフォーム呼び出しメソッド (System.Runtime.InteropServices.DllImportAttribute 属性を使用してマークされているメソッドなど) または Visual Basic で Declare キーワードを使用して定義されているメソッドが、アンマネージ コードにアクセスしています。これらのメソッドは、NativeMethods、SafeNativeMethods、または UnsafeNativeMethods クラスに属している必要があります。
ko: System.Runtime.InteropServices.DllImportAttribute 특성을 사용하여 표시되거나 Visual Basic에서 선언 키워드를 사용하여 정의되는 메서드와 같은 플랫폼 호출 메서드는 비관리 코드에 액세스합니다. 이러한 메서드는 NativeMethods, SafeNativeMethods 또는 UnsafeNativeMethods 클래스여야 합니다.
pl: Metody wywoływania platformy, takie jak metody oznaczone atrybutem System.Runtime.InteropServices.DllImportAttribute, lub metody zdefiniowane za pomocą słowa kluczowego Declare w języku Visual Basic uzyskują dostęp do kodu niezarządzanego. Te metody powinny należeć do klasy NativeMethods, SafeNativeMethods lub UnsafeNativeMethods.
pt_br: Os métodos de invocação de plataforma, tais como os que são marcados usando o atributo System.Runtime.InteropServices.DllImportAttribute ou os métodos definidos usando a palavra-chave Declare no Visual Basic, acessam código não gerenciado. Esses métodos devem ser da classe NativeMethods, SafeNativeMethods ou UnsafeNativeMethods.
ru: Методы вызова неуправляемого кода, например, помеченные атрибутом System.Runtime.InteropServices.DllImportAttribute, или методы, определенные с помощью ключевого слова Declare в Visual Basic, обращаются к неуправляемому коду. Эти методы должны относиться к классу NativeMethods, SafeNativeMethods или UnsafeNativeMethods.
tr: System.Runtime.InteropServices.DllImportAttribute özniteliği kullanılarak işaretlenmiş olanlar gibi Platform Çağırma yöntemleri veya Visual Basic’te Declare anahtar sözcüğü kullanılarak tanımlanmış yöntemler yönetilmeyen koda erişir. Bu yöntemler NativeMethods, SafeNativeMethods veya UnsafeNativeMethods sınıfında olmalıdır.
zh_hans: 平台调用方法(例如，使用 System.Runtime.InteropServices.DllImportAttribute 属性标记的方法)，或在 Visual Basic 中使用 Declare 关键字定义的方法，它们均访问非托管代码。这些方法应为 NativeMethods、SafeNativeMethods 或 UnsafeNativeMethods 类。
zh_hant: 平台引動過程方法 (例如，使用 System.Runtime.InteropServices.DllImportAttribute 屬性標記的方法，或在 Visual Basic 中使用 Declare 關鍵字定義的方法) 都會存取非受控程式碼。這些方法應為 NativeMethods、SafeNativeMethods 或 UnsafeNativeMethods 類別。

# MovePInvokesToNativeMethodsClassMessage
source: Move pinvokes to native methods class
cs: Přesuňte volání nespravovaného kódu do třídy nativních metod.
de: Pinvokes in native Methodenklasse verschieben
es: Mover elementos PInvoke a clases de métodos nativos
fr: Déplacer les P/Invoke vers une classe NativeMethods
it: Spostare le istanze di PInvoke nella classe NativeMethods
ja: pinvoke をネイティブ メソッド クラスに移動します
ko: PInvoke를 네이티브 메서드 클래스로 이동하세요.
pl: Przenieś metody pinvoke do klasy metod natywnych
pt_br: Mover pinvokes para a classe de métodos nativos
ru: Переместите вызовы PInvoke в класс собственных методов
tr: Pinvoke’ları yerel yöntemler sınıfına taşıyın
zh_hans: 将 pinvoke 移到本机方法类
zh_hant: 將 PInvoke 移到原生方法類別

# IdentifiersShouldDifferByMoreThanCaseTitle
source: Identifiers should differ by more than case
cs: Identifikátory se mají lišit nejen velikostí písmen.
de: Bezeichner dürfen sich nicht nur durch die Groß-/Kleinschreibung unterscheiden
es: Los identificadores se deberían diferenciar en algo más que en el uso de mayúsculas y minúsculas
fr: Les identificateurs ne doivent pas différer uniquement par leur casse
it: La differenza tra identificatori non deve limitarsi al diverso uso di maiuscole/minuscole
ja: 識別子は、大文字と小文字の区別以外にも相違していなければなりません
ko: 식별자에 대/소문자만 다른 이름을 사용할 수 없습니다.
pl: Identyfikatory powinny różnić się nie tylko wielkością liter
pt_br: Identificadores devem ter alguma diferença além da distribuição de maiúsculas e minúsculas
ru: Идентификаторы должны отличаться не только регистром
tr: Tanımlayıcılar arasındaki fark yalnızca büyük/küçük harf olmamalıdır
zh_hans: 标识符应以大小写之外的差别进行区分
zh_hant: 識別項不應只靠大小寫區別

# IdentifiersShouldDifferByMoreThanCaseDescription
source: Identifiers for namespaces, types, members, and parameters cannot differ only by case because languages that target the common language runtime are not required to be case-sensitive.
cs: Identifikátory názvových prostorů, typů, členů a parametrů se nemůžou lišit jen velikostí písmen, protože jazyky, jejichž cílem je modul CLR (Common Language Runtime), nemusejí rozlišovat malá a velká písmena.
de: Bezeichner für Namespaces, Typen, Member und Parameter dürfen sich nicht nur durch die Groß-/Kleinschreibung unterscheiden, weil diese bei Sprachen, die auf die Common Language Runtime ausgerichtet sind, nicht relevant ist.
es: Los identificadores de los espacios de nombres, tipos, miembros y parámetros no puede distinguirse solo por el uso de mayúsculas o minúsculas, ya que los lenguajes destinados al Common Language Runtime no necesitan distinguir entre mayúsculas y minúsculas.
fr: Les identificateurs des espaces de noms, types, membres et paramètres ne peuvent pas différer uniquement par la casse, car les langages qui ciblent le Common Language Runtime ne sont pas tenus de la respecter.
it: La differenza tra identificatori per spazi dei nomi, tipi, membri e parametri non deve limitarsi solo al diverso uso di maiuscole/minuscole perché la differenza tra maiuscole/minuscole non è obbligatoria per i linguaggi destinati a Common Language Runtime.
ja: 名前空間、型、メンバー、およびパラメーターの識別子は、大文字/小文字だけを変更しても区別できません。共通言語ランタイムを対象とする言語は、大文字と小文字を区別する必要がないためです。
ko: 공용 언어 런타임을 대상으로 하는 언어가 대/소문자를 구분하지 않으므로 네임스페이스, 형식, 멤버 및 매개 변수에 대한 식별자는 대/소문자만 다른 이름을 사용할 수 없습니다.
pl: Identyfikatory przestrzeni nazw, typów, elementów członkowskich i parametrów nie mogą różnić się tylko wielkością liter, ponieważ języki docelowe środowiska uruchomieniowego języka wspólnego nie muszą rozróżniać wielkości liter.
pt_br: Os identificadores para namespaces, tipos, membros e parâmetros não podem ter a distribuição de maiúsculas e minúsculas como única diferença, porque as linguagens direcionadas ao Common Language Runtime não precisam diferenciar maiúsculas de minúsculas.
ru: Идентификаторы для пространств имен, типов, членов и параметров не могут отличаться только регистром, так как языки, ориентированные на среду CLR, не учитывают регистр.
tr: Ortak dil çalışma zamanını hedefleyen dillerin büyük/küçük harfe duyarlı olması gerekmediğinden, ad alanları, türler, üyeler ve parametreler arasındaki fark yalnızca büyük/küçük harf olamaz.
zh_hans: 只通过大小写无法区分命名空间、类型、成员和参数的标识符，因为目标为公共语言运行时的语言不需要区分大小写。
zh_hant: 因為以 Common Language Runtime 為目標的語言，不需要區分大小寫，所以命名空間、類型、成員以及參數的識別項不可只有大小寫不同。

# IdentifiersShouldDifferByMoreThanCaseMessage
source: Names of '{0}' and '{1}' should differ by more than case
cs: Názvy {0} a {1} by se měly lišit nejen velikostí písmen.
de: Namen von "{0}" und "{1}" dürfen sich nicht nur durch die Groß-/Kleinschreibung unterscheiden.
es: Los nombres de "{0}" y "{1}" se deben diferenciar en algo más que en el uso de mayúsculas y minúsculas.
fr: Les noms de '{0}' et '{1}' ne doivent pas différer uniquement par leur casse
it: La differenza tra i nomi di '{0}' e '{1}' non deve limitarsi al diverso uso di maiuscole/minuscole
ko: '{0}' 및 '{1}'에 대/소문자만 다른 이름을 사용할 수 없습니다.
pl: Nazwy elementów „{0}” i „{1}” powinny różnić się nie tylko wielkością liter
pt_br: Os nomes de '{0}' e '{1}' devem ter alguma diferença além da distribuição de maiúsculas e minúsculas
ru: Имена "{0}" и "{1}" должны отличаться не только регистром.
tr: '{0}' ve '{1}' öğelerinin adları arasındaki fark yalnızca büyük/küçük harf olmamalıdır
zh_hans: “{0}”和“{1}”名称应以大小写之外的差别进行区分
zh_hant: '{0}' 與 '{1}' 的名稱不應只靠大小寫區別

# IdentifiersShouldHaveCorrectPrefixTitle
source: Identifiers should have correct prefix
cs: Identifikátory mají mít správnou předponu.
de: Bezeichner müssen ein korrektes Präfix aufweisen
es: Los identificadores deben tener el prefijo correcto
fr: Les identificateurs doivent être dotés d'un préfixe correct
it: Gli identificatori devono contenere il prefisso corretto
ja: 識別子は正しいプレフィックスを含んでいなければなりません
ko: 식별자에는 올바른 접두사를 사용해야 합니다.
pl: Identyfikatory powinny mieć poprawny prefiks
pt_br: Os identificadores devem ter o prefixo correto
ru: Идентификаторы должны иметь правильные префиксы
tr: Tanımlayıcılar doğru ön eke sahip olmalıdır
zh_hans: 标识符应具有正确的前缀
zh_hant: 識別項應該使用正確的前置詞

# IdentifiersShouldHaveCorrectPrefixDescription
source: The name of an externally visible interface does not start with an uppercase ""I"". The name of a generic type parameter on an externally visible type or method does not start with an uppercase ""T"".
cs: Název externě viditelného rozhraní nezačíná velkým písmenem I. Název parametru obecného typu u externě viditelného typu nebo metody nezačíná velkým písmenem I.
de: Der Name einer extern sichtbaren Schnittstelle beginnt nicht mit einem großen ""I"". Der Name eines generischen Typparameters für einen extern sichtbaren Typ oder eine extern sichtbare Methode beginnt nicht mit einem großen ""T"".
es: El nombre de una interfaz visible externamente no empieza por "I" mayúscula. El nombre de un parámetro de tipo genérico en un tipo o método visible externamente no empieza por "T" mayúscula.
fr: Le nom d'une interface visible de manière externe ne commence pas par un ""I"" majuscule. Le nom d'un paramètre de type générique sur un type ou une méthode visible de manière externe ne commence pas par un ""T"" majuscule.
it: Il nome di un'interfaccia visibile esternamente non inizia con una ""I"" maiuscola. Il nome di un parametro di tipo generico su un tipo o un metodo visibile esternamente non inizia con una ""T"" maiuscola.
ja: 外部から参照可能なインターフェイスの名前は大文字の ""I"" で始まりません。外部から参照可能な型またはメソッドのジェネリック型パラメーターの名前は大文字の ""T"" で始まりません。
ko: 외부에 표시되는 인터페이스의 이름은 대문자 ""I""로 시작하지 않습니다. 외부에 표시되는 형식의 제네릭 형식 매개 변수 또는 메서드의 이름은 대문자 ""T""로 시작하지 않습니다.
pl: Nazwa interfejsu widocznego zewnętrznie nie zaczyna się wielką literą „I”. Nazwa parametru typu ogólnego dla typu lub metody widocznych zewnętrznie nie zaczyna się wielką literą „T”.
pt_br: O nome de uma interface visível externamente não começa com um ""I"" maiúsculo. O nome de um parâmetro de tipo genérico em um tipo ou método visível externamente não começa com um ""T"" maiúsculo.
ru: Имя видимых снаружи интерфейсов не начинается с прописной буквы "I". Имя параметра универсального типа для видимого снаружи типа или метода не начинается с прописной буквы "T".
tr: Dışarıdan görünen bir arabirimin adı büyük ""I"" harfiyle başlamaz. Dışarıdan görünen bir tür veya yöntemdeki genel türde bir parametrenin adı büyük ""T"" harfiyle başlamaz.
zh_hans: 外部可见的接口的名称不以大写字母 "I" 开头。外部可见的类型或方法上的泛型类型参数的名称不以大写字母 "T" 开头。
zh_hant: 外部可見介面的名稱未以大寫 ""I"" 開頭。外部可見類型或方法上，泛型型別參數的名稱未以大寫 ""T"" 開頭。

# IdentifiersShouldHaveCorrectPrefixMessageInterface
source: Prefix interface name {0} with 'I'
cs: Vložte před název rozhraní {0} předponu I.
de: Stellen Sie dem Schnittstellennamen "{0}" ein "I" voran.
es: Agregue el prefijo "I" al nombre de la interfaz {0}.
fr: Faites précéder de la lettre 'I' le nom d'interface {0}
it: Anteporre il prefisso 'I' al nome di interfaccia {0}
ko: 인터페이스 이름 {0}에 'I'를 접두사로 사용하세요.
pl: Dodaj do nazwy interfejsu {0} prefiks „I”
pt_br: Prefixe o nome da interface {0} com 'I'
ru: Добавьте префикс "I" к имени интерфейса {0}.
tr: {0} arabirim adının önüne 'I' ekleyin
zh_hans: 为接口名称 {0} 加上前缀 "I"
zh_hant: 在介面名稱 {0} 前面加上 'I'

# IdentifiersShouldHaveCorrectPrefixMessageTypeParameter
source: Prefix generic type parameter name {0} with 'T'
cs: Vložte před název parametru obecného typu {0} předponu T.
de: Stellen Sie dem Namen des generischen Typparameters "{0}" ein "T" voran.
es: Agregue el prefijo "T" al nombre del parámetro de tipo genérico {0}.
fr: Faites précéder de la lettre 'T' le nom de paramètre de type générique {0}
it: Anteporre il prefisso 'T' al nome di parametro di tipo generico {0}
ko: 제네릭 형식 매개 변수 이름 {0}에 'T'를 접두사로 사용하세요.
pl: Dodaj do nazwy parametru typu ogólnego {0} prefiks „T”
pt_br: Prefixe o nome de parâmetro de tipo genérico {0} com 'T'
ru: Добавьте префикс "T" к имени параметра универсального типа {0}.
tr: Genel türdeki {0} parametre adının önüne 'T' ekleyin
zh_hans: 为泛型类型参数名称 {0} 加上前缀 "T"
zh_hant: 在泛型型別參數名稱 {0} 前面加上 'T'

# NonConstantFieldsShouldNotBeVisibleTitle
source: Non-constant fields should not be visible
cs: Nekonstantní pole nemají být viditelná.
de: Nicht konstante Felder dürfen nicht sichtbar sein
es: Los campos no constantes no deben ser visibles
fr: Les champs non constants ne doivent pas être visibles
it: I campi non costanti non devono essere visibili
ja: 非定数フィールドは表示されません
ko: 비상수 필드는 표시할 수 없습니다.
pl: Pola niebędące stałymi nie powinny być widoczne
pt_br: Campos não constantes não devem ser visíveis
ru: Поля, не являющиеся константами, не должны быть видимыми
tr: Sabit olmayan alanlar görünür olmamalıdır
zh_hans: 非常量字段应当不可见
zh_hant: 非常數欄位不應可見

# NonConstantFieldsShouldNotBeVisibleDescription
source: Static fields that are neither constants nor read-only are not thread-safe. Access to such a field must be carefully controlled and requires advanced programming techniques to synchronize access to the class object.
cs: Statická pole, která nejsou ani konstantní, ani jen pro čtení, nejsou bezpečná pro přístup z více vláken. Přístup k takovému poli musí být pečlivě řízený a vyžaduje pokročilé programovací techniky, aby se synchronizoval s objektem třídy.
de: Statische Felder, die weder Konstanten noch schreibgeschützt sind, sind nicht threadsicher. Der Zugriff auf ein solches Feld muss sorgfältig kontrolliert werden und erfordert erweiterte Programmiertechniken, um den Zugriff auf das Klassenobjekt zu synchronisieren.
es: Los campos estáticos que no son constantes ni de solo lectura no son seguros para los subprocesos. El acceso a campos de este tipo se debe controlar atentamente y requiere técnicas de programación avanzadas para sincronizar el acceso al objeto de clase.
fr: Les champs static qui ne sont ni constants ni en lecture seule ne sont pas thread-safe. L'accès à un tel champ doit être soigneusement contrôlé et nécessite des techniques de programmation avancées pour synchroniser l'accès à l'objet de classe.
it: I campi statici che non sono né costanti né di sola lettura non sono thread-safe. L'accesso a tali campi deve essere controllato attentamente e richiede tecniche di programmazione avanzate per la sincronizzazione dell'accesso all'oggetto classe.
ja: 定数でも読み取り専用でもない静的フィールドは、スレッドセーフではありません。このようなフィールドへのアクセスは慎重に制御する必要があります。また、クラス オブジェクトへのアクセスを同期するには、高度なプログラミング技術が必要です。
ko: 상수도 아니고 읽기 전용도 아닌 정적 필드는 스레드로부터 안전하지 않습니다. 이러한 필드에 액세스하려면 신중한 제어와 액세스를 클래스 개체에 동기화할 수 있는 고급 프로그래밍 기술이 필요합니다.
pl: Pola statyczne, które nie są stałymi ani wartościami tylko do odczytu, nie są bezpieczne wątkowo. Dostęp do takiego pola musi być starannie kontrolowany i wymaga zaawansowanych technik programistycznych do synchronizowania dostępu do obiektu klasy.
pt_br: Os campos estáticos que não são nem constantes nem somente leitura não são thread-safe. O acesso a esse campo deve ser cuidadosamente controlado e requer técnicas de programação avançadas para sincronizar o acesso com o objeto de classe.
ru: Статические поля, не являющиеся ни константами, ни доступными только для чтения, не потокобезопасны. Доступ к таким полям следует тщательно контролировать, а для синхронизации доступа к объекту класса требуется применять расширенные методики программирования.
tr: Sabit veya salt okunur olmayan statik alanlar iş parçacığı güvenli değildir. Böyle bir alana erişim dikkatli bir şekilde denetlenmelidir ve sınıf nesnesine erişimin eşitlenmesi için ileri düzey programlama teknikleri gerektirir.
zh_hans: 既不是常量也不是只读的静态字段不是线程安全的字段。必须谨慎控制对此类字段的访问，并且需要高级编程技术来同步对类对象的访问。
zh_hant: 既非常數又非唯讀的靜態欄位，不是安全執行緒。必須小心控制對這類欄位的存取，且需要進階的程式設計技巧來同步對類別物件的存取。

# NonConstantFieldsShouldNotBeVisibleMessage
source: Non-constant fields should not be visible
cs: Nekonstantní pole nemají být viditelná.
de: Nicht konstante Felder dürfen nicht sichtbar sein
es: Los campos no constantes no deben ser visibles
fr: Les champs non constants ne doivent pas être visibles
it: I campi non costanti non devono essere visibili
ja: 非定数フィールドは表示されません
ko: 비상수 필드는 표시할 수 없습니다.
pl: Pola niebędące stałymi nie powinny być widoczne
pt_br: Campos não constantes não devem ser visíveis
ru: Поля, не являющиеся константами, не должны быть видимыми
tr: Sabit olmayan alanlar görünür olmamalıdır
zh_hans: 非常量字段应当不可见
zh_hant: 非常數欄位不應可見

# DoNotMarkEnumsWithFlagsTitle
source: Do not mark enums with FlagsAttribute
cs: Neoznačujte výčty atributem FlagsAttribute.
de: Enumerationen nicht mit FlagsAttribute markieren
es: No marcar las enumeraciones con FlagsAttribute
fr: Ne pas marquer les enums avec l'attribut FlagsAttribute
it: Non contrassegnare le enumerazioni con FlagsAttribute
ja: 列挙型を FlagsAttribute に設定しません
ko: FlagsAttribute로 열거형을 표시하지 마세요.
pl: Nie oznaczaj wyliczeń atrybutem FlagsAttribute
pt_br: Não marcar enums com FlagsAttribute
ru: Не помечайте перечисления с помощью FlagsAttribute
tr: Sabit listelerini FlagsAttribute ile işaretlemeyin
zh_hans: 不要使用 FlagsAttribute 标记枚举
zh_hant: 請勿將列舉標記為 FlagsAttribute

# DoNotMarkEnumsWithFlagsDescription
source: An externally visible enumeration is marked by using FlagsAttribute, and it has one or more values that are not powers of two or a combination of the other defined values on the enumeration.
cs: Externě viditelný výčet je označený atributem FlagsAttribute a obsahuje jednu nebo více hodnot, které nejsou mocninami čísla 2 ani kombinací jiných definovaných hodnot výčtu.
de: Eine extern sichtbare Enumeration wird über das FlagsAttribute markiert und verfügt über mindestens einen Wert, der keine Potenz von zwei oder keine Kombination der anderen definierten Werte für die Enumeration ist.
es: Una enumeración visible externamente está marcada con FlagsAttribute y tiene uno o varios valores que no son potencias de dos o una combinación de los otros valores definidos en la enumeración.
fr: Une énumération visible de manière externe est marquée par FlagsAttribute. Elle a une ou plusieurs valeurs qui ne sont pas des puissances de deux ou une combinaison des autres valeurs définies dans l'énumération.
it: Un'enumerazione visibile esternamente è contrassegnata tramite FlagsAttribute e contiene uno o più valori che non sono potenze di due o una combinazione degli altri valori definiti nell'enumerazione.
ja: 外部から参照可能な列挙型が FlagsAttribute を使用してマークされ、その列挙型に、2 の累乗でもその列挙型で定義されている他の値の組み合わせでもない値が 1 つ以上含まれています。
ko: 외부에 표시되는 열거형은 FlagsAttribute를 사용하여 표시되며 2의 거듭제곱 또는 열거형에서 정의된 다른 값의 조합이 아닌 하나 이상의 값을 가집니다.
pl: Wyliczenie widoczne zewnętrznie jest oznaczone atrybutem FlagsAttribute i ma co najmniej jedną wartość, która nie jest potęgą dwójki ani kombinacją innych wartości zdefiniowanych dla wyliczenia.
pt_br: Uma enumeração visível externamente é marcada usado FlagsAttribute e ela tem um ou mais valores que não são potências de dois nem uma combinação dos outros valores definidos na enumeração.
ru: Видимое снаружи перечисление помечается с помощью FlagsAttribute и имеет одно или несколько значений, отличных от степеней двойки или сочетания других определенных значений в этом перечислении.
tr: Dışarıdan görünen bir sabit listesi FlagsAttribute kullanılarak işaretlenir ve ikinin üssü olmayan bir veya daha fazla değere ya da sabit listesindeki diğer tanımlı değerlerin bir birleşimine sahip olur.
zh_hans: 外部可见的枚举通过 FlagsAttribute 标记，并且它的一个或多个值不是 2 的幂或枚举上定义的其他值的组合。
zh_hant: 外部可見的列舉會使用 FlagsAttribute 加以標記，且有一或多個值不是二的次方或列舉上其他定義值的組合。

# DoNotMarkEnumsWithFlagsMessage
source: Do not mark enums with FlagsAttribute
cs: Neoznačujte výčty atributem FlagsAttribute.
de: Enumerationen nicht mit FlagsAttribute markieren
es: No marcar las enumeraciones con FlagsAttribute
fr: Ne pas marquer les enums avec l'attribut FlagsAttribute
it: Non contrassegnare le enumerazioni con FlagsAttribute
ja: 列挙型を FlagsAttribute に設定しません
ko: FlagsAttribute로 열거형을 표시하지 마세요.
pl: Nie oznaczaj wyliczeń atrybutem FlagsAttribute
pt_br: Não marcar enums com FlagsAttribute
ru: Не помечайте перечисления с помощью FlagsAttribute
tr: Sabit listelerini FlagsAttribute ile işaretlemeyin
zh_hans: 不要使用 FlagsAttribute 标记枚举
zh_hant: 請勿將列舉標記為 FlagsAttribute

# OperatorOverloadsHaveNamedAlternatesTitle
source: Operator overloads have named alternates
cs: Přetížení operátorů mají pojmenované alternativy.
de: Operatorüberladungen weisen benannte Alternativen auf
es: Las sobrecargas del operador tienen alternativas con nombre
fr: Les surcharges d'opérateur offrent d'autres méthodes nommées
it: Per gli overload degli operatori esistono metodi alternativi denominati
ja: 演算子オーバーロードには名前付けされた代替が存在します
ko: 연산자 오버로드에는 명명된 대체 항목이 있습니다.
pl: Przeciążenia operatora mają nazwane alternatywy
pt_br: Sobrecargas de operador têm alternativas nomeadas
ru: Для перегрузок операторов существуют варианты с именами
tr: İşleç aşırı yüklemelerinin adlandırılmış alternatifleri vardır
zh_hans: 运算符重载具有命名的备用项
zh_hant: 運算子多載有具名的替代項
