Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ExceptionsShouldBePublicTitle
source: Exceptions should be public
cs: Výjimky mají být veřejné.
de: Ausnahmen müssen öffentlich sein
es: Las excepciones deben ser públicas
fr: Les exceptions doivent être publiques
it: Le eccezioni devono essere public
ja: 例外は public として設定する必要があります
ko: 예외는 public이어야 합니다.
pl: Wyjątki powinny być publiczne
pt_br: As exceções devem ser públicas
ru: Исключения должны быть общими
tr: Özel durumlar genel olmalıdır
zh_hans: 异常应该是公共的
zh_hant: 例外狀況應為公用

# ExceptionsShouldBePublicDescription
source: An internal exception is visible only inside its own internal scope. After the exception falls outside the internal scope, only the base exception can be used to catch the exception. If the internal exception is inherited from T:System.Exception, T:System.SystemException, or T:System.ApplicationException, the external code will not have sufficient information to know what to do with the exception.
cs: Interní výjimka je viditelná jenom uvnitř svého vlastního interního oboru. Pokud tato výjimka spadá mimo interní obor, dá se k jejímu zachycení použít jenom základní výjimka. Pokud je interní výjimka zděděná od T:System.Exception, T:System.SystemException nebo T:System.ApplicationException, nebude mít externí kód dost informací o tom, co se má s touto výjimkou udělat.
de: Eine interne Ausnahme ist nur innerhalb des eigenen internen Geltungsbereichs sichtbar. Sobald die Ausnahme außerhalb des internen Geltungsbereichs fällt, kann nur die Basisausnahme zum Abfangen der Ausnahme verwendet werden. Wenn die interne Ausnahme von "T:System.Exception", "T:System.SystemException" oder "T:System.ApplicationException" geerbt wird, besitzt der externe Code nicht genügend Informationen für die weitere Verarbeitung der Ausnahme.
es: Una excepción interna solo se ve dentro de su propio ámbito interno. Cuando la excepción está fuera del ámbito interno, solo se puede usar la excepción base para capturarla. Si la excepción interna se hereda de T:System.Exception, T:System.SystemException o T:System.ApplicationException, el código externo no tendrá información suficiente para saber qué hacer con ella.
fr: Une exception interne est visible uniquement à l'intérieur de sa propre portée interne. Quand l'exception est en dehors de la portée interne, seule l'exception de base peut être utilisée pour intercepter l'exception. Si l'exception interne est héritée de T:System.Exception, T:System.SystemException ou T:System.ApplicationException, le code externe n'a pas suffisamment d'informations pour savoir comment traiter l'exception.
it: Un'eccezione interna è visibile solo nel relativo ambito interno. Se l'eccezione si verifica al di fuori dell'ambito interno, può essere rilevata solo tramite l'eccezione di base. Se l'eccezione interna è ereditata da T:System.Exception, T:System.SystemException o T:System.ApplicationException, il codice esterno non avrà di informazioni sufficienti per la corretta gestione dell'eccezione.
ja: 内部例外を参照できるのは、それ独自の内部スコープ内でのみです。例外が内部スコープ外にあると、基本例外を使用しなければキャッチできません。内部例外が System.Exception、System.SystemException、または System.ApplicationException から継承されている場合、外部コードはその例外の処理に関する十分な情報を取得できません。
ko: 내부 예외는 내부 범위에서만 표시됩니다. 이 예외가 내부 범위를 벗어난 후 예외를 catch하려면 기본 예외만 사용할 수 있습니다. 내부 예외가 T:System.Exception, T:System.SystemException 또는 T:System.ApplicationException에서 상속되는 경우 외부 코드에는 예외를 사용하여 수행해야 하는 작업에 대한 충분한 정보가 제공되지 않습니다.
pl: Wyjątek wewnętrzny jest widoczny tylko wewnątrz własnego zakresu wewnętrznego. Gdy wyjątek zostanie przekazany poza zakres wewnętrzny, do przechwycenia tego wyjątku można użyć tylko wyjątku podstawowego. Jeśli wyjątek wewnętrzny jest dziedziczony z wyjątku T:System.Exception, T:System.SystemException lub T:System.ApplicationException, kod zewnętrzny nie będzie miał wystarczających informacji do określenia, co zrobić z wyjątkiem.
pt_br: Uma exceção interna é visível apenas dentro do seu escopo interno. Depois que a exceção estiver fora do escopo interno, apenas a exceção base poderá ser usada capturar a exceção. Se a exceção interna for herdada de T:System.Exception, T:System.SystemException ou T:System.ApplicationException, o código externo não terá informações suficientes para saber o que fazer com a exceção.
ru: Внутреннее исключение видно только внутри своей внутренней области. Когда исключение выходит за пределы внутренней области, для его перехвата можно использовать только базовое исключение. Если внутреннее исключение унаследовано от T:System.Exception, T:System.SystemException или T:System.ApplicationException, внешний код не будет располагать достаточной информацией о том, что нужно сделать с этим исключением.
tr: Bir iç özel durum yalnızca kendi iç kapsamı içinde görünür. Özel durum iç kapsamın dışında kaldığında, özel durumun yakalanması için yalnızca temel özel durum kullanılabilir. İç özel durum T:System.Exception, T:System.SystemException veya T:System.ApplicationException öğesinden devralınırsa, dış kod özel durumla ne yapılacağı konusunda yeterli bilgiye sahip olmaz.
zh_hans: 内部异常仅在其内部范围内可见。在异常超出内部范围后，只能使用基异常来捕获异常。如果内部异常继承自 T:System.Exception、T:System.SystemException 或 T:System.ApplicationException，则外部代码将不具有足够的信息用于处理异常。
zh_hant: 內部例外狀況只有在其本身的內部範圍內才可看到。當例外狀況超出內部範圍之後，只能使用基底例外狀況來攔截例外狀況。若內部例外狀況繼承自 T:System.Exception、T:System.SystemException 或 T:System.ApplicationException，則外部程式碼將不會有足夠的資訊可以知道應如何處理此例外狀況。

# ExceptionsShouldBePublicMessage
source: Exceptions should be public
cs: Výjimky mají být veřejné.
de: Ausnahmen müssen öffentlich sein
es: Las excepciones deben ser públicas
fr: Les exceptions doivent être publiques
it: Le eccezioni devono essere public
ja: 例外は public として設定する必要があります
ko: 예외는 public이어야 합니다.
pl: Wyjątki powinny być publiczne
pt_br: As exceções devem ser públicas
ru: Исключения должны быть общими
tr: Özel durumlar genel olmalıdır
zh_hans: 异常应该是公共的
zh_hant: 例外狀況應為公用

# DoNotRaiseExceptionsInUnexpectedLocationsTitle
source: Do not raise exceptions in unexpected locations
cs: Nevyvolávejte výjimky na neočekávaných místech.
de: Keine Ausnahmen an unerwarteten Speicherorten auslösen
es: No producir excepciones en ubicaciones inesperadas
fr: Ne pas lever d'exceptions dans les emplacements inattendus
it: Non generare eccezioni in posizioni non previste
ja: 予期しない場所に例外を発生させません
ko: 예기치 않은 위치에서 예외를 발생시키지 마세요.
pl: Nie zgłaszaj wyjątków w nieoczekiwanych lokalizacjach
pt_br: Não gerar exceções em locais inesperados
ru: Не вызывайте исключения в непредвиденных местах
tr: Beklenmeyen konumlarda özel durum tetiklemeyin
zh_hans: 不要在意外的位置引发异常
zh_hant: 請勿在非預期的位置中引發例外狀況

# DoNotRaiseExceptionsInUnexpectedLocationsDescription
source: A method that is not expected to throw exceptions throws an exception.
cs: Metoda, u které se neočekává vyvolání výjimek, vyvolá výjimku.
de: Eine Methode, von der keine Ausnahmen erwartet werden, löst eine Ausnahme aus.
es: Un método que no se espera que produzca excepciones inicia una excepción.
fr: Une méthode qui n'est pas censée lever d'exceptions lève une exception.
it: Un metodo che normalmente non genera eccezioni genera un'eccezione.
ja: 例外をスローすることが想定されていないメソッドが例外をスローします。
ko: 예외를 throw할 수 없는 메서드가 예외를 throw합니다.
pl: Wyjątek zgłasza metoda, od której nie oczekuje się zgłaszania wyjątków.
pt_br: Um método que não deve gerar exceções gera uma exceção.
ru: Метод, который не должен выдавать исключение, делает это.
tr: Özel durum tetiklemesi beklenmeyen bir yöntem, özel durum oluşturuyor.
zh_hans: 预计不会引发异常的方法引发了异常。
zh_hant: 應不會擲回例外狀況的方法擲回了例外狀況。

# DoNotRaiseExceptionsInUnexpectedLocationsMessagePropertyGetter
source: {0} creates an exception of type {1}, an exception type that should not be raised in a property. If this exception instance might be raised, use a different exception type, convert this property into a method, or change this property's logic so that it no longer raises an exception.
cs: {0} vytváří výjimku typu {1}, což je typ výjimky, která by neměla být ve vlastnosti vyvolána. Pokud se tato instance výjimky může vyvolat, použijte jiný typ výjimky, převeďte tuto vlastnost na metodu nebo změňte logiku této vlastnosti tak, aby už nevyvolávala výjimku.
de: "{0}" erstellt eine Ausnahme vom Typ "{1}". Dies ist ein Ausnahmetyp, der in einer Eigenschaft nicht ausgelöst werden darf. Wenn diese Ausnahmeinstanz ausgelöst werden könnte, verwenden Sie einen anderen Ausnahmetyp, konvertieren Sie diese Eigenschaft in eine Methode, oder ändern Sie die Logik dieser Eigenschaft, sodass sie keine Ausnahme mehr auslöst.
es: {0} crea una excepción de tipo {1}, que no debe producirse en una propiedad. Si puede producirse esta instancia de excepción, use un tipo de excepción diferente, convierta esta propiedad en un método o cambie la lógica de la propiedad para que deje de producir una excepción.
fr: {0} crée une exception de type {1}, un type d'exception qui ne doit pas être levé dans une propriété. Si cette instance d'exception est susceptible d'être levée, utilisez un autre type d'exception, convertissez cette propriété en méthode ou changez la logique de cette propriété pour qu'elle ne lève plus d'exception.
it: {0} crea un'eccezione di tipo {1} e tale tipo di eccezione non dovrebbe essere generato in una proprietà. Se questa istanza di eccezione può essere generata, usare un altro tipo di eccezione, convertire questa proprietà in un metodo o modificare la logica della proprietà in modo che non generi più un'eccezione.
ja: {0} は型 {1} の例外を作成します。これは、プロパティで発生させることができない例外の種類です。この例外インスタンスが発生する可能性がある場合は、別の例外の種類を使用するか、このプロパティをメソッドに変換するか、例外が発生しないようにこのプロパティのロジックを変更します。
ko: {0}이(가) 속성에서 발생하지 않아야 하는 예외 형식인 {1} 형식의 예외를 만듭니다. 이 예외 인스턴스가 발생하는 경우 예외가 더 이상 발생하지 않도록 다른 예외 형식을 사용하고 이 속성을 메서드로 변환하거나 이 속성의 논리를 변경하세요.
pl: Właściwość {0} tworzy wyjątek typu {1}, który nie powinien być zgłaszany przez właściwość. Jeśli to wystąpienie wyjątku może zostać zgłoszone, użyj innego typu wyjątku, przekonwertuj tę właściwość na metodę lub zmień logikę tej właściwości tak, aby nie zgłaszała wyjątku.
pt_br: {0} cria uma exceção do tipo {1}, um tipo de exceção que não deve ser gerado em uma propriedade. Se essa instância de exceção puder ser gerada, use um tipo de exceção diferente, converta essa propriedade em um método ou altere a lógica dessa propriedade para que ela deixe de gerar uma exceção.
ru: {0} создает исключение типа {1}, который не должен порождаться в свойстве. Если этот экземпляр исключения может быть порожден, используйте другой тип исключения, преобразуйте это свойство в метод или измените логику этого свойства, чтобы оно больше не порождало исключение.
tr: {0}, bir özellikte tetiklenmemesi gereken {1} türünde bir özel durum oluşturuyor. Bu özel durum tetiklenebilirse, farklı bir özel durum türü kullanın, bu özelliği bir yönteme dönüştürün veya bu özelliğin mantığını artık özel durum tetiklemeyecek şekilde değiştirin.
zh_hans: {0} 创建 {1} 类型的异常，该异常类型不应当在属性中引发。如果有可能会引发此异常实例，请使用其他异常类型，将该属性转换为方法，或者更改该属性的逻辑，使它不再引发异常。
zh_hant: {0} 會建立類型 {1} 的例外狀況，而這種例外狀況類型不應在屬性中引發。若可能引發此例外狀況執行個體，請使用其他例外狀況類型，將這個屬性轉換為方法，或是變更這個屬性的邏輯，使其不會再引發例外狀況。

# DoNotRaiseExceptionsInUnexpectedLocationsMessageHasAllowedExceptions
source: {0} creates an exception of type {1}, an exception type that should not be raised in this type of method. If this exception instance might be raised, either use a different exception type or change this method's logic so that it no longer raises an exception.
cs: {0} vytváří výjimku typu {1}, což je typ výjimky, která by neměla být v tomto typu metody vyvolána. Pokud se tato instance výjimky může vyvolat, buď použijte jiný typ výjimky, nebo změňte logiku této metody tak, aby už nevyvolávala výjimku.
de: "{0}" erstellt eine Ausnahme vom Typ "{1}". Dies ist ein Ausnahmetyp, der in diesem Methodentyp nicht ausgelöst werden darf. Wenn diese Ausnahmeinstanz ausgelöst werden könnte, verwenden Sie entweder einen anderen Ausnahmetyp, oder ändern Sie die Logik dieser Methode, sodass sie keine Ausnahme mehr auslöst.
es: {0} crea una excepción de tipo {1}, que no debe producirse en este tipo de método. Si puede producirse esta instancia de excepción, use un tipo de excepción diferente o cambie la lógica de este método para que deje de producir una excepción.
fr: {0} crée une exception de type {1}, un type d'exception qui ne doit pas être levé dans ce type de méthode. Si cette instance d'exception est susceptible d'être levée, utilisez un autre type d'exception ou changez la logique de cette méthode pour qu'elle ne lève plus d'exception.
it: {0} crea un'eccezione di tipo {1} e tale tipo di eccezione non dovrebbe essere generato in questo tipo di metodo. Se questa istanza di eccezione può essere generata, usare un altro tipo di eccezione o modificare la logica di questo metodo in modo che non generi più un'eccezione.
ja: {0} は型 {1} の例外を作成します。これは、この型のメソッドで発生させることができない例外の種類です。この例外インスタンスが発生する可能性がある場合は、別の例外の種類を使用するか、例外が発生しないようにこのメソッドのロジックを変更します。
ko: {0}이(가) 이 메서드의 형식에서 발생하지 않아야 하는 예외 형식인 {1} 형식의 예외를 만듭니다. 이 예외 인스턴스가 발생하는 경우 더 이상 예외가 발생하지 않도록 다른 예외 형식을 사용하거나 이 메서드의 논리를 변경하세요.
pl: Metoda {0} tworzy wyjątek typu {1}, który nie powinien być zgłaszany przez metodę tego typu. Jeśli to wystąpienie wyjątku może zostać zgłoszone, użyj innego typu wyjątku lub zmień logikę tej metody tak, aby nie zgłaszała wyjątku.
pt_br: {0} cria uma exceção do tipo {1}, um tipo de exceção que não deve ser gerado nesse tipo de método. Se essa instância de exceção puder ser gerada, use um tipo de exceção diferente ou altere a lógica desse método para que ele deixe de gerar uma exceção.
ru: {0} создает исключение типа {1}, который не должен порождаться в этом типе метода. Если этот экземпляр исключения может быть порожден, используйте другой тип исключения или измените логику этого метода, чтобы он больше не порождал исключение.
tr: {0}, bu tür bir yöntemde tetiklenmemesi gereken {1} türünde bir özel durum oluşturuyor. Bu özel durum tetiklenebilirse, farklı bir özel durum türü kullanın veya bu yöntemin mantığını artık özel durum tetiklemeyecek şekilde değiştirin.
zh_hans: {0} 创建 {1} 类型的异常，该异常类型不应当在这种类型的方法中引发。如果有可能会引发此异常实例，请使用其他异常类型，或者更改该方法的逻辑，使它不再引发异常。
zh_hant: {0} 會建立類型 {1} 的例外狀況，而這種例外狀況類型不應在此類型的方法中引發。若可能引發此例外狀況執行個體，請使用其他例外狀況類型，或是變更此方法的邏輯，使其不會再引發例外狀況。

# DoNotRaiseExceptionsInUnexpectedLocationsMessageNoAllowedExceptions
source: {0} creates an exception of type {1}. Exceptions should not be raised in this type of method. If this exception instance might be raised, change this method's logic so it no longer raises an exception.
cs: {0} vytváří výjimku typu {1}. V tomto typu metody by se neměly vyvolávat výjimky. Pokud se tato instance výjimky může vyvolat, změňte logiku této metody tak, aby už nevyvolávala výjimku.
de: "{0}" erstellt eine Ausnahme vom Typ "{1}". Ausnahmen dürfen in diesem Methodentyp nicht ausgelöst werden. Wenn diese Ausnahmeinstanz ausgelöst werden könnte, ändern Sie die Logik dieser Methode, sodass sie keine Ausnahme mehr auslöst.
es: {0} crea una excepción de tipo {1}. No se deben producir excepciones en este tipo de método. Si puede producirse esta instancia de excepción, cambie la lógica de este método para que deje de producir una excepción.
fr: {0} crée une exception de type {1}. Les exceptions ne doivent pas être levées dans ce type de méthode. Si cette instance d'exception est susceptible d'être levée, changez la logique de cette méthode pour qu'elle ne lève plus d'exception.
it: {0} crea un'eccezione di tipo {1}. Le eccezioni non dovrebbe essere generate in questo tipo di metodo. Se questa istanza di eccezione può essere generata, modificare la logica di questo metodo in modo che non generi più un'eccezione.
ja: {0} は型 {1} の例外を作成します。この型のメソッドでは例外を発生させることはできません。この例外インスタンスが発生する可能性がある場合は、例外が発生しないようにこのメソッドのロジックを変更します。
ko: {0}이(가) {1} 형식의 예외를 만듭니다. 예외는 이 메서드의 형식에서 발생하지 않아야 합니다. 이 예외 인스턴스가 발생하는 경우 더 이상 예외가 발생하지 않도록 이 메서드의 논리를 변경하세요.
pl: Metoda {0} tworzy wyjątek typu {1}. Ten typ metody nie powinien zgłaszać wyjątków. Jeśli to wystąpienie wyjątku może zostać zgłoszone, zmień logikę tej metody tak, aby nie zgłaszała wyjątku.
pt_br: {0} cria uma exceção do tipo {1}. Exceções não devem ser geradas nesse tipo de método. Se essa instância de exceção puder ser gerada, altere a lógica desse método para que ele deixe de gerar uma exceção.
ru: {0} создает исключение типа {1}. В этом типе метода не должны порождаться исключения. Если этот экземпляр исключения может быть порожден, измените логику этого метода, чтобы он больше не порождал исключение.
tr: {0}, {1} türünde bir özel durum oluşturuyor. Bu tür bir yöntemde özel durum tetiklenmemelidir. Bu özel durum tetiklenebilirse, bu yöntemin mantığını artık özel durum tetiklemeyecek şekilde değiştirin.
zh_hans: {0} 创建 {1} 类型的异常。不应在这种类型的方法中引发异常。如果有可能会引发此异常实例，请更改该方法的逻辑，使它不再引发异常。
zh_hant: {0} 會建立類型 {1} 的例外狀況。不應於此類型的方法中引發例外狀況。若可能引發此例外狀況執行個體，請變更這個方法的邏輯，使其不會再引發例外狀況。

# IdentifiersShouldNotContainUnderscoresTitle
source: Identifiers should not contain underscores
cs: Identifikátory nemají obsahovat podtržítka.
de: Bezeichner dürfen keine Unterstriche enthalten
es: Los identificadores no deben contener caracteres de subrayado
fr: Les identificateurs ne doivent pas contenir de traits de soulignement
it: Gli identificatori non devono contenere caratteri di sottolineatura
ja: 識別子はアンダースコアを含むことはできません
ko: 식별자에는 밑줄을 사용할 수 없습니다.
pl: Identyfikatory nie powinny zawierać znaków podkreślenia
pt_br: Identificadores não devem conter sublinhados
ru: Идентификаторы не должны содержать символы подчеркивания
tr: Tanımlayıcılar alt çizgi içermemelidir
zh_hans: 标识符不应包含下划线
zh_hant: 識別項不應包含底線

# IdentifiersShouldNotContainUnderscoresDescription
source: By convention, identifier names do not contain the underscore (_) character. This rule checks namespaces, types, members, and parameters.
cs: Podle dohody nemají názvy identifikátorů obsahovat znaky podtržítka (_). Toto pravidlo kontroluje názvové prostory, typy, členy a parametry.
de: Laut Konvention enthalten Bezeichnernamen keinen Unterstrich (_). Diese Regel prüft Namespaces, Typen, Member und Parameter.
es: Por convención, los nombres de identificador no contienen el carácter de subrayado (_). La regla comprueba espacios de nombres, tipos, miembros y parámetros.
fr: Par convention, les noms d'identificateurs ne contiennent pas le caractère de soulignement (_). Cette règle vérifie les espaces de noms, les types, les membres et les paramètres.
it: Per convenzione i nomi degli identificatori non contengono il carattere di sottolineatura (_). Questa regola controlla spazi dei nomi, tipi, membri e parametri.
ja: 規則により、識別子名にアンダースコア (_) 文字を含めることができません。この規則では名前空間、型、メンバー、およびパラメーターをチェックします。
ko: 규칙에 따라 식별자 이름은 밑줄(_) 문자를 포함하지 않습니다. 이 규칙은 네임스페이스, 형식, 멤버 및 매개 변수를 검사합니다.
pl: Według konwencji nazwy identyfikatorów nie powinny zawierać znaku podkreślenia (_). Ta reguła sprawdza przestrzenie nazw, typy, elementy członkowskie i parametry.
pt_br: Por convenção, os nomes de identificadores não contêm o caractere sublinhado (_). Essa regra verifica namespaces, tipos, membros e parâmetros.
ru: По соглашению имена идентификаторов не содержат символ подчеркивания (_). Это правило проверяет пространства имен, типы, члены и параметры.
tr: Kurallar gereği, tanımlayıcı adları alt çizgi (_) karakterini içermez. Bu kural ad alanlarını, türleri, üyeleri ve parametreleri denetler.
zh_hans: 按照惯例，标识符名称不包含下划线(_)字符。此规则检查命名空间、类型、成员和参数。
zh_hant: 依照慣例，識別項名稱不包含底線 (_) 字元。此規則會檢查命名空間、類型、成員與參數。

# IdentifiersShouldNotContainUnderscoresMessageAssembly
source: Remove the underscores from assembly name {0}
cs: Odeberte podtržítka z názvu sestavení {0}.
de: Entfernen Sie die Unterstriche aus dem Assemblynamen "{0}".
es: Quite los caracteres de subrayado del nombre de ensamblado {0}.
fr: Supprimez les traits de soulignement du nom d'assembly {0}
it: Rimuovere i caratteri di sottolineatura dal nome di assembly {0}
ko: 어셈블리 이름 {0}에서 밑줄을 제거하세요.
pl: Usuń znaki podkreślenia z nazwy zestawu {0}
pt_br: Remova os sublinhados do nome do assembly {0}
ru: Удалите символы подчеркивания из имени сборки {0}.
tr: {0} bütünleştirilmiş kod adından alt çizgileri kaldırın
zh_hans: 从程序集名称 {0} 中删除下划线
zh_hant: 移除組件名稱 {0} 中的底線

# IdentifiersShouldNotContainUnderscoresMessageNamespace
source: Remove the underscores from namespace name '{0}'
cs: Odeberte podtržítka z názvu názvového prostoru {0}.
de: Entfernen Sie die Unterstriche aus dem Namespacenamen "{0}".
es: Quite los caracteres de subrayado del nombre "{0}" del espacio de nombres.
fr: Supprimez les traits de soulignement du nom d'espace de noms '{0}'
it: Rimuovere i caratteri di sottolineatura dal nome di spazio dei nomi '{0}'
ko: 네임스페이스 이름 '{0}'에서 밑줄을 제거하세요.
pl: Usuń znaki podkreślenia z nazwy przestrzeni nazw „{0}”
pt_br: Remova os sublinhados do nome do namespace '{0}'
ru: Удалите символы подчеркивания из имени пространства имен "{0}".
tr: '{0}' ad alanı adından alt çizgileri kaldırın
zh_hans: 从命名空间名称“{0}”中删除下划线
zh_hant: 移除命名空間名稱 '{0}' 中的底線

# IdentifiersShouldNotContainUnderscoresMessageType
source: Remove the underscores from type name {0}
cs: Odeberte podtržítka z názvu typu {0}.
de: Entfernen Sie die Unterstriche aus dem Typnamen "{0}".
es: Quite los caracteres de subrayado del nombre de tipo {0}.
fr: Supprimez les traits de soulignement du nom de type {0}
it: Rimuovere i caratteri di sottolineatura dal nome di tipo {0}
ko: 형식 이름 {0}에서 밑줄을 제거하세요.
pl: Usuń znaki podkreślenia z nazwy typu {0}
pt_br: Remova os sublinhados do nome de tipo {0}
ru: Удалите символы подчеркивания из имени типа {0}.
tr: {0} tür adından alt çizgileri kaldırın
zh_hans: 从类型名称 {0} 中删除下划线
zh_hant: 移除型別名稱 {0} 中的底線

# IdentifiersShouldNotContainUnderscoresMessageMember
source: Remove the underscores from member name {0}
cs: Odeberte podtržítka z názvu člena {0}.
de: Entfernen Sie die Unterstriche aus dem Membernamen "{0}".
es: Quite los caracteres de subrayado del nombre de miembro {0}.
fr: Supprimez les traits de soulignement du nom de membre {0}
it: Rimuovere i caratteri di sottolineatura dal nome di membro {0}
ko: 멤버 이름 {0}에서 밑줄을 제거하세요.
pl: Usuń znaki podkreślenia z nazwy składowej {0}
pt_br: Remova os sublinhados do nome do membro {0}
ru: Удалите символы подчеркивания из имени члена {0}.
tr: {0} üye adından alt çizgileri kaldırın
zh_hans: 从成员名称 {0} 中删除下划线
zh_hant: 移除成員名稱 {0} 中的底線

# IdentifiersShouldNotContainUnderscoresMessageTypeTypeParameter
source: On type {0}, remove the underscores from generic type parameter name {1}
cs: U typu {0} odeberte podtržítka z názvu parametru obecného typu {1}.
de: Entfernen Sie im Typ "{0}" die Unterstriche aus dem Namen des generischen Typparameters ({1}).
es: En el tipo {0}, quite los caracteres de subrayado del nombre de parámetro de tipo genérico {1}.
fr: Dans le type {0}, supprimez les traits de soulignement du nom de paramètre de type générique {1}
it: Nel tipo {0} rimuovere i caratteri di sottolineatura dal nome di parametro di tipo generico {1}
ko: {0} 형식의 제네릭 형식 매개 변수 이름 {1}에서 밑줄을 제거하세요.
pl: W typie {0} usuń znaki podkreślenia z nazwy parametru typu ogólnego {1}
pt_br: No tipo {0}, remova os sublinhados do nome de parâmetro de tipo genérico {1}
ru: В типе {0} удалите символы подчеркивания из имени параметра универсального типа {1}.
tr: {0} türünde, {1} genel tür parametre adından alt çizgileri kaldırın
zh_hans: 在类型 {0} 上，从泛型类型参数名称 {1} 中删除下划线
zh_hant: 在型別 {0} 上，移除泛型型別參數名稱 {1} 中的底線
