Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ValidateArgumentsOfPublicMethodsMessage
source: In externally visible method '{0}', validate parameter '{1}' is non-null before using it. If appropriate, throw an 'ArgumentNullException' when the argument is 'null'.
cs: Dříve, než v externě viditelné metodě {0} použijete parametr {1}, ověřte, že tento parametr není null. V případě potřeby vyvolejte ArgumentNullException, když je argument null.
de: Validieren Sie in der extern sichtbaren Methode „{0}“, dass der Parameter "{1}" ungleich NULL ist, bevor Sie ihn verwenden. Lösen Sie gegebenenfalls eine „ArgumentNullException“ aus, wenn das Argument NULL ist.
es: En el método "{0}" visible externamente, valide que el parámetro "{1}" no sea nulo antes de usarlo. Si procede, inicie una excepción "ArgumentNullException" cuando el argumento sea "nulo".
fr: Dans la méthode « {0} » visible de manière externe, vérifiez que le paramètre '{1}' a une valeur non null avant de l'utiliser. Le cas échéant, ArgumentNullException doit être levé quand l'argument a une valeur « null ».
it: Nel metodo visibile esternamente '{0}' convalidare il parametro '{1}' in modo che non sia Null prima di usarlo. Se appropriato, generare un'eccezione 'ArgumentNullException' quando l'argomento è 'null'.
ko: 외부에 표시되는 메서드 '{0}'에서 사용 전에 '{1}' 매개 변수가 null이 아닌지 확인합니다. 해당하는 경우 인수가 'null'이면 'ArgumentNullException'을 throw합니다.
pl: W widocznej zewnętrznie metodzie „{0}” przed użyciem sprawdź, czy parametr „{1}” nie ma wartości null. W razie potrzeby zgłoś wyjątek „ArgumentNullException”, gdy argument ma wartość „null”.
pt_br: No método visível externamente '{0}', validar o parâmetro '{1}' é não nulo antes de usá-lo. Se apropriado, lance um 'ArgumentNullException' quando o argumento for 'nulo'.
ru: В видимом извне методе "{0}" перед использованием параметра "{1}" нужно убедиться, что его значение отличается от NULL. При необходимости следует вызвать исключение ArgumentNullException, если аргумент равен NULL.
tr: Dışarıdan görünen '{0}' metodunda '{1}' parametresini kullanmadan önce parametrenin null olmadığını doğrulayın. Uygunsa bağımsız değişken null olduğunda bir ‘ArgumentNullException’ oluşturun.
zh_hans: 在外部可见的方法 "{0}" 中，在使用验证参数 "{1}" 之前，它为非 null。如果适用，请在参数为 "null" 时引发 "ArgumentNullException"。
zh_hant: 在外部可見方法 '{0}' 中，驗證參數 '{1}' 在使用前會是非 null。若可行的話，當引數為 'null' 時請擲回 'ArgumentNullException'。

# ValidateArgumentsOfPublicMethodsTitle
source: Validate arguments of public methods
cs: Ověřte argumenty veřejných metod
de: Argumente von öffentlichen Methoden validieren
es: Validar argumentos de métodos públicos
fr: Valider les arguments de méthodes publiques
it: Convalidare gli argomenti di metodi pubblici
ja: パブリック メソッドの引数の検証
ko: public 메서드의 인수에 대한 유효성을 검사하세요.
pl: Waliduj argumenty metod publicznych
pt_br: Validar argumentos de métodos públicos
ru: Проверить аргументы или открытые методы
tr: Genel yöntemlerin bağımsız değişkenlerini doğrulayın
zh_hans: 验证公共方法的参数
zh_hant: 必須驗證公用方法的引數

# AssigningSymbolAndItsMemberInSameStatementTitle
source: Assigning symbol and its member in the same statement.
ja: 同じステートメントにシンボルとそのメンバーを割り当てています。

# AvoidAsyncVoidTitle
source: Avoid Async Void
ja: Async Void を使用しないでください

# AvoidAsyncVoidMessage
source: Avoid Async Void
ja: Async Void を使用しないでください

# AsyncMethodNamesShouldEndInAsyncTitle
source: Async Method Names Should End in Async
ja: 非同期メソッド名は Async で終わる必要があります

# AsyncMethodNamesShouldEndInAsyncMessage
source: Async Method Names Should End in Async
ja: 非同期メソッド名は Async で終わる必要があります

# AvoidOutParametersMessage
source: Avoid 'out' parameters as they are not designed for general audience.
ja: 一般向けに設計されていないため、'out' パラメーターは使用しないでください。

# DoNotCatchGeneralExceptionTypesMessage
source: Modify '{0}' to catch a more specific allowed exception type, or rethrow the exception.
ja: '{0}' を変更して特定の許可された例外の種類をさらにキャッチするか、例外を再スローします。

# DoNotPassAsyncLambdasAsVoidReturningDelegateTypesTitle
source: Don't Pass Async Lambdas as Void Returning Delegate Types
ja: デリゲート型を返す Void として非同期ラムダを渡さないでください

# DoNotPassAsyncLambdasAsVoidReturningDelegateTypesMessage
source: Don't Pass Async Lambdas as Void Returning Delegate Types
ja: デリゲート型を返す Void として非同期ラムダを渡さないでください

# DoNotPrefixEnumValuesWithTypeNameMessage
source: Do not prefix enum values with the name of the enum type '{0}'.
ja: 列挙値の前に列挙型 '{0}' の名前を付けないでください。

# DoNotStoreAsyncLambdasAsVoidReturningDelegateTypesTitle
source: Don't Store Async Lambdas as Void Returning Delegate Types
ja: デリゲート型を返す Void として非同期ラムダを格納しないでください

# DoNotStoreAsyncLambdasAsVoidReturningDelegateTypesMessage
source: Don't Store Async Lambdas as Void Returning Delegate Types
ja: デリゲート型を返す Void として非同期ラムダを格納しないでください

# EnumShouldNotHaveDuplicatedValuesMessageDuplicatedBitwiseValuePart
source: The field reference '{0}' is duplicated in this bitwise initialization.
ja: フィールド参照 '{0}' は、このビット単位の初期化で重複しています。

# EnumShouldNotHaveDuplicatedValuesMessageDuplicatedValue
source: The enum member '{0}' has the same constant value '{1}' as member '{2}'.
ja: 列挙型メンバー '{0}' の定数値 '{1}' がメンバー '{2}' と同じです。

# PropagateCancellationTokensWhenPossibleTitle
source: Propagate CancellationTokens When Possible
ja: 可能な場合は CancellationToken を伝達してください

# PropagateCancellationTokensWhenPossibleMessage
source: Propagate CancellationTokens When Possible
ja: 可能な場合は CancellationToken を伝達してください

# DoNotMixBlockingAndAsyncTitle
source: Don't Mix Blocking and Async
ja: ブロッキングと非同期を組み合わせないでください

# DoNotMixBlockingAndAsyncMessage
source: Don't Mix Blocking and Async
ja: ブロッキングと非同期を組み合わせないでください

# EnumsShouldHaveZeroValueMessageFlagsRename
source: In enum {0}, change the name of {1} to 'None'.
ja: 列挙型 {0} では、{1} の名前を 'None' に変更してください。

# EnumsShouldHaveZeroValueMessageFlagsMultipleZeros
source: Remove all members that have the value zero from {0} except for one member that is named 'None'.
ja: 'None' という名前の 1 つのメンバーを除き、値 0 を含むすべてのメンバーを {0} から削除します。

# EnumsShouldHaveZeroValueMessageNotFlagsNoZeroValue
source: Add a member to {0} that has a value of zero with a suggested name of 'None'.
ja: 提案された名前 'None' を伴う、値 0 を含む {0} にメンバーを追加します。

# AbstractTypesShouldNotHaveConstructorsTitle
source: Abstract types should not have constructors
ja: 抽象型はコンストラクターを含むことはできません

# AbstractTypesShouldNotHaveConstructorsMessage
source: Abstract type {0} should not have constructors
ja: 抽象型 {0} はコンストラクターを含むことはできません

# MarkAssembliesWithComVisibleMessageNoAttribute
source: Because {0} exposes externally visible types, mark it with ComVisible(false) at the assembly level and then mark all types within the assembly that should be exposed to COM clients with ComVisible(true).
ja: {0} は外部から参照可能な型を公開するため、アセンブリ レベルで ComVisible(false) に設定し、COM クライアントに公開する必要があるアセンブリ内のすべての型を ComVisible(true) に設定します。

# MarkAssembliesWithComVisibleMessageAttributeTrue
source: Consider changing the ComVisible attribute on {0} to false, and opting in at the type level.
ja: {0} の ComVisible 属性を false に変更してから、各型レベルで調節することを検討してください。

# MarkAttributesWithAttributeUsageDescription
source: When you define a custom attribute, mark it by using AttributeUsageAttribute to indicate where in the source code the custom attribute can be applied. The meaning and intended usage of an attribute will determine its valid locations in code.
ja: カスタム属性を定義する場合、AttributeUsageAttribute を使用して、ソース コード内でカスタム属性を適用できる位置を示すように設定します。属性の意味と用途により、コード内での有効な位置が決まります。

# MarkAttributesWithAttributeUsageMessageDefault
source: Specify AttributeUsage on {0}.
ja: AttributeUsage を {0} で指定します。

# MarkAttributesWithAttributeUsageMessageInherited
source: Even though attribute {0} inherits AttributeUsage from its base type, you should consider explicitly specifying AttributeUsage on the type to improve code readability and documentation.
ja: 属性 {0} がその基本データ型から AttributeUsage を継承した場合でも、コードの読みやすさ、ドキュメントを改善するために、AttributeUsage をその型で明示的に指定することを検討してください。

# DefineAccessorsForAttributeArgumentsDescription
source: Attributes can define mandatory arguments that must be specified when you apply the attribute to a target. These are also known as positional arguments because they are supplied to attribute constructors as positional parameters. For every mandatory argument, the attribute should also provide a corresponding read-only property so that the value of the argument can be retrieved at execution time. Attributes can also define optional arguments, which are also known as named arguments. These arguments are supplied to attribute constructors by name and should have a corresponding read/write property.
ja: 属性は、対象に適用するときに指定する必要のある必須の引数を定義できます。これらは、属性コンストラクターに位置指定パラメーターとして指定されるため、位置指定引数とも呼ばれます。必須の属性ごとに、属性は、引数の値を実行時に取得できるように、対応する読み取り専用プロパティも提供する必要があります。また、属性は省略可能な引数も定義できます。これは名前付き引数とも呼ばれます。これらの引数は、名前で属性コンストラクターに指定され、対応する読み取り/書き込みプロパティが必要です。

# DefineAccessorsForAttributeArgumentsMessageDefault
source: Add a public read-only property accessor for positional argument {0} of Attribute {1}.
ja: 属性 {1} の位置引数 {0} 用にパブリックな読み取り専用プロパティ アクセサーを追加します。

# DefineAccessorsForAttributeArgumentsMessageRemoveSetter
source: Remove the property setter from {0} or reduce its accessibility because it corresponds to positional argument {1}.
ja: プロパティ set アクセス操作子が位置引数 {1} に対応しているため、これを {0} から削除するか、アクセシビリティを下げてください。

# DefineAccessorsForAttributeArgumentsMessageIncreaseVisibility
source: If {0} is the property accessor for positional argument {1}, make it public.
ja: {0} が位置引数 {1} のプロパティ アクセサーである場合は、パブリックにしてください。

# InterfaceMethodsShouldBeCallableByChildTypesMessage
source: Make '{0}' sealed (a breaking change if this class has previously shipped), implement the method non-explicitly, or implement a new method that exposes the functionality of '{1}' and is visible to derived classes.
ja: '{0}' をシールドにするか (このクラスが以前に出荷されている場合は重大な変更)、メソッドを非明示的に実装するか、'{1}' の機能を公開して派生クラスに表示される新しいメソッドを実装します。

# OverrideMethodsOnComparableTypesMessageEquals
source: {0} should override Equals since it implements IComparable.
ja: {0} は、IComparable を実装しているため、Equals をオーバーライドしなければなりません。

# OverrideMethodsOnComparableTypesMessageOperator
source: {0} should define operator(s) '{1}' since it implements IComparable.
ja: {0} は、IComparable を実装しているため、演算子 '{1}' を定義しなければなりません。

# IdentifiersShouldDifferByMoreThanCaseMessage
source: Names of '{0}' and '{1}' should differ by more than case.
ja: 名前 '{0}' および '{1}' は、大文字と小文字の区別以外にも相違させる必要があります。

# IdentifiersShouldHaveCorrectPrefixMessageInterface
source: Prefix interface name {0} with 'I'.
ja: インターフェイス名 {0} にプレフィックスとして 'I' を指定します。

# IdentifiersShouldHaveCorrectPrefixMessageTypeParameter
source: Prefix generic type parameter name {0} with 'T'.
ja: ジェネリック型パラメーター名 {0} にプレフィックスとして 'T' を指定します。

# OperatorOverloadsHaveNamedAlternatesMessageDefault
source: Provide a method named '{0}' as a friendly alternate for operator {1}.
ja: '{0}' という名前のメソッドを演算子 {1} の代替として指定します。

# OperatorOverloadsHaveNamedAlternatesMessageProperty
source: Provide a property named '{0}' as a friendly alternate for operator {1}.
ja: '{0}' という名前のプロパティを演算子 {1} の代替として指定します。

# OperatorOverloadsHaveNamedAlternatesMessageMultiple
source: Provide a method named '{0}' or '{1}' as an alternate for operator {2}.
ja: '{0}' または '{1}' という名前のメソッドを演算子 {2} の代替として指定します。

# OperatorOverloadsHaveNamedAlternatesMessageVisibility
source: Mark {0} as public because it is a friendly alternate for operator {1}.
ja: 演算子 {1} の代替であるため {0} をパブリックに設定します。

# OperatorsShouldHaveSymmetricalOverloadsMessage
source: Operators should have symmetrical overloads
ja: 演算子は対称型オーバーロードを含まなければなりません

# CollectionPropertiesShouldBeReadOnlyMessage
source: Change '{0}' to be read-only by removing the property setter.
ja: プロパティ set アクセス操作子を削除して '{0}' を読み取り専用に変更します。

# OverloadOperatorEqualsOnOverridingValueTypeEqualsDescription
source: In most programming languages there is no default implementation of the equality operator (==) for value types. If your programming language supports operator overloads, you should consider implementing the equality operator. Its behavior should be identical to that of Equals
ja: ほとんどのプログラミング言語では、値型に対する等値演算子 (==) の既定の実装がありません。プログラミング言語で演算子のオーバーロードがサポートされている場合は、等値演算子の実装を検討してください。その動作は、Equals の動作と同じである必要があります

# OverloadOperatorEqualsOnOverridingValueTypeEqualsMessage
source: Overload operator equals on overriding value type Equals
ja: 値型 Equals のオーバーライドで、演算子 equals をオーバーロードします

# PassSystemUriObjectsInsteadOfStringsMessage
source: Modify '{0}' to call '{1}' instead of '{2}'.
ja: '{2}' ではなく '{1}' を呼び出すように '{0}' を変更します。

# ImplementIEquatableWhenOverridingObjectEqualsTitle
source: Type {0} should implement IEquatable<T> because it overrides Equals
ja: 型 {0} は Equals をオーバーライドするため、IEquatable<T> を実装する必要があります

# ImplementIEquatableWhenOverridingObjectEqualsMessage
source: Implement IEquatable when overriding Object.Equals
ja: Object.Equals をオーバーライドする際に IEquatable を実装します

# ConstructorMakeNoninheritableBaseClassInheritableTitle
source: Constructor make noninheritable base class inheritable
ja: コンストラクターにより、継承不可能な基底クラスが継承可能になります

# ConstructorMakeNoninheritableBaseClassInheritableDescription
source: When a base class is noninheritable because its constructor is internal, a derived class should not make it inheritable by having a public or protected constructor.
ja: コンストラクターが内部であるために基底クラスが継承不可能な場合は、派生クラスは、パブリック コンストラクターまたは保護されたコンストラクターを設定して基底クラスを継承可能にしないでください。

# ConstructorMakeNoninheritableBaseClassInheritableMessage
source: Constructor make noninheritable base class inheritable
ja: コンストラクターにより、継承不可能な基底クラスが継承可能になります

# AddAssemblyLevelComVisibleFalse
source: Because {0} exposes externally visible types, mark it with ComVisible(false) at the assembly level and then mark all types within the assembly that should be exposed to COM clients with ComVisible(true).
ja: {0} は外部から参照可能な型を公開するため、アセンブリ レベルで ComVisible(false) に設定し、COM クライアントに公開する必要があるアセンブリ内のすべての型を ComVisible(true) に設定します。

# ChangeAssemblyLevelComVisibleToFalse
source: Consider changing the ComVisible attribute on {0} to false, and opting in at the type level.
ja: {0} の ComVisible 属性を false に変更してから、各型レベルで調節することを検討してください。

# EnumStorageShouldBeInt32Message
source: If possible, make the underlying type of {0} System.Int32 instead of {1}.
ja: 可能な場合は、基になる型 {0} を {1} ではなく System.Int32 にしてください。

# UseEventsWhereAppropriateMessage
source: Consider making '{0}' an event.
ja: '{0}' をイベントにすることを検討してください。

# ImplementStandardExceptionConstructorsMessageMissingConstructor
source: Add the following constructor to {0}: {1}.
ja: 次のコンストラクターを {0} に追加します: {1}。

# ImplementStandardExceptionConstructorsMessageAccessibility
source: Change the accessibility of {0} to {1}.
ja: {0} のアクセシビリティを {1} に変更します。

# PropertiesShouldNotBeWriteOnlyMessageAddGetter
source: Because property {0} is write-only, either add a property getter with an accessibility that is greater than or equal to its setter or convert this property into a method.
ja: プロパティ {0} は書き込み専用であるため、アクセシビリティがプロパティ セッター以上のプロパティ ゲッターを追加するか、このプロパティをメソッドに変換してください。

# PropertiesShouldNotBeWriteOnlyMessageMakeMoreAccessible
source: Because the property getter for {0} is less visible than its setter, either increase the accessibility of its getter or decrease the accessibility of its setter.
ja: {0} のプロパティ ゲッターがプロパティ セッターよりも参照範囲が小さいため、ゲッターのアクセシビリティを上げるか、セッターのアクセシビリティを下げてください。

# UriParametersShouldNotBeStringsTitle
source: Uri parameters should not be strings
ja: URI パラメーターを文字列にすることはできません

# UriParametersShouldNotBeStringsDescription
source: If a method takes a string representation of a URI, a corresponding overload should be provided that takes an instance of the URI class, which provides these services in a safe and secure manner.
ja: メソッドで URI の文字列表現を使用する場合、URI クラスのインスタンスを取得する、対応するオーバーロードを指定する必要があります。これにより、安全な方法でこれらのサービスが提供されます。

# UriParametersShouldNotBeStringsMessage
source: Change the type of parameter {0} of method {1} from string to System.Uri, or provide an overload to {1} that allows {0} to be passed as a System.Uri object.
ja: メソッド {1} のパラメーター {0} の型を文字列から System.Uri に変更するか、または {1} のオーバーロードを指定してください。そうすると、{0} を System.Uri オブジェクトとして渡すことができます。

# UriReturnValuesShouldNotBeStringsTitle
source: Uri return values should not be strings
ja: URI 戻り値を文字列にすることはできません

# UriReturnValuesShouldNotBeStringsMessage
source: Change the return type of method {0} from string to System.Uri.
ja: メソッド {0} の戻り値の型を文字列から System.Uri に変更してください。

# UriPropertiesShouldNotBeStringsTitle
source: Uri properties should not be strings
ja: URI プロパティを文字列にすることはできません

# UriPropertiesShouldNotBeStringsMessage
source: Change the type of property {0} from string to System.Uri.
ja: プロパティ {0} の型を文字列から System.Uri に変更してください。

# ImplementIDisposableCorrectlyMessageIDisposableReimplementation
source: Remove IDisposable from the list of interfaces implemented by '{0}' as it is already implemented by base type '{1}'.
ja: '{0}' によって実行されたインターフェイスの一覧から IDisposable を削除します。基本型 '{1}' によって既に実装されているためです。

# ImplementIDisposableCorrectlyMessageDisposeOverride
source: Remove '{0}', override Dispose(bool disposing), and put the dispose logic in the code path where 'disposing' is true.
ja: '{0}' を削除し、Dispose(bool disposing) をオーバーライドします。その後、'disposing' が true のコード パスで dispose 論理を配置します。

# ImplementIDisposableCorrectlyMessageDisposeSignature
source: Ensure that '{0}' is declared as public and sealed.
ja: '{0}' が public および sealed.として宣言されていることを確認します。

# ImplementIDisposableCorrectlyMessageRenameDispose
source: Rename '{0}' to 'Dispose' and ensure that it is declared as public and sealed.
ja: 名前を '{0}' から 'Dispose' に変更し、public および sealed として宣言されていることを確認します。

# ImplementIDisposableCorrectlyMessageDisposeBoolSignature
source: Ensure that '{0}' is declared as protected, virtual, and unsealed.
ja: '{0}' が protected、virtual、unsealed として宣言されていることを確認します。

# ImplementIDisposableCorrectlyMessageDisposeImplementation
source: Modify '{0}' so that it calls Dispose(true), then calls GC.SuppressFinalize on the current object instance ('this' or 'Me' in Visual Basic), and then returns.
ja: '{0}' を変更し、Dispose(true) を呼び出したのちに現在のオブジェクト インスタンスで GC.SuppressFinalize (Visual Basic の 'this' または 'Me') を呼び出して、結果を戻すようにします。

# ImplementIDisposableCorrectlyMessageFinalizeImplementation
source: Modify '{0}' so that it calls Dispose(false) and then returns.
ja: '{0}' を変更し、Dispose(false) を呼び出して結果を返すようにします。

# IdentifiersShouldNotContainUnderscoresMessageAssembly
source: Remove the underscores from assembly name {0}.
ja: アンダースコアをアセンブリ名 {0} から削除してください。

# IdentifiersShouldNotContainUnderscoresMessageNamespace
source: Remove the underscores from namespace name '{0}'.
ja: アンダースコアを名前空間 '{0}' から削除してください。

# IdentifiersShouldNotContainUnderscoresMessageType
source: Remove the underscores from type name {0}.
ja: アンダースコアを型名 {0} から削除してください。

# IdentifiersShouldNotContainUnderscoresMessageMember
source: Remove the underscores from member name {0}.
ja: アンダースコアをメンバー名 {0} から削除してください。

# IdentifiersShouldNotContainUnderscoresMessageTypeTypeParameter
source: On type {0}, remove the underscores from generic type parameter name {1}.
ja: 型 {0} で、アンダースコアをジェネリック型パラメーター名 {1} から削除してください。

# IdentifiersShouldNotContainUnderscoresMessageMethodTypeParameter
source: On method {0}, remove the underscores from generic type parameter name {1}.
ja: メソッド {0} で、アンダースコアをジェネリック型パラメーター名 {1} から削除してください。

# IdentifiersShouldNotContainUnderscoresMessageMemberParameter
source: In member {0}, remove the underscores from parameter name {1}.
ja: メンバー {0} で、アンダースコアをパラメーター名 {1} から削除してください。

# IdentifiersShouldNotContainUnderscoresMessageDelegateParameter
source: In delegate {0}, remove the underscores from parameter name {1}.
ja: デリゲート {0} で、アンダースコアをパラメーター名 {1} から削除してください。

# IdentifiersShouldHaveCorrectSuffixMessageDefault
source: Rename {0} to end in '{1}'.
ja: {0} の名前が '{1}' で終わるように変更します。

# IdentifiersShouldHaveCorrectSuffixMessageSpecialCollection
source: Rename {0} to end in either 'Collection' or '{1}'.
ja: {0} の名前が 'Collection' または '{1}' で終わるように変更します。

# IdentifiersShouldNotHaveIncorrectSuffixMessageTypeNoAlternate
source: Rename type name {0} so that it does not end in '{1}'.
ja: 型名 '{0}' が '{1}' で終わらないように変更します。

# IdentifiersShouldNotHaveIncorrectSuffixMessageMemberNewerVersion
source: Either replace the suffix '{0}' in member name {1} with the suggested numeric alternate '2' or provide a more meaningful suffix that distinguishes it from the member it replaces.
ja: メンバー名 '{1}' のサフィックス '{0}' を推奨される数値 '2' で置き換えるか、意味のあるサフィックスを指定して置き換えるメンバーと区別してください。

# IdentifiersShouldNotHaveIncorrectSuffixMessageTypeNewerVersion
source: Either replace the suffix '{0}' in type name {1} with the suggested numeric alternate '2' or provide a more meaningful suffix that distinguishes it from the type it replaces.
ja: 型名 '{1}' のサフィックス '{0}' を推奨される数値 '2' で置き換えるか、意味のあるサフィックスを指定して置き換える型と区別してください。

# IdentifiersShouldNotHaveIncorrectSuffixMessageMemberWithAlternate
source: Either replace the suffix '{0}' in member name '{1}' with the suggested alternate '{2}' or remove the suffix completely.
ja: メンバー名 '{1}' のサフィックス '{0}' を推奨される '{2}' で置き換えるか、サフィックスをすべて削除してください。

# FlagsEnumsShouldHavePluralNamesTitle
source: Flags enums should have plural names
ja: フラグ列挙型は、複数形の名前を含んでいなければなりません

# FlagsEnumsShouldHavePluralNamesDescription
source: A public enumeration has the System.FlagsAttribute attribute, and its name does not end in ""s"". Types that are marked by using FlagsAttribute have names that are plural because the attribute indicates that more than one value can be specified.
ja: パブリック列挙型に System.FlagsAttribute 属性があり、その名前の末尾に ""s"" がありません。FlagsAttribute を使用してマークされた型には複数形の名前が付きます。これは、この属性に複数の値を指定できることを示すためです。

# FlagsEnumsShouldHavePluralNamesMessage
source: Flags enums should have plural names
ja: フラグ列挙型は、複数形の名前を含んでいなければなりません

# OnlyFlagsEnumsShouldHavePluralNamesTitle
source: Only FlagsAttribute enums should have plural names
ja: FlagsAttribute 列挙型のみが複数形の名前を含んでいなければなりません

# OnlyFlagsEnumsShouldHavePluralNamesDescription
source: Naming conventions dictate that a plural name for an enumeration indicates that more than one value of the enumeration can be specified at the same time.
ja: 名前付け規則では、列挙型の複数形の名前は同時に複数の列挙型を指定できることを意味します。

# OnlyFlagsEnumsShouldHavePluralNamesMessage
source: Only FlagsAttribute enums should have plural names
ja: FlagsAttribute 列挙型のみが複数形の名前を含んでいなければなりません

# ParameterNamesShouldMatchBaseDeclarationMessage
source: In member {0}, change parameter name {1} to {2} in order to match the identifier as it has been declared in {3}.
ja: {3} で宣言されている識別子と一致するように、メンバー {0} のパラメーター名 {1} を {2} に変更します。

# UsePreferredTermsTitle
source: Use preferred terms
ja: 適切な用語を使用します

# UsePreferredTermsDescription
source: The name of an externally visible identifier includes a term for which an alternative, preferred term exists. Alternatively, the name includes the term ""Flag"" or ""Flags"".
ja: 外部から参照可能な識別子の名前には、代わりとなる適切な用語が存在する用語が含まれています。または、名前に ""Flag"" または ""Flags"" という語が含まれています。

# UsePreferredTermsMessageAssembly
source: Replace the term '{0}' in assembly name {1} with the preferred alternate '{2}'.
ja: アセンブリ名 {1} の用語 '{0}' を適切な用語 '{2}' に置き換えます。

# UsePreferredTermsMessageNamespace
source: Replace the term '{0}' in namespace name '{1}' with the preferred alternate '{2}'.
ja: 名前空間の名前 '{1}' の用語 '{0}' を適切な用語 '{2}' に置き換えます。

# UsePreferredTermsMessageMemberParameter
source: In member {0}, replace the term '{1}' in parameter name {2} with the preferred alternate '{3}'.
ja: メンバー {0} で、パラメーター名 {2} の用語 '{1}' を適切な用語 '{3}' に置き換えます。

# UsePreferredTermsMessageDelegateParameter
source: In delegate {0}, replace the term '{1}' in parameter name {2} with the preferred alternate '{3}'.
ja: デリゲート {0} で、パラメーター名 {2} の用語 '{1}' を適切な用語 '{3}' に置き換えます。
