Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AvoidUsingCrefTagsWithAPrefixDescription
source: Use of cref tags with prefixes should be avoided, since it prevents the compiler from verifying references and the IDE from updating references during refactorings. It is permissible to suppress this error at a single documentation site if the cref must use a prefix because the type being mentioned is not findable by the compiler. For example, if a cref is mentioning a special attribute in the full framework but you're in a file that compiles against the portable framework, or if you want to reference a type at higher layer of Roslyn, you should suppress the error. You should not suppress the error just because you want to take a shortcut and avoid using the full syntax.
cs: Značky cref s předponami byste neměli používat, protože brání kompilátoru v ověření odkazů a integrovanému vývojovému prostředí (IDE) v aktualizaci odkazů při refaktoringu. Pokud je nutné značku cref použít s předponou, protože kompilátor nemůže vyhledat zmiňovaný typ, můžete tuto chybu potlačit na jednom webu s dokumentací. Pokud například značka cref zmiňuje speciální atribut v plné verzi prostředí, ale vy jste v souboru, který se kompiluje proti přenosnému prostředí, nebo pokud chcete odkazovat na typ na vyšší vrstvě Roslynu, měli byste tuto chybu potlačit. Chybu byste neměli potlačovat jenom z důvodu, že si chcete ušetřit práci a vyhnout se použití úplné syntaxe.
de: Die Verwendung von cref-Tags mit Präfixen sollte vermieden werden, weil sie verhindern, dass der Compiler Verweise überprüft und dass die IDE während des Refactorings Verweise aktualisiert. Dieser Fehler darf an einem einzigen Dokumentationsstandort unterdrückt werden, wenn das cref-Tag ein Präfix verwenden muss, weil der erwähnte Typ vom Compiler nicht gefunden werden kann. Wenn ein cref-Tag beispielsweise ein bestimmtes Attribut in einem vollständigen Framework erwähnt, Sie sich jedoch in einer Datei befinden, die anhand des portierbaren Frameworks kompiliert wird, oder wenn Sie auf einen Typ in einer höheren Roslyn-Schicht verweisen möchten, sollten Sie den Fehler unterdrücken. Allerdings sollten Sie den Fehler nicht unterdrücken, weil Sie den Vorgang abkürzen und nicht die vollständige Syntax verwenden möchten.
es: Se debe evitar el uso de etiquetas cref con prefijos, dado que impide al compilador verificar las referencias y al IDE actualizar las referencias durante las refactorizaciones. Se permite suprimir este error en un solo sitio de documentación si cref debe usar un prefijo porque el compilador no puede encontrar el tipo mencionado. Por ejemplo, si el atributo cref menciona un atributo especial en el marco completo pero el usuario se encuentra en un archivo que compila en relación con el marco portable, o si se desea hacer referencia a un tipo en el nivel superior de Roslyn, se debe suprimir el error. No se debe suprimir el error solo por tomar un camino más corto y evitar el uso de la sintaxis completa.
fr: Vous devez éviter d'utiliser des balises cref avec des préfixes, car cela empêche le compilateur de vérifier les références. De plus, l'IDE ne peut pas mettre à jour ces références durant les refactorisations. Il est permis de supprimer cette erreur sur un site de documentation unique, si le cref doit utiliser un préfixe, car le type mentionné est introuvable par le compilateur. Par exemple, si un cref mentionne un attribut spécial dans le framework complet mais que vous êtes dans un fichier compilé sur le framework portable, ou si vous souhaitez référencer un type sur une couche supérieure de Roslyn, vous devez supprimer l'erreur. Ne supprimez pas l'erreur juste pour aller plus vite et éviter d'utiliser la syntaxe complète.
it: È opportuno evitare di usare tag cref con prefissi perché impediscono al compilatore di verificare i riferimenti e all'IDE di aggiornare i riferimenti durante i refactoring. È consentito eliminare questo errore in un singolo sito di documentazione se il tag cref deve usare un prefisso perché il tipo menzionato non è individuabile dal compilatore. Se ad esempio un tag cref menziona uno speciale attributo nel framework completo ma ci si trova in un file che viene compilato con il framework portabile o si vuole fare riferimento a un tipo a un livello superiore di Roslyn, è opportuno eliminare questo errore. È opportuno non eliminare questo errore solo perché si vuole prendere una scorciatoia ed evitare di usare la sintassi completa.
ja: cref タグをプレフィックスと共に使用しないでください。リファクタリング中に、コンパイラが参照を検証したり、IDE が参照を更新したりできなくなります。指定されている型をコンパイラが検出できないことが原因で cref でプレフィックスを使用する必要がある場合は、単一のドキュメント サイトでこのエラーを抑制することは許容されます。たとえば、cref に完全なフレームワークの特殊な属性を指定している一方で、移植可能なフレームワークを対象にコンパイルするファイルを使用している場合や、Roslyn の上位レイヤーの型を参照する場合は、このエラーが表示されないようにする必要があります。完全な構文の使用を避けて手軽な方法を使用したいというだけの理由でこのエラーが表示されないようにしないでください。
ko: 컴파일러에서 참조를 확인할 수 없으며 IDE에서 리팩터링하는 동안 참조를 업데이트할 수 없으므로 cref 태그와 접두사를 함께 사용하지 않아야 합니다. 언급된 형식을 컴파일러에서 찾을 수 없어 cref 태그와 접두사를 함께 사용해야 하는 경우 단일 문서 사이트에서 이 오류를 표시하지 않을 수 있습니다. 예를 들어 cref가 전체 프레임워크에서 특수한 특성을 언급하고 있지만, 사용자가 이식 가능한 프레임워크에 대해 컴파일하는 파일을 사용 중이거나 Roslyn의 상위 레이어에서 형식을 참조하려는 경우 이 오류를 무시해야 합니다. 작업을 빠르고 쉽게 완료하기 위해 전체 구문을 사용하지 않으려는 의도로 이 오류를 무시할 수는 없습니다.
pl: Należy unikać korzystania z tagów cref z prefiksami, ponieważ uniemożliwia to weryfikowanie odwołań przez kompilator oraz aktualizowanie odwołań przez środowisko IDE podczas refaktoryzacji. Można pominąć ten błąd w jednej witrynie dokumentacji, jeśli tag cref wymaga użycia prefiksu, ponieważ kompilator nie może odnaleźć wspomnianego typu. Jeśli na przykład w tagu cref podano specjalny atrybut w pełnej platformie, ale korzystasz z pliku kompilowanego w platformie przenośnej lub chcesz odwołać się do typu w wyższej warstwie programu Roslyn, należy pominąć ten błąd. Nie należy pomijać błędu, aby ułatwić sobie pracę i uniknąć użycia pełnej składni.
pt_br: Deve-se evitar usar marcas cref com prefixos, pois isso impede o compilador de verificar as referências e o IDE de atualizar as referências durante as refatorações. É permitido suprimir este erro em um único site de documentação se o cref deve usar um prefixo devido ao tipo que está sendo mencionado não ser localizável pelo compilador. Por exemplo, se um cref estiver mencionando um atributo especial na estrutura completa, mas você estiver em um arquivo compilado com relação à estrutura portátil ou desejar referenciar um tipo em uma camada maior do Roslyn, você deverá suprimir o erro. Você não deve suprimir o erro só porque você deseja pegar um atalho e evitar usar a sintaxe completa.
ru: Теги cref не следует использовать в префиксах, так как это мешает компилятору проверить ссылки, а интегрированной среде разработки — обновить их во время рефакторинга. Эту ошибку можно скрыть на отдельном сайте документации, если для cref нужен префикс, так как упомянутый тип не может быть найден компилятором. Например, если cref упоминает специальный атрибут в полной платформе, но вы работаете с файлом, который компилируется для переносимой платформы, или хотите сослаться на тип на более высоком уровне Roslyn, вам следует скрыть эту ошибку. Не следует скрывать эту ошибку, если вы хотите сократить объем работы и не использовать полный синтаксис.
tr: Ön ekli cref etiketleri kullanılması, derleyicinin başvuruları doğrulamasını ve yeniden düzenlemeler sırasında IDE’nin başvuruları güncelleştirmesini engellediğinden, bundan kaçınılmalıdır. Bahsedilmekte olan tür derleyici tarafından bulunabilir olmadığından cref’in bir ön ek kullanması gerekiyorsa tek bir belge sitesinde bu hatanın bastırılmasına izin verilir. Örneğin, bir cref tam çerçevedeki özel bir öznitelikten bahsediyor, ancak siz taşınabilir çerçeveye göre derlenen bir dosyadaysanız ya da daha yüksek bir Roslyn katmanındaki bir türe başvurmak istiyorsanız hatayı bastırmalısınız. Hatayı yalnızca işinizi kolaylaştırmak ve tam söz dizimini kullanmaktan kaçınmak için bastırmamalısınız.
zh_hans: 应避免将 cref 标记与前缀结合使用，因为在重构过程中，这种做法会阻止编译器验证引用并阻止 IDE 更新引用。如果由于编译器无法找到所提到的类型而导致 cref 必须使用前缀，则可以在一个文档站点取消此错误。例如，如果 cref 在完整框架中提到某一特殊属性，但你位于使用可移植框架编译的文件中，或者要在更高的 Roslyn 层引用某个类型，则应取消此错误。但不应仅因为想走捷径和避免使用完整语法而取消此错误。
zh_hant: 應避免使用有前置詞的 cref 標籤，因為如此會導致編譯器無法驗證參考，並導致 IDE 無法於重構期間更新參考。如果因為編譯器無法找到提及的類型，而讓 cref 必須使用前置詞時，您可在單一文件網站上隱藏此錯誤。例如，如果 cref 提及完整架構中的某個特殊屬性，但您檔案的編譯對象為可攜式架構，或若想參考 Roslyn 更高層的類型，即不應出現此錯誤。即使只是單純求快而不想使用完整語法，也不應隱藏此項錯誤。

# AvoidUsingCrefTagsWithAPrefixMessage
source: Avoid using cref tags with a prefix
cs: Nepoužívejte značky cref s předponou
de: Verwendung von cref-Tags mit einem Präfix vermeiden
es: Evitar el uso de etiquetas cref con un prefijo.
fr: Éviter d'utiliser des balises cref avec un préfixe
it: Evitare di usare tag cref con un prefisso
ja: cref タグをプレフィックスと共に使用しない
ko: 접두사와 cref 태그를 동시에 사용하지 마세요.
pl: Unikaj korzystania z tagów cref z prefiksem
pt_br: Evite usar tags cref com um prefixo
ru: Не используйте теги cref в префиксе
tr: Ön ek içeren cref etiketlerini kullanmayın
zh_hans: 避免将 cref 标记与前缀结合使用
zh_hant: 避免使用有前置詞的 cref 標籤

# AvoidDeadConditionalCodeAlwaysTruFalseOrNullMessage
source: '{0}' is always '{1}'. Remove or refactor the condition(s) to avoid dead code.
cs: {0} bude vždy {1}. Odeberte nebo refaktorujte podmínku tak, abyste se vyhnuli mrtvému kódu.
de: "{0}" ist immer "{1}". Entfernen Sie die Bedingung(en), oder gestalten Sie sie um, um toten Code zu vermeiden.
es: "{0}" siempre es "{1}". Quite o refactorice las condiciones para evitar el código no alcanzado.
fr: '{0}' est toujours '{1}'. Supprimez ou refactorisez les conditions pour éviter d'avoir du code mort.
it: '{0}' è sempre '{1}'. Rimuovere le condizioni o effettuarne il refactoring per evitare codice non utilizzato.
ja: '{0}' は常に '{1}' です。実行されないコードを回避するには、条件を削除するかリファクターします。
ko: '{0}'은(는) 항상 '{1}'입니다. 데드 코드를 방지하려면 조건을 제거하거나 리팩터링합니다.
pl: Element „{0}” ma zawsze wartość „{1}”. Usuń lub zrefaktoryzuj warunki w celu uniknięcia nieaktywnego kodu.
pt_br: '{0}' é sempre '{1}'. Remova ou refatore as condições para evitar um código morto.
ru: "{0}" всегда является "{1}". Удалите эти условия или выполните их рефакторинг, чтобы избежать появления неиспользуемого кода.
tr: '{0}' her zaman: '{1}'. Ölü kod oluşmasını önlemek için koşulları kaldırın veya yeniden düzenleyin.
zh_hans: “{0}”始终是“{1}”。删除或重构条件以避免死代码。
zh_hant: '{0}' 一律是 '{1}'。請移除條件或重構條件，避免使用無作用程式碼。

# AvoidDeadConditionalCodeNeverNullMessage
source: '{0}' is never '{1}'. Remove or refactor the condition(s) to avoid dead code.
cs: {0} nikdy nebude {1}. Odeberte nebo refaktorujte podmínku tak, abyste se vyhnuli mrtvému kódu.
de: "{0}" ist niemals "{1}". Entfernen Sie die Bedingung(en), oder gestalten Sie sie um, um toten Code zu vermeiden.
es: "{0}" nunca es "{1}". Quite o refactorice las condiciones para evitar el código no alcanzado.
fr: '{0}' n'est jamais '{1}'. Supprimez ou refactorisez les conditions pour éviter d'avoir du code mort.
it: '{0}' non è mai '{1}'. Rimuovere le condizioni o effettuarne il refactoring per evitare codice non utilizzato.
ja: '{0}' は '{1}' ではありません。実行されないコードを回避するには、条件を削除するかリファクターします。
ko: '{0}'은(는) '{1}'이(가) 아닙니다. 데드 코드를 방지하려면 조건을 제거하거나 리팩터링합니다.
pl: Element „{0}” nigdy nie ma wartości „{1}”. Usuń lub zrefaktoryzuj warunki w celu uniknięcia nieaktywnego kodu.
pt_br: '{0}' nunca é '{1}'. Remova ou refatore as condições para evitar um código morto.
ru: "{0}" никогда не является "{1}". Удалите эти условия или выполните их рефакторинг, чтобы избежать появления неиспользуемого кода.
tr: '{0}' asla '{1}' değildir. Ölü kod oluşmasını önlemek için koşulları kaldırın veya yeniden düzenleyin.
zh_hans: “{0}”永远不会是“{1}”。删除或重构条件以避免死代码。
zh_hant: '{0}' 一律不會是 '{1}'。請移除條件或重構條件，避免使用無作用程式碼。

# AvoidDeadConditionalCodeTitle
source: Avoid dead conditional code
cs: Vyhněte se mrtvému podmíněnému kódu
de: Toten bedingten Code vermeiden
es: Evitar código condicional no alcanzado
fr: Éviter le code conditionnel mort
it: Evitare codice di condizione non utilizzato
ja: 使用されない条件付きコードを回避する
ko: 데드 조건부 코드 방지
pl: Unikaj nieaktywnego kodu warunkowego
pt_br: Evite um código condicional morto
ru: Предотвращение появления неиспользуемого условного кода
tr: Ölü koşullu kod oluşmasından kaçının
zh_hans: 避免死条件代码
zh_hant: 避免使用無作用條件式程式碼

# AvoidExcessiveClassCouplingDescription
source: This rule measures class coupling by counting the number of unique type references that a symbol contains. Symbols that have a high degree of class coupling can be difficult to maintain. It is a good practice to have types and methods that exhibit low coupling and high cohesion. To fix this violation, try to redesign the code to reduce the number of types to which it is coupled.
cs: Toto pravidlo měří párování tříd tak, že počítá jedinečné odkazy na typy obsažené v symbolu. Symboly s vysokým stupněm párování tříd může být složité udržovat. Doporučeným postupem je používat typy a metody s nízkým párováním a vysokou kohezí. Pokud chcete porušení tohoto pravidla opravit, zkuste kód přepracovat tak, aby se snížil počet typů, na které se páruje.
de: Diese Regel misst die Kopplung zwischen Klassen, indem sie die Anzahl der eindeutigen Typrefenzen in einem Symbol zählt. Es kann schwierig sein, Symbole, bei denen viele Klassen aneinder gekoppelt sind, zu verwalten. Es werden Typen und Methoden empfohlen, die wenige Kopplungen und ein hohes Maß an Kohäsion aufweisen. Wenn Sie diesen Verstoß beheben möchten, gestalten Sie den Code um, um die Anzahl an Typen zu reduzieren, an die dieser gekoppelt ist.
es: Esta regla mide el acoplamiento de clase contando el número de referencias de tipo únicas que contiene un símbolo. Los símbolos que tienen un alto grado de acoplamiento de la clase pueden ser difíciles de mantener. Es una buena práctica tener tipos y métodos que exhiben un acoplamiento bajo y una alta cohesión. Para corregir esta infracción, intente rediseñar el código para reducir el número de tipos a los que está acoplado.
fr: Cette règle mesure le couplage de classes en comptant le nombre de références de type uniques que contient un symbole. Les symboles qui ont un haut degré de couplage de classes peuvent être difficiles à maintenir. Une bonne pratique est d'avoir des types et des méthodes qui présentent un faible couplage et une cohésion élevée. Pour corriger cette infraction, essayez de revoir le code afin de réduire le nombre de types auquel il est couplé.
it: Questa regola misura gli accoppiamenti tra classi conteggiando il numero di riferimenti al tipo univoci contenuti in un simbolo. I simboli con un grado elevato di accoppiamento tra classi possono essere difficili da gestire. È consigliabile avere tipi e metodi che mostrano un accoppiamento basso e una coesione elevata. Per risolvere questa violazione, provare a riprogettare il codice in modo da ridurre il numero di tipi a cui viene accoppiato.
ja: このルールは、シンボルが含まれる一意の型参照の数をカウントすることによってクラス結合度を測定します。クラス結合度の高いシンボルは保守が困難になることがあります。低い結合度と高い凝集度を指定する型とメソッドを含めることをお勧めします。この違反を修正するには、コードを書き直し、結合する型の数を減らします。
ko: 이 규칙은 기호에 포함된 고유한 unique type references that a symbol contains. Symbols that have a high degree of class coupling can be difficult to maintain. It is a good practice to have types and methods that exhibit low coupling and high cohesion. To fix this violation, try to redesign the code to reduce the number of types to which it is coupled.
pl: Ta reguła mierzy sprzężenie klas, licząc liczbę unikatowych odwołań do typów, które zawiera symbol. Symbole o wysokim stopniu sprzężenia klas mogą być trudne w utrzymaniu. Dobrym rozwiązaniem jest tworzenie typów i metod o niskim sprzężeniu i wysokiej spójności. Aby naprawić to naruszenie, przeprojektuj kod w celu zmniejszenia liczby typów, z którymi jest sprzężony.
pt_br: Esta regra mede o acoplamento de classes pela contagem do número de referências de tipo único que um símbolo contém. Símbolos que têm um alto grau de acoplamento de classe podem ser difíceis de manter. É uma prática recomendada ter tipos e métodos que apresentam baixo acoplamento e alta coesão. Para corrigir essa violação, tente reprojetar o código para reduzir o número de tipos para aos quais ela está acoplada.
ru: Это правило измеряет взаимозависимость классов посредством подсчета количества уникальных ссылок на типы, которые содержат символ. Символы, которые имеют высокую степень взаимозависимости классов, может быть трудно поддерживать. Рекомендуется иметь типы и методы, которые обладают низкой взаимозависимостью и высокой связностью. Чтобы устранить это нарушение, попробуйте реорганизовать код, чтобы уменьшить число типов, которые участвуют в формировании взаимозависимости.
tr: Bu kural, bir sembolün içerdiği benzersiz tür başvurularını sayarak sınıf bağlantılarını ölçer. Yüksek düzeyde sınıf bağlantısı içeren sembollerin bakımının yapılması zor olabilir. Düşük bağlantı düzeyine ve yüksek uyuma sahip türler ve metotlar kullanılması iyi bir uygulamadır. Bu ihlali düzeltmek için kodu yeniden tasarlayarak kodun bağlı olduğu tür sayısını azaltmayı deneyin.
zh_hans: 该规则通过计算符号包含的唯一类型引用的数量来度量类耦合。具有高度类耦合的符号很难维护。一种好的做法是采用耦合性低且内聚性高的类型和方法。要纠正该违反行为，请尝试重新设计代码，以减少耦合类型的数量。
zh_hant: 此規則會計算符號包含的唯一類型參考數目來衡量類別結合程度。類別結合程度高的符號可能難以維護。建議讓類型與方法的結合程度低而內聚程度高。若要修正此違規，請嘗試重新設計程式碼，減少其結合的類型數目。

# AvoidExcessiveClassCouplingMessage
source: '{0}' is coupled with '{1}' different types from '{2}' different namespaces. Rewrite or refactor the code to decrease its class coupling below '{3}'.
cs: {0} se páruje s {1} různými typy z {2} různých oborů názvů. Přepište nebo refaktorujte kód tak, aby se párování tříd snížilo pod {3}.
de: "{0}" wird mit "{1}" verschiedenen Typen von "{2}" verschiedenen Namespaces verknüpft. Schreiben Sie den Code neu, oder gestalten Sie ihn um, um die Kopplung zwischen Klassen auf einen Wert unter "{3}" zu senken.
es: "{0}" se combina con "{1}" tipos diferentes de "{2}" diferentes espacios de nombres. Reescriba o refactorice el código para disminuir su acoplamiento de clase por debajo de "{3}".
fr: '{0}' est couplé avec des types différents '{1}' d'espaces de noms différents '{2}'. Réécrivez ou refactorisez le code pour baisser son couplage de classe en dessous de '{3}'.
it: '{0}' è accoppiato a '{1}' tipi diversi di '{2}' spazi dei nomi diversi. Riscrivere il codice o effettuarne il refactoring per diminuire gli accoppiamenti di classe sotto '{3}'.
ja: '{0}' は、異なる名前空間 '{2}' の中の異なる型 '{1}' と結合しています。コードを書き直すかリファクタリングを行って、'{3}' の下のクラス間結合を小さくしてください。
ko: '{0}'이(가) '{2}'개의 다른 네임스페이스에 있는 '{1}'개의 다른 형식과 결합되어 있습니다. 코드를 다시 작성하거나 리팩터링하여 클래스 결합 수준을 '{3}' 이하로 낮추세요.
pl: Element „{0}” jest sprzężony z „{1}” różnymi typami z „{2}” różnych przestrzeni nazw. Ponownie napisz kod lub refaktoryzuj go w taki sposób, aby sprzężenie klas było niższe niż „{3}”.
pt_br: '{0}' está acoplado a tipos diferentes de '{1}' de '{2}' namespaces diferentes. Reescreva ou refatore o código para diminuir o acoplamento abaixo '{3}'.
ru: '{0}' связан с различными типами ('{1}') из различных пространств имен ('{2}'). Перепишите или оптимизируйте код, чтобы уменьшить степень взаимозависимости классов ниже '{3}'.
tr: '{0}', '{2}' farklı ad alanından '{1}' farklı türe bağlı. Kodu yeniden yazarak veya yeniden düzenleyerek sınıf bağlantısını '{3}' düzeyinin altına düşürün.
zh_hans: “{0}”与“{2}”不同命名空间中的“{1}”不同类型相耦合。请重写或重构代码，将其类耦合数降低到“{3}”之下。
zh_hant: '{0}' 已與來自 '{2}' 個不同命名空間中的 '{1}' 個不同類型結合。請重寫或重構程式碼，以將其類別結合程度降低至 '{3}' 以下。

# AvoidExcessiveClassCouplingTitle
source: Avoid excessive class coupling
cs: Vyhněte se nadměrnému párování tříd
de: Übermäßige Klassenkopplungen vermeiden
es: Evite el acoplamiento excesivo de clases
fr: Éviter les couplages de classe excessifs
it: Evita un numero eccessivo di accoppiamenti di classi
ja: 過剰なクラス結合を避ける
ko: 클래스를 지나치게 많이 결합하지 마십시오.
pl: Unikaj nadmiernego sprzężenia klas
pt_br: Evite o acoplamento de classes em excesso
ru: Избегать чрезмерной взаимозависимости классов
tr: Aşırı miktarda sınıf bağlantısından kaçının
zh_hans: 避免过度的类耦合
zh_hant: 避免過度的類別結合
