Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UriReturnValuesShouldNotBeStringsDescription
source: This rule assumes that the method returns a URI. A string representation of a URI is prone to parsing and encoding errors, and can lead to security vulnerabilities. The System.Uri class provides these services in a safe and secure manner.
cs: Toto pravidlo předpokládá, že metoda vrací identifikátor URI. Řetězcová reprezentace identifikátoru URI je náchylná k chybám při parsování a kódování a může vést k ohrožení zabezpečení. Třída System.Uri poskytuje tyto služby zabezpečeným způsobem.
de: Diese Regel geht davon aus, dass die Methode einen URI zurückgibt. Eine Zeichenfolgendarstellung eines URI ist für Analyse- und Codierungsfehler anfällig und kann zu Sicherheitsrisiken führen. Die System.Uri-Klasse stellt diese Dienste auf sichere Weise bereit.
es: Esta regla supone que el método devuelve un URI. La representación de cadena de un URI tiende a analizar y codificar los errores, lo que puede crear puntos vulnerables en la seguridad. La clase System.Uri proporciona estos servicios de manera segura.
fr: Cette règle suppose que la méthode retourne un URI. Une représentation sous forme de chaîne d'un URI est sujette aux erreurs d'analyse et d'encodage. De plus, elle peut entraîner des failles de sécurité. La classe System.Uri fournit ces services de manière sûre et sécurisée.
it: Questa regola presuppone che il metodo restituisca un URI. Una rappresentazione di stringa di un URI è soggetta a errori di analisi e di codifica e può comportare vulnerabilità di sicurezza. La classe System.Uri fornisce questi servizi in modo sicuro e protetto.
ja: この規則では、メソッドから URI が返されることを前提としています。URI の文字列表現は解析エラーやエンコーディング エラーが発生しやすく、セキュリティ上の脆弱性の原因となる場合があります。System.Uri クラスを使用すると、安全な方法でこれらのサービスが提供されます。
ko: 이 규칙은 메서드가 URI를 반환한다고 가정합니다. URI의 문자열 표현은 오류를 구문 분석하거나 인코딩하기 쉬우며 이로 인해 보안이 취약해질 수 있습니다. System.Uri 클래스는 이러한 서비스를 안전하게 제공합니다.
pl: W tej regule przyjęto, że metoda zwraca identyfikator URI. Reprezentacja identyfikatora URI w postaci ciągu jest narażona na błędy analizy i kodowania oraz może powodować luki w zabezpieczeniach. Klasa System.Uri udostępnia te usługi w bezpieczny sposób.
pt_br: Esta regra presume que o método retorna um URI. Uma representação de cadeia de caracteres de um URI é propensa a analisar e codificar erros e pode levar a vulnerabilidades de segurança. A classe System.Uri oferece esses serviços de maneira segura.
ru: Это правило предполагает, что метод возвращает URI. Строковое представление URI подвержено возникновению ошибок анализа и кодирования, а также может создавать уязвимости в системе безопасности. Класс System.Uri предоставляет эти службы безопасным образом.
tr: Bu kural, yöntemin bir URI döndürdüğünü varsayar. Bir URI’nin dize temsili ayrıştırma ve kodlama hatalarına meyilli olduğundan, güvenlik açıklarına yol açabilir. System.Uri sınıfı bu hizmetleri güvenli bir biçimde sağlar.
zh_hans: 此规则假定方法返回一个 URI。URI 的字符串表示形式易解析且易出现编码错误，并可能导致安全漏洞。System.Uri 类以安全可靠方式提供这些服务。
zh_hant: 此規則假設方法會傳回 URI。URI 的字串表示法容易發生剖析及編碼錯誤，且可能因此導致安全性弱點。System.Uri 類別以安全的方式提供這些服務。

# UriReturnValuesShouldNotBeStringsMessage
source: Change the return type of method '{0}' from 'string' to 'System.Uri'
cs: Změňte návratový typ metody {0} ze string na System.Uri.
de: Ändern Sie den Rückgabetyp der Methode "{0}" von "string" in "System.Uri".
es: Cambie el tipo de valor devuelto del método "{0}" de "string" a "System.Uri"
fr: Changez le type de retour de la méthode '{0}', de 'string' à 'System.Uri'
it: Modificare il tipo restituito del metodo '{0}' da 'string' a 'System.Uri'
ko: 메서드 '{0}'의 반환 형식을 'string'에서 'System.Uri'로 변경하세요.
pl: Zmień zwracany typ metody {0} ze „string” na „System.Uri”
pt_br: Altere o tipo de retorno do método '{0}' de 'string' para 'System.Uri'
ru: Измените тип возвращаемого значения для метода "{0}" со "string" на "System.Uri".
tr: '{0}' metodunun 'string' olan dönüş türünü 'System.Uri' olarak değiştirin
zh_hans: 将方法“{0}”的返回类型从 "string" 更改为 "System.Uri"
zh_hant: 將方法 '{0}' 的傳回型別從 'string' 變更為 'System.Uri'

# UriPropertiesShouldNotBeStringsTitle
source: URI-like properties should not be strings
cs: Vlastnosti podobné identifikátoru URI by neměly být řetězce
de: URI-ähnliche Eigenschaften dürfen keine Zeichenfolgen sein
es: Las propiedades de tipo URI no deben ser cadenas
fr: Les propriétés de type URI ne doivent pas être des chaînes
it: Le proprietà simili a URI non devono essere stringhe
ko: URI 같은 속성은 문자열이 아니어야 함
pl: Właściwości z identyfikatorami URI nie powinny być ciągami
pt_br: As propriedades do tipo URI não devem ser cadeias de caracteres
ru: Свойства, напоминающие URI, не должны быть строками
tr: URI benzeri özellikler dize olmamalıdır
zh_hans: 类 URI 属性不应是字符串
zh_hant: 類 URI 屬性不應為字串

# UriPropertiesShouldNotBeStringsDescription
source: This rule assumes that the property represents a Uniform Resource Identifier (URI). A string representation of a URI is prone to parsing and encoding errors, and can lead to security vulnerabilities. The System.Uri class provides these services in a safe and secure manner.
cs: Toto pravidlo předpokládá, že vlastnost reprezentuje identifikátor URI (Uniform Resource Identifier). Řetězcová reprezentace identifikátoru URI je náchylná k chybám při parsování a kódování a může vést k ohrožení zabezpečení. Třída System.Uri poskytuje tyto služby zabezpečeným způsobem.
de: Diese Regel geht davon aus, dass die Eigenschaft einen URI (Uniform Resource Identifier) darstellt. Eine Zeichenfolgendarstellung eines URI ist für Analyse- und Codierungsfehler anfällig und kann zu Sicherheitsrisiken führen. Die System.Uri-Klasse stellt diese Dienste auf sichere Weise bereit.
es: Esta regla supone que la propiedad representa un identificador uniforme de recursos (URI). La representación de cadena de un URI tiende a analizar y codificar los errores, lo que puede crear puntos vulnerables en la seguridad. La clase System.Uri proporciona estos servicios de manera segura.
fr: Cette règle suppose que la propriété représente un URI (Uniform Resource Identifier). Une représentation sous forme de chaîne d'un URI est sujette aux erreurs d'analyse et d'encodage. De plus, elle peut entraîner des failles de sécurité. La classe System.Uri fournit ces services de manière sûre et sécurisée.
it: Questa regola presuppone che la proprietà rappresenti un URI (Uniform Resource Identifier). Una rappresentazione di stringa di un URI è soggetta a errori di analisi e di codifica e può comportare vulnerabilità di sicurezza. La classe System.Uri fornisce questi servizi in modo sicuro e protetto.
ja: この規則では、プロパティが Uniform Resource Identifier (URI) を表すことを前提としています。URI の文字列表現は解析エラーやエンコーディング エラーが発生しやすく、セキュリティ上の脆弱性の原因となる場合があります。System.Uri クラスを使用すると、安全な方法でこれらのサービスが提供されます。
ko: 이 규칙은 속성이 URI(Uniform Resource Identifier)를 나타낸다고 가정합니다. URI의 문자열 표현은 오류를 구문 분석하거나 인코딩하기 쉬우며 이로 인해 보안이 취약해질 수 있습니다. System.Uri 클래스는 이러한 서비스를 안전하게 제공합니다.
pl: W tej regule przyjęto, że właściwość reprezentuje identyfikator URI (Uniform Resource Identifier). Reprezentacja identyfikatora URI w postaci ciągu jest narażona na błędy analizy i kodowania oraz może powodować luki w zabezpieczeniach. Klasa System.Uri udostępnia te usługi w bezpieczny sposób.
pt_br: Esta regra presume que a propriedade representa um URI (Uniform Resource Identifier). Uma representação de cadeia de caracteres de um URI é propensa a analisar e codificar erros e pode levar a vulnerabilidades de segurança. A classe System.Uri oferece esses serviços de maneira segura.
ru: Это правило предполагает, что свойство представляет универсальный код ресурса (URI). Строковое представление URI подвержено возникновению ошибок анализа и кодирования, а также может создавать уязвимости в системе безопасности. Класс System.Uri предоставляет эти службы безопасным образом.
tr: Bu kural, özelliğin bir Tekdüzen Kaynak Tanımlayıcısını (URI) temsil ettiğini varsayar. Bir URI’nin dize temsili ayrıştırma ve kodlama hatalarına meyilli olduğundan, güvenlik açıklarına yol açabilir. System.Uri sınıfı bu hizmetleri güvenli bir biçimde sağlar.
zh_hans: 此规则假定属性表示统一资源标识符(URI)。URI 的字符串表示形式易解析且易出现编码错误，并可能导致安全漏洞。System.Uri 类以安全可靠方式提供这些服务。
zh_hant: 此規則假設屬性代表統一資源識別項 (URI)。URI 的字串表示法容易發生剖析及編碼錯誤，且可能因此導致安全性弱點。System.Uri 類別以安全的方式提供這些服務。

# UriPropertiesShouldNotBeStringsMessage
source: Change the type of property '{0}' from 'string' to 'System.Uri'
cs: Změňte typ vlastnosti {0} ze string na System.Uri.
de: Ändern Sie den Typ der Eigenschaft "{0}" von "string" in "System.Uri".
es: Cambie el tipo de la propiedad "{0}" de "string" a "System.Uri"
fr: Changez le type de la propriété '{0}', de 'string' à 'System.Uri'
it: Modificare il tipo della proprietà '{0}' da 'string' a 'System.Uri'
ko: 속성 '{0}'의 형식을 'string'에서 'System.Uri'로 변경하세요.
pl: Zmień typ właściwości {0} ze „string” na „System.Uri”.
pt_br: Altere o tipo da propriedade '{0}' de 'string' para 'System.Uri'
ru: Измените тип свойства "{0}" со "string" на "System.Uri".
tr: '{0}' özelliğinin 'string' olan türünü 'System.Uri' olarak değiştirin
zh_hans: 将属性“{0}”的类型从 "string" 更改为 "System.Uri"
zh_hant: 將屬性 '{0}' 的類型從 'string' 變更為 'System.Uri'

# ImplementIDisposableCorrectlyTitle
source: Implement IDisposable Correctly
cs: Implementujte IDisposable správně.
de: IDisposable richtig implementieren
es: Implementar IDisposable correctamente
fr: Implémenter IDisposable correctement
it: Implementare correttamente IDisposable
ja: IDisposable を正しく実装します
ko: IDisposable 인터페이스를 올바르게 구현하세요.
pl: Zaimplementuj poprawnie interfejs IDisposable
pt_br: Implementar IDisposable corretamente
ru: Правильно реализуйте IDisposable
tr: IDisposable’ı Doğru Uygulayın
zh_hans: 正确实现 IDisposable
zh_hant: 正確實作 IDisposable

# ImplementIDisposableCorrectlyDescription
source: All IDisposable types should implement the Dispose pattern correctly.
cs: Všechny typy IDisposable by měly implementovat vzor Dispose správně.
de: Alle IDisposable-Typen müssen das Dispose-Muster korrekt implementieren.
es: Todos los tipos IDisposable deben implementar el patrón Dispose correctamente.
fr: Tous les types IDisposable doivent implémenter le modèle Dispose correctement.
it: Tutti i tipi IDisposable devono implementare correttamente il criterio Dispose.
ja: すべての IDisposable 型は、Dispose パターンを正しく実装しなければなりません。
ko: 모든 IDisposable 형식은 Dispose 패턴을 올바르게 구현해야 합니다.
pl: Wszystkie typy IDisposable powinny poprawnie implementować wzorzec Dispose.
pt_br: Todos os tipos IDisposable devem implementar o padrão Dispose corretamente.
ru: Во всех типах IDisposable шаблон Dispose должен быть реализован правильно.
tr: Tüm IDisposable türleri, Dispose desenini doğru uygulamalıdır.
zh_hans: 所有 IDisposable 类型都应正确实现 Dispose 模式。
zh_hant: 所有 IDisposable 類型都應正確地實作 Dispose 模式。

# ImplementIDisposableCorrectlyMessageIDisposableReimplementation
source: Remove IDisposable from the list of interfaces implemented by '{0}' as it is already implemented by base type '{1}'
cs: Odebrete IDisposable ze seznamu rozhraní, která implementuje {0}, protože už jej implementuje základní typ {1}.
de: Entfernen Sie "IDisposable" aus der Liste der durch "{0}" implementierten Schnittstellen, weil sie bereits durch den Basistyp "{1}" implementiert wird.
es: Elimine IDisposable de la lista de interfaces implementadas por "{0}" puesto que ya está implementado por el tipo base "{1}".
fr: Supprimez IDisposable de la liste des interfaces implémentées par '{0}', car elle est déjà implémentée par le type de base '{1}'
it: Rimuovere IDisposable dall'elenco delle interfacce implementate da '{0}' perché è già implementato dal tipo di base '{1}'
ko: 기본 형식 '{1}'에서 이미 구현되었으므로 '{0}'에서 구현된 인터페이스의 목록에서 IDisposable을 제거하세요.
pl: Usuń interfejs IDisposable z listy interfejsów implementowanych przez element „{0}”, ponieważ jest on już implementowany przez typ bazowy „{1}”
pt_br: Remova IDisposable da lista de interfaces implementadas por '{0}', uma vez que ela já foi implementada pelo tipo base '{1}'
ru: Удалите IDisposable из списка интерфейсов, реализованных в "{0}", так как он уже реализован базовым типом "{1}".
tr: IDisposable zaten '{1}' temel türü tarafından uygulandığından bunu '{0}' tarafından uygulanan arabirimler listesinden kaldırın
zh_hans: 从“{0}”实现的接口列表中删除 IDisposable，因为它已由基类型“{1}”实现
zh_hant: 從 '{0}' 實作的介面清單中移除 IDisposable，原因是基底類型 '{1}' 已實作該項

# ImplementIDisposableCorrectlyMessageDisposeOverride
source: Remove '{0}', override Dispose(bool disposing), and put the dispose logic in the code path where 'disposing' is true
cs: Odeberte {0}, přepište Dispose(bool disposing) a vložte finalizační logiku do cesty kódu, kde je disposing hodnoty true.
de: Entfernen Sie "{0}", überschreiben Sie "Dispose(bool disposing)", und platzieren Sie die Dispose-Logik im Codepfad, wenn "disposing" TRUE lautet.
es: Elimine "{0}", reemplace Dispose(bool disposing) y coloque la lógica de eliminación en la ruta de acceso al código de manera que "disposing" se establezca en verdadero.
fr: Supprimez '{0}', remplacez Dispose(bool disposing) et placez la logique dispose dans le chemin de code où 'disposing' est true
it: Rimuovere '{0}', eseguire l'override di Dispose(bool disposing) e inserire la logica di Dispose nel percorso del codice in cui 'disposing' è true
ko: '{0}'을(를) 제거하고 Dispose(bool disposing)를 재정의한 후 삭제 논리를 'disposing'이 true인 코드 경로에 추가하세요.
pl: Usuń funkcję „{0}”, przesłoń funkcję Dispose(bool disposing) i umieść logikę usuwania w ścieżce kodu, gdzie element „disposing” ma wartość true
pt_br: Remova '{0}', substitua Dispose(bool disposing) e coloque a lógica de descarte no caminho do código em que 'disposing' é true
ru: Удалите "{0}", переопределите Dispose(bool disposing) и поместите логику метода dispose в пути кода, там где "disposing" имеет значение true.
tr: '{0}' öğesini kaldırın, Dispose(bool disposing) metodunu geçersiz kılın ve atma mantığını 'disposing' değerinin true olduğu kod yoluna yerleştirin
zh_hans: 删除“{0}”，替代 Dispose(bool disposing)，并在 "disposing" 为 true 的代码路径中加入释放逻辑
zh_hant: 移除 '{0}'，覆寫 Dispose(bool disposing)，並在程式碼路徑中放置處置邏輯，其中 'disposing' 為 true

# ImplementIDisposableCorrectlyMessageDisposeSignature
source: Ensure that '{0}' is declared as public and sealed
cs: Zajistěte, aby metoda {0} byla deklarovaná jako veřejná a zapečetěná.
de: Stellen Sie sicher, dass "{0}" als öffentlich deklariert und versiegelt wird.
es: Asegúrese de que "{0}" se declara como público y sellado.
fr: Vérifiez que '{0}' est déclaré comme public et sealed
it: Assicurarsi che '{0}' sia dichiarato come public e sealed
ko: '{0}'이(가) public 및 sealed로 선언되었는지 확인하세요.
pl: Upewnij się, że element „{0}” jest zadeklarowany jako public i sealed
pt_br: Verifique se '{0}' está declarado como público e selado
ru: Убедитесь, что тип "{0}" объявлен как открытый и запечатанный.
tr: '{0}' öğesinin genel ve mühürlü olarak bildirildiğinden emin olun
zh_hans: 确保“{0}”声明为公开且已密封
zh_hant: 確保 '{0}' 已宣告為公用並密封

# ImplementIDisposableCorrectlyMessageRenameDispose
source: Rename '{0}' to 'Dispose' and ensure that it is declared as public and sealed
cs: Přejmenujte metodu {0} na Dispose a zajistěte, aby byla deklarovaná jako veřejná a zapečetěná.
de: Benennen Sie "{0}" in "'Dispose" um, und stellen Sie eine Deklaration als öffentlich und versiegelt sicher.
es: Cambie el nombre de "{0}" a "Dispose" y asegúrese de que se declara como público y sellado.
fr: Renommez '{0}' en 'Dispose' et vérifiez qu'il est déclaré comme public et sealed
it: Rinominare '{0}' in 'Dispose' e assicurarsi che sia dichiarato come public e sealed
ko: '{0}'의 이름을 'Dispose'로 바꾸고 public 및 sealed로 선언되었는지 확인하세요.
pl: Zmień nazwę elementu „{0}” na „Dispose” i upewnij się, że jest on zadeklarowany jako public i sealed
pt_br: Renomeie '{0}' como 'Dispose' e verifique se ele está declarado como público e selado
ru: Переименуйте "{0}" в "Dispose" и убедитесь, что он объявлен как открытый и запечатанный.
tr: '{0}' öğesini 'Dispose' olarak yeniden adlandırıp öğenin genel ve mühürlü olarak bildirildiğinden emin olun
zh_hans: 将“{0}”重命名为 "Dispose"，并确保其声明为公共且已密封
zh_hant: 將 '{0}' 重新命名為 'Dispose'，並確保其已宣告為公用並密封

# ImplementIDisposableCorrectlyMessageDisposeBoolSignature
source: Ensure that '{0}' is declared as protected, virtual, and unsealed
cs: Zajistěte, aby metoda {0} byla deklarovaná jako chráněná, virtuální a nezapečetěná.
de: Stellen Sie sicher, dass "{0}" als geschützt, virtuell und nicht versiegelt deklariert wird.
es: Asegúrese de que "{0}" se declara como protegido, virtual y no sellado.
fr: Vérifiez que '{0}' est déclaré comme protégé, virtuel et unsealed
it: Assicurarsi che '{0}' sia dichiarato come protected, virtual e unsealed
ko: '{0}'이(가) protected, virtual 및 unsealed로 선언되었는지 확인하세요.
pl: Upewnij się, że element „{0}” jest zadeklarowany jako protected, virtual i unsealed
pt_br: Verifique se '{0}' está declarado como protegido, virtual e não selado
ru: Убедитесь, что тип "{0}" объявлен как защищенный, виртуальный и незапечатанный.
tr: '{0}' öğesinin korumalı, sanal ve mühürsüz olarak bildirildiğinden emin olun
zh_hans: 确保将“{0}”声明为受保护、虚拟和未密封
zh_hant: 確保 '{0}' 已宣告為受保護、虛擬和未密封

# ImplementIDisposableCorrectlyMessageDisposeImplementation
source: Modify '{0}' so that it calls Dispose(true), then calls GC.SuppressFinalize on the current object instance ('this' or 'Me' in Visual Basic), and then returns
cs: Upravte {0} tak, že volá Dispose(true), pak volá GC.SupressFinalize na aktuální instanci objektu (this nebo Me ve Visual Basicu) a potom se vrací.
de: Ändern Sie "{0}" so, dass zunächst "Dispose(true)" und dann "GC.SuppressFinalize" für die aktuelle Objektinstanz (in Visual Basic "this" oder "Me") aufgerufen und anschließend ein Wert zurückgegeben wird.
es: Modifique "{0}" de manera que llame a Dispose(true), seguidamente llame a GC.SuppressFinalize en la instancia actual del objeto ("this" o "Me" en Visual Basic) y finalmente devuelva un valor.
fr: Modifez '{0}' pour qu'il appelle Dispose(true), puis GC.SuppressFinalize sur l'instance d'objet actuelle ('this' ou 'Me' en Visual Basic), puis retourne un résultat
it: Modificare '{0}' in modo che chiami Dispose(true), quindi GC.SuppressFinalize nell'istanza dell'oggetto corrente ('this' o 'Me' in Visual Basic) e quindi esca dalla funzione
ko: '{0}'을(를) 수정하여 Dispose(true)를 호출한 다음에 현재 개체 인스턴스(Visual Basic의 경우 'this' 또는 'Me')에서 GC.SuppressFinalize를 호출한 후 반환하도록 하세요.
pl: Zmodyfikuj element „{0}” tak, aby wywoływał funkcję Dispose(true), a następnie wywoływał funkcję GC.SuppressFinalize dla bieżącego wystąpienia obiektu („this” lub „Me” w języku Visual Basic), po czym wykonywał instrukcję return
pt_br: Modifique '{0}' para chamar Dispose(true), depois chamar GC.SuppressFinalize na instância do objeto atual ('this' ou 'Me' no Visual Basic) e retornar
ru: Измените "{0}", так чтобы он вызывал Dispose(true), затем вызывал GC.SuppressFinalize для экземпляра текущего объекта ("this" или "Me" в Visual Basic) и затем выполнял возврат.
tr: '{0}' metodunu Dispose(true) çağrısı yapacak, sonra geçerli nesne örneğinde (Visual Basic'te 'this' veya 'Me') GC.SuppressFinalize çağrısı yapacak ve sonra dönüş yapacak şekilde değiştirin
zh_hans: 修改“{0}”，使其调用 Dispose(true)，再对当前对象实例调用 GC.SuppressFinalize (Visual Basic 中的“此项”或“我”)，然后返回
zh_hant: 修改 '{0}'，以便其呼叫 Dispose(true)，並在目前的物件執行個體 (Visual Basic 中的 'this' 或 'Me') 上呼叫 GC.SuppressFinalize，然後傳回

# ImplementIDisposableCorrectlyMessageFinalizeImplementation
source: Modify '{0}' so that it calls Dispose(false) and then returns
cs: Upravte {0} tak, že volá Dispose(false) a potom se vrací.
de: Ändern Sie "{0}" so, dass "Dispose(false)" aufgerufen und anschließend ein Wert zurückgegeben wird.
es: Modifique "{0}" para que llame a Dispose(false) y luego devuelva un valor.
fr: Modifiez '{0}' pour qu'il appelle Dispose(false), puis retourne un résultat
it: Modificare '{0}' in modo che chiami Dispose(false) e quindi esca dalla funzione
ko: '{0}'을(를) 수정하여 Dispose(false)를 호출한 후 반환하도록 하세요.
pl: Zmodyfikuj element „{0}” tak, aby wywoływał funkcję Dispose(false), a następnie wykonywał instrukcję return
pt_br: Modifique '{0}' para que ele chame Dispose(false) e retorne
ru: Измените "{0}", так чтобы он вызывал Dispose(false) и затем выполнял возврат.
tr: '{0}' metodunu Dispose(false) çağrısı yapacak ve sonra dönüş yapacak şekilde değiştirin
zh_hans: 修改“{0}”，使其调用 Dispose(false)，然后再返回
zh_hant: 修改 '{0}'，以便其呼叫 Dispose(false) 然後傳回

# ImplementIDisposableCorrectlyMessageProvideDisposeBool
source: Provide an overridable implementation of Dispose(bool) on '{0}' or mark the type as sealed. A call to Dispose(false) should only clean up native resources. A call to Dispose(true) should clean up both managed and native resources.
cs: Poskytněte přepisovatelnou implementaci Dispose(bool) na {0} nebo označte typ jako zapečetěný. Volání Dispose(false) by mělo vyčistit jenom nativní prostředky. Volání Dispose(true) by mělo vyčistit prostředky spravované i nativní.
de: Stellen Sie eine überschreibbare Implementierung von "Dispose(bool)" auf "{0}" bereit, oder markieren Sie den Typ als versiegelt. Durch einen Aufruf von "Dispose(false)" sollten nur native Ressourcen bereinigt werden. Durch einen Aufruf von "Dispose(true)" sollten sowohl verwaltete als auch native Ressourcen bereinigt werden.
es: Proporcione una implementación reemplazable de Dispose(bool) en "{0}" o marque el tipo como sellado. Una llamada a Dispose(false) solo debería limpiar recursos nativos. Una llamada a Dispose(true) debería limpiar tanto recursos administrados como nativos.
fr: Fournissez une implémentation remplaçable de Dispose(bool) sur '{0}' ou marquez le type comme sealed. Un appel à Dispose(false) doit uniquement nettoyer les ressources natives. Un appel à Dispose(true) doit nettoyer les ressources natives et managées.
it: Fornire un'implementazione sottoponibile a override di Dispose(bool) su '{0}' o contrassegnare il tipo come sealed. Una chiamata a Dispose(false) pulisce solo le risorse native. Una chiamata a Dispose(true) pulisce le risorse native e quelle gestite.
ja: '{0}' で Dispose(bool) のオーバーライド可能な実装を提供するか、型を sealed としてマークします。Dispose(false) を呼び出す場合は、ネイティブ リソースのみがクリーンアップされます。Dispose(true) を呼び出す場合には、マネージド リソースとネイティブ リソースの両方がクリーンアップされます。
ko: '{0}'에 Dispose(bool)의 재정의 가능한 구현을 제공하거나 형식을 sealed로 표시합니다. Dispose(false)에 대한 호출은 네이티브 리소스만 정리해야 하지만 Dispose(true)에 대한 호출은 관리되는 리소스와 네이티브 리소스 모두를 정리해야 합니다.
pl: Zapewnij możliwą do zastąpienia implementację funkcji Dispose(bool) dla elementu „{0}” lub oznacz typ jako sealed. Wywołanie funkcji Dispose(false) powinno czyścić tylko zasoby natywne. Wywołanie funkcji Dispose(true) powinno czyścić zasoby zarządzane i natywne.
pt_br: Forneça uma implementação substituível de Dispose(bool) em '{0}' ou marque o tipo como selado. Uma chamada para Dispose(false) deve limpar somente os recursos nativos. Uma chamada para Dispose(true) deve limpar os recursos gerenciados e nativos.
ru: Предоставьте переопределяемую реализацию Dispose(bool) в '{0}' или пометьте тип как запечатанный. При вызове Dispose(false) должны удаляться только собственные ресурсы. При вызове Dispose(true) должны удаляться как управляемые, так и собственные ресурсы.
tr: '{0}' üzerinde geçersiz kılınabilen bir Dispose(bool) uygulaması sağlayın veya türü mühürlü olarak işaretleyin. Bir Dispose(false) çağrısı yalnızca yerel kaynakları temizlemelidir. Bir Dispose(true) çağrısı hem yönetilen hem yerel kaynakları temizlemelidir.
zh_hans: 对 {0} 提供 Dispose(bool) 的可重写实现或将该类型标记为“已密封”。对 Dispose(false) 的调用应仅清理本机资源。对 Dispose(true) 的调用应同时清理托管资源和本机资源。
zh_hant: 在 '{0}' 上提供 Dispose(bool) 的可覆寫實作，或將該類型標記為密封。呼叫 Dispose(false) 只能清除原生資源。呼叫 Dispose(true) 則能同時清除受控與原生資源。
