Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AvoidUnusedPrivateFieldsDescription
source: Private fields were detected that do not appear to be accessed in the assembly.
cs: Byla zjištěna privátní pole, která se podle všeho v tomto sestavení nepoužívají.
de: Private Felder wurden ermittelt, auf die in der Assembly offenbar nicht zugegriffen wird.
es: Se detectaron campos privados a los que no parece que se acceda en el ensamblado
fr: Des champs privés qui ne semblent pas être accessibles dans l'assembly ont été détectés.
it: Sono stati rilevati campi privati che sembrano essere inutilizzati nell'assembly.
ja: アセンブリ内でアクセスされていないと思われるプライベート フィールドが検出されました。
ko: 어셈블리 내부에서 액세스되지 않는 프라이빗 필드가 발견되었습니다.
pl: Zostały wykryte pola prywatne, dostęp do których prawdopodobnie nie będzie występował w zestawie.
pt_br: Foram detectados campos particulares que não parecem ser acessados dentro do assembly.
ru: В сборке обнаружены частные поля, к которым не осуществляется доступ.
tr: Derleme içerisinde erişilmeyen özel alanlar algılandı.
zh_hans: 检测到程序集内似乎有未访问过的私有字段。
zh_hant: 偵測到似乎無法於組件內存取的私用欄位。

# AvoidUnusedPrivateFieldsMessage
source: Unused field '{0}'
cs: Nepoužité pole {0}.
de: Nicht verwendetes Feld "{0}".
es: El campo "{0}" no se usa.
fr: Champ '{0}' inutilisé
it: Il campo '{0}' è inutilizzato
ko: 사용하지 않는 필드 '{0}'입니다.
pl: Nieużywane pole „{0}”
pt_br: Campo '{0}' não utilizado
ru: Неиспользуемое поле "{0}".
tr: '{0}' alanı kullanılmıyor
zh_hans: 未使用的字段“{0}”
zh_hant: 未使用的欄位 '{0}'

# DoNotIgnoreMethodResultsMessagePureMethod
source: {0} calls {1} but does not use the value the method returns. Because {1} is marked as a Pure method, it cannot have side effects. Use the result in a conditional statement, assign the result to a variable, or pass it as an argument to another method.
cs: {0} volá {1}, ale nepoužívá hodnotu, kterou tato metoda vrací. Protože {1} je označená jako metoda Pure, nemůže mít vedlejší účinky. Použijte výsledek v podmíněném příkazu, přiřaďte výsledek proměnné nebo ho předejte jako argument jiné metodě.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht den von der Methode zurückgegebenen Wert. Weil "{1}" als Pure-Methode markiert ist, kann sie keine Nebeneffekte haben. Verwenden Sie das Ergebnis in einer Bedingungsanweisung, weisen Sie das Ergebnis einer Variablen zu, oder übergeben Sie es als Argument an eine andere Methode.
es: {0} llama a {1} pero no usa el valor que el método devuelve. {1} se ha marcado como método Pure, por lo que no puede tener efectos secundarios. Use el resultado en una instrucción condicional, asigne el resultado a una variable o páselo como argumento a otro método.
fr: {0} appelle {1} mais n'utilise pas la valeur retournée par la méthode. Dans la mesure où {1} est marqué en tant que méthode Pure, il ne peut pas avoir d'effets secondaires. Utilisez le résultat dans une instruction conditionnelle, assignez-le à une variable ou passez-le en tant qu'argument à une autre méthode.
it: {0} chiama {1} ma non usa il valore restituito dal metodo. Dal momento che {1} è contrassegnato come metodo Pure, non può avere effetti collaterali. Usare il risultato in un'istruzione condizionale, assegnare il risultato a una variabile o passarlo come argomento a un altro metodo.
ja: {0} は {1} を呼び出しますが、メソッドから返される値は使用されません。{1} は Pure メソッドとしてマークされているため、副作用は発生しません。条件ステートメントで結果を使用するか、結果を変数に割り当てるか、引数として他のメソッドに渡してください。
ko: {0}이(가) {1}을(를) 호출하지만 메서드가 반환하는 값을 사용하지 않습니다. {1}이(가) 순수 메서드로 표시되어 있으므로 의도하지 않은 결과가 발생하지 않습니다. 결과를 조건문에 사용하거나 변수에 할당하거나 다른 메서드에 인수로 전달하세요.
pl: Element {0} wywołuje element {1}, ale nie używa wartości zwracanej przez metodę. Ponieważ metoda {1} jest oznaczona jako metoda Pure, nie może ona mieć efektów ubocznych. Użyj wyniku w instrukcji warunkowej, przypisz wynik do zmiennej lub przekaż go jako argument do innej metody.
pt_br: {0} chama {1}, mas não usa o valor retornado pelo método. Como {1} é marcado como um método Pure, ele não pode ter efeitos colaterais. Use o resultado em uma instrução condicional, atribua o resultado a uma variável ou passe-o como argumento para outro método.
ru: {0} вызывает {1}, но не использует значение, возвращаемое методом. Так как {1} помечен как метод Pure, он не может иметь побочные эффекты. Используйте результат в условном операторе, присвойте его переменной или передайте его в качестве аргумента другому методу.
tr: {0} {1} çağırıyor ancak yöntemin döndürdüğü değeri kullanmıyor. {1} Saf yöntem olarak işaretlendiğinden yan etkilere sahip olamaz. Bir koşullu ifadedeki sonucu kullanın, sonucu bir değişkene atayın veya bir bağımsız değişken olarak başka bir yönteme geçirin.
zh_hans: {0} 调用 {1}，但不使用方法返回的值。{1} 被标记为纯方法，所以不会有副作用。请使用条件语句中的结果，并将结果赋给变量或将其作为自变量传递给另一个方法。
zh_hant: {0} 呼叫了 {1}，但未使用方法傳回的值。因為 {1} 標記為 Pure 方法，所以不能有副作用。請使用條件陳述式中的結果、將結果指派到變數，或將其以引數方式傳遞到另一個方法。

# UseNameOfInPlaceOfStringDescription
source: Using nameof helps keep your code valid when refactoring.
cs: Použití nameof pomůže zachovat platnost vašeho kódu při refaktoringu.
de: Durch das Verwenden von "nameof" behält Ihr Code beim Refactoring seine Gültigkeit.
es: El uso de nameof ayuda a mantener el código válido durante la refactorización.
fr: L'utilisation de nameof permet à votre code de rester valide lors de la refactorisation.
it: Se si usa nameof, il codice rimarrà valido durante il refactoring.
ja: nameof を使用するとリファクタリング時にコードを有効な状態に保つ上で役立ちます。
ko: nameof를 사용하면 리팩터링 시 코드를 유효하게 유지할 수 있습니다.
pl: Korzystanie z operatora pomaga zachować poprawność kodu przy refaktoryzacji.
pt_br: Usar nameof ajuda a manter seu código válido ao refatorar.
ru: Использование nameof позволяет обеспечить работоспособность кода при рефакторинге.
tr: Nameof kullanmak yeniden düzenlerken kodunuzun geçerli kalmasına yardımcı olur.
zh_hans: 在重构时使用 nameof 帮助代码保持有效性。
zh_hant: 使用 nameof 可以協助您於重構時保持程式碼的有效性。

# UseNameOfInPlaceOfStringMessage
source: Use nameof in place of string literal '{0}'
cs: Namísto řetězcového literálu {0} použijte nameof.
de: "nameof" anstelle des Zeichenfolgenliterals "{0}" verwenden
es: Use nameof en lugar del literal de cadena "{0}"
fr: Utiliser nameof à la place du littéral de chaîne '{0}'
it: Usare nameof invece del valore letterale stringa '{0}'
ja: 文字列リテラル '{0}' の代わりに nameof を使用します
ko: 문자열 리터럴 '{0}' 대신 nameof 사용
pl: Użyj operatora nameof zamiast literału ciągu „{0}”
pt_br: Usar nameof em lugar do literal de cadeia de caracteres '{0}'
ru: Используйте nameof вместо строкового литерала "{0}"
tr: Dize sabiti '{0}' yerine nameof kullanın
zh_hans: 使用 nameof 代替字符串文本“{0}”
zh_hant: 使用 nameof 取代字串常值 '{0}'

# UseNameOfInPlaceOfStringTitle
source: Use nameof to express symbol names
cs: K vyjádření názvů symbolů použijte nameof
de: "nameof" für Symbolnamen verwenden
es: Use nameof para expresar nombres de símbolos
fr: Utiliser nameof pour exprimer les noms de symboles
it: Usare nameof per esprimere nomi di simbolo
ja: nameof を使用してシンボル名を表現します
ko: 기호 이름을 표시하기 위해 nameof 사용
pl: Używaj operatora nameof, aby wyrażać nazwy symboli
pt_br: Usar nameof para expressar nomes de símbolo
ru: Используйте nameof для выражения имен символов
tr: Sembol adlarını ifade etmek için nameof kullanın
zh_hans: 使用 nameof 表达符号名称
zh_hant: 使用 nameof 表示符號名稱

# AvoidPropertySelfAssignmentMessage
source: The property {0} should not be assigned to itself
cs: Vlastnost {0} nesmí být přiřazena sama k sobě.
de: Die Eigenschaft "{0}" darf nicht sich selbst zugewiesen werden.
es: La propiedad {0} no debe asignarse a sí misma.
fr: La propriété {0} ne doit pas être assignée à elle-même
it: La proprietà {0} non deve essere assegnata a se stessa
ko: {0} 속성을 자체에 할당하면 안 됩니다.
pl: Właściwość {0} nie powinna być przypisana do samej siebie
pt_br: A propriedade {0} não deve ser atribuída a si mesma
ru: Свойство {0} запрещено назначать самому себе.
tr: {0} özelliği kendisine atanmamalıdır
zh_hans: 不得将属性 {0} 分配给其自身
zh_hant: 不應將屬性 {0} 指派給屬性自身

# AvoidPropertySelfAssignmentTitle
source: Do not assign a property to itself
cs: Nepřiřazujte vlastnost k ní samotné
de: Eigenschaft nicht sich selbst zuweisen
es: No asignar una propiedad a sí misma
fr: N'assignez pas une propriété à elle-même
it: Non assegnare una proprietà a se stessa
ko: 속성을 자체에 할당하면 안 됨
pl: Nie przypisuj właściwości do jej samej
pt_br: Não atribua uma propriedade a si mesma
ru: Запрет назначения свойства самому себе
tr: Bir özelliği kendisine atamayın
zh_hans: 请勿将属性分配给其自身
zh_hant: 請勿將屬性指派給屬性自身

# MarkMembersAsStaticCodeFix
source: Make static
cs: Nastavit jako statickou
de: Als statisch festlegen
es: Hacer estático
fr: Rendre statique
it: Imposta come statici
ja: 静的にする
ko: 정적으로 만들기
pl: Ustaw jako statyczne
pt_br: Tornar estático
ru: Сделать статическим
tr: Statik yap
zh_hans: 设为静态
zh_hant: 使其變成靜態

# MarkMembersAsStaticCodeFix_WarningAnnotation
source: Some references to '{0}' could not be fixed, they should be fixed manually.
cs: Některé odkazy na {0} nešlo opravit. Měly by se opravit ručně.
de: Einige Verweise auf "{0}" konnten nicht korrigiert werden. Korrigieren Sie sie manuell.
es: Algunas referencias a "{0}" podrían no corregirse, así que tendría que hacerlo manualmente.
fr: Des références à '{0}' n'ont pas pu être corrigées, elles doivent être corrigées manuellement.
it: Non è stato possibile correggere alcuni riferimenti a '{0}'. Correggerli manualmente.
ja: '{0}' への参照を修正できませんでした。手動で修正する必要があります。
ko: '{0}'에 대한 일부 참조를 수정할 수 없습니다. 수동으로 수정해야 합니다.
pl: Nie można naprawić niektórych odwołań do „{0}”. Należy je naprawić ręcznie.
pt_br: Algumas referências a '{0}' não puderam ser corrigidas, elas devem ser corrigidas manualmente.
ru: Не удалось исправить некоторые ссылки на "{0}". Их следует исправить вручную.
tr: Bazı '{0}' başvuruları düzeltilemedi, bunları kendiniz düzeltmelisiniz.
zh_hans: 无法修复对“{0}”的部分引用，应手动修复它们。
zh_hant: 無法修正對 '{0}' 的某些參考，應予以手動修正。

# UseLiteralsWhereAppropriateTitle
source: Use literals where appropriate
cs: Tam, kde je to vhodné, použijte literály
de: Nach Möglichkeit Literale verwenden
es: Usar literales cuando resulte apropiado
fr: Utiliser des littéraux quand cela est approprié
it: Usa valori letterali dove appropriato
ja: 適切な場所にリテラルを使用します
ko: 적합한 리터럴을 사용하세요.
pl: Używaj literałów w odpowiednich miejscach
pt_br: Usar literais sempre que apropriado
ru: Используйте литералы, когда это уместно
tr: Uygun durumlarda sabit değerler kullanın
zh_hans: 在合适的位置使用文本
zh_hant: 適當時機使用常值

# UseLiteralsWhereAppropriateDescription
source: A field is declared static and read-only (Shared and ReadOnly in Visual Basic), and is initialized by using a value that is computable at compile time. Because the value that is assigned to the targeted field is computable at compile time, change the declaration to a const (Const in Visual Basic) field so that the value is computed at compile time instead of at runtime.
cs: Pole je deklarováno jako statické a jen ke čtení (ve Visual Basicu jako Shared a ReadOnly) a je inicializováno pomocí hodnoty, kterou lze při kompilaci vypočítat. Vzhledem k tomu, že hodnotu přidruženou k cílovému poli je možné při kompilaci vypočítat, změňte deklaraci na pole const (Const ve Visual Basicu), aby se tato hodnota vypočítala při kompilaci, a nikoli za běhu.
de: Ein Feld wird als "static" und "read-only" ("Shared" und "ReadOnly" in Visual Basic) deklariert und anhand eines Werts initialisiert, der zur Kompilierzeit berechnet werden kann. Da der dem Zielfeld zugewiesene Wert zur Kompilierzeit berechnet werden kann, ändern Sie die Deklaration in ein const-Feld (Const in Visual Basic), sodass der Wert statt zur Laufzeit zur Kompilierzeit berechnet wird.
es: Se declara un campo static y readonly (Shared y ReadOnly en Visual Basic) y se inicializa con un valor que se puede calcular durante la compilación. Dado que el valor asignado al campo de destino se calcula en tiempo de compilación, cambie la declaración a un campo const (Const en Visual Basic) para que el valor se calcule en tiempo de compilación en lugar de en tiempo de ejecución.
fr: Un champ est déclaré comme étant static et en lecture seule (Shared et ReadOnly en Visual Basic), et est initialisé à l’aide d’une valeur calculable au moment de la compilation. Dans la mesure où la valeur assignée au champ ciblé est calculable au moment de la compilation, changez la déclaration en la remplaçant par un champ const (Const en Visual Basic) pour que la valeur soit calculée au moment de la compilation et non au moment de l’exécution.
it: Un campo viene dichiarato statico e di sola lettura (Shared e ReadOnly in Visual Basic) e viene inizializzato usando un valore calcolabile in fase di compilazione. Dato che il valore assegnato al campo di destinazione è calcolabile in fase di compilazione, modificare la dichiarazione in un campo const (Const in Visual Basic) in modo che il valore venga calcolato in fase di compilazione anziché in fase di esecuzione.
ko: 필드가 static 및 읽기 전용(Visual Basic의 경우 Shared 및 ReadOnly)으로 선언되었으며 컴파일 시간에 계산할 수 있는 값을 사용하여 초기화되었습니다. 대상 필드에 할당된 값을 컴파일 시간에 계산할 수 있으므로 이 값이 런타임 대신 컴파일 시간에 계산될 수 있도록 선언을 const(Visual Basic의 경우 Const)로 변경하세요.
pl: Pole zostało zadeklarowane jako statyczne i tylko do odczytu (Shared i ReadOnly w języku Visual Basic) i zainicjowane przy użyciu wartości obliczanych w czasie kompilacji. Ponieważ wartość przypisana do pola docelowego jest obliczana w czasie kompilacji, należy zmienić deklarację na pole wartości stałej (Const w języku Visual Basic), aby wartość była obliczana w czasie kompilacji, a nie w czasie wykonywania.
pt_br: Um campo é declarado estático e somente leitura (Compartilhando e Somente Leitura no Visual Basic) e é inicializado usando um valor computável em tempo de compilação. Como o valor atribuído ao campo de destino é computável em tempo de compilação, altere a declaração para um campo const (Const no Visual Basic) para que o valor seja calculado em tempo de compilação em vez de no runtime.
ru: Поле объявлено как статическое и доступное только для чтения (Shared и ReadOnly в Visual Basic) и инициализировано с помощью значения, вычисляемого во время компиляции. Так как значение, присвоенное целевому полю, вычисляется во время компиляции, измените объявление на поле константы (Const в Visual Basic), чтобы значение вычислялось во время компиляции, а не во время выполнения.
tr: Alanlar statik ve salt okunur (Visual Basic’te Shared ve ReadOnly) olarak bildirilir ve derleme zamanında hesaplanabilen bir değer kullanılarak başlatılır. Hedeflenen alana atanmış değer derleme zamanında hesaplanabildiğinden, bir sabit (Visual Basic’te Const) alanına yönelik bildirimi, değerin çalışma zamanı yerine derleme zamanında hesaplanacağı şekilde değiştirin.
zh_hans: 字段声明为静态和只读(在 Visual Basic 中为“共享”和“只读”)，并且使用编译时可计算的值进行初始化。由于分配给目标字段的值在编译时是可计算的，因此将声明更改为“常量”(在 Visual Basic 中为“常量”)，以便在编译时而非运行时计算值。
zh_hant: 宣告為靜態及唯讀的欄位 (在 Visual Basic 中為 Shared 及 ReadOnly)，使用編譯時期可計算的值初始化。因為指派給目標欄位的值，可於編譯期間進行計算，將宣告變更為 Const (在 Visual Basic 中為 Const) 欄位，所以此值可於編譯期間計算，而非於執行階段計算。

# UseLiteralsWhereAppropriateMessageDefault
source: Field '{0}' is declared as 'readonly' but is initialized with a constant value. Mark this field as 'const' instead.
cs: Pole {0} se deklarovalo jako readonly, ale je inicializované pomocí konstantní hodnoty. Označte toto pole místo toho jako const.
de: Das Feld "{0}" wurde als "readonly" deklariert, wird jedoch mit einem konstanten Wert initialisiert. Markieren Sie dieses Feld stattdessen als "const".
es: El campo "{0}" se declara como "readonly", pero se inicializa con un valor constante. Marque este campo como "const".
fr: Le champ '{0}' est déclaré comme étant 'readonly' mais il est initialisé avec une valeur de constante. À la place, marquez ce champ comme étant un champ 'const'.
it: Il campo '{0}' è dichiarato come 'readonly' ma è inizializzato con un valore costante. Contrassegnare questo campo come 'const'.
ja: フィールド '{0}' は 'readonly' として宣言されていますが、定数値を指定して初期化されています。代わりに、このフィールドを 'const' として設定してください。
ko: '{0}' 필드가 'readonly'로 선언되었지만 상수 값으로 초기화되었습니다. 대신 이 필드를 'const'로 표시하세요.
pl: Pole „{0}” zostało zadeklarowane jako „readonly”, ale zainicjowano je za pomocą wartości stałej. Zamiast tego oznacz to pole jako „const”.
pt_br: O campo '{0}' está declarado como 'readonly', mas foi inicializado com um valor constante. Nesse caso, marque esse campo como 'const'.
ru: Поле "{0}" объявлено как "readonly", но инициализировано как константа. Вместо этого пометьте поле как "const".
tr: '{0}' alanı 'readonly' olarak bildirilmiş ama sabit bir değerle başlatılıyor. Bunun yerine, bu alanı 'const' olarak işaretleyin.
zh_hans: 字段“{0}”声明为 "readonly"，但它是用常量值初始化的。请将此字段标记为 "const"。
zh_hant: 欄位 '{0}' 宣告為 'readonly'，但卻使用了常數值進行初始化。將此欄位改標記為 'const'。

# UseLiteralsWhereAppropriateMessageEmptyString
source: Field '{0}' is declared as 'readonly' but is initialized with an empty string (""). Mark this field as 'const' instead.
cs: Pole {0} se deklarovalo jako readonly, ale je inicializované pomocí prázdného řetězce (""). Označte toto pole místo toho jako const.
de: Das Feld "{0}" wurde als "readonly" deklariert, wird jedoch mit einer leeren Zeichenfolge ("") initialisiert. Markieren Sie dieses Feld stattdessen als "const".
es: El campo "{0}" se declara como "readonly", pero se inicializa con una cadena vacía (""). Marque este campo como "const".
fr: Le champ '{0}' est déclaré comme étant 'readonly' mais il est initialisé avec une chaîne vide (""). À la place, marquez ce champ comme étant un champ 'const'.
it: Il campo '{0}' è dichiarato come 'readonly' ma è inizializzato con una stringa vuota (""). Contrassegnare questo campo come 'const'.
ja: フィールド '{0}' は 'readonly' として宣言されていますが、空の文字列 ("") を指定して初期化されています。代わりに、このフィールドを 'const' として設定してください。
ko: '{0}' 필드가 'readonly'로 선언되었지만 빈 문자열("")로 초기화되었습니다. 대신 이 필드를 'const'로 표시하세요.
pl: Pole „{0}” zostało zadeklarowane jako „readonly”, ale zainicjowano je za pomocą pustego ciągu (""). Zamiast tego oznacz to pole jako „const”.
pt_br: O campo '{0}' está declarado como 'readonly', mas foi inicializado com uma cadeia de caracteres vazia (""). Nesse caso, marque esse campo como 'const'.
ru: Поле "{0}" объявлено как "readonly", но инициализировано как пустая строка (""). Вместо этого пометьте поле как "const".
tr: '{0}' alanı 'readonly' olarak bildirilmiş ama boş bir dizeyle ("") başlatılıyor. Bunun yerine, bu alanı 'const' olarak işaretleyin.
zh_hans: 字段“{0}”声明为 "readonly"，但它是用空字符串("")初始化的。请将此字段标记为 "const"。
zh_hant: 欄位 '{0}' 宣告為 'readonly'，但卻使用了空字串 ("") 進行初始化。將此欄位改標記為 'const'。

# DoNotInitializeUnnecessarilyTitle
source: Do not initialize unnecessarily
cs: Nepoužívejte inicializaci zbytečně
de: Keine unnötige Initialisierung
es: No inicializar innecesariamente
fr: Ne pas effectuer d'initialisation inutilement
it: Non eseguire inutilmente l'inizializzazione
ja: 不必要に初期化しません
ko: 불필요한 초기화를 수행하지 마세요.
pl: Nie inicjuj niepotrzebnie
pt_br: Não inicializar desnecessariamente
ru: Не делайте лишних инициализаций
tr: Gerekmediği durumlarda başlatmayın
zh_hans: 避免进行不必要的初始化
zh_hant: 請勿進行非必要的初始化
