Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# OverrideGetHashCodeOnOverridingEqualsDescription
source: GetHashCode returns a value, based on the current instance, that is suited for hashing algorithms and data structures such as a hash table. Two objects that are the same type and are equal must return the same hash code.
cs: GetHashCode vrací hodnotu na základě aktuální instance, která je vhodná pro algoritmy hash a datové struktury, jako je zatřiďovací tabulka. Dva objekty, které jsou stejného typu a rovnají se, musejí vracet stejný kód hash.
de: GetHashCode gibt basierend auf der aktuellen Instanz einen Wert zurück, der für Hashalgorithmen und Datenstrukturen wie eine Hashtabelle geeignet ist. Zwei Objekte, die vom selben Typ und gleich sind, müssen denselben Hashcode zurückgeben.
es: GetHashCode devuelve un valor basado en la instancia actual que se adapta a las estructuras de datos y los algoritmos hash, como una tabla hash. Dos objetos iguales del mismo tipo deben devolver el mismo código hash.
fr: GetHashCode retourne une valeur, en fonction de l'instance actuelle, qui est adaptée aux algorithmes de hachage et aux structures de données telles qu'une table de hachage. Deux objets de même type et égaux doivent retourner le même code de hachage.
it: GetHashCode restituisce un valore, basato sull'istanza corrente, che è appropriato per algoritmi hash e strutture dei dati come una tabella hash. Due oggetti uguali e dello stesso tipo devono restituire lo stesso codice hash.
ja: GetHashCode は、現在のインスタンスに基づいて、ハッシュ アルゴリズムとデータ構造 (ハッシュ テーブルなど) に適した値を返します。同じ型で等しい 2 つのオブジェクトは、同じハッシュ コードを返す必要があります。
ko: GetHashCode는 현재 인스턴스를 기반으로 값을 반환하며 이 값은 해시 알고리즘과 해시 테이블과 같은 데이터 구조에 적합합니다. 형식이 같은 동일한 개체 2개는 동일한 해시 코드를 반환해야 합니다.
pl: Metoda GetHashCode zwraca wartość na podstawie bieżącego wystąpienia, co jest przydatne na potrzeby algorytmów skrótu i struktur danych takich jak tablica skrótów. Dwa obiekty, które są tego samego typu i są równe, muszą zwracać ten sam kod skrótu.
pt_br: GetHashCode retorna um valor, com base na instância atual, que é adequado para algoritmos de hash e estruturas de dados como uma tabela de hash. Dois objetos do mesmo tipo e iguais devem retornar o mesmo código hash.
ru: GetHashCode возвращает значение, основанное на текущем экземпляре, которое подходит для хэш-алгоритмов и структур данных, таких как хэш-таблица. Два равных объекта одного типа должны возвращать одинаковый хэш-код.
tr: GetHashCode, geçerli örnek temel alınarak bir değer döndürür ve bu değer, algoritmaların ve veri yapılarının bir karma tablo gibi karmasını oluşturmak için uygundur. Aynı türde ve eşit olan iki nesne, aynı karma kodu döndürmelidir.
zh_hans: GetHashCode 基于当前实例返回一个值，该值适用于哈希算法和数据结构(如哈希表)。类型相同且相等的两个对象必须返回相同哈希代码。
zh_hant: GetHashCode 會依據目前執行個體傳回值，適用於雜湊演算法以及像是雜湊資料表等的資料結構。兩個具有相同類型且相等的物件，必須傳回相同的雜湊碼。

# OverrideGetHashCodeOnOverridingEqualsMessage
source: Override GetHashCode on overriding Equals
cs: Přepište GetHashCode při přepisu Equals.
de: GetHashCode beim Außerkraftsetzen von "Equals" außer Kraft setzen
es: Reemplazar GetHashCode al reemplazar Equals
fr: Remplacer GetHashCode au moment de remplacer Equals
it: Eseguire l'override di GetHashCode durante l'override di Equals
ja: オーバーライドする Equals で GetHashCode をオーバーライドします
ko: Equals를 재정의할 때 GetHashCode를 재정의하세요.
pl: Przesłoń metodę GetHashCode przy przesłanianiu metody Equals
pt_br: Substituir GetHashCode ao substituir Equals
ru: Переопределите GetHashCode при переопределении Equals
tr: Equals geçersiz kılındığında GetHashCode’u geçersiz kılın
zh_hans: 重写 Equals 时重写 GetHashCode
zh_hant: 覆寫 Equals 時覆寫 GetHashCode

# OverrideEqualsOnOverloadingOperatorEqualsTitle
source: Override Equals on overloading operator equals
cs: Přepište Equals při přetížení operátorů rovnosti.
de: "Equals" beim Überladen von Gleichheitsoperatoren außer Kraft setzen
es: Reemplazar Equals al sobrecargar operadores de igualdad
fr: Remplacer Equals au moment de surcharger l'opérateur égal
it: Eseguire l'override di Equals durante l'overload dell'operatore di uguaglianza
ja: オーバーロードする演算子 equals で Equals をオーバーライドします
ko: 같음 연산자를 오버로드할 때 Equals를 재정의하세요.
pl: Przesłoń metodę Equals przy przeciążaniu operatora równości
pt_br: Substituir Equals ao sobrecarregar o operador Equals
ru: Переопределите Equals при перегрузке оператора равенства
tr: Aşırı yükleme işleci eşit olduğunda Equals’ı geçersiz kılın
zh_hans: 重载相等运算符时重写 Equals 方法
zh_hant: 多載等號比較運算子時覆寫 Equals

# OverrideEqualsOnOverloadingOperatorEqualsDescription
source: A public type implements the equality operator but does not override Object.Equals.
cs: Veřejný typ implementuje operátor rovnosti, ale nepřepisuje Object.Equals.
de: Ein öffentlicher Typ implementiert den Gleichheitsoperator, setzt jedoch "Object.Equals" nicht außer Kraft.
es: Un tipo público implementa el operador de igualdad, pero no reemplaza Object.Equals.
fr: Un type public implémente l'opérateur d'égalité, mais ne remplace pas Object.Equals.
it: Un tipo public implementa l'operatore di uguaglianza, ma non esegue l'override di Object.Equals.
ja: パブリック型では等値演算子が実装されますが、Object.Equals はオーバーライドされていません。
ko: public 형식이 같음 연산자를 구현하지만 Object.Equals를 재정의하지 않습니다.
pl: Typ publiczny implementuje operator równości, lecz nie przesłania metody Object.Equals.
pt_br: Um tipo público implementa o operador de igualdade, mas não substitui Object.Equals.
ru: Общий тип реализует оператор равенства, но не переопределяет Object.Equals.
tr: Genel bir tür eşitlik işlecini uygular, ancak Object.Equals’ı geçersiz kılmaz.
zh_hans: 公共类型实现相等运算符但不重写 Object.Equals。
zh_hant: 公用類型會實作等號比較運算子，但不會覆寫 Object.Equals。

# OverrideEqualsOnOverloadingOperatorEqualsMessage
source: Override Equals on overloading operator equals
cs: Přepište Equals při přetížení operátorů rovnosti.
de: "Equals" beim Überladen von Gleichheitsoperatoren außer Kraft setzen
es: Reemplazar Equals al sobrecargar operadores de igualdad
fr: Remplacer Equals au moment de surcharger l'opérateur égal
it: Eseguire l'override di Equals durante l'overload dell'operatore di uguaglianza
ja: オーバーロードする演算子 equals で Equals をオーバーライドします
ko: 같음 연산자를 오버로드할 때 Equals를 재정의하세요.
pl: Przesłoń metodę Equals przy przeciążaniu operatora równości
pt_br: Substituir Equals ao sobrecarregar o operador Equals
ru: Переопределите Equals при перегрузке оператора равенства
tr: Aşırı yükleme işleci eşit olduğunda Equals’ı geçersiz kılın
zh_hans: 重载相等运算符时重写 Equals 方法
zh_hant: 多載等號比較運算子時覆寫 Equals

source: Since '{0}' redefines operator '{1}', it should also redefine operator '{2}'
cs: Protože {0} mění definici operátoru {1}, má rovněž měnit definici operátoru {2}.
de: Da "{0}" den Operator "{1}" neu definiert, muss auch der Operator "{2}" neu definiert werden.
es: Dado que “{0}” redefine el operador “{1}”, también debe redefinir el operador “{2}”
fr: Dans la mesure où '{0}' redéfinit l'opérateur '{1}', il doit également redéfinir l'opérateur '{2}'
it: Dal momento che '{0}' ridefinisce l'operatore '{1}', deve ridefinire anche l'operatore '{2}'
ja: '{0}' は演算子 '{1}' を再定義するため、演算子 '{2}' も再定義しなければなりません
ko: '{0}'이(가) '{1}' 연산자를 다시 정의하므로 '{2}' 연산자도 다시 정의해야 합니다.
pl: Ponieważ typ „{0}” definiuje ponownie operator „{1}”, powinien także definiować ponownie operator „{2}”
pt_br: Como '{0}' redefine o operador '{1}', ele também deve redefinir o operador '{2}'
ru: Так как "{0}" переопределяет оператор "{1}", он должен переопределять и оператор "{2}"
tr: '{0}', '{1}' işlecini yeniden tanımladığından '{2}' işlecini de yeniden tanımlamalıdır.
zh_hans: 由于“{0}”重定义运算符“{1}”，因此它还应该重定义运算符“{2}”
zh_hant: 因為 '{0}' 會重新定義運算子 '{1}'，所以其應也會重新定義運算子 '{2}'

source: Generate missing operators
cs: Vygenerujte chybějící operátory.
de: Fehlende Operatoren generieren
es: Generar operadores que faltan
fr: Générer les opérateurs manquants
it: Generare gli operatori mancanti
ja: 不足している演算子を生成します
ko: 누락된 연산자를 생성하세요.
pl: Wygeneruj brakujące operatory
pt_br: Gerar operadores ausentes
ru: Создайте отсутствующие операторы
tr: Eksik işleçleri oluşturun
zh_hans: 生成丢失的运算符
zh_hant: 產生遺漏的運算子

# OverrideEqualsOnOverloadingOperatorEqualsCodeActionTitle
source: Override object.Equals
cs: Přepište object.Equals.
de: "object.Equals" außer Kraft setzen
es: Reemplazar object.Equals
fr: Remplacer object.Equals
it: Eseguire l'override di object.Equals
ja: object.Equals をオーバーライドします
ko: object.Equals를 재정의하세요.
pl: Przesłoń metodę object.Equals
pt_br: Substituir object.Equals
ru: Переопределите object.Equals
tr: object.Equals’ı geçersiz kılın
zh_hans: 重写 object.Equals
zh_hant: 覆寫 object.Equals

# OverrideEqualsOnImplementingIEquatableCodeActionTitle
source: Override object.Equals
cs: Přepište object.Equals.
de: "object.Equals" außer Kraft setzen
es: Reemplazar object.Equals
fr: Remplacer object.Equals
it: Eseguire l'override di object.Equals
ja: object.Equals をオーバーライドします
ko: object.Equals를 재정의하세요.
pl: Przesłoń metodę object.Equals
pt_br: Substituir object.Equals
ru: Переопределите object.Equals
tr: object.Equals’ı geçersiz kılın
zh_hans: 重写 object.Equals
zh_hant: 覆寫 object.Equals

# OverrideGetHashCodeOnOverridingEqualsCodeActionTitle
source: Override object.GetHashCode
cs: Přepište object.GetHashCode.
de: "object.GetHashCode" außer Kraft setzen
es: Reemplazar object.GetHashCode
fr: Remplacer object.GetHashCode
it: Eseguire l'override di object.GetHashCode
ja: object.GetHashCode をオーバーライドします
ko: object.GetHashCode를 재정의하세요.
pl: Przesłoń metodę object.GetHashCode
pt_br: Substituir object.GetHashCode
ru: Переопределите object.GetHashCode
tr: object.GetHashCode’u geçersiz kılın
zh_hans: 重写 object.GetHashCode
zh_hant: 覆寫 object.GetHashCode

source: Make exception public
cs: Nastavte výjimku jako veřejnou.
de: Ausnahme öffentlich machen
es: Convertir la excepción en pública
fr: Rendre l'exception publique
it: Impostare l'eccezione come public
ja: 例外を public に設定します
ko: 예외를 public으로 설정하세요.
pl: Zadeklaruj wyjątek jako publiczny
pt_br: Tornar exceção pública
ru: Сделайте исключение общим
tr: Özel durumu genel yapın
zh_hans: 使异常公开
zh_hant: 將例外狀況設為公用

# InterfaceMethodsShouldBeCallableByChildTypesFix1
source: Make '{0}' protected.
cs: Nastavte {0} jako chráněnou.
de: Legen Sie "{0}" als geschützt fest.
es: Convierta “{0}” en un elemento protegido.
fr: Rendre '{0}' protégé.
it: Impostare '{0}' come protected.
ja: '{0}' を protected に設定します。
ko: '{0}'을(를) protected로 설정하세요.
pl: Zadeklaruj element „{0}” jako chroniony.
pt_br: Torne '{0}' protegido.
ru: Сделайте "{0}" защищенным.
tr: '{0}' öğesini korumalı yapın.
zh_hans: 使“{0}”受保护。
zh_hant: 將 '{0}' 設為受保護。

# InterfaceMethodsShouldBeCallableByChildTypesFix2
source: Change '{0}' to a public interface implementation.
cs: Změňte {0} na implementaci veřejného rozhraní.
de: Ändern Sie "{0}" in eine öffentliche Schnittstellenimplementierung.
es: Cambie “{0}” a una implementación de interfaz pública.
fr: Changez '{0}' en implémentation d'interface publique.
it: Modificare '{0}' in un'implementazione di interfaccia public.
ja: '{0}' をパブリック インターフェイスの実装に変更します。
ko: '{0}'을(를) 공용 인터페이스 구현으로 변경하세요.
pl: Zmodyfikuj element „{0}” zgodnie z implementacją interfejsu publicznego.
pt_br: Altere '{0}' para uma implementação de interface pública.
ru: Измените "{0}" на реализацию общего интерфейса.
tr: '{0}' öğesini genel bir arabirim uygulamasına dönüştürün.
zh_hans: 将“{0}”更改为公共接口实现。
zh_hant: 將 '{0}' 變更為公用介面實作。

# InterfaceMethodsShouldBeCallableByChildTypesFix3
source: Make the containing type '{0}' sealed.
cs: Nastavte obsahující typ {0} jako zapečetěný.
de: Legen Sie den enthaltenden Typ "{0}" als versiegelt fest.
es: Convierta el tipo contenedor “{0}” en sellado.
fr: Rendez le type conteneur '{0}' sealed.
it: Impostare il tipo contenitore '{0}' come sealed.
ja: 含んでいる型 '{0}' をシールドに設定します。
ko: 포함하는 형식 '{0}'을(를) sealed로 설정하세요.
pl: Zapieczętuj typ zawierający „{0}”.
pt_br: Torne o tipo recipiente '{0}' selado.
ru: Сделайте содержащий тип "{0}" запечатанным.
tr: İçeren türü '{0}' mühürlü yapın.
zh_hans: 使包含类型“{0}”为密封。
zh_hant: 將包含類型 '{0}' 設為密封。

# StaticHolderTypeIsNotStatic
source: Type '{0}' is a static holder type but is neither static nor NotInheritable
cs: Typ {0} je typ statický typ držitele, ale není ani statický, ani nedědičný.
de: Der Typ "{0}" ist ein statischer Containertyp, aber weder "Static" noch "NotInheritable".
es: “{0}” es un tipo contenedor estático, pero no es static ni NotInheritable
fr: Le type '{0}' est un type conteneur statique mais il n'est ni Static ni NotInheritable
it: Il tipo '{0}' è un tipo che contiene membri static ma non è né static né NotInheritable
ja: 型 '{0}' はスタティック ホルダー型ですが、static でも NotInheritable でもありません
ko: '{0}' 형식은 정적 소유자 형식이지만 Static 또는 NotInheritable이 아닙니다.
pl: Typ „{0}” jest statycznym typem przechowującym, ale nie jest statyczny i nie ma modyfikatora NotInheritable
pt_br: O tipo '{0}' é um tipo que retém membros estáticos, mas não é static nem NotInheritable
ru: Тип "{0}" относится к статическим заполнителям, однако не является ни Static, ни NotInheritable
tr: '{0}' türü statik bir tutucu tür olmasına rağmen ne statik ne de NotInheritable
zh_hans: 类型“{0}”是一个静态容器类型，但既非 static 又非 NotInheritable
zh_hant: 類型 '{0}' 是靜態預留位置類型，但並非 Static 或 NotInheritable

source: Static holder types should be Static or NotInheritable
cs: Statické typy držitelů mají být statické nebo nedědičné.
de: Statische Containertypen müssen "Static" oder "NotInheritable" sein.
es: Los tipos de contenedor estáticos deben ser Static o NotInheritable
fr: Les types conteneurs statiques doivent être Static ou NotInheritable
it: I tipi che contengono membri static devono Static o NotInheritable
ja: スタティック ホルダー型は Static または NotInheritable でなければなりません
ko: 정적 소유자 형식은 Static 또는 NotInheritable이어야 합니다.
pl: Statyczne typy przechowujące powinny być zadeklarowane za pomocą modyfikatora Static lub NotInheritable
pt_br: Os tipos recipientes de membros estáticos devem ser Static ou NotInheritable
ru: Типы статических заполнителей должны быть Static или NotInheritable
tr: Statik tutucu türler Static veya NotInheritable olmalıdır
zh_hans: 静态容器类型应为 Static 或 NotInheritable
zh_hant: 靜態預留位置類型應為 Static 或 NotInheritable

source: Make Class Static
cs: Nastavte třídu jako statickou.
de: Klasse als statisch festlegen
es: Convertir la clase en estática
fr: Rendre la classe static
it: Impostare la classe come static
ja: クラスを静的にします
ko: 클래스를 Static으로 설정
pl: Zadeklaruj klasę jako statyczną
pt_br: Tornar a classe estática
ru: Сделайте класс статическим
tr: Sınıfı Statik Yapın
zh_hans: 使类变为静态
zh_hant: 將類別設為靜態

# OverrideObjectEqualsMessage
source: Type {0} should override Equals because it implements IEquatable<T>
cs: Typ {0} by měl přepisovat metodu Equals, protože implementuje IEquatable<T>.
de: Der Typ {0} muss Equals außer Kraft setzen, weil IEquatable<T> implementiert wird.
es: El tipo {0} debe reemplazar a Equals porque implementa IEquatable<T>.
fr: Le type {0} doit remplacer Equals, car il implémente IEquatable<T>
it: Il tipo {0} deve eseguire l'override di Equals perché implementa IEquatable<T>
ja: 型 {0} は IEquatable<T> を実装するため、Equals をオーバーライドする必要があります
ko: {0} 형식은 IEquatable<T>를 구현하므로 Equals를 재정의해야 합니다.
pl: Typ {0} powinien przesłaniać metodę Equals, ponieważ implementuje interfejs IEquatable<T>
pt_br: O tipo {0} deve substituir Equals porque ele implementa IEquatable<T>
ru: Тип {0} должен переопределять Equals, так как он реализует IEquatable<T>
tr: {0} türü IEquatable<T> uyguladığından Equals metodunu geçersiz kılmalıdır
zh_hans: 类型 {0} 应替代 Equals，因为它实现 IEquatable<T>
zh_hant: 因為類型 {0} 會實作 IEquatable<T>，所以其應覆寫 Equals

# OverrideObjectEqualsTitle
source: Override Object.Equals(object) when implementing IEquatable<T>
cs: Při implementaci IEquatable<T> přepište Object.Equals(object)
de: "Object.Equals(object)" bei Implementierung von "IEquatable<T>" außer Kraft setzen
es: Reemplazar Object.Equals(object) al implementar IEquatable<T>
fr: Remplacer Object.Equals(object) au moment d'implémenter IEquatable<T>
it: Eseguire l'override di Object.Equals(object) durante l'implementazione di IEquatable<T>
ja: IEquatable<T> を実装するときに Object.Equals(object) をオーバーライドします
ko: IEquatable<T>를 구현할 때 Object.Equals(개체)를 재정의합니다.
pl: Przesłoń metodę Object.Equals(object) przy implementowaniu interfejsu IEquatable<T>
pt_br: Substitua Object.Equals(object) ao implementar IEquatable<T>
ru: Переопределите Object.Equals(object) при реализации IEquatable<T>
tr: IEquatable<T> uygularken Object.Equals(object)’i geçersiz kılın
zh_hans: 在实现 IEquatable<T> 时替代 Object.Equals(object)
zh_hant: 實作 IEquatable<T> 時覆寫 Object.Equals(object)

# UseIntegralOrStringArgumentForIndexersDescription
source: Indexers, that is, indexed properties, should use integer or string types for the index. These types are typically used for indexing data structures and increase the usability of the library. Use of the Object type should be restricted to those cases where the specific integer or string type cannot be specified at design time. If the design requires other types for the index, reconsider whether the type represents a logical data store. If it does not represent a logical data store, use a method.
cs: Indexery, neboli indexované vlastnosti, mají pro index používat celočíselný nebo řetězcový typ. Tyto typy se zpravidla používají pro indexování datových struktur a zvyšují použitelnost knihovny. Použití objektového typu by se mělo omezit na případy, kdy se při návrhu nedá určit konkrétní celočíselný nebo řetězcový typ. Pokud návrh vyžaduje pro index jiné typy, znovu zvažte, jestli tento typ představuje logické datové úložiště. Pokud nepředstavuje logické datové úložiště, použijte metodu.
de: Indizierer, also indizierte Eigenschaften, müssen ganzzahlige oder Zeichenfolgentypen für den Index verwenden. Diese Typen werden in der Regel für die Indizierung von Datenstrukturen verwendet und erhöhen die Nutzbarkeit der Bibliothek. Die Verwendung des Object-Typs muss auf Klassen beschränkt werden, in denen der jeweilige integer- oder string-Typ zur Designzeit nicht angegeben werden kann. Wenn das Design andere Typen für den Index vorsieht, erwägen Sie, ob der Typ einen logischen Datenspeicher darstellt. Wenn er keinen logischen Datenspeicher darstellt, verwenden Sie eine Methode.
es: Los indizadores, es decir, las propiedades indexadas, deben usar tipos enteros o de cadena para el índice. Estos tipos se usan normalmente para indexar las estructuras de datos e incrementar la utilidad de la biblioteca. El uso del tipo Object debe limitarse a los casos en los que el tipo entero o de cadena concreto no se puede especificar en tiempo de diseño. Si el diseño requiere otros tipos para el índice, reconsidere si el tipo representa un almacén de datos lógico. Si no representa un almacén de datos lógico, use un método.
fr: Les indexeurs, c'est-à-dire les propriétés indexées, doivent utiliser des types entier ou chaîne pour l'index. Ces types sont généralement utilisés pour indexer les structures de données. De plus, ils augmentent la facilité d'utilisation de la bibliothèque. L'utilisation du type Object doit se limiter aux cas où le type entier ou chaîne spécifique ne peut pas être spécifié au moment du design. Si le design nécessite d'autres types pour l'index, déterminez si le type représente ou non un magasin de données logique. S'il ne représente pas un magasin de données logique, utilisez une méthode.
it: Gli indicizzatori, ovvero le proprietà indicizzate, devono usare tipi Integer o string per l'indice. Questi tipi vengono usati in genere per l'indicizzazione di strutture dei dati e aumentano l'usabilità della libreria. L'uso del tipo Object deve essere limitato ai casi in cui non sia possibile specificare il tipo Integer o string in fase di progettazione. Se la progettazione richiede altri tipi per l'indice, provare a verificare se l'indice rappresenta un archivio dati logico. Se non rappresenta un archivio dati logico, usare un metodo.
ja: インデクサー (インデックス付きのプロパティ) は、インデックスに整数型または文字列型を使用する必要があります。一般に、これらの型は、データ構造のインデックス作成に使用されます。また、ライブラリの操作感が改善されます。Object 型の使用は、デザイン時に特定の整数型または文字列型を指定できない場合に限定してください。デザインによってインデックスに他の型が必要な場合は、該当する型が論理的なデータ ストアを表しているかどうかを再検討してください。論理的なデータ ストアを表していない場合、メソッドを使用します。
ko: 인덱싱된 속성인 인덱서는 인덱스에 정수 또는 문자열 형식을 사용해야 합니다. 이러한 형식은 일반적으로 인덱싱 데이터 구조에 사용되며 라이브러리의 유용성을 향상시킵니다. 디자인 타임에 특정 정수 또는 문자열 형식이 지정될 수 없는 경우 개체 형식 사용이 제한되어야 합니다. 디자인에 다른 인덱스 형식이 필요한 경우 형식이 논리 데이터 저장소를 나타내는지 확인하세요. 논리 데이터 저장소를 나타내지 않는 경우 메서드를 사용하세요.
pl: Indeksatory (tj. indeksowane właściwości) powinny używać typów całkowitoliczbowych lub ciągów na potrzeby indeksu. Te typy są zazwyczaj używane do indeksowania struktur danych i zwiększają użyteczność biblioteki. Użycie typu Object powinno być ograniczone do przypadków, w których konkretnego typu całkowitoliczbowego lub ciągu nie można określić podczas projektowania. Jeśli projekt wymaga użycia innych typów dla indeksu, rozważ ponownie, czy typ reprezentuje logiczny magazyn danych. Jeśli typ nie reprezentuje logicznego magazynu danych, użyj metody.
pt_br: Indexadores, ou seja, propriedades indexadas, devem usar tipos inteiros ou de cadeia de caracteres para o índice. Esses tipos são normalmente usados para indexar estruturas de dados e aumentar a usabilidade da biblioteca. O uso do tipo Object deve ser restrito aos casos em que o tipo de cadeia de caracteres ou do inteiro específico não possa ser especificado no tempo de design. Se o design exigir outros tipos para o índice, reconsidere se o tipo representa um armazenamento de dados lógico. Se ele não representar um armazenamento de dados lógico, use um método.
ru: Индексаторы, представляющие собой индексированные свойства, должны использовать для индекса целочисленные или строковые типы. Эти типы обычно используются для индексирования структур данных и расширяют возможности по использованию библиотеки. Тип Object разрешено использовать только в тех случаях, когда не удается задать определенный целочисленный или строковый тип во время разработки. Если для проектируемой структуры требуются другие типы индексов, перепроверьте, что тип представляет логическое хранилище данных. Если он этого не делает, используйте метод.
tr: Dizin oluşturucular, yani dizine eklenmiş özellikler dizin için tamsayı veya dize türlerini kullanmalıdır. Bu türler genellikle veri yapılarının dizininin oluşturulması ve kitaplığın kullanılabilirliğinin artırılması için kullanılır. Object türünün kullanımı, tamsayı veya dize türünün tasarım sırasında tam olarak belirtilemediği durumlarla kısıtlı olmalıdır. Tasarım dizin için başka türler gerektiriyorsa, türün mantıksal bir veri deposunu temsil edip etmediğini yeniden değerlendirin. Mantıksal bir veri deposunu temsil etmiyorsa bir yöntem kullanın.
zh_hans: 索引器(即索引属性)应使用索引的整数或字符串类型。这些类型通常用于对数据结构编制索引，并增加库的可用性。对象类型的使用应局限于在设计时不能指定特定整数或字符串类型的情况。如果设计需要索引的其他类型，请重新考虑该类型是否代表逻辑数据存储。如果它不代表逻辑数据存储，请使用方法。
zh_hant: 索引子 (也就是索引屬性) 應使用整數或字串作為索引類型。這些類型通常用於編製資料結構的索引，且可以提升程式庫的可用性。使用 Object 類型應限於無法在設計階段指定特定整數或字串類型的情況。若設計為索引需要其他類型，請重新考慮該類型是否代表邏輯資料存放區。若不代表邏輯資料存放區，請使用方法。

# UseIntegralOrStringArgumentForIndexersMessage
source: Use Integral Or String Argument For Indexers
cs: Použijte pro indexery integrální nebo řetězcový argument.
de: Integrales oder Zeichenfolgenargument für Indizierer verwenden
es: Usar un argumento integral o de cadena para los indizadores
fr: Utiliser un argument de chaîne ou intégral pour les indexeurs
it: Usare un argomento di tipo string o Integer per gli indicizzatori
ja: インデクサーには整数または文字列引数を使用します
ko: 인덱서에 정수 또는 문자열 인수를 사용하세요.
pl: Użyj argumentu całkowitoliczbowego lub ciągu dla indeksatorów
pt_br: Usar argumento integral ou de cadeia de caracteres para indexadores
ru: Используйте целый или строковый аргумент для индексаторов
tr: Dizin Oluşturucular için Tamsayı veya Dize Bağımsız Değişkenini Kullanın
zh_hans: 将整型或字符串参数用于索引器
zh_hant: 為索引子使用整數或字串引數
