Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PassSystemUriObjectsInsteadOfStringsMessage
source: Modify '{0}' to call '{1}' instead of '{2}'
cs: Změňte {0} tak, aby se místo {2} volalo {1}.
de: Ändern Sie "{0}", sodass "{1}" anstelle von "{2}" aufgerufen wird.
es: Modifique "{0}" para llamar a "{1}" en lugar de a "{2}".
fr: Modifiez '{0}' pour appeler '{1}' au lieu de '{2}'
it: Modificare '{0}' in modo che chiami '{1}' invece di '{2}'
ko: '{0}'을(를) 수정하여 '{2}' 대신 '{1}'을(를) 호출하세요.
pl: Zmodyfikuj element „{0}” w celu wywoływania metody „{1}” zamiast „{2}”
pt_br: Modifique '{0}' para chamar '{1}', em vez de '{2}'
ru: Измените "{0}", чтобы вызывать "{1}" вместо "{2}".
tr: '{0}' metodunu '{2}' yerine '{1}' öğesini çağıracak şekilde değiştirin
zh_hans: 修改“{0}”以调用“{1}”而非“{2}”
zh_hant: 將 {0} 修改為呼叫 '{1}'，而非呼叫 '{2}'

# ImplementIEquatableWhenOverridingObjectEqualsTitle
source: Implement IEquatable when overriding Object.Equals
cs: Při přepisu Object.Equals implementujte IEquatable.
de: "IEquatable" beim Außerkraftsetzen von "Object.Equals" implementieren
es: Implementar IEquatable al invalidar Object.Equals
fr: Implémenter IEquatable au moment de remplacer Object.Equals
it: Implementare IEquatable quando si esegue l'override di Object.Equals
ko: Object.Equals를 재정의할 때 IEquatable을 구현하세요.
pl: Zaimplementuj interfejs IEquatable przy przesłanianiu metody Object.Equals
pt_br: Implementar IEquatable ao substituir Object.Equals
ru: Реализуйте IEquatable при переопределении Object.Equals
tr: Object.Equals’ı geçersiz kılarken IEquatable uygulayın
zh_hans: 重写 Object.Equals 时实现 IEquatable
zh_hant: 覆寫 Object.Equals 時實作 IEquatable

# ImplementIEquatableWhenOverridingObjectEqualsMessage
source: Type {0} should implement IEquatable<T> because it overrides Equals
cs: Typ {0} by měl implementovat rozhraní IEquatable<T>, protože přepisuje metodu Equals
de: Typ {0} muss IEquatable<T> implementieren, weil er Equals überschreibt
es: El tipo {0} debe implementar IEquatable<T> porque reemplaza a Equals
fr: Le type {0} doit implémenter IEquatable<T>, car il remplace Equals
it: Il tipo {0} deve implementare IEquatable<T> perché esegue l'override di Equals
ko: {0} 형식은 Equals를 재정의하므로 IEquatable<T>를 구현해야 합니다.
pl: Typ {0} powinien implementować interfejs IEquatable<T>, ponieważ przesłania metodę Equals
pt_br: O tipo {0} deve implementar IEquatable<T> porque ele substitui Equals
ru: Тип {0} должен реализовывать IEquatable<T>, так как он переопределяет Equals
tr: {0} türü Equals metodunu geçersiz kıldığından IEquatable<T> uygulamalıdır
zh_hans: 类型 {0} 应实现 IEquatable<T> ，因为它将替代 Equals
zh_hant: 類型 {0} 應先實作 IEquatable<T>，因為它會覆寫 Equals

# CancellationTokenParametersMustComeLastTitle
source: CancellationToken parameters must come last
cs: Parametry CancellationToken musí být poslední.
de: CancellationToken-Parameter müssen zuletzt aufgeführt werden
es: Los parámetros CancellationToken deben aparecer en último lugar
fr: Les paramètres CancellationToken doivent venir en dernier
it: I parametri CancellationToken devono essere indicati per ultimi
ja: CancellationToken パラメーターは最後に指定する必要があります
ko: CancellationToken 매개 변수는 마지막에 위치해야 합니다.
pl: Parametry CancellationToken muszą występować na końcu
pt_br: Os parâmetros CancellationToken devem vir por último
ru: Параметры CancellationToken должны находиться в конце
tr: CancellationToken parametreleri en sonda olmalıdır
zh_hans: CancellationToken 参数必须最后出现
zh_hant: CancellationToken 參數必須位於最後

# CancellationTokenParametersMustComeLastMessage
source: Method '{0}' should take CancellationToken as the last parameter
cs: Metoda {0} má převzít CancellationToken jako poslední parametr.
de: Die Methode "{0}" muss CancellationToken als letzten Parameter annehmen.
es: El método “{0}” debe tomar CancellationToken como último parámetro.
fr: La méthode '{0}' doit accepter CancellationToken en tant que dernier paramètre
it: Il metodo '{0}' deve accettare CancellationToken come ultimo parametro
ja: メソッド '{0}' は、CancellationToken を最後のパラメーターとして受け取る必要があります
ko: 메서드 '{0}'은(는) CancellationToken을(를) 마지막 매개 변수로 사용해야 합니다.
pl: Metoda „{0}” powinna pobierać wartość CancellationToken jako ostatni parametr
pt_br: O método '{0}' deve usar CancellationToken como o último parâmetro
ru: Метод "{0}" должен принимать CancellationToken в качестве параметра
tr: '{0}' yöntemi, son parametre olarak CancellationToken’ı almalıdır
zh_hans: 方法“{0}”应将 CancellationToken 作为最后一个参数
zh_hant: 方法 '{0}' 應以 CancellationToken 作為最後一個參數

# IdentifiersShouldNotContainTypeNamesTitle
source: Identifier contains type name
cs: Identifikátor obsahuje název typu.
de: Bezeichner enthält Typnamen
es: El identificador contiene el nombre de tipo
fr: L'identificateur contient le nom de type
it: L'identificatore contiene il nome di tipo
ja: 識別子に型名が含まれます
ko: 식별자가 형식 이름을 포함합니다.
pl: Identyfikator zawiera nazwę typu
pt_br: O identificador contém o nome de tipo
ru: Идентификатор содержит имя типа
tr: Tanımlayıcı tür adı içeriyor
zh_hans: 标识符包含类型名称
zh_hant: 識別項包含類型名稱

# IdentifiersShouldNotContainTypeNamesDescription
source: Names of parameters and members are better used to communicate their meaning than to describe their type, which is expected to be provided by development tools. For names of members, if a data type name must be used, use a language-independent name instead of a language-specific one.
cs: Názvy parametrů a členů se používají spíše k vyjádření jejich významu než k popisu jejich typu, což se očekává od vývojových nástrojů. Pokud se pro názvy členů musí použít název datového typu, použijte místo jazykově specifického názvu nějaký název nezávislý na jazyku.
de: Namen von Parametern und Membern sollten lieber Aufschluss über ihre Bedeutung geben als zur Beschreibung ihres Typs dienen. Dieser wird normalerweise durch die Entwicklungstools angegeben. Wenn ein Datentypname verwendet werden muss, verwenden Sie für Namen von Membern einen sprachunabhängigen Namen anstelle eines sprachspezifischen Namens.
es: Es mejor usar los nombres de parámetros y miembros para comunicar su significado que para describir el tipo al que pertenecen, ya que esta información suelen proporcionarla las herramientas de desarrollo. En los nombres de miembros, si es necesario usar un nombre de tipo de datos, utilice un nombre independiente del lenguaje en lugar de uno específico de este.
fr: Les noms de paramètres et de membres sont plus utiles pour indiquer leur signification que pour décrire leur type, ce qui est censé être effectué par les outils de développement. Pour les noms de membres, si un nom de type de données doit être employé, utilisez un nom indépendant des langages au lieu d'un nom spécifique à un langage.
it: I nomi di parametri e membri devono comunicare il loro significato e non descriverne il tipo, che viene in genere fornito dagli strumenti di sviluppo. Se per i nomi di membri è necessario usare un nome di tipo di dati, indicare un nome indipendente dal linguaggio invece di uno specifico del linguaggio.
ja: パラメーターとメンバーの名前では、パラメーターとメンバーの型ではなく意味を伝えるようにします。パラメーターとメンバーの型は、開発ツールで表示されるためです。メンバー名では、データ型名を使用する必要がある場合、言語固有の名前ではなく、言語に依存しない名前を使用します。
ko: 매개 변수 및 멤버 이름은 형식을 설명하기보다 의미를 통신하는 데 유용하게 사용되며, 개발 도구에서 이러한 이름을 제공해야 합니다. 멤버 이름의 경우, 데이터 형식 이름을 사용해야 하는 상황에서는 특정 언어 이름 대신 언어 독립 이름을 사용하세요.
pl: Nazwy parametrów i elementów członkowskich powinny raczej określać ich znaczenie niż opisywać ich typ, który powinien być udostępniany przez narzędzia programistyczne. Jeśli jest konieczne użycie nazwy typu danych w nazwach elementów członkowskich, użyj nazwy niezależnej od języka zamiast nazwy specyficznej dla języka.
pt_br: Os nomes dos parâmetros e dos membros são melhor usados para comunicar seu significado em vez de para descrever seu tipo, que deve ser fornecido por ferramentas de desenvolvimento. Para nomes de membros, se um nome de tipo de dados deve ser usado, use um nome independente da linguagem em vez de um nome específico a um idioma.
ru: Имена параметров и членов лучше использовать для описания их значения, а не для указания их типа, который должен быть предоставлен средствами разработки. Если для имен членов нужно использовать имя типа данных, используйте независимое от языка имя вместо зависимого от языка.
tr: Parametre ve üye adlarının, geliştirme araçları tarafından sağlanması beklenen tür bilgisi yerine bunların anlamını bildirmek için kullanılması daha iyidir. Bir veri türü adı kullanılması gerekiyorsa, üyelerin adları için dile özgü bir ad yerine dilden bağımsız bir ad kullanın.
zh_hans: 参数和成员的名称用于交流其意义优于用于描述其类型，该类型预期由开发工具提供。对于成员的名称，如果必须使用数据类型名称，请使用与语言无关的名称，而不要使用语言特定的名称。
zh_hant: 參數與成員名稱最好可傳達其意義，而不是說明應由開發工具提供的類型。對於成員名稱而言，如果必須使用資料類型名稱，請使用和語言無關的名稱，而非使用語言專屬的名稱。

# IdentifiersShouldNotContainTypeNamesMessage
source: Identifier '{0}' contains type name
cs: Identifikátor {0} obsahuje název typu.
de: Der Bezeichner "{0}" enthält einen Typnamen.
es: El identificador “{0}” contiene el nombre de tipo.
fr: L'identificateur '{0}' contient le nom de type
it: L'identificatore '{0}' contiene il nome di tipo
ja: 識別子 '{0}' に型名が含まれます
ko: 식별자 '{0}'이(가) 형식 이름을 포함합니다.
pl: Identyfikator „{0}” zawiera nazwę typu
pt_br: O identificador '{0}' contém o nome de tipo
ru: Идентификатор "{0}" содержит имя типа
tr: '{0}' tanımlayıcısı tür adı içeriyor
zh_hans: 标识符“{0}”包含类型名称
zh_hant: 識別項 '{0}' 包含類型名稱

# CreatePropertyAccessorForParameter
source: Create a property accessor.
cs: Vytvořte přístupový objekt vlastnosti.
de: Erstellen Sie einen Eigenschaftenaccessor.
es: Cree un descriptor de acceso de propiedades.
fr: Créez un accesseur de propriété.
it: Creare una funzione di accesso della proprietà.
ja: プロパティ アクセサーを作成します。
ko: 속성 접근자를 만드세요.
pl: Utwórz metodę dostępu do właściwości.
pt_br: Crie um acessador de propriedade.
ru: Создайте метод доступа свойства.
tr: Bir özellik erişimcisi oluşturun.
zh_hans: 创建属性访问器。
zh_hant: 建立屬性存取子。

# MakeGetterPublic
source: Make the getter of the property public
cs: Nastavte metodu getter vlastnosti jako veřejnou.
de: Legen Sie den Getter der Eigenschaft als öffentlich fest.
es: Convertir el captador de la propiedad en público
fr: Rendre publique la méthode getter de la propriété
it: Impostare il getter della proprietà come public
ja: プロパティのゲッターをパブリックにします
ko: 속성의 getter를 public으로 설정하세요.
pl: Zadeklaruj metodę pobierającą właściwość jako publiczną
pt_br: Torne o getter da propriedade público
ru: Сделайте метод получения свойства общим
tr: Özellik alıcısını genel yapın
zh_hans: 使属性 getter 公开
zh_hant: 將屬性的 getter 設為公用

# MakeSetterNonPublic
source: Make the setter of the property non-public
cs: Nastavte metodu setter vlastnosti jako neveřejnou.
de: Legen Sie den Setter der Eigenschaft als nicht öffentlich fest.
es: Convertir el establecedor de la propiedad en no público
fr: Rendre non publique la méthode setter de la propriété
it: Impostare il setter della proprietà come non public
ja: プロパティのセッターを非パブリックにします
ko: 속성의 setter를 non-public으로 설정하세요.
pl: Zadeklaruj metodę ustawiającą właściwość jako niepubliczną
pt_br: Torne o setter da propriedade não público
ru: Сделайте метод задания свойства не общим
tr: Özellik ayarlayıcısını genel olmayan bir duruma getirin
zh_hans: 使属性 setter 不公开
zh_hant: 將屬性的 setter 設為非公用

# AddAssemblyLevelComVisibleFalse
source: Because {0} exposes externally visible types, mark it with ComVisible(false) at the assembly level and then mark all types within the assembly that should be exposed to COM clients with ComVisible(true)
cs: Protože sestavení {0} zpřístupňuje externě viditelné typy, označte ho pomocí ComVisible(false) na úrovni sestavení a pak označte všechny typy v tomto sestavení, které mají být zpřístupněny klientům modelu COM, pomocí ComVisible(true).
de: Da "{0}" extern sichtbare Typen verfügbar macht, setzen Sie auf Assemblyebene eine Markierung mit "ComVisible(false)", und markieren Sie dann alle Typen innerhalb der Assembly, die für COM-Clients verfügbar gemacht werden sollen, mit "ComVisible(true)".
es: Puesto que {0} expone tipos visibles externamente, márquelo con ComVisible(false) en el nivel de ensamblado y, después, marque todos los tipos del ensamblado que se deben exponer a clientes COM con ComVisible(true).
fr: Dans la mesure où {0} expose les types visibles de manière externe, marquez-le avec ComVisible(false) au niveau de l'assembly, puis marquez tous les types dans l'assembly qui doivent être exposés aux clients COM avec ComVisible(true)
it: Dal momento che {0} espone tipi visibili esternamente, contrassegnarlo con ComVisible(false) a livello di assembly e quindi contrassegnare con ComVisible(true) tutti i tipi all'interno dell'assembly che devono essere esposti ai client COM
ko: {0}이(가) 외부에 표시되는 형식을 노출하므로 어셈블리 수준에서 ComVisible(false)로 표시한 다음, COM 클라이언트에 노출되어야 하는 어셈블리 내의 모든 형식을 ComVisible(true)로 표시하세요.
pl: Ponieważ zestaw {0} udostępnia typy widoczne zewnętrznie, oznacz go atrybutem ComVisible(false) na poziomie zestawu, a następnie oznacz atrybutem ComVisible(true) wszystkie typy w zestawie, które powinny być dostępne dla klientów modelu COM
pt_br: Já que {0} expõe os tipos visíveis externamente, marque-o com ComVisible(false) no nível de assembly e marque todos os tipos no assembly que devem ser expostos a clientes COM que têm ComVisible(true)
ru: Так как {0} публикует типы, видимые извне, пометьте его как ComVisible(false) на уровне сборки, а затем пометьте все типы в сборке, которые должны быть предоставлены COM-клиентам, как ComVisible(true).
tr: {0} öğesi dışarıdan görünen türleri kullanıma sunduğundan, bunu bütünleştirilmiş kod düzeyinde ComVisible(false) ile işaretleyin, sonra bütünleştirilmiş kodda bulunan ve COM istemcilerinin kullanımına sunulması gereken tüm türleri ComVisible(true) ile işaretleyin
zh_hans: 因为 {0} 公开外部可见的类型，请在程序集级别使用 ComVisible(false) 来标记它，然后使用 ComVisible(true) 来标记该程序集内应当向 COM 客户端公开的所有类型
zh_hant: 因為 {0} 會公開外部可見的型別，所以請在組件層級將其標記為 ComVisible(false)，然後將應公開給 COM 用戶端之組件內的所有型別，標記為 ComVisible(true)

# ChangeAssemblyLevelComVisibleToFalse
source: Consider changing the ComVisible attribute on {0} to false, and opting in at the type level
cs: Zvažte změnu atributu ComVisible u sestavení {0} na false a jeho připojení na úrovni typu.
de: Ziehen Sie in Betracht, das ComVisible-Attribut für "{0}" in FALSE zu ändern und auf Typebene zu aktivieren.
es: Considere cambiar el atributo ComVisible de {0} a false e incluirlo en el nivel de tipo.
fr: Changez éventuellement l'attribut ComVisible sur {0} en lui affectant la valeur false, puis intervenez au niveau du type
it: Provare a impostare su false l'attributo ComVisible su {0} e ad acconsentire in modo esplicito a livello di tipo
ko: {0}에서 ComVisible 특성을 false로 변경하고 형식 수준에서 선택하는 것이 좋습니다.
pl: Rozważ zmianę atrybutu ComVisible dla zestawu {0} na wartość false i użycie wartości true na poziomie typów
pt_br: Considere alterar o atributo ComVisible em {0} para false e aceitá-lo no nível de tipo
ru: Рекомендуется присвоить атрибуту ComVisible {0} значение "false" и дать согласие на уровне типов.
tr: {0} öğesindeki ComVisible özniteliğini false olarak değiştirmeyi ve tür düzeyinde kabul etmeyi deneyin
zh_hans: 考虑将 {0} 的 ComVisible 属性改为 false，然后在类型级别进行选择
zh_hant: 請考慮將 {0} 上的 ComVisible 屬性變更為 false，並於型別層級選擇加入

# ImplementComparable
source: Implement Equality and Comparison methods and operators
cs: Implementujte metody rovnosti a porovnání a operátory.
de: Gleichheits- und Vergleichsmethoden und -operatoren implementieren
es: Implementar operadores y métodos de igualdad y comparación
fr: Implémenter les méthodes et opérateurs d'égalité et de comparaison
it: Implementare metodi e operatori di uguaglianza e confronto
ja: 等値および比較メソッドおよび演算子を実装します
ko: 같음 및 비교 메서드와 연산자를 구현하세요.
pl: Zaimplementuj metody i operatory równości i porównania
pt_br: Implementar métodos e operadores de Igualdade e de Comparação
ru: Реализуйте методы и операторы Equality и Comparison
tr: Equality ve Comparison yöntemlerini ve işleçlerini uygulayın
zh_hans: 实现相等和比较方法和运算符
zh_hant: 實作 Equality 與 Comparison 方法以及運算子

# ImplementEquatable
source: Implement IEquatable
cs: Implementujte rozhraní IEquatable.
de: "IEquatable" implementieren
es: Implementar IEquatable
fr: Implémenter IEquatable
it: Implementare IEquatable
ja: IEquatable を実装します
ko: IEquatable을 구현하세요.
pl: Zaimplementuj interfejs IEquatable
pt_br: Implementar IEquatable
ru: Реализуйте IEquatable
tr: IEquatable Uygulayın
zh_hans: 实现 IEquatable
zh_hant: 實作 IEquatable

source: Implement IDisposable Interface
cs: Implementujte rozhraní IDisposable.
de: IDisposable-Schnittstelle implementieren
es: Implementar la interfaz IDisposable
fr: Implémenter l'interface IDisposable
it: Implementare l'interfaccia IDisposable
ja: IDisposable インターフェイスを実装します
ko: IDisposable 인터페이스를 구현하세요.
pl: Zaimplementuj interfejs IDisposable
pt_br: Implementar interface IDisposable
ru: Реализуйте интерфейс IDisposable
tr: IDisposable Arabirimi Uygulayın
zh_hans: 实现 IDisposable 接口
zh_hant: 實作 IDisposable 介面

# DoNotMarkEnumsWithFlagsCodeFix
source: Remove FlagsAttribute from enum.
cs: Odeberte z výčtu atribut FlagsAttribute.
de: Entfernen Sie das FlagsAttribute aus der Enumeration.
es: Quite FlagsAttribute de la enumeración.
fr: Supprimez FlagsAttribute de l'enum.
it: Rimuovere FlagsAttribute dall'enumerazione.
ja: FlagsAttribute を列挙型から削除します。
ko: 열거형에서 FlagsAttribute를 제거하세요.
pl: Usuń atrybut FlagsAttribute z wyliczenia.
pt_br: Remova FlagsAttribute da enum.
ru: Удалите FlagsAttribute из перечисления.
tr: Sabit listesinden FlagsAttribute öğesini kaldırın.
zh_hans: 从枚举中删除 FlagsAttribute。
zh_hant: 從列舉移除 FlagsAttribute。

# MarkEnumsWithFlagsCodeFix
source: Apply FlagsAttribute to enum.
cs: Použijte u výčtu atribut FlagsAttribute.
de: Wenden Sie das FlagsAttribute auf die Enumeration an.
es: Aplique FlagsAttribute a la enumeración.
fr: Appliquez FlagsAttribute à l'enum.
it: Applicare FlagsAttribute all'enumerazione.
ja: FlagsAttribute を列挙型に適用します。
ko: 열거형에 FlagsAttribute를 적용하세요.
pl: Zastosuj atrybut FlagsAttribute do wyliczenia.
pt_br: Aplique FlagsAttribute ao enum.
ru: Примените FlagsAttribute к перечислению.
tr: Sabit listesine FlagsAttribute öğesini uygulayın.
zh_hans: 向枚举应用 FlagsAttribute。
zh_hant: 將 FlagsAttribute 套用至列舉。

# EnumsShouldZeroValueFlagsMultipleZeroCodeFix
source: Remove all members that have the value zero except for one member that is named 'None'.
cs: Odeberte všechny členy, které mají nulovou hodnotu, s výjimkou jednoho člena s názvem None.
de: Entfernen Sie alle Member mit dem Wert null, mit Ausnahme des einen Members mit dem namen "None".
es: Quite todos los miembros que tienen valor cero, excepto uno denominado “None”.
fr: Supprimez tous les membres ayant la valeur zéro, à l'exception d'un membre nommé 'None'.
it: Rimuovere tutti i membri con valore zero ad eccezione dell'unico membro denominato 'None'.
ja: 'None' という名前の 1 つのメンバー以外の、値 0 を含むすべてのメンバーを削除します。
ko: 'None'으로 명명된 하나의 멤버를 제외하고 0 값을 가진 모든 멤버를 제거하세요.
pl: Usuń wszystkie elementy członkowskie o wartości zero z wyjątkiem elementu członkowskiego o nazwie „None”.
pt_br: Remova todos os membros que têm valor zero, exceto o membro chamado 'None'.
ru: Удалите все члены с нулевым значением, за исключением одного, с именем "None".
tr: 'None' olarak adlandırılmış tek üye dışındaki sıfır değerine sahip tüm üyeleri kaldırın.
zh_hans: 删除所有值为零的成员(名为 "None" 的成员除外)。
zh_hant: 移除值為零的所有成員，但名為 'None' 的成員除外。

# EnumsShouldZeroValueFlagsRenameCodeFix
source: Rename zero-valued enum field to 'None'.
cs: Přejmenujte pole výčtu s nulovou hodnotou na None.
de: Benennen Sie das Enumerationsfeld mit dem Wert null in "None" um.
es: Cambie el nombre del campo de enumeración de valor cero a “None”.
fr: Renommez le champ enum ayant la valeur zéro à l'aide de 'None'.
it: Rinominare il campo di enumerazione con valore zero in 'None'.
ja: 0 値の列挙型フィールドの名前を 'None' に変更します。
ko: 값이 0인 열거형 필드의 이름을 'None'으로 바꾸세요.
pl: Zmień nazwę pola wyliczenia o wartości zero na „None”.
pt_br: Renomeie o campo de enum de valor zero para 'None'.
ru: Переименуйте поле перечисления с нулевым значением в "None".
tr: Sıfır değerli sabit listesi alanını 'None' olarak yeniden adlandırın.
zh_hans: 将值为零的枚举字段重命名为 "None"。
zh_hant: 將值為零的列舉欄位重新命名為 'None'。

# EnumsShouldZeroValueNotFlagsNoZeroValueCodeFix
source: Add a zero-valued member 'None' to enum.
cs: Přidejte k výčtu člena None s nulovou hodnotou.
de: Fügen Sie der Enumeration einen Member "None" mit dem Wert null hinzu.
es: Agregue un miembro “None” de valor cero a la enumeración.
fr: Ajoutez un membre 'None' ayant la valeur zéro à l'enum.
it: Aggiungere all'enumerazione un membro 'None' con valore zero.
ja: 0 値のメンバー 'None' を列挙型に追加します。
ko: 값이 0인 멤버 'None'을 열거형에 추가하세요.
pl: Dodaj element członkowski o wartości zero i nazwie „None” do wyliczenia.
pt_br: Adicione um membro de valor zero 'None' ao enum.
ru: Добавьте нулевой член "None" в перечисление.
tr: Sabit listesine sıfır değerli bir 'None' üyesi ekleyin.
zh_hans: 向枚举添加值为零的成员 "None"。
zh_hant: 將值為零的成員 'None' 新增至列舉。

# AbstractTypesShouldNotHavePublicConstructorsCodeFix
source: Change the accessibility of public constructors to protected.
cs: Změňte přístupnost veřejných konstruktorů na chráněnou.
de: Ändern Sie die Zugänglichkeit der öffentlichen Konstruktoren in geschützt.
es: Cambie la accesibilidad de los constructores públicos a protegida.
fr: Changez l'accessibilité des constructeurs publics en protected.
it: Impostare su protected l'accessibilità di costruttori public.
ja: パブリック コンストラクターのアクセシビリティを protected に変更します。
ko: public 생성자의 접근성을 protected로 변경하세요.
pl: Zmień poziom dostępu do konstruktorów publicznych na chroniony.
pt_br: Altere a acessibilidade de construtores públicos para protegidos.
ru: Измените область доступности общих конструкторов на защищенную.
tr: Genel oluşturucuların erişilebilirliğini korumalı olarak değiştirin.
zh_hans: 将公共构造函数的可访问性更改为受保护。
zh_hant: 變更要保護之公用建構函式的存取範圍。

# DoNotDeclareStaticMembersOnGenericTypesTitle
source: Do not declare static members on generic types
cs: Nedeklarujte statické členy u obecných typů.
de: Statische Member nicht in generischen Typen deklarieren
es: No declarar miembros estáticos en tipos genéricos
fr: Ne pas déclarer de membres comme étant static sur les types génériques
it: Non dichiarare membri statici su tipi generici
ja: ジェネリック型の静的メンバーを宣言しません
ko: 제네릭 형식에서 정적 멤버를 선언하지 마세요.
pl: Nie deklaruj statycznych elementów członkowskich dla typów ogólnych
pt_br: Não declarar membros estáticos em tipos genéricos
ru: Не объявляйте статические члены в универсальных типах
tr: Genel türlerde statik üyeler bildirmeyin
zh_hans: 不要在泛型类型中声明静态成员
zh_hant: 請勿在泛型型別上宣告靜態成員
