Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotPassTypesByReferenceDescription
source: Passing types by reference (using out or ref) requires experience with pointers, understanding how value types and reference types differ, and handling methods that have multiple return values. Also, the difference between out and ref parameters is not widely understood.
cs: Předávání typů podle odkazu (jako out nebo ref) vyžaduje zkušenost s ukazateli, porozumění rozdílu mezi hodnotovými a odkazovými typy a obeznámenost s metodami s více návratovými hodnotami. Navíc není široce rozšířeno chápání rozdílu mezi parametry out a ref.
de: Das Übergeben von Typen als Verweis (mit "out" oder "ref") erfordert Erfahrung mit Zeigern, den Unterschieden zwischen Werttypen und Verweistypen sowie der Verarbeitung von Methoden mit mehreren Rückgabewerten. Auch der Unterschied zwischen den Parametern "out" und "ref" ist nicht allgemein geläufig.
es: Para pasar tipos por referencia (mediante out o ref) se necesita tener experiencia con punteros, comprender en qué se diferencian los tipos de valor y los tipos de referencia y saber usar métodos que tengan varios valores devueltos. Además, la diferencia entre los parámetros out y ref no se ha entendido del todo.
fr: Le passage de types par référence (via out ou ref) nécessite une bonne connaissance des pointeurs, une bonne compréhension des différences entre les types valeur et les types référence ainsi qu'une certaine expérience de la gestion des méthodes ayant plusieurs valeurs de retour. En effet, la différence entre les paramètres out et ref n'est pas comprise par tout le monde.
it: Oltre all'esperienza con i puntatori, per passare tipi per riferimento (con out o ref), è necessario comprendere le differenze tra tipi valore e tipi riferimento e gestire i metodi con più valori restituiti. Anche la differenza tra parametri out e ref non è del tutto compresa.
ko: out 또는 ref를 사용하여 참조로 형식을 전달하려면 포인터 사용 경험이 있고, 값 형식과 참조 형식의 차이점을 알고 있으며, 반환 값이 여러 개인 메서드를 처리해야 합니다. 또한 out 매개 변수와 ref 매개 변수의 차이점은 널리 알려져 있지 않습니다.
pl: Przekazywanie typów przez odwołanie (zastosowanie parametrów „out” lub „ref”) wymaga doświadczenia w pracy ze wskaźnikami, rozumienia różnic między typami wartości i typami odwołań oraz umiejętności stosowania metod z wieloma wartościami zwracanymi. Ponadto różnice między parametrami „out” i „ref” nie są powszechnie zrozumiałe.
pt_br: A passagem de tipos por referência (usando 'out' ou 'ref') exige experiência com ponteiros, o entendimento da diferença entre os tipos de valor e de referência e a manipulação de métodos com vários valores retornados. Além disso, não há um amplo entendimento sobre a diferença entre os parâmetros out e ref.
ru: Для передачи типов по ссылке (с использованием "out" или "ref") необходим опыт работы с указателями, понимание различий между типами значений и ссылочными типами, а также использование методов с несколькими возвращаемыми значениями. Кроме того, разница между параметрами "out" и "ref" не является очевидной.
tr: Türleri başvuruya göre geçirmek (out veya ref kullanılarak) için işaretçiler konusunda deneyim sahibi olmak, değer ve başvuru türleri arasındaki farkları anlamak ve birden çok dönüş değeri içeren metotları işlemeyi bilmek gerekir. Ayrıca out ve ref parametreleri arasındaki fark genelde kapsamlı bir şekilde anlaşılmaz.
zh_hans: 要按引用传递类型(使用 out 或 ref)，需具备指针方面的经验、了解值类型和引用类型之间的区别，并处理具有多个返回值的方法。此外，out 和 ref 参数之间的差异未被广泛理解。
zh_hant: 藉傳址傳遞類型 (使用 out 或 ref) 需有指標經驗、了解實值型別與參考型別之間的差異，以及處理具有多個傳回值的方法。而且，大家普遍不了解 out 與 ref 參數之間的差異。

# DoNotPassTypesByReferenceMessage
source: Consider a design that does not require that '{0}' be a reference parameter
cs: Zvažte návrh, který nevyžaduje {0} být parametrem odkazu.
de: Erwägen Sie einen Entwurf, bei dem "{0}" kein Verweisparameter sein muss.
es: Considere el uso de un diseño que no requiera que "{0}" sea un parámetro de referencia.
fr: Utilisez une conception qui n'impose pas '{0}' en tant que paramètre de référence
it: Provare a usare una progettazione in cui non è richiesto l'uso di '{0}' come parametro per riferimento
ko: '{0}'이(가) 참조 매개 변수일 필요가 없는 디자인이 좋습니다.
pl: Rozważ użycie projektu, który nie wymaga, aby element „{0}” był parametrem w formie odwołania
pt_br: Considere um design que não exija que '{0}' seja um parâmetro de referência
ru: Измените архитектуру, так чтобы "{0}" не был ссылочным параметром.
tr: '{0}' öğesinin bir başvuru parametresi olmasını gerektirmeyen bir tasarım kullanabilirsiniz
zh_hans: 请考虑使用不要求将“{0}”用作引用参数的设计
zh_hant: 請考慮設計成 '{0}' 不必是傳址參數的樣子

# DoNotPassTypesByReferenceTitle
source: Do not pass types by reference
cs: Nepředávejte typy pomocí odkazu
de: Typen nicht als Verweis übergeben
es: No pasar tipos por referencia
fr: Ne pas passer de types par référence
it: Non passare i tipi per riferimento
ko: 참조로 형식을 전달하지 마십시오.
pl: Nie przekazuj typów przez referencję
pt_br: Não passar tipos por referência
ru: Не передавайте типы по ссылке
tr: Türleri başvuruya göre geçmeyin
zh_hans: 不要通过引用来传递类型
zh_hant: 不要藉傳址方式傳遞類型

# DoNotPrefixEnumValuesWithTypeNameDescription
source: An enumeration's values should not start with the type name of the enumeration.
cs: Hodnoty výčtu by neměly začínat názvem typu výčtu.
de: Der Wert einer Enumeration sollte nicht mit dem Typnamen der Enumeration beginnen.
es: Los valores de una enumeración no deben comenzar con el nombre del tipo de la enumeración.
fr: Les valeurs d'une énumération ne doivent pas commencer par le nom de type de l'énumération.
it: I valori di un'enumerazione non devono iniziare con il nome del tipo dell'enumerazione.
ja: 列挙値は、列挙型名で始まらないようにします。
ko: 열거형의 값은 열거형의 형식 이름으로 시작하지 않아야 합니다.
pl: Wartości wyliczenia nie powinny rozpoczynać się od nazwy typu wyliczenia.
pt_br: Valores de uma enumeração não devem começar com o nome do tipo de enumeração.
ru: Значения перечисления не могут начинаться с имени типа перечисления.
tr: Numaralandırma değeri numaralandırmanın tür adıyla başlamamalıdır.
zh_hans: 枚举的值不应以枚举的类型名称开头。
zh_hant: 列舉值不應以列舉的類型名稱作為開頭。

# DoNotPrefixEnumValuesWithTypeNameMessage
source: Do not prefix enum values with the name of the enum type '{0}'
cs: Nepřidávejte před hodnoty výčtu název typu výčtu {0}.
de: Stellen Sie Enumerationswerten nicht den Namen des Enumerationstyps ({0}) voran.
es: Los valores de una enumeración no deben usar como prefijo el nombre del tipo de enumeración "{0}".
fr: N'ajoutez pas de préfixe aux valeurs d'énumération avec le nom du type enum '{0}'
it: Non anteporre il nome del tipo enumerazione '{0}' come prefisso in valori di enumerazione
ko: 열거형 값에 열거형 형식 '{0}'의 이름을 접두사로 사용하지 마세요.
pl: Nie dodawaj do wartości wyliczenia prefiksu w postaci nazwy typu wyliczenia „{0}”
pt_br: Não adicione prefixos de valores de enumeração com o mesmo nome do tipo enumerado '{0}'
ru: Не добавлять к значениям перечисления префикс в виде типа перечисления "{0}".
tr: Sabit listesi değerlerinin önüne '{0}' sabit listesi türünün adını eklemeyin
zh_hans: 不要将枚举类型为“{0}”的名称用作枚举值的前缀
zh_hant: 請勿以列舉類型 '{0}' 的名稱作為列舉值的前置詞

# DoNotPrefixEnumValuesWithTypeNameTitle
source: Do not prefix enum values with type name
cs: Nepřidávejte před hodnoty výčtu název typu
de: Enumerationswerten nicht den Typnamen voranstellen
es: No utilizar como prefijo el nombre del tipo en valores de la enumeración
fr: Ne pas ajouter de préfixe aux valeurs d'énumération avec un nom de type
it: Non aggiungere nomi di tipo come prefisso in valori di enumerazione
ja: 列挙値の前に型名を付けないでください
ko: 열거형 값에 형식 이름을 접두사로 사용하지 마세요.
pl: Nie dodawaj do wartości wyliczenia prefiksu w postaci nazwy typu
pt_br: Não adicionar prefixos de valores enum com nome do tipo
ru: Не добавлять к значениям перечисления префикс в виде имени типа
tr: Numaralandırma değerlerinin önüne tür adını ekleme
zh_hans: 不要对枚举值使用类名作为前缀
zh_hant: 不要將類型名稱作為列舉值的前置詞

# EnumShouldNotHaveDuplicatedValuesMessageDuplicatedBitwiseValuePart
source: The field reference '{0}' is duplicated in this bitwise initialization
cs: Odkaz na pole {0} je v této bitové inicializaci duplicitní.
de: Der Feldverweis "{0}" wird in dieser bitweisen Initialisierung dupliziert.
es: La referencia de campo "{0}" está duplicada en esta inicialización bit a bit.
fr: La référence de champ '{0}' est dupliquée dans cette initialisation au niveau du bit
it: Il riferimento al campo '{0}' è duplicato in questa inizializzazione bit per bit
ko: 이 비트 초기화에서 필드 참조 '{0}'이(가) 중복되었습니다.
pl: Odwołanie do pola „{0}” jest zduplikowane w tym inicjowaniu bitowym
pt_br: A referência de campo '{0}' está duplicada nesta inicialização bit a bit
ru: Ссылка на поле "{0}" дублируется в этой побитовой инициализации.
tr: '{0}' alan başvurusu bu bit düzeyinde başlatmada yineleniyor
zh_hans: 此按位初始化中的字段引用 "{0}" 重复
zh_hant: 欄位參考 '{0}' 在此位元初始化中重複

# EnumShouldNotHaveDuplicatedValuesMessageDuplicatedValue
source: The enum member '{0}' has the same constant value '{1}' as member '{2}'
cs: Člen výčtu {0} má stejnou konstantní hodnotu {1} jako člen {2}.
de: Der Enumerationsmember "{0}" weist denselben Konstantenwert "{1}" wie der Member "{2}" auf.
es: El miembro de enumeración "{0}" tiene el mismo valor de constante "{1}" que el miembro "{2}".
fr: Le membre enum '{0}' a la même valeur de constante '{1}' que le membre '{2}'
it: Il membro di enumerazione '{0}' ha lo stesso valore costante '{1}' del membro '{2}'
ko: 열거형 멤버 '{0}'의 상수 값 '{1}'이(가) '{2}' 멤버와 같습니다.
pl: Składowa wyliczenia „{0}” ma tę samą stałą wartość „{1}” co składowa „{2}”
pt_br: O membro de enumeração '{0}' tem o mesmo valor constante '{1}' que o membro '{2}'
ru: Элемент перечисления "{0}" имеет то же постоянное значение "{1}", что и элемент "{2}".
tr: '{0}' sabit listesi üyesi, '{2}' üyesiyle aynı '{1}' sabit değerine sahip
zh_hans: 枚举成员 "{0}" 具有与成员 "{2}" 相同的常量值 "{1}"
zh_hant: 列舉成員 '{0}' 具有與成員 '{2}' 相同的常數值 '{1}'

# EnumShouldNotHaveDuplicatedValuesTitle
source: Enums values should not be duplicated
cs: Hodnoty výčtů by neměly být duplicitní
de: Enumerationswerte dürfen nicht dupliziert werden
es: Los valores de las enumeraciones no deben estar duplicados
fr: Les valeurs enum ne doivent pas être dupliquées
it: I valori di enumerazione non devono essere duplicati
ja: 列挙値を重複させることはできない
ko: 열거형 값은 중복되어서는 안 됨
pl: Wartości wyliczenia nie powinny być duplikowane
pt_br: Os valores de enumerações não devem ser duplicados
ru: Значения перечислений не должны повторяться
tr: Sabit liste değerleri yinelenmemeli
zh_hans: 不应复制枚举值
zh_hant: 列舉值不應重複

# EventsShouldNotHaveBeforeOrAfterPrefixDescription
source: Event names should describe the action that raises the event. To name related events that are raised in a specific sequence, use the present or past tense to indicate the relative position in the sequence of actions. For example, when naming a pair of events that is raised when closing a resource, you might name it 'Closing' and 'Closed', instead of 'BeforeClose' and 'AfterClose'.
cs: Názvy událostí by měly popisovat akce, které příslušné události vyvolávají. Pokud chcete pojmenovat související události vyvolané v konkrétním pořadí, použijte přítomný nebo minulý čas, pomocí nichž vyjádříte relativní pozici v pořadí akcí. Například při pojmenovávání dvojice událostí, které se vyvolaly při uzavírání prostředku, můžete zvolit názvy Closing a Closed namísto BeforeClose a AfterClose.
de: Ereignisnamen sollten die Aktion beschreiben, durch die das Ereignis ausgelöst wird. Um zusammenhängende Ereignisse zu benennen, die in einer bestimmten Sequenz ausgelöst werden, verwenden Sie das Präsens oder das Imperfekt, um die relative Position in der Sequenz von Aktionen anzugeben. Wenn Sie z. B. ein Ereignispaar benennen, das beim Schließen einer Ressource ausgelöst wird, könnten Sie es "Closing" und "Closed" nennen anstelle von "BeforeClose" und "AfterClose".
es: Los nombres de evento deben describir la acción que genera el evento. Para nombrar los eventos relacionados que se generan en una secuencia específica, use los tiempos verbales presente o pasado para indicar la posición relativa en la secuencia de acciones. Por ejemplo, al asignar un nombre a un par de eventos que se generan al cerrar un recurso, pueden denominarse "Closing" y "Closed" en lugar de "BeforeClose" y "AfterClose".
fr: Les noms d'événement doivent décrire l'action qui déclenche l'événement. Pour nommer les événements associés qui sont déclenchés dans une séquence spécifique, utilisez le présent ou le passé pour indiquer la position relative dans la séquence d'actions. Par exemple, quand vous nommez une paire d'événements déclenchée à la fermeture d'une ressource, vous pouvez la nommer 'Closing' et 'Closed' au lieu de 'BeforeClose' et 'AfterClose'.
it: I nomi di evento devono descrivere l'azione che genera l'evento. Per assegnare un nome a eventi correlati generati in una sequenza specifica, usare il tempo presente o passato per indicare la posizione relativa nella sequenza di azioni. Ad esempio, quando si assegna un nome a una coppia di eventi generati durante la chiusura di una risorsa, è possibile assegnare i nomi 'Closing' e 'Closed', invece di 'BeforeClose' e 'AfterClose'.
ko: 이벤트 이름에는 이벤트를 발생시키는 동작의 설명이 있어야 합니다. 특정 시퀀스에서 발생하는 관련 이벤트의 이름을 지정하려면, 현재 또는 과거 시제를 사용하여 작업 순서에서 상대 위치를 나타냅니다. 예를 들어, 리소스를 종료할 때 발생하는 이벤트 쌍을 명명하는 경우 'BeforeClose' 및 'AfterClose' 대신 'Closing' 및 'Closed'로 이름을 지정할 수 있습니다.
pl: Nazwy zdarzeń powinny opisywać akcję, która wywołuje zdarzenie. Aby nazwać zdarzenia pokrewne, które są wywoływane w konkretnej kolejności, użyj czasu teraźniejszego lub przeszłego, aby wskazać względną pozycję w sekwencji akcji. Na przykład podczas nadawania nazw parze zdarzeń, które są wywoływane podczas zamykania zasobu, możesz nadać nazwy „Zamykanie” i „Zamknięto” zamiast „PrzedZamknięciem” i „PoZamknięciu”.
pt_br: Os nomes de eventos devem descrever a ação que aciona o evento. Para nomear eventos relacionados que são acionados em uma sequência específica, use o tempo presente ou passado para indicar a posição relativa na sequência de ações. Por exemplo, ao nomear um par de eventos que é gerado ao fechar um recurso, você pode nomeá-lo como 'Closing' e 'Closed', em vez de 'BeforeClose' e 'AfterClose'.
ru: Имена событий должны описывать действия, которые вызывают событие. Для именования связанных событий, возникающих в определенной последовательности, используйте настоящее или прошедшее время, чтобы указать относительное положение в последовательности действий. Например, при именовании двух событий, возникающих при закрытии ресурса, вы можете присвоить им имена Closing и Closed вместо BeforeClose и AfterClose.
tr: Olay adları, olayı oluşturan eylemi açıklamalıdır. Belirli bir sırada oluşturulan ilgili olayları adlandırırken eylem sırasındaki göreli konumlarını belirtmek üzere şimdiki veya geçmiş zaman kullanın. Örneğin, bir kaynağı kapatırken oluşan bir olay çiftini adlandırırken, bu olayları 'BeforeClose' ve 'AfterClose' yerine 'Closing' ve 'Closed' olarak adlandırabilirsiniz.
zh_hans: 事件名称应描述引发该事件的操作。要对按特定序列引发的相关事件命名，请使用现在时或过去时来指示在操作序列中的相对位置。例如，在对关闭资源时引发的一对事件进行命名时，可将其命名为 "Closing" 和 "Closed"，而不是 "BeforeClose" 和 "AfterClose"。
zh_hant: 事件名稱應該描述引發該事件的動作。若要命名特定順序內引發的相關事件，請使用現在式或過去式來表示一系列動作中的相對位置。例如，要命名一組在關閉資源時所引發的事件，可以將其命名為 'Closing' 以及 'Closed'，而請勿使用 'BeforeClose' 和 'AfterClose'。

# EventsShouldNotHaveBeforeOrAfterPrefixMessage
source: Events should not have 'Before' or 'After' prefix
cs: Události by neměly mít předponu Before nebo After.
de: Ereignisse dürfen kein Präfix "Before" oder "After" aufweisen.
es: Los eventos no deben tener el prefijo "Antes" ni "Después"
fr: Les événements ne doivent pas avoir un préfixe 'Before' ou 'After'
it: Non usare il prefisso 'Before' o 'After' negli eventi
ko: 이벤트에 'Before' 또는 'After' 접두사를 사용하지 마세요.
pl: Zdarzenia nie powinny mieć prefiksu „Przed” ani „Po”
pt_br: Eventos não devem ter o prefixo 'Before' ou 'After'
ru: 3 - ReadyForReview
tr: Olaylar 'Before' ya da 'After' ön ekine sahip olmamalıdır
zh_hans: 事件不应具有 "Before" 或 "After" 前缀
zh_hant: 事件開頭不應出現 'Before' 或 'After'

# EventsShouldNotHaveBeforeOrAfterPrefixTitle
source: Events should not have 'Before' or 'After' prefix
cs: Události by neměly mít předponu Before nebo After
de: Ereignisse dürfen kein Präfix "Before" oder "After" aufweisen.
es: Los eventos no deben tener el prefijo "Antes" ni "Después"
fr: Les événements ne doivent pas avoir un préfixe 'Before' ou 'After'
it: Non usare il prefisso 'Before' o 'After' negli eventi
ko: 이벤트에 'Before' 또는 'After' 접두사를 사용하지 마세요.
pl: Zdarzenia nie powinny mieć prefiksu „Przed” ani „Po”
pt_br: Eventos não devem ter o prefixo 'Before' ou 'After'
ru: 3 - ReadyForReview
tr: Olaylar 'Before' ya da 'After' ön ekine sahip olmamalıdır
zh_hans: 事件不应具有 "Before" 或 "After" 前缀
zh_hant: 事件開頭不應出現 'Before' 或 'After'

# IdentifiersShouldHaveCorrectSuffixMessageMultiple
source: Rename {0} to end in either '{1}' or '{2}'
cs: Přejmenujte {0} tak, aby název končil buď na {1}, nebo na {2}.
de: Umbenennen{0}, um entweder auf '{1}' oder '{2}' zu enden
es: Cambie el nombre de {0} para que termine en '{1}' o '{2}'
fr: Renommer {0} pour se terminer par '{1}' ou '{2}'
it: Rinomina {0} per terminare con '{1}' o '{2}'
ko: {0}이(가) '{1}' 또는 '{2}'(으)로 끝나도록 이름을 바꾸세요.
pl: Zmień nazwę {0}, aby kończyła się na „{1}” lub „{2}”
pt_br: Renomeie {0} para terminar em '{1}' ou '{2}'
ru: Переименуйте {0} так, чтобы окончание было "{1}" или "{2}"
tr: {0} öğesini '{1}' veya '{2}' ile bitecek şekilde yeniden adlandırın
zh_hans: 将 {0} 重命名为以“{1}”或“{2}”结尾
zh_hant: 重新命名 {0}，使其以 '{1}' 或 '{2}' 結尾

# IdentifiersShouldNotContainUnderscoresCodeFixTitle
source: Remove underscores
cs: Odebrat podtržítka
de: Unterstriche entfernen
es: Quitar caracteres de subrayado
fr: Supprimer des traits de soulignement
it: Rimuovi caratteri di sottolineatura
ko: 밑줄 제거
pl: Usuwanie podkreśleń
pt_br: Remover sublinhados
ru: Удалить символы подчеркивания
tr: Alt çizgileri kaldır
zh_hans: 删除下划线
zh_hant: 移除底線

# ImplementIDisposableCorrectlyMessageFinalizeOverride
source: Remove the finalizer from type '{0}', override Dispose(bool disposing), and put the finalization logic in the code path where 'disposing' is false. Otherwise, it might lead to duplicate Dispose invocations as the Base type '{1}' also provides a finalizer.
cs: Odeberte finalizační metodu z typu {0}, přepište Dispose(bool disposing) a vložte finalizační logiku do cesty kódu, kde je disposing hodnoty false. V opačném případě by to mohlo vést k duplicitním voláním Dispose, protože základní typ {1} také poskytuje finalizační metodu.
de: Entfernen Sie den Finalizer vom Typ "{0}", setzen Sie "Dispose(bool disposing)" außer Kraft, und platzieren Sie die Finalisierungslogik im Codepfad, wenn "disposing" FALSE lautet. Andernfalls kann es zu doppelten Dispose-Aufrufen kommen, weil der Basistyp "{1}" ebenfalls einen Finalizer bereitstellt.
es: Elimine el finalizador del tipo "{0}", reemplace el valor de "Dispose(bool disposing)" y coloque la lógica de finalización en la ruta de código de manera que el valor de "disposing" se establezca como falso. De lo contrario, se duplicarían las invocaciones de "Dispose" ya que el tipo Base "{1}" también ofrece un finalizador.
fr: Supprimez le finaliseur du type '{0}', remplacez Dispose(bool disposing) et placez la logique de finalisation dans le chemin de code où 'disposing' est false. Sinon, vous risquez d'avoir des invocations de Dispose en double, car le type de base '{1}' fournit aussi un finaliseur.
it: Rimuovere il finalizzatore dal tipo '{0}', eseguire l'override di Dispose(bool disposing) e inserire la logica di finalizzazione nel percorso del codice in cui 'disposing' è false. In caso contrario, potrebbero verificarsi chiamate duplicate a Dispose perché il tipo di base '{1}' fornisce anche un finalizzatore.
ja: 型 '{0}' からファイナライザーを削除し、Dispose(bool disposing) をオーバーライドします。その後、'disposing' が false のコード パスに finalization 論理を配置します。その他の場合、基本型 '{1}' でもファイナライザーが提供されるため、Dispose 呼び出しが重複する可能性があります。
ko: '{0}' 형식에서 종료자를 제거하고 Dispose(bool disposing)를 재정의한 후 종료 논리를 'disposing'이 false인 코드 경로에 추가하세요. 그렇지 않으면, 기본 형식 '{1}'도 종료자를 제공할 때 중복된 Dispose 호출이 발생할 수 있습니다.
pl: Usuń finalizator z typu „{0}”, przesłoń funkcję Dispose(bool disposing) i umieść logikę finalizacji w ścieżce kodu, gdzie element „disposing” ma wartość false. W przeciwnym razie mogą pojawić się zduplikowane wywołania funkcji Dispose, ponieważ typ bazowy „{1}” także udostępnia finalizator.
pt_br: Remova o finalizador do tipo '{0}', substitua Dispose(bool disposing) e coloque a lógica de finalização no caminho do código em que 'disposing' é false. Caso contrário, ele poderá duplicar invocações Dispose, já que o tipo Base '{1}' também fornece um finalizador.
ru: Удалите метод завершения из типа '{0}', переопределите Dispose(bool disposing) и поместите логику завершения в путь кода, туда где 'disposing' имеет значение false. В противном случае это может привести к дублированию вызовов метода Dispose, так как базовый тип '{1}' также предоставляет метод завершения.
tr: '{0}' türünden sonlandırıcıyı kaldırın, Dispose(bool disposing) metodunu geçersiz kılın ve sonlandırma mantığını 'disposing' değerinin false olduğu kod yoluna yerleştirin. Aksi takdirde, '{1}' Temel türü de bir sonlandırıcı sağladığından yinelenen Dispose çağrılarına yol açabilir.
zh_hans: 从类型“{0}”中删除终结器，替代 Dispose(bool disposing)，并在 "disposing" 为 false 的代码路径中放置终结逻辑。否则，它可能导致出现重复的 Dispose 调用，因为基类型“{1}”也提供终结器。
zh_hant: 從類型 '{0}' 移除完成項，覆寫 Dispose(bool disposing)，然後在程式碼路徑中放置完成項邏輯，其中 'disposing' 為 false。否則這可能導致 Dispose 引動過程重複，原因是基底類型 ‘{1}’ 也提供了完成項。

# LoggerMessageDiagnosticConcatenationInFormatStringDescription
source: The logging message template should not vary between calls.
cs: Šablona zprávy protokolování by se neměla mezi voláními lišit.
de: Die Vorlage für Protokollierungsnachrichten darf nicht zwischen Aufrufen variieren.
es: La plantilla de mensaje de registro no debe variar entre llamadas.
fr: Le modèle de message de journalisation ne doit pas varier entre les appels.
it: Il modello di messaggio di registrazione non deve variare tra una chiamata e l'altra.
ko: 로깅 메시지 템플릿은 호출 간에 달라지지 않아야 합니다.
pl: Szablon wiadomości rejestrowania nie powinien się różnić między wywołaniami.
pt_br: O modelo de mensagem de log não deve variar entre chamadas.
ru: Шаблон сообщения о ведении журнала не должен изменяться между вызовами.
tr: Günlük ileti şablonu çağrılar arasında değişiklik göstermemelidir.
zh_hans: 日志记录消息模板不应因调用而异。
zh_hant: 記錄訊息範本在不同呼叫之間不能改變。

# LoggerMessageDiagnosticConcatenationInFormatStringMessage
source: The logging message template should not vary between calls to '{0}'
cs: Šablona zprávy protokolování by se neměla lišit mezi voláními do {0}.
de: Die Vorlage für die Protokollierungsmeldung darf nicht zwischen Aufrufen von "{0}" variieren.
es: La plantilla de mensaje de registro no debe variar entre las llamadas a "{0}"
fr: Le modèle de message de journalisation ne doit pas varier entre les appels à '{0}'.
it: Il modello di messaggio di registrazione non deve variare tra una chiamata e l'altra a '{0}'
ko: 로깅 메시지 템플릿은 {0}에 대한 호출 간에 달라지지 않아야 합니다.
pl: Szablon wiadomości rejestrowania nie powinien się różnić między wywołaniami elementu „{0}”
pt_br: O modelo de mensagem de log não deve variar entre as chamadas para '{0}'
ru: Шаблон сообщения о ведении журнала не должен изменяться между вызовами в "{0}"
tr: Günlük kaydı ileti şablonu ‘{0}’ çağrıları arasında değişiklik göstermemelidir
zh_hans: 日志记录消息模板在对“{0}”的调用之间不应存在不同。
zh_hant: 記錄訊息範本不應在與 '{0}' 通話期間改變
