Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidEntryInCodeMetricsConfigFileDescription
source: Invalid entry in code metrics rule specification file.
cs: Neplatná položka v souboru specifikace pravidel metrik kódu
de: Ungültiger Eintrag in der Datei zur Spezifikation von Regeln für Codemetriken.
es: Entrada no válida en el archivo de especificación de regla de métricas del código
fr: Entrée non valide dans le fichier de spécification de règle de métrique du code.
it: Voce non valida nel file di specifica delle regole per la metrica del codice.
ko: 코드 메트릭 규칙 사양 파일의 항목이 잘못되었습니다.
pl: Nieprawidłowy wpis w pliku specyfikacji reguły metryk kodu.
pt_br: Entrada inválida no arquivo de especificação de regra de medição de código.
ru: Недопустимая запись в файле спецификации правил метрик кода.
tr: Kod ölçümleri kural belirtimi dosyasındaki girdi geçersiz.
zh_hans: 代码度量规则规范文件中的条目无效。
zh_hant: 程式碼度量規則規格檔案中的項目無效。

# InvalidEntryInCodeMetricsConfigFileMessage
source: Invalid entry '{0}' in code metrics rule specification file '{1}'
cs: Neplatná položka {0} v souboru specifikace pravidel metrik kódu {1}
de: Ungültige Eingabe "{0}" in der Spezifikationsdatei "{1}" für Codemetrikregeln.
es: Entrada no válida "{0}" en el archivo de especificación de la regla de métricas de código "{1}"
fr: Entrée non valide '{0}' dans le fichier de spécification de règle de métrique du code '{1}'
it: Voce non valida '{0}' nel file '{1}' di specifica delle regole per la metrica del codice
ja: コード メトリック ルール仕様ファイル '{1}' のエントリ '{0}' が無効です
ko: 코드 메트릭 규칙 사용 파일 '{1}'의 잘못된 항목 '{0}'
pl: Nieprawidłowy wpis „{0}” w pliku specyfikacji reguły metryk kodu „{1}”
pt_br: Entrada inválida '{0}' no arquivo de especificação de medição de código '{1}'
ru: Недопустимая запись '{0}' в файле спецификации правила метрик кода '{1}'
tr: '{1}' adlı kod ölçümleri kural belirtimi dosyasındaki '{0}' girişi geçersiz
zh_hans: 代码度量规则规范文件“{1}”中的“{0}”条目无效
zh_hant: 程式碼度量規則規格檔案 ‘{1}’ 中的項目 ‘{0}’ 無效

# InvalidEntryInCodeMetricsConfigFileTitle
source: Invalid entry in code metrics rule specification file
cs: Neplatná položka v souboru specifikace pravidel metrik kódu
de: Ungültiger Eintrag in der Spezifikationsdatei für die Codemetrikregeln.
es: Entrada no válida en el archivo de especificación de regla de métricas de código
fr: Entrée non valide dans le fichier de spécification de règle de métrique du code
it: Voce non valida nel file di specifica delle regole per la metrica del codice
ja: コード メトリック ルール仕様ファイル内のエントリが無効です
ko: 코드 메트릭 규착 사양 파일의 잘못된 항목
pl: Nieprawidłowy wpis w pliku specyfikacji reguły metryk kodu
pt_br: Entrada inválida no arquivo de especificação de regra de métricas de código
ru: Недопустимая запись в файле спецификации правила метрик кода
tr: Ölçüm kuralı belirtim dosyasında geçersiz giriş
zh_hans: 代码度量规则规范文件中的条目无效
zh_hant: 程式碼度量規則規格檔案中的項目無效

# DoNotIgnoreMethodResultsTitle
source: Do not ignore method results
cs: Neignorujte výsledky metod.
de: Methodenergebnisse nicht ignorieren
es: No omitir resultados del método
fr: Ne pas ignorer les résultats des méthodes
it: Non ignorare i risultati del metodo
ja: メソッドの結果を無視しない
ko: 메서드 결과를 무시하지 마세요.
pl: Nie ignoruj wyników metody
pt_br: Não ignorar resultados de métodos
ru: Не игнорируйте результаты метода
tr: Yöntem sonuçlarını yoksaymayın
zh_hans: 不要忽略方法结果
zh_hant: 請勿略過方法結果

# DoNotIgnoreMethodResultsDescription
source: A new object is created but never used; or a method that creates and returns a new string is called and the new string is never used; or a COM or P/Invoke method returns an HRESULT or error code that is never used.
cs: Je vytvořený nový objekt, který se vůbec nepoužívá; nebo se volá metoda, která vytváří a vrací nový řetězec, který se vůbec nepoužívá; nebo metoda COM či P/Invoke vrací HRESULT nebo kód chyby, který se vůbec nepoužívá.
de: Ein neues Objekt wird erstellt, aber nicht verwendet, oder eine Methode wird aufgerufen, die eine neue Zeichenfolge erstellt und zurückgibt, aber die neue Zeichenfolge wird niemals verwendet, oder eine COM- oder P/Invoke-Methode gibt einen HRESULT-Wert oder einen Fehlercode zurück, der nicht verwendet wird.
es: Se crea un objeto pero no se usa nunca, se llama a un método que crea y devuelve una cadena nueva la cual no se usa nunca o bien un método P/Invoke o COM devuelve un código de error o HRESULT que no se usa nunca.
fr: Un objet est créé mais jamais utilisé, ou une méthode qui crée et retourne une nouvelle chaîne est appelée mais celle-ci n'est jamais utilisée, ou bien une méthode COM ou P/Invoke retourne une valeur HRESULT ou un code d'erreur qui n'est jamais utilisé.
it: Un nuovo oggetto viene creato ma mai usato oppure viene chiamato un metodo che crea e restituisce una nuova stringa che non viene mai usata oppure un metodo COM o P/Invoke restituisce un HRESULT o un codice errore che non viene mai usato.
ja: 新しいオブジェクトが作成されても使用されていないか、新しい文字列を作成して返すメソッドが呼び出されても新しい文字列が使用されていないか、COM メソッドまたは P/Invoke メソッドから返された HRESULT またはエラー コードが使用されていません。
ko: 새 개체가 만들어졌으나 사용되지 않았습니다. 또는 새 문자열을 만들고 반환한 메서드가 호출되었으며 새 문자열이 사용되지 않았습니다. 또는 COM 또는 P/Invoke가 사용되지 않는 HRESULT 또는 오류 코드를 반환합니다.
pl: Nowy obiekt został utworzony, ale nigdy nie został użyty, została wywołana metoda tworząca i zwracająca nowy ciąg, a nowy ciąg nigdy nie został użyty lub metoda COM albo P/Invoke zwraca wartość HRESULT lub kod błędu, który nigdy nie został użyty.
pt_br: Um novo objeto é criado, mas nunca usado; ou um método que cria e retorna uma nova cadeia de caracteres é chamado e a nova cadeia de caracteres nunca é usada; ou um método COM ou P/Invoke retorna um HRESULT ou um código de erro que nunca é usado.
ru: Созданный объект не используется, вызван метод, создающий и возвращающий строку, которая не используется, либо метод COM или P/Invoke возвращает результат HRESULT или код ошибки, который не используется.
tr: Yeni bir nesne oluşturulur ancak hiçbir zaman kullanılmaz; veya yeni bir dize oluşturup döndüren bir yöntem çağrılır ve yeni dize hiçbir zaman kullanılmaz; veya bir COM ya da P/Invoke yöntemi hiçbir zaman kullanılmayan bir HRESULT veya hata kodu döndürür.
zh_hans: 已创建新对象，但未使用过该对象；或已调用创建并返回新字符串的方法，但未使用过该新字符串；或 COM 或 P/Invoke 方法返回从未使用过的 HRESULT 或错误代码。
zh_hant: 已建立但從未使用的新物件; 或是會建立並傳回呼叫的新字串之方法，以及從未使用過的新字串; 或是傳回 HRESULT 或從未使用過的錯誤碼之 COM 或 P/Invoke。

# DoNotIgnoreMethodResultsMessageObjectCreation
source: {0} creates a new instance of {1} which is never used. Pass the instance as an argument to another method, assign the instance to a variable, or remove the object creation if it is unnecessary.
cs: {0} vytváří novou instanci {1}, která se vůbec nepoužívá. Předejte tuto instanci jako argument jiné metodě, přiřaďte tuto instanci proměnné nebo odeberte vytvoření objektu, pokud je nepotřebný.
de: "{0}" erstellt eine neue Instanz von "{1}", die nicht verwendet wird. Übergeben Sie die Instanz als Argument an eine andere Methode, weisen Sie die Instanz einer Variablen zu, oder entfernen Sie die Objekterstellung, sofern sie unnötig ist.
es: {0} crea una instancia de {1} que no se usa nunca. Pase la instancia como argumento a otro método, asigne la instancia a una variable o quite la creación del objeto si no es necesaria.
fr: {0} crée une instance de {1} qui n'est jamais utilisée. Passez l'instance en tant qu'argument à une autre méthode, assignez l'instance à une variable ou supprimez la création d'objet si elle n'est pas nécessaire.
it: {0} crea una nuova istanza di {1} che non viene mai usata. Passare l'istanza come argomento di un altro metodo, assegnare l'istanza a una variabile oppure rimuovere la creazione dell'oggetto se non è necessaria.
ja: {0} では使用されない {1} の新しいインスタンスが作成されます。インスタンスを引数として他のメソッドに渡すか、インスタンスを変数に割り当てるか、不要な場合はオブジェクト作成を削除してください。
ko: {0}이(가) 사용되지 않는 {1}의 새 인스턴스를 만듭니다. 인스턴스를 다른 메서드에 인수로 전달하고 변수에 할당하거나 불필요한 경우 개체 만들기를 제거하세요.
pl: Element {0} tworzy nowe wystąpienie elementu {1}, które nigdy nie zostało użyte. Przekaż wystąpienie jako argument do innej metody, przypisz wystąpienie do zmiennej lub usuń tworzenie obiektu, jeśli jest zbędne.
pt_br: {0} cria uma nova instância de {1} que nunca é usada. Passe a instância como argumento para outro método, atribua a instância a uma variável ou remova a criação do objeto se ela for desnecessária.
ru: {0} создает экземпляр {1}, который не используется. Передайте этот экземпляр в качестве аргумента другому методу, присвойте экземпляр переменной, или удалите создание объекта, если он не нужен.
tr: {0} hiçbir zaman kullanılmayan yeni bir {1} örneği oluşturuyor. Örneği bir bağımsız değişken olarak başka yönteme geçirin, örneği bir değişkene atayın ya da gereksizse nesne oluşturmayı kaldırın.
zh_hans: {0} 创建 {1} 的新实例，但该实例从未使用过。如果不需要此实例，请将它作为参数传递给另一个方法，将此实例赋给变量或删除对象创建。
zh_hant: {0} 建立了 {1} 的新執行個體，但從未使用過。請將執行個體以引數方式傳遞到另一個方法、將執行個體指派到變數，或是移除該物件建立 (若不需要的話)。

# DoNotIgnoreMethodResultsMessageStringCreation
source: {0} calls {1} but does not use the new string instance that the method returns. Pass the instance as an argument to another method, assign the instance to a variable, or remove the call if it is unnecessary.
cs: {0} volá {1}, ale nepoužívá novou instanci řetězce, kterou tato metoda vrací. Předejte tuto instanci jako argument jiné metodě, přiřaďte tuto instanci proměnné nebo odeberte volání, pokud je nepotřebné.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht die neue Zeichenfolgeninstanz, die von der Methode zurückgegeben wird. Übergeben Sie die Instanz als Argument an eine andere Methode, weisen Sie die Instanz einer Variablen zu, oder entfernen Sie den Aufruf, sofern er unnötig ist.
es: {0} llama a {1} pero no usa la nueva instancia de cadena que devuelve el método. Pase la instancia como argumento a otro método, asigne la instancia a una variable o quite la llamada si no es necesaria.
fr: {0} appelle {1} mais n'utilise pas la nouvelle instance de chaîne retournée par la méthode. Passez l'instance en tant qu'argument à une autre méthode, assignez l'instance à une variable ou supprimez l'appel s'il n'est pas nécessaire.
it: {0} chiama {1} ma non usa la nuova istanza di stringa restituita dal metodo. Passare l'istanza come argomento di un altro metodo, assegnare l'istanza a una variabile oppure rimuovere la chiamata se non è necessaria.
ja: {0} は {1} を呼び出しますが、メソッドから返される新しい文字列インスタンスは使用されません。インスタンスを引数として他のメソッドに渡すか、インスタンスを変数に割り当てるか、不要な場合は呼び出しを削除してください。
ko: {0}이(가) {1}을(를) 호출하지만 메서드가 반환하는 새 문자열 인스턴스를 사용하지 않습니다. 인스턴스를 다른 메서드에 인수로 전달하고 변수에 할당하거나 불필요한 경우 호출을 제거하세요.
pl: Element {0} wywołuje element {1}, ale nie używa wystąpienia nowego ciągu zwracanego przez metodę. Przekaż wystąpienie jako argument do innej metody, przypisz wystąpienie do zmiennej lub usuń wywołanie, jeśli jest zbędne.
pt_br: {0} chama {1}, mas não usa a instância da nova cadeia de caracteres retornada pelo método. Passe a instância como argumento para outro método, atribua a instância a uma variável ou remova a chamada se ela for desnecessária.
ru: {0} вызывает {1}, но не использует новый экземпляр строки, возвращаемый методом. Передайте этот экземпляр в качестве аргумента другому методу, присвойте экземпляр переменной или удалите вызов, если он не нужен.
tr: {0}, {1} çağırıyor ancak yöntemin döndürdüğü yeni dize örneğini kullanmıyor. Örneği bir bağımsız değişken olarak başka yönteme geçirin, örneği bir değişkene atayın ya da gereksizse çağrıyı kaldırın.
zh_hans: {0} 调用 {1}，但不使用该方法返回的新字符串实例。如果不需要此实例，请将它作为参数传递给另一个方法，将此实例赋给变量或删除调用。
zh_hant: {0} 呼叫了 {1}，但未使用方法傳回的新字串執行個體。請將執行個體以引數方式傳遞到另一個方法、將執行個體指派到變數，或是移除該呼叫 (若不需要的話)。

# DoNotIgnoreMethodResultsMessageHResultOrErrorCode
source: {0} calls {1} but does not use the HRESULT or error code that the method returns. This could lead to unexpected behavior in error conditions or low-resource situations. Use the result in a conditional statement, assign the result to a variable, or pass it as an argument to another method.
cs: {0} volá {1}, ale nepoužívá HRESULT ani kód chyby, který tato metoda vrací. To může vést k neočekávanému chování při výskytu chyby nebo nedostatku prostředků. Použijte výsledek v podmíněném příkazu, přiřaďte výsledek proměnné nebo ho předejte jako argument jiné metodě.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht den HRESULT-Wert oder den Fehlercode, der von der Methode zurückgegeben wird. Dies kann zu unerwartetem Verhalten bei Fehlerbedingungen oder in Situationen mit Ressourcenknappheit führen. Verwenden Sie das Ergebnis in einer Bedingungsanweisung, weisen Sie das Ergebnis einer Variablen zu, oder übergeben Sie es als Argument an eine andere Methode.
es: {0} llama a {1} pero no usa el código de error o HRESULT que devuelve el método. Esto puede dar lugar a un comportamiento inesperado en condiciones de error o situaciones de pocos recursos. Use el resultado en una instrucción condicional, asigne el resultado a una variable o páselo como argumento a otro método.
fr: {0} appelle {1} mais n'utilise pas la valeur HRESULT ou le code d'erreur retourné par la méthode. Cela peut entraîner un comportement inattendu dans les conditions d'erreurs ou dans les situations où les ressources sont limitées. Utilisez le résultat dans une instruction conditionnelle, assignez-le à une variable ou passez-le en tant qu'argument à une autre méthode.
it: {0} chiama {1} ma non usa l'HRESULT o il codice errore restituito dal metodo. Questo potrebbe causare un comportamento imprevisto in condizioni di errore o in situazioni di risorse insufficienti. Usare il risultato in un'istruzione condizionale, assegnare il risultato a una variabile o passarlo come argomento a un altro metodo.
ja: {0} は {1} を呼び出しますが、メソッドから返される HRESULT またはエラー コードは使用されません。このため、エラー条件での予期しない動作やリソース不足が発生する可能性があります。条件ステートメントで結果を使用するか、結果を変数に割り当てるか、引数として他のメソッドに渡してください。
ko: {0}이(가) {1}을(를) 호출하지만 메서드가 반환하는 HRESULT 또는 오류 코드를 사용하지 않습니다. 이로 인해 오류 상태의 예기치 않은 동작이 발생하거나 리소스가 부족해질 수 있습니다. 결과를 조건문에 사용하거나 변수에 할당하거나 다른 메서드에 인수로 전달하세요.
pl: Element {0} wywołuje element {1}, ale nie używa wartości HRESULT ani kodu błędu zwracanego przez metodę. Może to doprowadzić do nieoczekiwanego zachowania w warunkach błędu lub sytuacjach małej ilości zasobów. Użyj wyniku w instrukcji warunkowej, przypisz wynik do zmiennej lub przekaż go jako argument do innej metody.
pt_br: {0} chama {1}, mas não usa HRESULT ou o código do erro retornado pelo método. Isso poderia levar a um comportamento inesperado em condições de erro ou situações de poucos recursos. Use o resultado em uma instrução condicional, atribua o resultado a uma variável ou passe-o como argumento para outro método.
ru: {0} вызывает {1}, но не использует HRESULT или код ошибки, возвращаемые методом. Это может привести к непредвиденному поведению при возникновении ошибок или нехватке ресурсов. Используйте результат в условном операторе, присвойте его переменной или передайте его в качестве аргумента другому методу.
tr: {0}, {1} çağırıyor ancak yöntemin döndürdüğü HRESULT veya hata kodunu kullanmıyor. Bu, hata koşullarında ya da düşük kaynak durumlarında beklenmedik davranışlara neden olabilir. Bir koşullu ifadedeki sonucu kullanın, sonucu bir değişkene atayın veya bir bağımsız değişken olarak başka bir yönteme geçirin.
zh_hans: {0} 调用 {1}，但不使用该方法返回的 HRESULT 或错误代码。这可能会导致在出错或资源较少的情况下出现意外行为。请使用条件语句中的结果，并将结果赋给变量或将其作为自变量传递给另一个方法。
zh_hant: {0} 呼叫了 {1}，但未使用方法傳回的 HRESULT 或錯誤碼。如此可能會導致錯誤情況或資源不足時出現非預期的行為。請使用條件陳述式中的結果、將結果指派到變數，或將其以引數方式傳遞到另一個方法。

# DoNotIgnoreMethodResultsMessageTryParse
source: {0} calls {1} but does not explicitly check whether the conversion succeeded. Either use the return value in a conditional statement or verify that the call site expects that the out argument will be set to the default value when the conversion fails.
cs: {0} volá {1}, ale explicitně nekontroluje, jestli byl převod úspěšný. Buď použijte návratovou hodnotu v podmíněném příkazu, nebo ověřte, jestli volající web očekává, že se výstupní argument nastaví na výchozí hodnotu, když se převod nepodaří.
de: "{0}" ruft "{1}" auf, überprüft aber nicht explizit, ob die Konvertierung erfolgreich verlaufen ist. Verwenden Sie entweder den Rückgabewert in einer Bedingungsanweisung, oder prüfen Sie, ob die Aufrufsite erwartet, dass das ausgehende Argument bei einem Konvertierungsfehler auf den Standardwert festgelegt wird.
es: {0} llama a {1} pero no comprueba de forma explícita si la conversión se realizó correctamente. Use el valor devuelto en una instrucción condicional o compruebe que el sitio de la llamada espera que el argumento de salida se establezca en el valor predeterminado cuando la conversión no es correcta.
fr: {0} appelle {1} mais ne vérifie pas explicitement si la conversion a réussi. Utilisez la valeur de retour dans une instruction conditionnelle, ou vérifiez que le site d'appel s'attend à ce que l'argument out accepte la valeur par défaut en cas d'échec de la conversion.
it: {0} chiama {1} ma non verifica in modo esplicito se la conversione è riuscita. Usare il valore restituito in un'istruzione condizionale o verificare che il sito di chiamata preveda l'impostazione dell'argomento out sul valore predefinito in caso di conversione non riuscita.
ja: {0} は {1} を呼び出しますが、変換が成功したかどうかを明示的に確認しません。戻り値を条件ステートメントで使用するか、または、変換が失敗した場合に out 引数が既定値に設定されることを呼び出しサイトで想定するようにしてください。
ko: {0}이(가) {1}을(를) 호출하지만 변환 성공 여부를 명시적으로 검사하지 않습니다. 반환 값을 조건문에 사용하거나, 변환에 실패하면 out 인수가 기본값으로 설정되도록 호출 사이트가 지정되어 있는지 확인하세요.
pl: Element {0} wywołuje element {1}, ale nie sprawdza jawnie, czy konwersja się udała. Użyj wartości zwracanej w instrukcji warunkowej lub zweryfikuj, czy lokacja wywołania oczekuje, że argument wychodzący zostanie ustawiony na wartość domyślną w razie niepowodzenia konwersji.
pt_br: {0} chama {1}, mas não verifica explicitamente se a conversão foi bem-sucedida. Use o valor retornado em uma instrução condicional ou verifique se o local da chamada espera que o argumento de saída seja definido como o valor padrão quando a conversão falha.
ru: {0} вызывает {1}, но явно не проверяет успешность преобразования. Либо используйте возвращаемое значение в условном операторе, либо проверьте, что источник вызова предполагает, что при ошибке преобразования для аргумента out будет установлено значение по умолчанию.
tr: {0}, {1} çağırıyor ancak dönüşümün başarılı olup olmadığını açıkça denetlemiyor. Dönüş değerini koşullu bir ifadede kullanın veya çağırma sitesinin çıkış değerinin dönüşüm başarısız olduğunda varsayılan değere ayarlanmasını beklediğini doğrulayın.
zh_hans: {0} 调用 {1}，但不显式检查转换是否成功。请使用条件语句中的返回值，或验证在转换失败时调用站点是否希望将 out 参数设置为默认值。
zh_hant: {0} 呼叫了 {1}，但未明確地檢查轉換是否成功。請在條件陳述式中使用傳回值，或確認呼叫位置在轉換失敗時，預期會將 out 引數設為預設值。

# AvoidUninstantiatedInternalClassesTitle
source: Avoid uninstantiated internal classes
cs: Vyhněte se interním třídám bez vytvořené instance.
de: Nicht instanziierte interne Klassen vermeiden
es: Evitar las clases internas sin instancia
fr: Éviter les classes internes non instanciées
it: Evitare classi interne per cui non è stata creata un'istanza
ja: インスタンス化されていない内部クラスを使用しません
ko: 인스턴스화되지 않는 내부 클래스를 사용하지 마세요.
pl: Unikaj klas wewnętrznych bez wystąpień
pt_br: Evite classes internas sem instâncias
ru: Избегайте внутренних классов, не имеющих экземпляры
tr: Örneklendirilmemiş iç sınıflardan kaçının
zh_hans: 避免未实例化的内部类
zh_hant: 避免未具現化的內部類別

# AvoidUninstantiatedInternalClassesDescription
source: An instance of an assembly-level type is not created by code in the assembly.
cs: Instance typu na úrovni sestavení není vytvořená kódem v tomto sestavení.
de: Eine Instanz eines Typs auf Assemblyebene wird nicht von Code in der Assembly erstellt.
es: El código no crea ninguna instancia de un tipo de nivel de ensamblado en el ensamblado.
fr: Une instance d'un type au niveau de l'assembly n'est pas créée par du code dans l'assembly.
it: Il codice nell'assembly non crea un'istanza di un tipo a livello di assembly.
ja: アセンブリレベルの型のインスタンスが、アセンブリ内のコードから作成されません。
ko: 어셈블리 수준 형식의 인스턴스는 어셈블리 코드에서 만들어지지 않습니다.
pl: Wystąpienie typu na poziomie zestawu nie zostało utworzone przez kod w zestawie.
pt_br: Uma instância de um tipo de nível de assembly não é criada pelo código no assembly.
ru: В этой сборке код не создает экземпляр типа на уровне сборки.
tr: Derleme düzeyi bir türün örneği derlemede kod tarafından oluşturulmaz.
zh_hans: 程序集级别类型的实例不由程序集中的代码创建。
zh_hant: 組件層級類型的執行個體，並非由組件中的程式碼所建立。

# AvoidUninstantiatedInternalClassesMessage
source: '{0}' is an internal class that is apparently never instantiated. If so, remove the code from the assembly. If this class is intended to contain only static members, make it 'static' (Module in Visual Basic).
cs: {0} je interní třída, jejíž instance není zjevně vůbec vytvořená. V takovém případě odeberte kód ze sestavení. Pokud má tato třída obsahovat jenom statické členy, nastavte ji jako statickou (Module v jazyce Visual Basic).
de: '{0}' ist eine interne Klasse, die anscheinend nie instanziiert wird. Wenn dies der Fall ist, entfernen Sie den Code aus der Assembly. Wenn diese Klasse nur statische Member enthalten soll, legen Sie sie als 'static' fest (Module in Visual Basic).
es: "{0}" es una clase interna de la que aparentemente nunca se crea una instancia. Si es así, quite el código del ensamblado. Si esta clase está destinada a contener solo miembros estáticos, conviértala en "static" (Module en Visual Basic).
fr: « {0} » est une classe interne qui n'est apparemment jamais instanciée. Si tel est le cas, supprimez le code de l'assembly. Si cette classe est destinée à contenir uniquement des membres statiques, rendez-la « static » (Module dans Visual Basic).
it: '{0}' è una classe interna per la quale sembra che non sia mai stata creata un'istanza. In tal caso, rimuovere il codice dall'assembly. Se la classe è destinata a contenere solo membri statici, impostarla come 'static' (Module in Visual Basic).
ko: '{0}'은(는) 명백히 인스턴스화된 적이 없는 내부 클래스입니다. 그렇다면 어셈블리에서 코드를 제거합니다. 이 클래스에서 정적 멤버만 포함하려는 경우 'static'(Visual Basic의 Module)으로 설정합니다.
pl: Element „{0}” jest klasą wewnętrzną, która najwyraźniej nigdy nie miała wystąpień. Jeśli tak, usuń kod z zestawu. Jeśli ta klasa w założeniu ma zawierać tylko statyczne składowe, zmień ją na „statyczną” (Module w języku Visual Basic).
pt_br: '{0}' é uma classe interna que aparentemente nunca é instanciada. Em caso afirmativo, remova o código do assembly. Se esta classe destina-se a conter apenas membros estáticos, torne-a 'static' (Module in Visual Basic).
ru: "{0}" является внутренним классом, экземпляр которого никогда не создается. Если это так, удалите код из сборки. Если этот класс должен содержать только статические элементы, сделайте его "статическим" (Module в Visual Basic).
tr: '{0}' görünüşe göre hiç örnek oluşturulmamış bir iç sınıftır. Öyleyse, kodu derlemeden kaldırın. Bu sınıfın yalnızca statik üyeler içermesi gerekiyorsa, ‘statik’ hale getirin (Visual Basic’te Module).
zh_hans: "{0}" 是显然从未实例化过的内部类。如果是这样，请从程序集中删除该代码。如果此内部类只用于包含静态成员，请使其成为静态类(在 Visual Basic 中为 Module)。
zh_hant: '{0}' 是明顯從未具現化的內部類別。若是如此，請從組件中移除該程式碼。如果此類別預計只會包含靜態成員，請將其設為 'static' (在 Visual Basic 中為 Module )。

# AvoidUnusedPrivateFieldsTitle
source: Avoid unused private fields
cs: Vyhněte se nepoužitým privátním polím.
de: Nicht verwendete private Felder vermeiden
es: Evitar los campos privados sin utilizar
fr: Évitez les champs privés inutilisés
it: Evitare campi privati inutilizzati
ja: 使用されていないプライベート フィールドを使用しません
ko: 사용하지 않는 프라이빗 필드를 사용하지 마세요.
pl: Unikaj nieużywanych pól prywatnych
pt_br: Evite campos particulares não utilizados
ru: Избегайте неиспользуемых частных полей
tr: Kullanılmayan özel alanlardan kaçının
zh_hans: 避免未使用的私有字段
zh_hant: 避免未使用的私用欄位
