Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseIntegralOrStringArgumentForIndexersTitle
source: Use Integral Or String Argument For Indexers
cs: Použijte pro indexery integrální nebo řetězcový argument.
de: Integrales oder Zeichenfolgenargument für Indizierer verwenden
es: Usar un argumento integral o de cadena para los indizadores
fr: Utiliser un argument de chaîne ou intégral pour les indexeurs
it: Usare un argomento di tipo string o Integer per gli indicizzatori
ja: インデクサーには整数または文字列引数を使用します
ko: 인덱서에 정수 또는 문자열 인수를 사용하세요.
pl: Użyj argumentu całkowitoliczbowego lub ciągu dla indeksatorów
pt_br: Usar argumento integral ou de cadeia de caracteres para indexadores
ru: Используйте целый или строковый аргумент для индексаторов
tr: Dizin Oluşturucular için Tamsayı veya Dize Bağımsız Değişkenini Kullanın
zh_hans: 将整型或字符串参数用于索引器
zh_hant: 為索引子使用整數或字串引數

# DoNotDirectlyAwaitATaskDescription
source: When an asynchronous method awaits a Task directly, continuation occurs in the same thread that created the task. Consider calling Task.ConfigureAwait(Boolean) to signal your intention for continuation. Call ConfigureAwait(false) on the task to schedule continuations to the thread pool, thereby avoiding a deadlock on the UI thread. Passing false is a good option for app-independent libraries. Calling ConfigureAwait(true) on the task has the same behavior as not explicitly calling ConfigureAwait. By explicitly calling this method, you're letting readers know you intentionally want to perform the continuation on the original synchronization context.
cs: Když asynchronní metoda čeká přímo na Task, bude se pokračovat ve stejném vlákně, v jakém se vytvořila daná úloha. Zvažte možnost zavolat Task.ConfigureAwait(Boolean), čímž dáte najevo, že hodláte pokračovat. Když pro úlohu zavoláte ConfigureAwait(false), můžete ve fondu vláken naplánovat pokračování a vyhnout se tak vzájemnému zablokování ve vláknu uživatelského rozhraní. Pro knihovny, které nejsou závislé na aplikacích, je vhodné předat false. Volání ConfigureAwait(true) pro danou úlohu se chová stejně, jako když se explicitně nezavolá ConfigureAwait. Když tuto metodu explicitně zavoláte, dáváte čtenářům najevo, že se záměrně chystáte pokračovat v původním kontextu synchronizace.
de: Wenn eine asynchrone Methode direkt auf einen Task wartet, erfolgt die Fortsetzung in demselben Thread, in dem der Task erstellt wurde. Erwägen Sie den Aufruf von "Task.ConfigureAwait(Boolean)", um Ihre Absicht zur Fortsetzung zu signalisieren. Rufen Sie "ConfigureAwait(false)" auf, um Fortsetzungen für den Threadpool zu planen und so einen Deadlock für den UI-Thread zu vermeiden. Die Übergabe von FALSE ist eine geeignete Option für App-unabhängige Bibliotheken. Der Aufruf von "ConfigureAwait(true)" für den Task führt zum gleichen Verhalten wie der nicht explizite Aufruf von "ConfigureAwait". Wenn Sie diese Methode explizit aufrufen, teilen Sie den Lesern mit, dass Sie die Fortsetzung absichtlich für den ursprünglichen Synchronisierungskontext durchführen möchten.
es: Cuando un método asincrónico espera una tarea directamente, la continuación se produce en el mismo subproceso que creó la tarea. Puede llamar a Task.ConfigureAwait(Boolean) para indicar su intención de continuación. Llame a ConfigureAwait(false) en la tarea para programar las continuaciones en el grupo de subprocesos, lo que evita un interbloqueo en el subproceso de IU. Pasar el valor false es una opción adecuada para bibliotecas independientes de aplicación. El comportamiento obtenido al llamar a ConfigureAwait(true) en la tarea coincide con no llamar explícitamente a ConfigureAwait. Al llamar a este método de forma explícita, se informa a los lectores de que quiere realizar la continuación en el contexto de sincronización original.
fr: Quand une méthode asynchrone attend directement une tâche, la continuation se produit dans le même thread qui a créé la tâche. Appelez Task.ConfigureAwait(Boolean) pour signaler votre intention de continuer. Appelez ConfigureAwait(false) sur la tâche pour planifier les continuations sur le pool de threads, afin d'éviter un blocage sur le thread d'interface utilisateur. Vous pouvez passer false pour les bibliothèques indépendantes des applications. L'appel de ConfigureAwait(true) sur la tâche a le même comportement qu'un appel non explicite de ConfigureAwait. En appelant explicitement cette méthode, vous indiquez aux lecteurs que vous voulez volontairement effectuer la continuation sur le contexte de synchronisation d'origine.
it: Quando un metodo asincrono attende direttamente un elemento Task, la continuazione avviene nello stesso thread che ha creato l'attività. Provare a chiamare Task.ConfigureAwait(Boolean) per segnalare l'intenzione di continuare. Chiamare ConfigureAwait(false) sull'attività per pianificare le continuazioni nel pool di thread, evitando così un deadlock nel thread dell'interfaccia utente. È consigliabile passare false per le librerie indipendenti dall'app. Chiamare ConfigureAwait(true) sull'attività per ottenere lo stesso comportamento di quando ConfigureAwait non viene chiamato in modo esplicito. Se si chiama questo metodo in modo esplicito, si consente ai lettori di sapere che si intende intenzionalmente eseguire la continuazione nel contesto di sincronizzazione originale.
ja: 非同期メソッドがタスクを直接待機すると、タスクを作成したのと同じスレッドで継続が発生します。継続の意図を示すには、Task.ConfigureAwait(Boolean) の呼び出しを検討してください。タスクで ConfigureAwait(false) を呼び出して、スレッド プールへの継続をスケジュールします。その結果、UI スレッドのデッドロックを回避できます。アプリに依存しないライブラリでは、false を渡すことが適切なオプションです。タスクで ConfigureAwait(true) を呼び出すと、ConfigureAwait を明示的に呼び出さない場合と動作が同じになります。このメソッドを明示的に呼び出すことにより、元の同期コンテキストで意図的に継続を実行していることを閲覧者に示します。
ko: 비동기 메서드가 작업을 바로 대기하는 경우 작업을 만든 스레드와 같은 스레드에서 연속이 발생합니다. 연속에 대한 의도를 알리려면 Task.ConfigureAwait(Boolean) 호출을 고려합니다. 작업에 대해 ConfigureAwait(false)를 호출하여 스레드 풀에 대한 연속을 예약함으로써 UI 스레드에서의 교착 상태를 방지합니다. 앱과 관계없는 라이브러리의 경우 false를 전달하는 것이 좋은 옵션이 됩니다. 작업에 대해 ConfigureAwait(true)를 호출하는 것은 명시적으로 ConfigureAwait를 호출하지 않는 것과 동작이 같습니다. 이 메서드를 명시적으로 호출하여 판독기에 원래 동기화 컨텍스트에서 의도적으로 연속을 수행하려는 것임을 알립니다.
pl: Gdy metoda asynchroniczna oczekuje na zadanie bezpośrednio, kontynuowanie następuje w tym samym wątku, w którym utworzono zadanie. Rozważ wywołanie metody Task.ConfigureAwait(wartość logiczna), aby zasygnalizować zamiar kontynuowania. Wywołaj metodę ConfigureAwait(false) w zadaniu, aby zaplanować kontynuacje do puli wątków, co pozwoli uniknąć zakleszczenia wątku interfejsu użytkownika. Przekazywanie wartości false to dobra opcja dla bibliotek niezależnych od aplikacji. Wywoływanie metody ConfigureAwait(true) w zadaniu działa tak samo jak brak jawnego wywołania metody ConfigureAwait. Wywołując jawnie tę metodę, informujesz czytelników, że celowo zamierzasz kontynuować w pierwotnym kontekście synchronizacji.
pt_br: Quando um método assíncrono aguarda uma Tarefa diretamente, a continuação ocorre no mesmo thread que criou a tarefa. Considere chamar Task.ConfigureAwait(Boolean) para sinalizar sua intenção de continuação. Chame ConfigureAwait(false) na tarefa para agendar continuações para o pool de threads, evitando assim um deadlock no thread da interface do usuário. Passar false é uma boa opção para bibliotecas independentes de aplicativo. Chamar ConfigureAwait(true) na tarefa tem o mesmo comportamento que não chamar ConfigureAwait explicitamente. Ao chamar esse método explicitamente, você está permitindo que os leitores saibam que você deseja intencionalmente executar a continuação no contexto de sincronização original.
ru: Когда асинхронный метод непосредственно ожидает задачу, продолжение происходит в том же потоке, в котором была создана задача. Попробуйте вызвать Task.ConfigureAwait(Boolean), чтобы сообщить о том, что планируется продолжение. Вызовите ConfigureAwait(false) для задачи, чтобы запланировать продолжения для пула потоков, избежав таким образом взаимоблокировки в потоке пользовательского интерфейса. Передача значения false является хорошим вариантом для библиотек, независимых от приложений. Поведение при вызове ConfigureAwait(true) для задачи такое же, как при неявном вызове ConfigureAwait. При явном вызове этого метода вы сообщаете читателям, что вы намеренно хотите выполнить продолжение в исходном контексте синхронизации.
tr: Bir asenkron metot bir Görevi doğrudan bekliyorsa, görevi oluşturan iş parçacığında devamlılık gerçekleşir. Devamlılığa yönelik amacınızı belirtmek için Task.ConfigureAwait(Boolean) çağrısı yapmayı düşünün. İş parçacığı havuzuna devamlılıkları zamanlamaya yönelik görev üzerinde ConfigureAwait(false) çağrısı yaparak kullanıcı arabirimi iş parçacığında kilitlenmeyi önleyin. False geçirmek, uygulamadan bağımsız kitaplıklar için iyi bir seçenektir. Görevde ConfigureAwait(true) çağrısı yapmak, ConfigureAwait öğesini açıkça çağırmamakla aynı davranışa sahiptir. Bu yöntemi açık bir şekilde çağırarak, okuyuculara devamlılığı özgün eşitleme bağlamında gerçekleştirmek istediğinizi bildirirsiniz.
zh_hans: 当异步方法直接等待任务时，在创建该任务的同一线程中执行继续操作。请考虑调用 Task.ConfigureAwait(Boolean)以告知你打算继续。对任务调用 ConfigureAwait(false)以将继续操作安排到线程池，从而避免 UI 线程上出现死锁。对于独立于应用的库，最好选择传递 false。对任务调用 ConfigureAwait(true) 的行为与不显式调用 ConfigureAwait 相同。通过显式调用此方法，可以让读者知道你有意要对原始同步上下文执行继续操作。
zh_hant: 當非同步方法直接等候 Task 時，接續會發生在建立工作的同一個執行緒中。請考慮呼叫 Task.ConfigureAwait(Boolean) 以表示您打算接續。對工作呼叫 ConfigureAwait(false) 可對執行緒集區排程接續，從而避免 UI 執行緒上產生死結。傳遞 false 是適用於應用程式獨立程式庫的選項。對工作呼叫 ConfigureAwait(true) 的行為與未明確呼叫 ConfigureAwait 的行為相同。明確呼叫此方法，表示要讓讀取器知道您打算對原始同步內容執行接續。

# DoNotDirectlyAwaitATaskMessage
source: Consider calling ConfigureAwait on the awaited task
cs: Zvažte možnost zavolat ConfigureAwait pro očekávanou úlohu
de: Aufruf von "ConfigureAwait" für erwarteten Task erwägen
es: Puede llamar a ConfigureAwait en la tarea esperada
fr: Appeler ConfigureAwait sur la tâche attendue
it: Provare a chiamare ConfigureAwait sull'attività attesa
ja: 待機中のタスクでの ConfigureAwait の呼び出しを検討してください
ko: 대기된 작업에 대해 ConfigureAwait 호출을 고려하세요.
pl: Rozważ wywołanie metody ConfigureAwait w zadaniu, na które się oczekuje
pt_br: Considere chamar ConfigureAwait na tarefa esperada
ru: Попробуйте вызвать ConfigureAwait для ожидаемой задачи
tr: Beklenen görevde ConfigureAwait çağrısı yapmayı düşünün
zh_hans: 考虑对等待的任务调用 ConfigureAwait
zh_hant: 請考慮對等候的工作呼叫 ConfigureAwait

# DoNotDirectlyAwaitATaskTitle
source: Consider calling ConfigureAwait on the awaited task
cs: Zvažte možnost zavolat ConfigureAwait pro očekávanou úlohu
de: Aufruf von "ConfigureAwait" für erwarteten Task erwägen
es: Puede llamar a ConfigureAwait en la tarea esperada
fr: Appeler ConfigureAwait sur la tâche attendue
it: Provare a chiamare ConfigureAwait sull'attività attesa
ja: 待機中のタスクでの ConfigureAwait の呼び出しを検討してください
ko: 대기된 작업에 대해 ConfigureAwait 호출 고려
pl: Rozważ wywołanie metody ConfigureAwait w zadaniu, na które się oczekuje
pt_br: Considere chamar ConfigureAwait na tarefa esperada
ru: Попробуйте вызвать ConfigureAwait для ожидаемой задачи
tr: Beklenen görevde ConfigureAwait çağrısı yapmayı düşünün
zh_hans: 考虑对等待的任务调用 ConfigureAwait
zh_hant: 請考慮對等候的工作呼叫 ConfigureAwait

source: Append .ConfigureAwait(false)
cs: Připojte .ConfigureAwait(false).
de: ".ConfigureAwait(false)" anfügen
es: Anexar .ConfigureAwait(false)
fr: Ajouter .ConfigureAwait(false)
it: Accodare .ConfigureAwait(false)
ja: .ConfigureAwait(false) を追加します
ko: .ConfigureAwait(false)를 추가하세요.
pl: Dołącz wywołanie .ConfigureAwait(false)
pt_br: Acrescentar .ConfigureAwait(false)
ru: Добавьте .ConfigureAwait(false)
tr: Sonuna .ConfigureAwait(false) ekleyin
zh_hans: 追加 .ConfigureAwait(false)
zh_hant: 附加 .ConfigureAwait(false)

# ImplementIEquatableWhenOverridingObjectEqualsDescription
source: When a type T overrides Object.Equals(object), the implementation must cast the object argument to the correct type T before performing the comparison. If the type implements IEquatable<T>, and therefore offers the method T.Equals(T), and if the argument is known at compile time to be of type T, then the compiler can call IEquatable<T>.Equals(T) instead of Object.Equals(object), and no cast is necessary, improving performance.
cs: Když typ T přepisuje Object.Equals(object), implementace musí před porovnáním přetypovat argument objektu na správný typ T. Pokud typ implementuje rozhraní IEquatable<T> a tím nabízí metodu T.Equals(T) a pokud je při kompilaci známo, že argument je typu T, kompilátor může zavolat IEquatable<T>.Equals(T) místo Object.Equals(object). Díky tomu není nutné nic přetypovávat, což zvyšuje výkon.
de: Wenn ein Object.Equals(object) durch einen Typ T außer Kraft gesetzt wird, muss die Implementierung das Objektargument in den richtigen Typ T umwandeln, bevor der Vergleich durchgeführt wird. Wenn der Typ IEquatable<T> implementiert und daher die T.Equals(T)-Methode anbietet und wenn das Argument zur Kompilierzeit bekanntermaßen dem Typ T entspricht, kann der Compiler IEquatable<T>. Equals(T) anstelle von Object.Equals(object) aufrufen. In diesem Fall ist keine Umwandlung erforderlich, sodass eine bessere Leistung erzielt werden kann.
es: Cuando un tipo T reemplaza a Object.Equals(object), la implementación debe convertir el argumento de objeto al tipo T correcto antes de realizar la comparación. Si el tipo implementa IEquatable<T> y, por tanto, ofrece el método T.Equals(T) y si se sabe que el argumento es de tipo T en tiempo de compilación, el compilador puede llamar a IEquatable<T>. Equals(T) en lugar de a Object.Equals(object) y no es necesaria ninguna conversión, lo que mejora el rendimiento.
fr: Quand un type T remplace Object.Equals(object), l'implémentation doit caster l'argument d'objet vers le type T approprié avant d'effectuer la comparaison. Si le type implémente IEquatable<T>, et offre donc la méthode T.Equals(T), et si l'argument est connu au moment de la compilation pour être de type T, le compilateur peut appeler IEquatable<T>.Equals(T) à la place de Object.Equals(object). Aucun cast n'est nécessaire, ce qui se traduit par une amélioration des performances.
it: Quando un tipo T esegue l'override di Object.Equals(object), prima del confronto l'implementazione deve eseguire il cast dell'argomento dell'oggetto al tipo T corretto. Se il tipo implementa IEquatable<T> e quindi offre il metodo T.Equals(T) e si sa che in fase di compilazione l'argomento è di tipo T, il compilatore può chiamare IEquatable<T>.Equals(T) invece di Object.Equals(object) senza eseguire alcun cast, migliorando in tal modo le prestazioni.
ja: 型 T が Object.Equals(object) をオーバーライドする場合、この実装は、比較を行う前にオブジェクトの引数を正しい型 T にキャストする必要があります。型が IEquatable<T> を実装してメソッド T.Equals(T) を提供する場合、およびコンパイル時に引数が型 T であることがわかっている場合、コンパイラは Object.Equals(object) の代わりに IEquatable<T>.Equals(T) を呼び出すことができ、キャストは必要ではなくなるため、パフォーマンスが向上します。
ko: 형식 T가 Object.Equals(object)를 재정의하면 해당 구현은 비교를 수행하기 전에 개체 인수를 올바른 형식 T로 캐스트해야 합니다. 해당 형식이 IEquatable<T>를 구현하므로 T.Equals(T) 메서드를 제공하는 경우 및 인수가 컴파일 시간에 형식 T로 알려지는 경우 컴파일러는 Object.Equals(object) 대신 IEquatable<T>.Equals(T)를 호출할 수 있고, 캐스트가 필요하지 않으므로 성능이 향상됩니다.
pl: Gdy typ T przesłania metodę Object.Equals(object), implementacja musi rzutować obiekt będący argumentem na poprawny typ T przed wykonaniem porównania. Jeśli typ implementuje interfejs IEquatable<T>, a więc oferuje metodę T.Equals(T), i jeśli o argumencie wiadomo w chwili kompilacji, że jest typu T, kompilator może wywołać metodę IEquatable<T>.Equals(T) zamiast metody Object.Equals(object) bez konieczności wykonywania rzutowania, co poprawia wydajność.
pt_br: Quando um tipo T substitui Object.Equals(object), a implementação precisa converter o argumento de objeto no tipo T correto antes de executar a comparação. Se o tipo implementa IEquatable<T> e, portanto, oferece o método T.Equals(T) e se, no tempo de compilação, o argumento é reconhecido como do tipo T, o compilador pode chamar IEquatable<T>.Equals(T) em vez de Object.Equals(object) e não é necessária nenhuma conversão, melhorando o desempenho.
ru: Если тип T переопределяет Object.Equals(object), реализация должна привести аргумент object к правильному типу T перед выполнением сравнения. Если тип реализует IEquatable<T>и поэтому предоставляет метод T.Equals(T), а также известно, что этот аргумент во время компиляции имеет тип T, компилятор может вызывать IEquatable<T>.Equals(T) вместо Object.Equals(object) и приведение не требуется, что повышает производительность.
tr: Bir T türü Object.Equals(object) öğesini geçersiz kıldığında, uygulama karşılaştırma gerçekleştirmeden önce nesne bağımsız değişkenini doğru T türüne dönüştürmelidir. Tür IEquatable<T> arabirimini uyguluyor, dolayısıyla T.Equals(T) metodunu sunuyorsa ve bağımsız değişkenin derleme zamanında T türünde olduğu biliniyorsa, derleyici Object.Equals(object) yerine IEquatable<T>.Equals(T) çağrısı yapabilir ve tür dönüştürmeye gerek kalmadığından performansın artırılması sağlanır.
zh_hans: 当类型 T 替代 Object.Equals(object) 时，该实现必须在执行比较前将 object 参数强制转换为正确的类型 T。如果该类型实现了 IEquatable<T>，并因此提供了方法 T.Equals(T)，如果在编译时已知参数为类型 T，则编译器可以调用 IEquatable<T>.Equals(T) 而不是 Object.Equals(object) 来提高性能，并且无需强制转换。
zh_hant: 當類型 T 覆寫 Object.Equals(object) 時，實作必須將物件引數轉換為正確的類型 T，然後才可執行比較。如果此類型會實作 IEquatable<T>，因而提供方法 T.Equals(T)，且引數若在編譯時期即已知為類型 T，則編譯器可呼叫 IEquatable<T>.Equals(T) 而非 Object.Equals(object)，而不需要轉換，如此即可改進效能。

# OverrideObjectEqualsDescription
source: When a type T implements the interface IEquatable<T>, it suggests to a user who sees a call to the Equals method in source code that an instance of the type can be equated with an instance of any other type. The user might be confused if their attempt to equate the type with an instance of another type fails to compile. This violates the "principle of least surprise".
cs: Když typ T implementuje rozhraní IEquatable<T>, informuje uživatele, který ve zdrojovém kódu vidí volání metody Equals, že instance daného typu se dá porovnat s instancí jiného typu. U uživatele může dojít k nedorozumění, pokud jeho pokus o porovnání typu s instancí jiného typu způsobí chybu při kompilaci. To porušuje tzv. princip minimálního překvapení.
de: Wenn ein Typ T die Schnittstelle IEquatable<T> implementiert, gewinnt ein Benutzer, der einen Aufruf der Equals-Methode im Quellcode anzeigt, den Eindruck, dass eine Instanz des Typs mit einer Instanz eines beliebigen anderen Typs gleichgesetzt werden kann. Der Benutzer ist möglicherweise irritiert, wenn er den Typ mit einer Instanz eines anderen Typs gleichzusetzen versucht und keine Kompilierung möglich ist. Dies verstößt gegen das "Prinzip der geringsten Überraschung" (Principle of Least Surprise).
es: Cuando un tipo T implementa la interfaz IEquatable<T>, sugiere a un usuario que ve una llamada al método Equals en el código fuente que una instancia del tipo se puede equiparar a una instancia de cualquier otro tipo. El usuario puede confundirse si se produce un error de compilación al intentar equiparar el tipo con una instancia de otro tipo. Esto infringe el "principio de menos sorpresa".
fr: Quand un type T implémente l'interface IEquatable<T>, cela indique à l'utilisateur qui voit un appel à la méthode Equals dans le code source qu'une instance du type peut être rendue équivalente à une instance de n'importe quel autre type. L'utilisateur risque d'être perplexe si sa tentative visant à rendre le type équivalent à une instance d'un autre type entraîne un échec de compilation. Cela va à l'encontre du "principe de moindre surprise".
it: Quando un tipo T implementa l'interfaccia IEquatable<T>, suggerisce a un utente che vede una chiamata al metodo Equals nel codice sorgente che è possibile uguagliare un'istanza del tipo con una di qualsiasi altro tipo. Questo potrebbe generare confusione se l'utente prova a uguagliare il tipo con un'istanza di un altro tipo, ma la compilazione non viene eseguita. Questo comportamento viola il "principio di minor sorpresa".
ja: 型 T がインターフェイスの IEquatable<T> を実装することは、ソース コード内の Equals メソッドへの呼び出しを見るユーザーにとって、型のインスタンスを他の任意の型のインスタンスと結びつけることができることを意味しています。ユーザーが型を他の型のインスタンスに結びつけようとしてコンパイルが失敗すると、ユーザーは混乱する可能性があります。これは、「驚き最小の原則」に違反しています。
ko: 형식 T가 인터페이스 IEquatable<T>를 구현하면 소스 코드에서 Equals 메서드에 대한 호출을 확인하는 사용자에게 이 형식의 인스턴스가 다른 형식의 인스턴스와 같을 수 있음을 알려줍니다. 사용자는 이 형식과 다른 형식의 인스턴스를 동일하게 만드는 시도가 컴파일에 실패하는 경우 혼란을 겪을 수 있습니다. 이 경우는 "최소 놀람의 원칙"을 위반합니다.
pl: Gdy typ T implementuje interfejs IEquatable<T>, sugeruje użytkownikowi, który widzi wywołanie metody Equals w kodzie źródłowym, że wystąpienie typu może zostać porównane z wystąpieniem dowolnego innego typu. Użytkownik może być zdezorientowany, gdy jego próba skompilowania porównania typu z wystąpieniem innego typu nie powiedzie się. Jest to niezgodne z „zasadą najmniejszego zaskoczenia”.
pt_br: Quando um tipo T implementa a interface IEquatable<T>, ele sugere ao usuário que vê uma chamada para o método Equals no código-fonte que uma instância do tipo pode ser igual a uma instância de qualquer outro tipo. O usuário pode se confundir ao identificar se a tentativa de igualar o tipo com uma instância de outro tipo não pode ser compilada. Isso viola o "princípio de surpresa mínima".
ru: Когда тип T реализует интерфейс IEquatable<T>, он предлагает пользователю, который видит вызов метода Equals в исходном коде, что экземпляр типа можно сравнить с экземпляром любого другого типа. Пользователь может быть озадачен, если его попытка сравнить этот тип с экземпляром другого типа не компилируется. Это нарушает "принцип наименьшего удивления".
tr: Bir T türü IEquatable<T> arabirimini uyguluyorsa, bu arabirim kaynak kodunda Equals metodu çağrısını gören kullanıcıya türün örneğinin başka herhangi bir türün örneğiyle eşitlenebileceği önerisinde bulunur. Kullanıcının, türü başka bir türün örneğiyle eşitleme girişimi derlenemediğinde kafası karışabilir. Bu durum, "en az beklenmedik durum ilkesini" ihlal eder.
zh_hans: 当类型 T 实现接口 IEquatable<T> 时，它向在源代码中看到对 Equals 方法进行调用的用户表明，该类型的实例可以等同于任何其他类型的实例。如果用户尝试将此类型与另一种类型的实例等同，但此尝试无法编译，则用户会感觉困惑。这违反了“意外最少原则”。
zh_hant: 當類型 T 實作介面 IEquatable<T> 時，會向在原始程式碼中看到 Equals 方法呼叫的使用者指出，此類型的執行個體可以視為等同於其他任一類型的執行個體。如果使用者嘗試將此類型視為等同於另一個類型的執行個體，卻無法編譯，可能會感到困惑。這違反「最少意外原則」。

# RenameToTitle
source: Rename to '{0}'
cs: Přejmenujte na {0}.
de: In "{0}" umbenennen
es: Cambiar el nombre a “{0}”
fr: Renommer en '{0}'
it: Rinominare in '{0}'
ja: 名前を '{0}' に変更する
ko: '{0}'(으)로 이름을 바꾸세요.
pl: Zmień nazwę na „{0}”
pt_br: Renomear para '{0}'
ru: Измените имя на "{0}"
tr: '{0}' olarak yeniden adlandırın
zh_hans: 重命名为“{0}”
zh_hant: 重新命名為 '{0}'
