Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# EnumsShouldHaveZeroValueMessageNotFlagsNoZeroValue
source: Add a member to {0} that has a value of zero with a suggested name of 'None'
cs: Přidejte do {0} člena, který má nulovou hodnotu, s navrženým názvem None.
de: Fügen Sie "{0}" einen Member mit einem Wert von null und dem vorgeschlagenen Namen "None" hinzu.
es: Agregue un miembro a {0} que tenga valor cero con el nombre sugerido "None".
fr: Ajoutez un membre à {0} ayant la valeur zéro et le nom suggéré 'None'
it: Aggiungere a {0} un membro con valore zero e assegnargli il nome suggerito 'None'
ko: 제안된 이름 'None'과 0 값이 있는 멤버를 {0}에 추가하세요.
pl: Dodaj składową o wartości zero do wyliczenia {0} z sugerowaną nazwą „None”
pt_br: Adicione um membro a {0} que tenha um valor zero com um nome sugerido 'None'
ru: Добавьте в {0} член с нулевым значением и предлагаемым именем "None".
tr: {0} öğesine, değeri sıfır ve önerilen adı 'None' olan bir üye ekleyin
zh_hans: 将一个值为零且建议名称为 "None" 的成员添加到 {0} 中
zh_hant: 將成員新增至值為零且建議名稱為 'None' 的 {0}

# AbstractTypesShouldNotHaveConstructorsTitle
source: Abstract types should not have public constructors
cs: Abstraktní typy by neměly mít veřejné konstruktory
de: Abstrakte Typen dürfen keine öffentlichen Konstruktoren enthalten
es: Los tipos abstractos no deben tener constructores públicos
fr: Les types abstract ne doivent pas avoir de constructeurs publics
it: I tipi astratti non devono avere costruttori pubblici
ko: 추상 형식에는 public 생성자를 사용하지 않아야 함
pl: Typy abstrakcyjne nie powinny mieć konstruktorów publicznych
pt_br: Os tipos abstratos não devem ter construtores públicos
ru: Абстрактные типы не должны иметь открытых конструкторов.
tr: Soyut türlerde genel oluşturucular olmamalıdır
zh_hans: 抽象类型不应具有公共构造函数
zh_hant: 抽象類型不應有公用建構函式

# AbstractTypesShouldNotHaveConstructorsDescription
source: Constructors on abstract types can be called only by derived types. Because public constructors create instances of a type, and you cannot create instances of an abstract type, an abstract type that has a public constructor is incorrectly designed.
cs: Konstruktory u abstraktních typů mohou být volány jen odvozenými typy. Protože veřejné konstruktory vytvářejí instance typu, přičemž nemůžete vytvářet instance abstraktního typu, je abstraktní typ, který má veřejný konstruktor, nesprávně navržený.
de: Konstruktoren für abstrakte Typen können nur von abgeleiteten Typen aufgerufen werden. Da öffentliche Konstruktoren Instanzen eines Typs erstellen und Sie keine Instanzen eines abstrakten Typs erstellen können, wird ein abstrakter Typ mit einem öffentlichen Konstruktor falsch entworfen.
es: Solo los tipos derivados pueden llamar a los constructores de tipos abstractos. Puesto que los constructores públicos crean instancias de un tipo y no se pueden crear instancias de un tipo abstracto, no es correcto diseñar un tipo abstracto con un constructor público.
fr: Les constructeurs des types abstract peuvent être appelés uniquement par des types dérivés. Comme les constructeurs publics créent les instances d'un type et que vous ne pouvez pas créer d'instances d'un type abstract, un type abstract doté d'un constructeur public ne correspond pas à un design correct.
it: I costruttori su tipi astratti possono essere chiamati solo da tipi derivati. Dal momento che i costruttori public creano istanze di un tipo e non è possibile creare istanze di un tipo astratto, per una progettazione corretta non si deve creare un tipo astratto con costruttore public.
ja: 抽象型のコンストラクターは、派生型からのみ呼び出すことができます。パブリック コンストラクターによって型のインスタンスが作成され、抽象型のインスタンスを自分で作成できないため、パブリック コンストラクターを含む抽象型は正しく設計されません。
ko: 파생 형식만 추상 형식의 생성자를 호출할 수 있습니다. 공용 생성자에서 형식의 인스턴스를 만들고 사용자는 추상 형식의 인스턴스를 만들 수 없으므로 공용 생성자가 있는 추상 형식은 잘못 디자인되었습니다.
pl: Konstruktory typów abstrakcyjnych mogą być wywoływane tylko przez typy pochodne. Konstruktory publiczne tworzą wystąpienia typu, ale nie można tworzyć wystąpień typu abstrakcyjnego, dlatego typ abstrakcyjny z konstruktorem publicznym jest niepoprawnie zaprojektowany.
pt_br: Construtores em tipos abstratos podem ser chamados apenas por tipos derivados. Já que os construtores públicos criam instâncias de um tipo e você não pode criar instâncias de um tipo abstrato, um tipo abstrato que tem um construtor público é criado incorretamente.
ru: Конструкторы для абстрактных типов могут вызываться только производными типами. Так как общие конструкторы создают экземпляры типа, и вы не можете создавать экземпляры абстрактного типа, абстрактный тип с общим конструктором спроектирован неправильно.
tr: Soyut türlerdeki oluşturucular yalnızca türetilmiş türler tarafından çağrılabilir. Genel oluşturucular bir türün örneklerini oluşturduğundan ve soyut bir tür oluşturamayacağınızdan, genel oluşturucusu olan bir soyut tür yanlış tasarlanmıştır.
zh_hans: 抽象类型的构造函数只能由派生类型调用。由于公共构造函数创建某一类型的实例，而你不能创建抽象类型的实例，因此具有公共构造函数的抽象类型的设计是错误的。
zh_hant: 只有衍生類型才可呼叫抽象類型上的建構函式。因為公用建構函式會建立類型的執行個體，而且您無法建立抽象類型的執行個體，所以具有公用建構函式的抽象類型設計不正確。

# AbstractTypesShouldNotHaveConstructorsMessage
source: Abstract type '{0}' should not have public constructors
cs: Abstraktní typ {0} by neměl mít veřejné konstruktory.
de: Der abstrakte Typ "{0}" darf keine öffentlichen Konstruktoren enthalten.
es: El tipo abstracto "{0}" no debe tener constructores públicos
fr: Le type abstract '{0}' ne doit pas avoir de constructeurs publics
it: Il tipo astratto '{0}' non deve avere costruttori pubblici
ko: 추상 형식 '{0}'에는 public 생성자를 사용하지 않아야 합니다.
pl: Typ abstrakcyjny „{0}” nie powinien mieć konstruktorów publicznych
pt_br: O tipo abstrato '{0}' não deve ter construtores públicos
ru: Абстрактный тип "{0}" не должен иметь открытых конструкторов.
tr: '{0}' soyut türünde genel oluşturucular olmamalıdır
zh_hans: 抽象类型 {0} 不应具有公共构造函数
zh_hant: 抽象類型 '{0}' 不應有公用建構函式

# MarkAssembliesWithClsCompliantTitle
source: Mark assemblies with CLSCompliant
cs: Označte sestavení atributem CLSCompliant.
de: Assemblys mit CLSCompliant markieren
es: Marcar los ensamblados con CLSCompliant
fr: Marquer les assemblys avec CLSCompliant
it: Contrassegnare gli assembly con CLSCompliant
ja: アセンブリに CLSCompliant を設定します
ko: CLSCompliant로 어셈블리를 표시하세요.
pl: Oznacz zestawy atrybutem CLSCompliant
pt_br: Marcar assemblies com CLSCompliant
ru: Пометить сборки как CLSCompliant
tr: Bütünleştirilmiş kodları CLSCompliant ile işaretleyin
zh_hans: 用 CLSCompliant 标记程序集
zh_hant: 將組件標記為 CLSCompliant

# MarkAssembliesWithClsCompliantDescription
source: The Common Language Specification (CLS) defines naming restrictions, data types, and rules to which assemblies must conform if they will be used across programming languages. Good design dictates that all assemblies explicitly indicate CLS compliance by using CLSCompliantAttribute . If this attribute is not present on an assembly, the assembly is not compliant.
cs: CLS (Common Language Specification) definuje omezení názvů, datových typů a pravidel, kterým musí sestavení vyhovovat, pokud se budou používat v různých programovacích jazycích. Správný návrh vyžaduje, aby všechna sestavení explicitně označovala vyhovění standardu CSL atributem CLSCompliant. Pokud tento atribut u sestavení neexistuje, není toto sestavení vyhovující.
de: Die Common Language Specification (CLS) definiert Namenseinschränkungen, Datentypen und Regeln, denen Assemblys entsprechen müssen, wenn sie programmiersprachenübergreifend eingesetzt werden sollen. Ein gutes Design gibt vor, dass alle Assemblys über das CLSCompliantAttribute explizit auf ihre CLS-Konformität hinweisen. Wenn dieses Attribut in einer Assembly nicht vorhanden ist, ist die Assembly nicht konform.
es: Common Language Specification (CLS) define las restricciones de nomenclatura, los tipos de datos y las reglas a las que los ensamblados deben ajustarse si se van a usar en los lenguajes de programación. Los procedimientos de diseño recomendados dictan que se use CLSCompliantAttribute para indicar explícitamente el cumplimiento de CLS. Si el atributo no está presente en un ensamblado, este no se considera conforme.
fr: La spécification CLS (Common Language Specification) définit des restrictions de nommage, des types de données, ainsi que des règles auxquelles les assemblys doivent se conformer pour pouvoir être utilisés avec les langages de programmation. Un design est correct quand tous les assemblys indiquent explicitement la conformité CLS avec CLSCompliantAttribute. Si cet attribut n'est pas présent sur un assembly, l'assembly n'est pas conforme.
it: Le specifiche CLS definiscono restrizioni per l'assegnazione dei nomi, tipi di dati e regole che gli assembly devono rispettare per poter essere usati nei diversi linguaggi di programmazione. In una progettazione corretta tutti gli assembly devono indicare in modo esplicito la conformità CLS con l'attributo CLSCompliantAttribute. Se questo attributo non è presente su un assembly, l'assembly non è conforme.
ja: 共通言語仕様 (CLS) では、名前付け制限、データ型、規則が定義されています。アセンブリは、複数のプログラミング言語で使用する場合、これらに準拠する必要があります。すべてのアセンブリに CLSCompliantAttribute を使用して CLS への準拠を明示することをお勧めします。この属性がアセンブリに存在しない場合、そのアセンブリは CLS に準拠しません。
ko: CLS(공용 언어 사양)는 명명 제한, 데이터 형식 및 어셈블리가 프로그래밍 언어에 사용될 경우 준수해야 할 규칙을 정의합니다. 설계 시 CLSCompliantAttribute를 사용하여 모든 어셈블리가 명시적으로 CLS를 준수함을 나타내는 것이 좋습니다. 이 특성이 어셈블리에 표시되지 않는 경우는 어셈블리가 비규격 상태입니다.
pl: Specyfikacja CLS (Common Language Specification) definiuje ograniczenia nazewnictwa, typy danych i reguły, z którymi muszą być zgodne zestawy, jeśli będą używane z różnymi językami programowania. Reguły poprawnego projektowania nakazują, aby wszystkie zestawy jawnie deklarowały zgodność ze specyfikacją CLS za pomocą atrybutu CLSCompliantAttribute. Jeśli zestaw nie ma tego atrybutu, nie jest zgodny.
pt_br: A CLS (Common Language Specification) define restrições de nomenclatura, tipos de dados e regras com as quais os assemblies deverão estar em conformidade se forem usados em linguagens de programação. O bom design dita que todos os assemblies indicam explicitamente a conformidade com a CLS usando CLSCompliantAttribute. Se este atributo não estiver presente em um assembly, o assembly não estará em conformidade.
ru: Спецификация CLS определяет ограничения именования, типы данных и правила, которым должны соответствовать сборки, если они будут использоваться в разных языках программирования. Принципы хорошего проектирования требуют, чтобы все сборки явно указывали соответствие спецификации CLS с помощью CLSCompliantAttribute. Сборки без этого атрибута считаются несоответствующими.
tr: Ortak Dil Belirtimi (CLS), farklı programlama dillerinde kullanılacaksa bütünleştirilmiş kodların uyması gereken adlandırma kısıtlamalarını, veri türlerini ve kuralları tanımlar. İyi bir tasarım için tüm bütünleştirilmiş kodlar CLSCompliantAttribute kullanarak CLS uyumluluğunu açıkça belirtmelidir. Bütünleştirilmiş kodda bu öznitelik yoksa bütünleştirilmiş kod uyumlu değildir.
zh_hans: 公共语言规范 (CLS) 定义命名限制、数据类型和跨编程语言使用程序集时程序集必须遵循的规则。好的设计要求所有程序集使用 CLSCompliantAttribute 显式指示 CLS 符合性。如果程序集上不存在此属性，则程序集不符合。
zh_hant: Common Language Specification (CLS) 會定義命名限制、資料類型及組件必須遵守的規則 (若組件會跨程式設計語言使用)。良好的設計會要求所有組件使用 CLSCompliantAttribute 明確地表示 CLS 合規性。若此屬性未出現於組件中，則表示組件不符合標準。

# MarkAssembliesWithClsCompliantMessage
source: Mark assemblies with CLSCompliant
cs: Označte sestavení atributem CLSCompliant.
de: Assemblys mit CLSCompliant markieren
es: Marcar los ensamblados con CLSCompliant
fr: Marquer les assemblys avec CLSCompliant
it: Contrassegnare gli assembly con CLSCompliant
ja: アセンブリに CLSCompliant を設定します
ko: CLSCompliant로 어셈블리를 표시하세요.
pl: Oznacz zestawy atrybutem CLSCompliant
pt_br: Marcar assemblies com CLSCompliant
ru: Пометить сборки как CLSCompliant
tr: Bütünleştirilmiş kodları CLSCompliant ile işaretleyin
zh_hans: 用 CLSCompliant 标记程序集
zh_hant: 將組件標記為 CLSCompliant

# MarkAssembliesWithAssemblyVersionTitle
source: Mark assemblies with assembly version
cs: Označte sestavení číslem verze.
de: Assemblys mit Assemblyversion markieren
es: Marcar los ensamblados con la versión de ensamblado
fr: Marquer les assemblys avec une version d'assembly
it: Contrassegnare gli assembly con la versione dell'assembly
ja: アセンブリにアセンブリ バージョンを設定します
ko: 어셈블리 버전으로 어셈블리를 표시하세요.
pl: Oznacz zestawy za pomocą wersji zestawu
pt_br: Marcar assemblies com a versão do assembly
ru: Пометить сборки версией сборки
tr: Bütünleştirilmiş kodları bütünleştirilmiş kod sürümüyle işaretleyin
zh_hans: 用程序集版本标记程序集
zh_hant: 將組件標記為版本組件

# MarkAssembliesWithAssemblyVersionDescription
source: The .NET Framework uses the version number to uniquely identify an assembly, and to bind to types in strongly named assemblies. The version number is used together with version and publisher policy. By default, applications run only with the assembly version with which they were built.
cs: Rozhraní .NET Framework používá číslo verze k jednoznačné identifikaci sestavení a k vytvoření vazby s typy v sestaveních se silným názvem. Číslo verze se používá společně se zásadami verze a vydavatele. Aplikace standardně běží jen s verzí sestavení, se kterou byly sestaveny.
de: Das .NET Framework verwendet die Versionsnummer zur eindeutigen Identifikation einer Assembly und zum Binden an Typen in Assemblys mit starker Namensgebung. Die Versionsnummer wird zusammen mit der Versions- und Herausgeberrichtlinie verwendet. Standardmäßig werden Anwendungen nur mit der Assemblyversion ausgeführt, mit der sie erstellt wurden.
es: .NET Framework usa el número de versión para identificar de forma única un ensamblado y para enlazarse a los tipos de ensamblados con nombre seguro. El número de versión se usa junto con la versión y la directiva del publicador. De forma predeterminada, las aplicaciones solo se ejecutan con la versión de ensamblado con la que se compilaron.
fr: Le .NET Framework utilise le numéro de version pour identifier un assembly de manière unique, ainsi que pour créer une liaison avec des types dans les assemblys portant un nom fort. Le numéro de version est utilisé conjointement avec la version et la stratégie d'éditeur. Par défaut, les applications s'exécutent uniquement avec la version d'assembly avec laquelle elles ont été générées.
it: .NET Framework usa il numero di versione per identificare in modo univoco un assembly e per stabilire associazioni a tipi in assembly con nome sicuro. Il numero di versione viene usato insieme ai criteri di versione ed editore. Per impostazione predefinita, le applicazioni vengono eseguite solo con la versione di assembly con cui sono state compilate.
ja: .NET Framework では、バージョン番号を使用してアセンブリを一意に識別し、厳密な名前が指定されたアセンブリの型にバインドします。バージョン番号は、バージョンと発行者ポリシーと共に使用されます。既定で、アプリケーションは、ビルドに使用されたアセンブリ バージョンでのみ実行されます。
ko: .NET Framework에서는 어셈블리를 고유하게 식별하고 강력한 이름의 어셈블리에서 형식에 바인딩하기 위해 버전 번호를 사용합니다. 버전 번호는 버전 및 게시자 정책과 함께 사용됩니다. 기본적으로 애플리케이션은 빌드 시 사용된 어셈블리 버전에서만 실행됩니다.
pl: Program .NET Framework używa numeru wersji do unikatowego identyfikowania zestawu i tworzenia powiązań z typami w zestawach o silnej nazwie. Numer wersji jest używany w połączeniu z zasadami wersji i wydawcy. Domyślnie aplikacje działają tylko z wersją zestawu, dla której zostały skompilowane.
pt_br: O .NET Framework usa o número de versão para identificar exclusivamente um assembly e para associá-lo a tipos em assemblies com nomes fortes. O número de versão é usado juntamente com a política de versão e do editor. Por padrão, os aplicativos são executados apenas com a versão do assembly com a qual eles foram criados.
ru: Платформа .NET Framework использует номер версии для однозначной идентификации сборки, а также для привязки к типам в сборках со строгим именем. Этот номер версии используется вместе с версией и политикой издателя. По умолчанию приложения выполняются только с версией сборки, использованной при их сборке.
tr: .NET Framework, bir bütünleştirilmiş kodu benzersiz olarak tanımlamak ve adı kesin olarak belirlenmiş türlere bağlamak için sürüm numarasını kullanır. Sürüm numarası, sürüm ve yayımcı ilkesiyle birlikte kullanılır. Varsayılan olarak, uygulamalar yalnızca kendilerini oluşturmak için kullanılan bütünleştirilmiş kod sürümüyle çalışır.
zh_hans: .NET Framework 使用版本号来唯一标识程序集，并绑定到强命名程序集中的类型。版本号与版本和发布服务器策略一起使用。默认情况下，应用程序只与生成它们的程序集版本一起运行。
zh_hant: .NET Framework 使用版本號碼來唯一識別組件，且會繫結至強式具名組件中的類型。版本號碼會與版本以及發行者原則一起使用。根據預設，應用程式只可與原先建置它們的組件版本一起執行。

# MarkAssembliesWithAssemblyVersionMessage
source: Mark assemblies with assembly version
cs: Označte sestavení číslem verze.
de: Assemblys mit Assemblyversion markieren
es: Marcar los ensamblados con la versión de ensamblado
fr: Marquer les assemblys avec une version d'assembly
it: Contrassegnare gli assembly con la versione dell'assembly
ja: アセンブリにアセンブリ バージョンを設定します
ko: 어셈블리 버전으로 어셈블리를 표시하세요.
pl: Oznacz zestawy za pomocą wersji zestawu
pt_br: Marcar assemblies com a versão do assembly
ru: Пометить сборки версией сборки
tr: Bütünleştirilmiş kodları bütünleştirilmiş kod sürümüyle işaretleyin
zh_hans: 用程序集版本标记程序集
zh_hant: 將組件標記為版本組件

# MarkAssembliesWithComVisibleTitle
source: Mark assemblies with ComVisible
cs: Označte sestavení atributem ComVisible.
de: Assemblys mit ComVisible markieren
es: Marcar los ensamblados con ComVisible
fr: Marquer les assemblys avec ComVisible
it: Contrassegnare gli assembly con ComVisible
ja: アセンブリに ComVisible を設定します
ko: ComVisible로 어셈블리를 표시하세요.
pl: Oznacz zestawy atrybutem ComVisible
pt_br: Marcar assemblies com ComVisible
ru: Пометить сборки как ComVisible
tr: Bütünleştirilmiş kodları ComVisible ile işaretleyin
zh_hans: 用 ComVisible 标记程序集
zh_hant: 將組件標記為 ComVisible

# MarkAssembliesWithComVisibleDescription
source: ComVisibleAttribute determines how COM clients access managed code. Good design dictates that assemblies explicitly indicate COM visibility. COM visibility can be set for the whole assembly and then overridden for individual types and type members. If this attribute is not present, the contents of the assembly are visible to COM clients.
cs: Atribut ComVisible určuje, jak klienti modelu COM přistupují ke spravovanému kódu. Správný návrh vyžaduje, aby sestavení explicitně označovala viditelnost modelu COM. Viditelnost modelu COM lze nastavit pro celé sestavení a následně přepsat pro jednotlivé typy a členy typů. Pokud tento atribut neexistuje, je obsah sestavení viditelný klientům modelu COM.
de: Über ComVisibleAttribute wird festgelegt, wie COM-Clients auf verwalteten Code zugreifen. Ein gutes Design gibt vor, dass Assemblys explizit auf COM-Sichtbarkeit hinweisen. COM-Sichtbarkeit kann für die ganze Assembly festgelegt und dann für einzelne Typen und Typenmember außer Kraft gesetzt werden. Wenn dieses Attribut nicht vorhanden ist, ist der Inhalt der Assembly für COM-Clients sichtbar.
es: El atributo ComVisibleAttribute determina cómo acceden los clientes COM al código administrado. Los procedimientos de diseño recomendados dictan que los ensamblados indiquen explícitamente la visibilidad COM. La visibilidad COM se puede establecer para un ensamblado completo y, después, invalidarse para miembros de tipo y tipos individuales. Si este atributo no está presente, el contenido del ensamblado es visible para los clientes COM.
fr: ComVisibleAttribute détermine la façon dont les clients COM accèdent à du code managé. Un design est correct quand les assemblys indiquent explicitement la visibilité COM. La visibilité COM peut être définie pour l'assembly tout entier, puis être remplacée pour des types et des membres de type individuels. Si cet attribut n'est pas présent, les clients COM peuvent voir le contenu de l'assembly.
it: ComVisibleAttribute determina il modo in cui i client COM accedono al codice gestito. In una buona progettazione gli assembly devono indicare in modo esplicito la visibilità COM. È possibile impostare la visibilità COM per l'intero assembly e quindi eseguirne l'override per singoli tipi e membri dei tipi. Se questo attributo non è presente, il contenuto dell'assembly è visibile ai client COM.
ja: ComVisibleAttribute によって、COM クライアントからマネージ コードにアクセスする方法を決定します。この場合、アセンブリが COM の参照可能性を明示的に示すことが推奨されます。COM の参照可能性は、アセンブリ全体で設定した後、個々の型と型メンバーに対してオーバーライドできます。この属性が存在しない場合、アセンブリのコンテンツは COM クライアントから参照できます。
ko: ComVisibleAttribute는 COM 클라이언트가 관리 코드에 액세스하는 방법을 결정합니다. 어셈블리가 명시적으로 COM 표시 유형 지정하는 것이 좋습니다. COM 표시 유형은 전체 어셈블리에 대해 설정된 다음 개별 형식과 형식 멤버에 대해 재정의될 수 있습니다. 이 특성이 표시되지 않는 경우 어셈블리 콘텐츠는 COM 클라이언트에 표시되지 않습니다.
pl: Atrybut ComVisibleAttribute określa, w jaki sposób klienci modelu COM uzyskują dostęp do kodu zarządzanego. Zasady poprawnego projektowania nakazują, aby zestawy jawnie deklarowały widoczność modelu COM. Widoczność modelu COM można ustawić dla całego zestawu, a następnie przesłonić dla poszczególnych typów i elementów członkowskich typów. Jeśli nie ma tego atrybutu, zawartość zestawu jest widoczna dla klientów modelu COM.
pt_br: ComVisibleAttribute determina como os clientes COM acessam o código gerenciado. O bom design dita que os assemblies indicam explicitamente a visibilidade COM. A visibilidade COM pode ser definida para todo o assembly e, em seguida, substituída para tipos individuais e membros de tipo. Se o atributo não estiver presente, o conteúdo do assembly estará visível para clientes COM.
ru: ComVisibleAttribute определяет, как COM-клиенты обращаются к управляемому коду. Принципы хорошего проектирования требуют, чтобы сборки явно указывали COM-видимость. COM-видимость можно задать для всей сборки и затем переопределить для отдельных типов и их членов. Если этот атрибут отсутствует, COM-клиенты видят содержимое сборки.
tr: ComVisibleAttribute, COM istemcilerinin yönetilen koda nasıl erişeceğini belirler. İyi bir tasarım için bütünleştirilmiş kodlar COM görünürlüğünü açıkça belirtmelidir. COM görünürlüğü bütünleştirilmiş kodun tamamı için ayarlanabilir ve sonra tek tek türler ve tür üyeleri için geçersiz kılınabilir. Bu öznitelik yoksa, bütünleştirilmiş kodun içeriğini COM istemcileri görebilir.
zh_hans: ComVisibleAttribute 确定 COM 客户端访问托管代码的方法。好的设计要求程序集显式指示 COM 可见性。可为整个程序集设置 COM 可见性，然后为单个类型和类型成员重写。如果此属性不存在，则程序集的内容对 COM 客户端可见。
zh_hant: ComVisibleAttribute 會判斷 COM 用戶端如何存取受控程式碼。良好的設計會要求組件明確表示 COM 的可見度。可以為整個組件設定COM 的可見度，然後再對個別的類型與類型成員進行覆寫。若此屬性不存在，則 COM 用戶端可以看到組件的內容。

# MarkAttributesWithAttributeUsageTitle
source: Mark attributes with AttributeUsageAttribute
cs: Označte atributy atributem AttributeUsage.
de: Attribute mit AttributeUsageAttribute markieren
es: Marcar atributos con AttributeUsageAttribute
fr: Marquer les attributs avec AttributeUsageAttribute
it: Contrassegnare gli attributi con AttributeUsageAttribute
ja: 属性を AttributeUsageAttribute に設定します
ko: AttributeUsageAttribute로 특성을 표시하세요.
pl: Oznacz atrybuty za pomocą atrybutu AttributeUsageAttribute
pt_br: Marcar atributos com AttributeUsageAttribute
ru: Пометить атрибуты как AttributeUsageAttribute
tr: Öznitelikleri AttributeUsageAttribute ile işaretleyin
zh_hans: 用 AttributeUsageAttribute 标记属性
zh_hant: 將屬性標記為 AttributeUsageAttribute

# MarkAttributesWithAttributeUsageMessageDefault
source: Specify AttributeUsage on {0}
cs: Určete AttributeUsage pro {0}.
de: Geben Sie "AttributeUsage" für "{0}" an.
es: Especifique AttributeUsage en {0}.
fr: Spécifiez AttributeUsage sur {0}
it: Specificare AttributeUsage su {0}
ko: {0}에서 AttributeUsage를 지정하세요.
pl: Określ atrybut AttributeUsage dla elementu {0}
pt_br: Especifique AttributeUsage em {0}
ru: Укажите AttributeUsage в {0}.
tr: {0} üzerinde AttributeUsage belirtin
zh_hans: 在 {0} 上指定 AttributeUsage
zh_hant: 在 {0} 上指定 AttributeUsage
