Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UsePreferredTermsMessageTypeTypeParameter
source: On type {0}, replace the term '{1}' in generic type parameter name {2} with the preferred alternate '{3}'.
ja: 型 {0} で、ジェネリック型パラメーター名 {2} の用語 '{1}' を適切な用語 '{3}' に置き換えます。

# UsePreferredTermsMessageMethodTypeParameter
source: On method {0}, replace the term '{1}' in generic type parameter name {2} with the preferred alternate '{3}'.
ja: メソッド {0} で、ジェネリック型パラメーター名 {2} の用語 '{1}' を適切な用語 '{3}' に置き換えます。

# UsePreferredTermsMessageType
source: Replace the term '{0}' in type name {1} with the preferred alternate '{2}'.
ja: 型名 {1} の用語 '{0}' を適切な用語 '{2}' に置き換えます。

# UsePreferredTermsMessageMember
source: Replace the term '{0}' in member name {1} with the preferred alternate '{2}'.
ja: メンバー名 {1} の用語 '{0}' を適切な用語 '{2}' に置き換えます。

# UsePreferredTermsMessageAssemblyNoAlternate
source: Replace the term '{0}' in assembly name {1} with an appropriate alternate or remove it entirely.
ja: アセンブリ名 {1} の用語 '{0}' を適切な用語に置き換えるか、削除します。

# UsePreferredTermsMessageNamespaceNoAlternate
source: Replace the term '{0}' in namespace name '{1}' with an appropriate alternate or remove it entirely.
ja: 名前空間の名前 '{1}' の用語 '{0}' を適切な用語に置き換えるか、削除します。

# UsePreferredTermsMessageMemberParameterNoAlternate
source: In member {0}, replace the term '{1}' in parameter name {2} with an appropriate alternate or remove it entirely.
ja: メンバー {0} で、パラメーター名 {2} の用語 '{1}' を適切な用語に置き換えるか、削除します。

# UsePreferredTermsMessageDelegateParameterNoAlternate
source: In delegate {0}, replace the term '{1}' in parameter name {2} with an appropriate alternate or remove it entirely.
ja: デリゲート {0} で、パラメーター名 {2} の用語 '{1}' を適切な用語に置き換えるか、削除します。

# UsePreferredTermsMessageTypeTypeParameterNoAlternate
source: On type {0}, replace the term '{1}' in generic type parameter name {2} with an appropriate alternate or remove it entirely.
ja: 型 {0} で、ジェネリック型パラメーター名 {2} の用語 '{1}' を適切な用語に置き換えるか、削除します。

# UsePreferredTermsMessageMethodTypeParameterNoAlternate
source: On method {0}, replace the term '{1}' in generic type parameter name {2} with an appropriate alternate or remove it entirely.
ja: メソッド {0} で、パラメーター名 {2} の用語 '{1}' を適切な用語に置き換えるか、削除します。

# UsePreferredTermsMessageTypeNoAlternate
source: Replace the term '{0}' in type name {1} with an appropriate alternate or remove it entirely.
ja: 型名 {1} の用語 '{0}' を適切な用語に置き換えるか、削除します。

# UsePreferredTermsMessageMemberNoAlternate
source: Replace the term '{0}' in member name {1} with an appropriate alternate or remove it entirely.
ja: メンバー名 {1} の用語 '{0}' を適切な用語に置き換えるか、削除します。

# OverrideEqualsAndOperatorEqualsOnValueTypesMessageEquals
source: {0} should override Equals.
ja: {0} は Equals をオーバーライドしなければなりません。

# OverrideEqualsAndOperatorEqualsOnValueTypesMessageOpEquality
source: {0} should override the equality (==) and inequality (!=) operators.
ja: {0} は、等値演算子 (==) および非等値演算子 (!=) をオーバーライドしなければなりません。

# AssembliesShouldHaveValidStrongNamesTitle
source: Assemblies should have valid strong names
ja: アセンブリには有効な厳密な名前が必要です

# AssembliesShouldHaveValidStrongNamesDescription
source: The strong name protects clients from unknowingly loading an assembly that has been tampered with. Assemblies without strong names should not be deployed outside very limited scenarios. If you share or distribute assemblies that are not correctly signed, the assembly can be tampered with, the common language runtime might not load the assembly, or the user might have to disable verification on his or her computer.
ja: 厳密な名前によって、改ざんされたアセンブリをクライアントが知らないうちに読み込むことを防ぐことができます。厳密な名前のないアセンブリが配置される状況は限定されます。適切に署名されていないアセンブリを共有または配布すると、アセンブリが改ざんされたり、共通言語ランタイムでアセンブリが読み込まれなくなったりする可能性があるほか、ユーザーは自身のコンピューターで検証を無効にすることが必要になる場合があります。

# AssembliesShouldHaveValidStrongNamesMessageNoStrongName
source: Sign {0} with a strong name key.
ja: {0} を厳密な名前キーで署名します。

# AssembliesShouldHaveValidStrongNamesMessageNotValid
source: Verify that {0} has a valid strong name before deploying.
ja: 配置する前に、{0} に有効な厳密な名前が指定されていることを確認してください。

# DoNotHideBaseClassMethodsMessage
source: Change or remove '{0}' because it hides a more specific base class method: '{1}'.
ja: より特定の基底クラス メソッドを隠しているため、'{0}' を変更または削除してください: '{1}'。

# UseGenericEventHandlerInstancesForDelegateMessage
source: Remove '{0}' and replace its usage with a generic EventHandler, for e.g. EventHandler<T>, where T is a valid EventArgs
ja: '{0}' を削除して、それを EventHandler<T> (T は有効な EventArgs) などのジェネリックの EventHandler と置き換えます

# UseGenericEventHandlerInstancesForEventMessage
source: Change the event '{0}' to replace the type '{1}' with a generic EventHandler, for e.g. EventHandler<T>, where T is a valid EventArgs
ja: イベント '{0}' を変更して、型 '{1}' を EventHandler<T> (T は有効な EventArgs) などのジェネリックの EventHandler と置き換えます。

# OverrideMethodsOnComparableTypesMessageBoth
source: {0} should define operator(s) '{1}' and Equals since it implements IComparable.
ja: {0} は、IComparable を実装しているため、演算子 '{1}' と Equals を定義しなければなりません。

# AvoidCallingProblematicMethodsTitle
source: Avoid calling problematic methods
ja: 問題が発生する可能性のあるメソッドは呼び出しません

# AvoidCallingProblematicMethodsDescription
source: A member calls a potentially dangerous or problematic method.
ja: メンバーが危険性または問題のあるメソッドを呼び出します。

# AvoidCallingProblematicMethodsMessageSystemGCCollect
source: Remove the call to GC.Collect from {0}. It is usually unnecessary to force garbage collection, and doing so can severely degrade performance.
ja: GC.Collect への呼び出しを {0} から削除します。通常、ガベージ コレクションを強制する必要はありません。ガベージ コレクションを行うと、パフォーマンスが大幅に低下する可能性があります。

# AvoidCallingProblematicMethodsMessageSystemThreadingThreadResume
source: Remove the call to Thread.Resume from {0}. Suspending and resuming threads can be dangerous if the system is in the middle of a critical operation such as executing a class constructor of an important system type or resolving security for a shared assembly.
ja: Thread.Resume への呼び出しを {0} から削除します。重要なシステム型のクラス コンストラクターを実行中である、または共有アセンブリのセキュリティを解決中であるなどの重大な操作をシステムが実行している場合、スレッドの中断および再開には危険性が伴います。

# AvoidCallingProblematicMethodsMessageSystemThreadingThreadSuspend
source: Remove the call to Thread.Suspend from {0}. Suspending and resuming threads can be dangerous if the system is in the middle of a critical operation such as executing a class constructor of an important system type or resolving security for a shared assembly.
ja: Thread.Suspend への呼び出しを {0} から削除します。重要なシステム型のクラス コンストラクターを実行中である、または共有アセンブリのセキュリティを解決中であるなどの重大な操作をシステムが実行している場合、スレッドの中断および再開には危険性が伴います。

# AvoidCallingProblematicMethodsMessageSystemTypeInvokeMember
source: Remove the call to System.Type.InvokeMember with BindingFlags.NonPublic from {0}. Taking a dependency on a private member increases the chance of a breaking change in the future.
ja: BindingFlags.NonPublic を伴う System.Type.InvokeMember への呼び出しを {0} から削除します。プライベート メンバーの依存関係を取得すると、今後のコードに対する重大な変更が発生する可能性を高めます。

# AvoidCallingProblematicMethodsMessageCoInitializeSecurity
source: {0} is a P/Invoke declaration to an OLE32 API that cannot be reliably called after the runtime has been initialized. The workaround is to write an unmanaged shim that will call the routine and then activate and call into managed code. You can do this using an export from a mixed-mode C++ DLL, by registering a managed component for use by COM, or by using the runtime hosting API.
ja: {0} は、ランタイムが初期化された後に正しく呼び出すことができない OLE32 API への P/Invoke 宣言です。次善策としては、そのルーチンを呼び出してからマネージ コードをアクティブ化し、そのマネージ コードに呼び出しを行うアンマネージ shim を書き込むことです。COM によって使用するためにマネージ コンポーネントを登録することによって、またはランタイムをホストする API を使用することによって、混合モードの C++ DLL からのエクスポートを使用してこの動作を行うことができます。

# AvoidCallingProblematicMethodsMessageCoSetProxyBlanket
source: {0} is a P/Invoke declaration to an OLE32 API that cannot be reliably called against a runtime callable wrapper (a managed object wrapping a COM object). Runtime callable wrappers dynamically fetch interface pointers so the effect of the call might be arbitrarily lost. Runtime callable wrappers for a given COM object are also shared across an application domain so the call could possibly affect other users. Replace this call with a native wrapper COM object for the interface pointer that does the appropriate CoSetProxyBlanket calls.
ja: {0} は、ランタイム呼び出しラッパー (COM オブジェクトをラップするマネージ オブジェクト) に対して正しく呼び出すことができない OLE32 API への P/Invoke 宣言です。ランタイム呼び出しラッパーはインターフェイス ポインターを動的に取得するため、呼び出しの結果は任意に失われます。特定の COM オブジェクトの呼び出しラッパーがアプリケーション ドメインで共有されることもあるため、呼び出しが他のユーザーに影響する可能性もあります。この呼び出しを、適切な CoSetProxyBlanket 呼び出しを行う、インターフェイス ポインターのネイティブ ラッパー COM オブジェクトで置き換えてください。

source: Remove the call to SafeHandle.DangerousGetHandle from {0}.
ja: SafeHandle.DangerousGetHandle への呼び出しを {0} から削除します。

# AvoidCallingProblematicMethodsMessageSystemReflectionAssemblyLoadFrom
source: Remove the call to Assembly.LoadFrom from {0}.
ja: Assembly.LoadFrom への呼び出しを {0} から削除します。

# AvoidCallingProblematicMethodsMessageSystemReflectionAssemblyLoadFile
source: Remove the call to Assembly.LoadFile from {0}.
ja: Assembly.LoadFile への呼び出しを {0} から削除します。

# AvoidCallingProblematicMethodsMessageSystemReflectionAssemblyLoadWithPartialName
source: Remove the call to Assembly.LoadWithPartialName from {0}.
ja: Assembly.LoadWithPartialName への呼び出しを {0} から削除します。

# CategoryReliability
source: Reliability
ja: 信頼性

# AvoidExcessiveInheritanceMessage
source: '{0}' has an object hierarchy '{1}' levels deep within the defining module. If possible, eliminate base classes within the hierarchy to decrease its hierarchy level below '{2}': '{3}'
ja: '{0}' の定義モジュールには深さが '{1}' のオブジェクト階層レベルが含まれています。可能な場合には、階層レベルを '{2}' 未満になるよう階層内の基本クラスを減らしてください: '{3}'

# InvalidEntryInCodeMetricsConfigFileDescription
source: Invalid entry in code metrics rule specification file
ja: コード メトリック ルール仕様ファイル内のエントリが無効です

# VariableNamesShouldNotMatchFieldNamesTitle
source: Variable names should not match field names
ja: 変数名はフィールド名と同一にすることはできません

# VariableNamesShouldNotMatchFieldNamesDescription
source: An instance method declares a parameter or a local variable whose name matches an instance field of the declaring type, leading to errors.
ja: インスタンス メソッドで、宣言する型のインスタンス フィールドと名前が一致するパラメーターまたはローカル変数を宣言すると、エラーの原因となります。

# VariableNamesShouldNotMatchFieldNamesMessageLocal
source: {0}, a variable declared in {1}, has the same name as an instance field on the type. Change the name of one of these items.
ja: {1} で宣言された変数 {0} には、型のインスタンス フィールドと同じ名前が指定されています。これらの項目のうちの 1 つの名前を変更してください。

# VariableNamesShouldNotMatchFieldNamesMessageParameter
source: {0}, a parameter declared in {1}, has the same name as an instance field on the type. Change the name of one of these items.
ja: {1} で宣言されたパラメーター {0} には、型のインスタンス フィールドと同じ名前が指定されています。これらの項目のうちの 1 つの名前を変更してください。

# ReviewUnusedParametersTitle
source: Review unused parameters
ja: 使用されていないパラメーターの確認

# ReviewUnusedParametersDescription
source: Avoid unused paramereters in your code. If the parameter cannot be removed, then change its name so it starts with an underscore and is optionally followed by an integer, such as '_', '_1', '_2', etc. These are treated as special discard symbol names.
ja: コード内に使用されないパラメーターを指定しないでください。パラメーターを削除できない場合は、パラメーターの名前をアンダースコアの後にオプションで整数が続く名前 ('_'、'_1'、'_2' など) に変更してください。これらは、特別なディスカード シンボル名として扱われます。

# ReviewUnusedParametersMessage
source: Parameter {0} of method {1} is never used. Remove the parameter or use it in the method body.
ja: {1} のパラメーター {0} は使用されていません。パラメーターを削除するか、メソッド本体で使用してください。

# RemoveUnusedParameterMessage
source: Remove unused parameter
ja: 使用されていないパラメーターの削除

# AvoidUninstantiatedInternalClassesMessage
source: {0} is an internal class that is apparently never instantiated. If so, remove the code from the assembly. If this class is intended to contain only static members, make it static (Shared in Visual Basic).
ja: {0} は、インスタンス化されていない内部クラスです。その場合、コードをアセンブリから削除してください。このクラスが静的メンバーのみを含むことを意図している場合は、このクラスを static (Visual Basic の場合は Shared) にしてください。

# AvoidUnusedPrivateFieldsMessage
source: Unused field '{0}'.
ja: 未使用のフィールド '{0}'。

# AvoidPropertySelfAssignmentMessage
source: The property {0} should not be assigned to itself.
ja: プロパティ {0} をそれ自体に割り当てることはできません。

# AvoidPropertySelfAssignmentTitle
source: Do not assign a property to itself.
ja: プロパティをそれ自体に割り当てないでください。

# UseLiteralsWhereAppropriateDescription
source: A field is declared static and read-only (Shared and ReadOnly in Visual Basic), and is initialized by using a value that is computable at compile time. Because the value that is assigned to the targeted field is computable at compile time, change the declaration to a const (Const in Visual Basic) field so that the value is computed at compile time instead of at run?time.
ja: フィールドが static および read-only (Visual Basic では Shared および ReadOnly) として宣言され、コンパイル時に計算できる値によって初期化されています。対象フィールドに代入された値はコンパイル時に計算できるため、宣言を const (Visual Basic では Const) フィールドに変更して、値が実行時ではなくコンパイル時にコンピューティングされるようにします。

# DoNotInitializeUnnecessarilyDescription
source: The common language runtime initializes all fields to their default values before running the constructor. In most cases, initializing a field to its default value in a constructor is redundant, which degrades performance and adds to maintenance costs. One case where it is not redundant occurs when the constructor calls another constructor of the same class or a base class constructor and that constructor initializes the field to a non-default value. In this case, changing the value of the field back to its default value can be appropriate.
ja: 共通言語ランタイムは、コンストラクターを実行する前にすべてのフィールドを既定値に初期化します。ほとんどの場合、コンストラクターでフィールドを既定値に初期化する処理は冗長です。これにより、パフォーマンスが低下し、保守コストが増加します。冗長でない 1 つの例として、コンストラクターが、同じクラスの別コンストラクターまたは基底クラスのコンストラクターを呼び出し、そのコンストラクターがフィールドを既定以外の値に初期化する場合があります。この場合、フィールドの値を変更して既定値に戻すのが適切なこともあります。

# DoNotInitializeUnnecessarilyMessage
source: Do not initialize unnecessarily
ja: 不必要に初期化しません

# ReviewVisibleEventHandlersTitle
source: Review visible event handlers
ja: 表示するイベント ハンドラーを確認します

# ReviewVisibleEventHandlersDescription
source: A public or protected event-handling method was detected. Event-handling methods should not be exposed unless absolutely necessary.
ja: パブリックまたは保護されたイベント処理メソッドが検出されました。イベント処理メソッドは、どうしても必要な場合を除いて公開しないでください。

# ReviewVisibleEventHandlersMessageSecurity
source: Consider making {0} not externally visible or ensure that it is benign code.
ja: {0} の外部からの参照を不可能に設定することを検討するか、害のないコードであることを確認してください。

# ReviewVisibleEventHandlersMessageDefault
source: Consider making {0} not externally visible.
ja: {0} の外部からの参照を不可能に設定することを検討してください。

# RethrowToPreserveStackDetailsMessage
source: Re-throwing caught exception changes stack information.
ja: キャッチされた例外が再スローされると、スタック情報が変更されます。

# RethrowToPreserveStackDetailsTitle
source: Rethrow to preserve stack details.
ja: スタック詳細を保持するために再スローします。

# DoNotRaiseExceptionsInExceptionClausesMessageFinally
source: Do not raise an exception from within a finally clause.
ja: finally 句内から例外を発生させないでください。

# AvoidDuplicateElementInitializationMessage
source: The element at index [{0}] has already been initialized. Previous initializations of this element may be overwritten.
ja: インデックス [{0}] の要素は既に初期化されています。先に行われたこの要素の初期化が上書きされる可能性があります。

# ValidateArgumentsOfPublicMethodsDescription
source: An externally visible method dereferences one of its reference arguments without verifying whether that argument is null (Nothing in Visual Basic). All reference arguments that are passed to externally visible methods should be checked against null. If appropriate, throw an ArgumentNullException when the argument is null or add a Code Contract precondition asserting non-null argument. If the method is designed to be called only by known assemblies, you should make the method internal.
ja: 外部から参照できるメソッドが、引数が null (Visual Basic では Nothing) であるかどうかを確認せずに参照引数の 1 つを逆参照しています。外部から参照できるメソッドに渡されるすべての参照引数は、null でないかどうかを確認する必要があります。適切であれば、引数が null の場合は ArgumentNullException をスローするか、非 null の引数をアサートするコード コントラクトの必須条件を追加します。メソッドが既知のアセンブリからのみ呼び出されるように設計されている場合、メソッドを internal にします。

# ValidateArgumentsOfPublicMethodsMessage
source: In externally visible method '{0}', validate parameter '{1}' is non-null before using it. If appropriate, throw an ArgumentNullException when the argument is null or add a Code Contract precondition asserting non-null argument.
ja: 外部から参照できるメソッド '{0}' において、検証パラメーター '{1}' は使用前は非 null です。適切であれば、引数が null の場合に ArgumentNullException をスローするか、非 null の引数をアサートするコード コントラクトの必須条件を追加します。
