Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PropertiesShouldNotBeWriteOnlyDescription
source: Although it is acceptable and often necessary to have a read-only property, the design guidelines prohibit the use of write-only properties. This is because letting a user set a value, and then preventing the user from viewing that value, does not provide any security. Also, without read access, the state of shared objects cannot be viewed, which limits their usefulness.
cs: Přestože je přijatelné a občas nezbytné mít vlastnost jen pro čtení, zakazují pravidla návrhu používání vlastností jen pro zápis. Když totiž uživateli umožníte nastavit hodnotu, ale zabráníte mu v jejím zobrazení, nezajistíte tím žádné zabezpečení. Bez přístupu ke čtení navíc nelze stav sdílených objektů zobrazit, což omezuje jejich užitečnost.
de: Auch wenn schreibgeschützte Eigenschaften zulässig und häufig erforderlich sind, ist die Verwendung lesegeschützter Eigenschaften in den Designrichtlinien nicht gestattet. Der Grund dafür liegt darin, dass keine Sicherheit gewährleistet ist, wenn der Benutzer einen Wert festlegen darf und dann daran gehindert wird, den Wert anzuzeigen. Zudem kann der Status freigegebener Objekte ohne Lesezugriff nicht angezeigt werden, wodurch ihr Nutzen begrenzt wird.
es: Aunque es aceptable, y a menudo necesario, tener una propiedad de solo lectura, las directrices de diseño prohíben el uso de propiedades de solo escritura. Esto se debe a que permitir que un usuario establezca un valor y, después, impedir que lo vea no ofrece seguridad alguna. Además, sin acceso de lectura, no se puede ver el estado de los objetos compartidos, lo que limita su utilidad.
fr: Bien qu'il soit acceptable et souvent nécessaire d'avoir une propriété en lecture seule, les recommandations de design interdisent l'utilisation de propriétés en écriture seule. Le fait de permettre à un utilisateur de définir une valeur et de l'empêcher ensuite de la consulter n'offre aucune garantie de sécurité De plus, sans accès en lecture, l'état des objets partagés n'est pas consultable, ce qui limite leur utilité.
it: Anche se la presenza di proprietà di sola lettura sia accettabile e spesso necessaria, le linee guida di progettazione proibiscono l'uso di proprietà di sola scrittura. Questo dipende dal fatto che consentire a un utente di impostare un valore e quindi impedirgli di visualizzarlo non offre alcuna garanzia di sicurezza. Senza l'accesso in lettura, inoltre, non è possibile visualizzare lo stato degli oggetti condivisi e questo ne limita l'utilità.
ja: これは許容されており、読み取り専用プロパティが必要になる場合もよくありますが、デザイン ガイドラインでは、書き込み専用プロパティの使用が禁止されています。これは、ユーザーが値を設定した後にその値を参照できないようにすると、セキュリティが確保されないためです。また、読み取りアクセスがないと、共有オブジェクトのステータスを参照できないため、実用性が制限されます。
ko: 읽기 전용 속성은 사용할 수 있으며 필수로 사용해야 하는 경우가 많지만 디자인 지침에서는 쓰기 전용 속성 사용을 금지합니다. 쓰기 전용 속성 사용을 금지하는 이유는 값을 설정한 사용자가 해당 값을 보지 못하는 경우 보안 문제가 발생하기 때문입니다. 또한 읽기 권한이 없어 공유된 개체의 상태를 볼 수 없는 경우 개체의 유용성이 떨어집니다.
pl: Używanie właściwości tylko do odczytu jest akceptowalne i często konieczne, ale zasady projektowania zakazują używania właściwości tylko do zapisu. Przyczyną jest to, że umożliwienie użytkownikowi ustawienia wartości, a następnie uniemożliwienie odczytywania tej wartości nie stanowi żadnego zabezpieczenia. Bez dostępu do odczytu nie można także odczytywać stanu obiektów udostępnionych, co ogranicza ich użyteczność.
pt_br: Embora seja aceitável e geralmente necessário ter uma propriedade somente leitura, as diretrizes de design proíbem o uso de propriedades somente gravação. Isso ocorre porque permitir que um usuário defina um valor e, em seguida, impedir que o usuário exiba esse valor, é um procedimento que não oferece nenhuma segurança. Além disso, sem acesso de leitura, o estado de objetos compartilhados não pode ser exibido, o que limita a utilidade deles.
ru: Хотя свойства, доступные только для чтения, использовать разрешено и часто необходимо, рекомендации по разработке запрещают использовать свойства, доступные только для записи. Это вызвано тем, что процедура, позволяющая пользователю задать значение и не позволяющая его считать, является небезопасной. Кроме того, без доступа на чтение невозможно просмотреть состояние общих объектов, что ограничивает возможности их применения.
tr: Salt okunur bir özelliğe sahip olunması kabul edilebilir ve çoğu durumda gerekli olsa da, salt yazılır özelliklerin kullanımı tasarım yönergeleri tarafından yasaklanır. Bunun nedeni, bir kullanıcının bir değeri ayarlamasına izin verip bu değeri görüntülemesini engellemenin herhangi bir güvenlik sağlamamasıdır. Ayrıca, okuma erişimi olmadığında paylaşılan nesnelerin durumu görüntülenemediğinden kullanışlılığı kısıtlanabilir.
zh_hans: 虽然具有只读属性是可接受的，且常常是必需的，但设计指南禁止使用只写属性。这是因为让用户设置一个值，然后阻止用户查看该值，这种做法不安全。另外，如果没有读取访问权限，则不能查看共享对象的状态，这会限制对这些对象的作用。
zh_hant: 雖然擁有唯讀屬性是可接受且也經常需要，但設計方針禁止使用唯寫屬性。這是因為讓使用者設定一個值，然後使其無法檢視該值，並不會提供任何安全性。此外，如果沒有讀取權限，就無法檢視共用物件的狀態，進而限制其實用性。

# PropertiesShouldNotBeWriteOnlyMessageAddGetter
source: Because property {0} is write-only, either add a property getter with an accessibility that is greater than or equal to its setter or convert this property into a method
cs: Protože vlastnost {0} je jen pro zápis, buď přidejte metodu getter vlastnosti s přístupností, která je větší nebo stejná jako její metoda setter, nebo tuto vlastnost převeďte na metodu.
de: Da die Eigenschaft "{0}" lesegeschützt ist, fügen Sie entweder einen Eigenschaftengetter mit einer Zugänglichkeit hinzu, die mindestens der des zugehörigen Setters entspricht, oder konvertieren Sie diese Eigenschaft in eine Methode.
es: Puesto que la propiedad {0} es de solo escritura, agregue un captador de propiedad con una accesibilidad que sea mayor o igual que su establecedor o convierta la propiedad en un método.
fr: Dans la mesure où la propriété {0} est en écriture seule, ajoutez une méthode getter de propriété avec une accessibilité supérieure ou égale à celle de sa méthode setter, ou convertissez cette propriété en méthode
it: Dal momento che la proprietà {0} è di sola scrittura, aggiungere un getter di proprietà con un'accessibilità maggiore o uguale al rispettivo setter oppure convertire questa proprietà in un metodo
ko: {0} 속성이 쓰기 전용이므로 해당 setter보다 크거나 같은 접근성이 있는 속성 getter를 추가하거나 이 속성을 메서드로 변환하세요.
pl: Ponieważ właściwość {0} jest właściwością tylko do zapisu, dodaj metodę pobierającą właściwość z dostępnością co najmniej taką samą lub większą niż jej metoda ustawiająca albo przekonwertuj tę właściwość na metodę
pt_br: Como a propriedade {0} é somente gravação, adicione uma propriedade getter com uma acessibilidade maior ou igual ao setter ou converta essa propriedade em um método
ru: Так как свойство {0} доступно только для чтения, добавьте для него метод получения, уровень доступности которого больше или равен уровню доступности метода задания, либо преобразуйте это свойство в метод.
tr: {0} özelliği sadece yazılabilir olduğundan, erişilebilirliği en az özellik ayarlayıcısı kadar olan bir özellik alıcısı ekleyin ya da bu özelliği bir metoda dönüştürün
zh_hans: 由于属性 {0} 是只写的，因此，要么添加一个可访问性高于或等于 setter 的 getter 属性，要么将该属性转换为方法
zh_hant: 因為屬性 {0} 是唯寫屬性，所以請以大於或等於其 setter 的存取範圍，新增屬性 getter，或是將此屬性轉換為方法

# PropertiesShouldNotBeWriteOnlyMessageMakeMoreAccessible
source: Because the property getter for {0} is less visible than its setter, either increase the accessibility of its getter or decrease the accessibility of its setter
cs: Protože metoda getter vlastnosti {0} je méně viditelná než její metoda setter, buď zvyšte přístupnost její metody getter, nebo snižte přístupnost její metody setter.
de: Da der Eigenschaftengetter für "{0}" weniger sichtbar ist als der zugehörige Setter, erhöhen Sie entweder die Zugänglichkeit des zugehörigen Getters, oder verringern Sie die Zugänglichkeit des Setters.
es: Puesto que el captador de propiedad de {0} es menos visible que su establecedor, aumente la accesibilidad de su captador o reduzca la de su establecedor.
fr: Dans la mesure où la méthode getter de propriété pour {0} est moins visible que sa méthode setter, augmentez l'accessibilité de sa méthode getter ou diminuez celle de sa méthode setter
it: Dal momento che il getter di proprietà per {0} è meno visibile del rispettivo setter, aumentare l'accessibilità del getter o diminuire l'accessibilità del relativo setter
ko: {0}의 속성 getter가 setter보다 표시 수준이 낮으므로 getter의 접근성을 높이거나 해당 setter의 접근성을 낮추세요.
pl: Ponieważ metoda pobierająca właściwość {0} ma mniejszą widoczność niż jej metoda ustawiająca, zwiększ dostępność metody pobierającej lub zmniejsz dostępność metody ustawiającej
pt_br: Como a propriedade getter para {0} é menos visível do que o setter dela, aumente a acessibilidade do getter ou diminua a acessibilidade do setter
ru: Так как метод получения свойства {0} имеет меньшую видимость, чем метод задания, увеличьте уровень доступности для метода получения или уменьшите его для метода задания.
tr: {0} için özellik alıcısı, ayarlayıcısından daha az görünür olduğundan alıcının erişilebilirliğini artırın veya ayarlayıcının erişilebilirliğini azaltın
zh_hans: 由于 {0} 的属性 getter 的可见性低于 setter，因此，要么提高 getter 的可访问性，要么降低 getter 的可访问性
zh_hant: 因為 {0} 的屬性 getter 較其 setter 的可見性低，所以請加大其 getter 的存取範圍，或是縮小其 setter 的存取範圍

# DeclareTypesInNamespacesTitle
source: Declare types in namespaces
cs: Deklarujte typy v názvových prostorech.
de: Typen in Namespaces deklarieren
es: Declarar tipos en espacios de nombres
fr: Déclarer les types dans des espaces de noms
it: Dichiarare i tipi negli spazi dei nomi
ja: 名前空間で型を宣言します
ko: 네임스페이스에서 형식을 선언하세요.
pl: Zadeklaruj typy w przestrzeniach nazw
pt_br: Declarar tipos em namespaces
ru: Объявите типы в пространствах имен
tr: Ad alanlarında türleri bildirin
zh_hans: 在命名空间中声明类型
zh_hant: 在命名空間中宣告類型

# DeclareTypesInNamespacesDescription
source: Types are declared in namespaces to prevent name collisions and as a way to organize related types in an object hierarchy.
cs: Typy jsou deklarované v názvových prostorech, což zabraňuje kolizím názvů a umožňuje uspořádat související typy do hierarchie objektů.
de: Typen werden in Namespaces deklariert, um Namenskonflikte zu vermeiden und verwandte Typen in einer Objekthierarchie zu strukturieren.
es: Los tipos se declaran en los espacios de nombres para evitar conflictos de nombre y como forma de organizar los tipos relacionados en una jerarquía de objetos.
fr: Les types sont déclarés dans les espaces de noms pour empêcher les collisions de nommage, ainsi que pour organiser les types connexes dans une hiérarchie d'objets.
it: I tipi vengono dichiarati negli spazi dei nomi per impedire conflitti di denominazione e per organizzare i tipi correlati in una gerarchia di oggetti.
ja: 型を名前空間内で宣言するのは、名前の競合を防ぎ、関連する型をオブジェクト階層で編成するためです。
ko: 이름 충돌을 방지하고 개체 계층 구조에서 관련된 형식을 구성하기 위해 네임스페이스에서 형식이 선언됩니다.
pl: Typy są deklarowane w przestrzeniach nazw w celu uniknięcia kolizji nazw oraz jako sposób organizowania powiązanych typów w hierarchię obiektów.
pt_br: Os tipos são declarados em namespaces para impedir colisões de nomes e como uma forma de organizar tipos relacionados em uma hierarquia de objetos.
ru: Типы объявляются в пространствах имен во избежание конфликтов имен, а также для упорядочивания связанных типов в иерархии объектов.
tr: Ad çakışmalarını engellemek amacıyla ve ilgili türleri bir nesne hiyerarşisinde düzenleme yöntemi olarak ad alanlarında türler bildirilir.
zh_hans: 在命名空间中声明类型以防止名称冲突，并作为一种组织对象层次结构中相关类型的方式。
zh_hant: 類型會宣告於命名空間中，以避免名稱衝突，且可當作組織物件階層中相關類型的一種方法。

# DeclareTypesInNamespacesMessage
source: Declare types in namespaces
cs: Deklarujte typy v názvových prostorech.
de: Typen in Namespaces deklarieren
es: Declarar tipos en espacios de nombres
fr: Déclarer les types dans des espaces de noms
it: Dichiarare i tipi negli spazi dei nomi
ja: 名前空間で型を宣言します
ko: 네임스페이스에서 형식을 선언하세요.
pl: Zadeklaruj typy w przestrzeniach nazw
pt_br: Declarar tipos em namespaces
ru: Объявите типы в пространствах имен
tr: Ad alanlarında türleri bildirin
zh_hans: 在命名空间中声明类型
zh_hant: 在命名空間中宣告類型

# DoNotDeclareVisibleInstanceFieldsTitle
source: Do not declare visible instance fields
cs: Nedeklarujte viditelná pole instance.
de: Sichtbare Instanzfelder nicht deklarieren
es: No declarar campos de instancia visibles
fr: Ne pas déclarer de champs d'instances visibles
it: Non dichiarare campi di istanza visibili
ja: 参照可能なインスタンス フィールドを宣言しません
ko: 표시되는 인스턴스 필드를 선언하지 마세요.
pl: Nie deklaruj widocznych pól wystąpień
pt_br: Não declarar campos de instância visíveis
ru: Не объявляйте видимые поля экземпляров
tr: Görünür örnek alanlarını bildirmeyin
zh_hans: 不要声明可见实例字段
zh_hant: 請勿宣告可見的執行個體欄位

# DoNotDeclareVisibleInstanceFieldsDescription
source: The primary use of a field should be as an implementation detail. Fields should be private or internal and should be exposed by using properties.
cs: Pole se má primárně používat jako detail implementace. Pole mají být privátní nebo interní a zpřístupněná pomocí vlastností.
de: Ein Feld soll primär als Implementierungsdetail dienen. Felder sollten privat oder intern sein und anhand von Eigenschaften verfügbar gemacht werden.
es: El uso principal de un campo debe ser como un detalle de implementación. Los campos deben ser private o internal y deben exponerse mediante propiedades.
fr: Un champ est utilisé principalement en tant que détail d'implémentation. Les champs doivent être private ou internal, et doivent être exposés à l'aide de propriétés.
it: Un campo viene usato principalmente come dettaglio di implementazione. I campi devono essere privati o interni e devono essere esposti tramite proprietà.
ja: フィールドの主な用途は、実装の詳細を示すことです。フィールドは private または internal に設定し、プロパティを使用して公開する必要があります。
ko: 기본적으로 필드는 구현 세부 정보로 사용해야 합니다. 필드는 private 또는 internal이어야 하며 속성을 사용하여 표시해야 합니다.
pl: Pole powinno być używane przede wszystkim jako szczegół implementacji. Pola powinny być prywatne lub wewnętrzne i powinny być udostępniane za pomocą właściwości.
pt_br: O uso primário de um campo deve ser como um detalhe de implementação. Os campos devem ser privados ou internos e devem ser expostos pelo uso de propriedades.
ru: Основной вид использования поля должен соответствовать сведениям о реализации. Поля должны быть частными или внутренними и предоставляться с помощью свойств.
tr: Bir alan, birincil olarak bir uygulama ayrıntısı olarak kullanılmalıdır. Alanlar özel veya dahili olmalı ve özellikler aracılığıyla kullanıma sunulmalıdır.
zh_hans: 字段应主要用作实现详细信息。字段应为私有字段或内部字段，并且应使用属性来公开。
zh_hant: 欄位的主要用法應是作為實作詳細資料。欄位應為是私用或為內部使用，且應使用屬性公開。

# DoNotDeclareVisibleInstanceFieldsMessage
source: Do not declare visible instance fields
cs: Nedeklarujte viditelná pole instance.
de: Sichtbare Instanzfelder nicht deklarieren
es: No declarar campos de instancia visibles
fr: Ne pas déclarer de champs d'instances visibles
it: Non dichiarare campi di istanza visibili
ja: 参照可能なインスタンス フィールドを宣言しません
ko: 표시되는 인스턴스 필드를 선언하지 마세요.
pl: Nie deklaruj widocznych pól wystąpień
pt_br: Não declarar campos de instância visíveis
ru: Не объявляйте видимые поля экземпляров
tr: Görünür örnek alanlarını bildirmeyin
zh_hans: 不要声明可见实例字段
zh_hant: 請勿宣告可見的執行個體欄位

# UriParametersShouldNotBeStringsTitle
source: URI-like parameters should not be strings
cs: Parametry podobné identifikátoru URI by neměly být řetězce
de: URI-ähnliche Parameter dürfen keine Zeichenfolgen sein
es: Los parámetros de tipo URI no deben ser cadenas
fr: Les paramètres de type URI ne doivent pas être des chaînes
it: I parametri simili a URI non devono essere stringhe
ko: URI 같은 매개 변수는 문자열이 아니어야 함
pl: Parametry z identyfikatorami URI nie powinny być ciągami
pt_br: Os parâmetros do tipo URI não devem ser cadeias de caracteres
ru: Параметры, напоминающие URI, не должны быть строками
tr: URI benzeri parametreler dize olmamalıdır
zh_hans: 类 URI 参数不应为字符串
zh_hant: 類 URI 參數不應為字串

# UriParametersShouldNotBeStringsDescription
source: This rule assumes that the parameter represents a Uniform Resource Identifier (URI). A string representation or a URI is prone to parsing and encoding errors, and can lead to security vulnerabilities. 'System.Uri' class provides these services in a safe and secure manner.
cs: Toto pravidlo předpokládá, že parametr reprezentuje identifikátor URI (Uniform Resource Identifier). Řetězcová reprezentace nebo identifikátor URI jsou náchylné k chybám při parsování a kódování a můžou vést k ohrožení zabezpečení. Třída System.Uri poskytuje tyto služby zabezpečeným způsobem.
de: Diese Regel geht davon aus, dass der Parameter für einen URI (Uniform Resource Identifier) steht. Eine Zeichenfolgendarstellung eines URI ist anfällig für Analyse- und Codierungsfehler und kann zu Sicherheitsrisiken führen. Die System.Uri-Klasse stellt diese Dienste auf sichere Weise bereit.
es: Esta regla supone que el parámetro representa un identificador uniforme de recursos (URI). Una representación de cadena o un URI tienden a analizar y codificar los errores, lo que puede crear vulnerabilidades de seguridad. La clase "System.Uri" proporciona estos servicios de manera segura.
fr: Cette règle suppose que le paramètre représente un URI (Uniform Resource Identifier). Une représentation sous forme de chaîne ou un URI est sujet aux erreurs d'analyse et d'encodage. De plus, elle peut entraîner des failles de sécurité. La classe 'System.Uri' fournit ces services de manière sûre et sécurisée.
it: Questa regola presuppone che il parametro rappresenti un URI (Uniform Resource Identifier). Le rappresentazioni di stringa o gli URI sono soggetti a errori di analisi e di codifica e possono comportare vulnerabilità di sicurezza. La classe 'System.Uri' fornisce questi servizi in modo sicuro e protetto.
ko: 이 규칙은 매개 변수가 URI(Uniform Resource Identifier)를 나타낸다고 가정합니다. URI의 문자열 표현은 오류를 구문 분석하거나 인코딩하기 쉬우며 이로 인해 보안이 취약해질 수 있습니다. 'System.Uri' 클래스는 이러한 서비스를 안전하게 제공합니다.
pl: W tej regule przyjęto, że parametr reprezentuje identyfikator URI (Uniform Resource Identifier). Reprezentacja identyfikatora URI w postaci ciągu jest narażona na błędy analizy i kodowania oraz może powodować luki w zabezpieczeniach. Klasa „System.Uri” udostępnia te usługi w bezpieczny sposób.
pt_br: Esta regra considera que o parâmetro representa um URI (Uniform Resource Identifier). Uma representação de cadeia de caracteres de um URI é propensa a erros de análise e de codificação e pode levar a vulnerabilidades de segurança. A classe 'System.Uri' oferece esses serviços de maneira segura.
ru: Это правило предполагает, что параметр представляет универсальный код ресурса (URI). Строковое представление URI подвержено возникновению ошибок анализа и кодирования, а также может создавать уязвимости в системе безопасности. Класс "System.Uri" предоставляет эти услуги надежным и безопасным образом.
tr: Bu kural, parametrenin bir Tekdüzen Kaynak Tanımlayıcısını (URI) temsil ettiğini varsayar. Bir URI’nin dize temsili ayrıştırma ve kodlama hatalarına yatkın olduğundan, güvenlik açıklarına yol açabilir. 'System.Uri' sınıfı bu hizmetleri güvenli bir biçimde sağlar.
zh_hans: 此规则假定参数表示统一资源标识符(URI)。字符串表示形式或 URI 易解析且易出现编码错误，并可能导致安全漏洞。"System.Uri" 类以安全可靠方式提供这些服务。
zh_hant: 此規則假設參數代表統一資源識別項 (URI)。字串表示法或 URI 容易發生剖析及編碼錯誤，且可能因此導致安全性弱點。'System.Uri' 類別以安全的方式提供這些服務。

# UriParametersShouldNotBeStringsMessage
source: Change the type of parameter '{0}' of method '{1}' from 'string' to 'System.Uri', or provide an overload to '{1}' that allows '{0}' to be passed as a 'System.Uri' object
cs: Změňte typ parametru {0} metody {1} ze string na System.Uri, nebo pro {1} zadejte přetížení, které umožňuje předat {0} jako objekt System.Uri.
de: Ändern Sie den Typ des Parameters "{0}" der Methode "{1}" von "string" in "System.Uri", oder geben Sie eine Überladung für "{1}" an, die das Übergeben von "{0}" als System.Uri-Objekt ermöglicht.
es: Cambie el tipo de parámetro "{0}" del método "{1}" de "string" a "System.Uri" o proporcione una sobrecarga de "{1}" que permita pasar "{0}" como un objeto "System.Uri".
fr: Changez le type de paramètre '{0}' de la méthode '{1}', de 'string' à 'System.Uri', ou fournissez une surcharge de '{1}', qui autorise le passage de '{0}' en tant qu'objet 'System.Uri'
it: Modificare il tipo del parametro '{0}' del metodo '{1}' da 'string' a 'System.Uri' oppure fornire un overload di '{1}' che consenta il passaggio di '{0}' come oggetto 'System.Uri'
ko: '{1}' 메서드의 '{0}' 매개 변수 형식을 'string'에서 'System.Uri'로 변경하거나 '{0}'을(를) 'System.Uri' 개체로 전달하도록 허용하는 '{1}'에 오버로드를 제공하세요.
pl: Zmień typ parametru „{0}” metody „{1}” ze „string” na „System.Uri” lub określ przeciążenie metody „{1}” umożliwiające przekazanie parametru „{0}” jako obiektu „System.Uri”.
pt_br: Altere o tipo do parâmetro '{0}' do método '{1}' de 'string' para 'System.Uri' ou forneça uma sobrecarga para '{1}' que permita que '{0}' seja passado como um objeto 'System.Uri'
ru: Измените тип параметра "{0}" метода "{1}" со "string" на "System.Uri" или обеспечьте перегрузку метода "{1}", позволяющую передавать параметр "{0}" как объект "System.Uri".
tr: '{1}' metodunun '{0}' parametresinin 'string' olan türünü 'System.Uri' olarak değiştirin veya '{1}' metoduna, '{0}' parametresinin bir 'System.Uri' nesnesi olarak geçirilmesine imkan tanıyan bir aşırı yükleme sağlayın
zh_hans: 将方法“{1}”的参数“{0}”的类型从 "string" 改为 "System.Uri"，或者提供“{1}”的重载，允许将“{0}”作为 "System.Uri" 对象来传递
zh_hant: 將方法 '{1}' 的參數 '{0}' 型別從 'string' 變更為 'System.Uri'，或是為 '{1}' 提供多載，允許將 '{0}' 以 'System.Uri' 物件的形式傳遞

# UriReturnValuesShouldNotBeStringsTitle
source: URI-like return values should not be strings
cs: Návratové hodnoty podobné identifikátoru URI by neměly být řetězce
de: URI-ähnliche Rückgabewerte dürfen keine Zeichenfolgen sein
es: Los valores devueltos de tipo URI no deben ser cadenas
fr: Les valeurs de retour de type URI ne doivent pas être des chaînes
it: I valori restituiti simili a URI non devono essere stringhe
ko: URI 같은 반환 값은 문자열이 아니어야 함
pl: Zwracane wartości z identyfikatorami URI nie powinny być ciągami
pt_br: Os valores retornados do tipo URI não devem ser cadeias de caracteres
ru: Возвращаемые значения, напоминающие URI, не должны быть строками
tr: URI benzeri dönüş değerleri dize olmamalıdır
zh_hans: 类 URI 返回值不应是字符串
zh_hant: 類 URI 傳回值不應為字串
