Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotNameEnumValuesReservedMessage
source: If '{0}.{1}' is not used in the current implementation, remove it. Otherwise give it a meaningful name.
cs: Pokud {0}.{1} není v aktuální implementaci použita, odeberte ji. V opačném případě jí dejte smysluplný název.
de: Entfernen Sie "{0}.{1}", wenn das Element nicht in der aktuellen Implementierung verwendet wird. Verwenden Sie andernfalls einen aussagekräftigen Namen.
es: Si "{0}.{1}" no se usa en la implementación actual, quítelo. De lo contrario, asígnele un nombre significativo.
fr: Si vous n'utilisez pas '{0}.{1}' dans l'implémentation actuelle, supprimez-le. Sinon, donnez-lui un nom significatif.
it: Se '{0}.{1}' non viene usato nell'implementazione corrente, rimuoverlo. In alternativa, assegnargli un nome significativo.
ko: 현재 구현에서 '{0}.{1}'을(를) 사용하지 않는 경우 제거하세요. 사용하는 경우에는 의미 있는 이름을 지정하세요.
pl: Jeśli element „{0}.{1}” nie jest używany w bieżącej implementacji, usuń go. W przeciwnym razie nadaj mu zrozumiałą nazwę.
pt_br: Se '{0}.{1}' não está sendo usado na implementação atual, remova-o. Caso contrário, dê a ele um nome significativo.
ru: Если "{0}.{1}" не используется в текущей реализации, удалите его. В противном случае присвойте ему осмысленное имя.
tr: '{0}.{1}' geçerli uygulamada kullanılmıyorsa kaldırın. Kullanılıyorsa ona anlamlı bir ad verin.
zh_hans: 如果未在当前实现中使用“{0}.{1}”，请将它移除。否则，请为它指定一个有意义的名称。
zh_hant: 如果目前實作中並未使用 '{0}.{1}'，請將其移除。否則，請為其指定有意義的名稱。

# DoNotNameEnumValuesReservedTitle
source: Do not name enum values 'Reserved'
cs: Nepojmenovávejte výčty hodnot 'Reserved'
de: Enumerationswerte nicht mit "Reserviert" benennen
es: No nombrar valores de enumeración como 'Reserved'
fr: Ne nommez pas les valeurs enum 'Reserved'
it: Non denominare 'Reserved' i valori di enumerazione
ko: 열거형 값의 이름을 'Reserved'로 지정하지 마세요.
pl: Nie nadawaj wartościom wyliczeniowym nazwy Reserved
pt_br: Não nomeie valores de enumerações como 'Reserved'
ru: Не присваивайте перечисляемым значениям имя "Reserved"
tr: Sabit listesi değerlerini 'Reserved' olarak adlandırmayın
zh_hans: 不要命名“Reserved”枚举值
zh_hant: 不要在列舉值名稱中包含 'Reserved'

# DoNotExposeGenericListsDescription
source: System.Collections.Generic.List<T> is a generic collection that's designed for performance and not inheritance. List<T> does not contain virtual members that make it easier to change the behavior of an inherited class.
cs: System.Collections.Generic.List<T> je obecná kolekce navržená pro výkon, nikoli dědičnost. List<T> neobsahuje virtuální členy, které by usnadňovaly změnu chování děděných tříd.
de: System.Collections.Generic.List<T> ist eine generische Sammlung, die aus Leistungsgründen und nicht zur Vererbung entworfen wurde. List<T> enthält keine virtuellen Member, die das Ändern des Verhaltens einer geerbten Klasse vereinfachen.
es: System.Collections.Generic.List<T> es una colección genérica diseñada para el rendimiento, no para la herencia. La lista<T> no contiene miembros virtuales que faciliten el cambio de comportamiento de una clase heredada.
fr: System.Collections.Generic.List<T> est une collection générique conçue pour les performances et non pour l'héritage. List<T> ne contient pas de membres virtuels qui facilitent le changement de comportement d'une classe héritée.
it: System.Collections.Generic.List<T> è una raccolta generica progettata per le prestazioni e non per l'ereditarietà. List<T> non contiene membri virtuali che semplificano la modifica del comportamento di una classe ereditata.
ko: System.Collections.Generic.List<T>는 상속이 아닌 성능을 위해 설계된 제네릭 컬렉션입니다. List<T>는 상속된 클래스의 동작을 더 쉽게 변경할 수 있도록 만들어 주는 가상 멤버를 포함하지 않습니다.
pl: System.Collections.Generic.List<T> to ogólna kolekcja zaprojektowana pod kątem wydajności, a nie dziedziczenia. Element List<T> nie zawiera wirtualnych składowych, które ułatwiają zmianę zachowania dziedziczonej klasy.
pt_br: System.Collections.Generic.List<T> é uma coleção genérica projetada para desempenho e não para herança. A lista<T> não contém membros virtuais que tornam mais fácil alterar o comportamento de uma classe herdada.
ru: System.Collections.Generic.List<T> является универсальной коллекцией, которая предназначена для повышения производительности, а не для наследования. List<T> не содержит виртуальные члены, которые упрощают изменение поведения наследуемого класса.
tr: System.Collections.Generic.List<T>, devralma için değil performans için tasarlanmış genel amaçlı bir koleksiyondur. List<T>, devralınan bir sınıfın davranışını değiştirmeyi kolaylaştıran sanal üyeler içermez.
zh_hans: System.Collections.Generic.List<T> 是设计用于性能和非继承的泛型集合。List<T> 不包含可使更改继承类的行为变得更容易的虚拟成员。
zh_hant: System.Collections.Generic.List<T> 是為效能而非繼承所設計的泛型集合。List<T> 不包含讓已繼承類別行為更容易變更的虛擬成員。

# DoNotExposeGenericListsMessage
source: Change '{0}' in '{1}' to use 'Collection<T>', 'ReadOnlyCollection<T>' or 'KeyedCollection<K,V>'
cs: Změňte {0} v {1} tak, aby se používalo Collection<T>, ReadOnlyCollection<T> nebo KeyedCollection<K,V>.
de: Ändern Sie "{0}" in "{1}", um "Collection<T>", "ReadOnlyCollection<T>" oder "KeyedCollection<K,V>" zu verwenden.
es: Cambie "{0}" en "{1}" para que use "Collection<T>", "ReadOnlyCollection<T>" o "KeyedCollection<K,V>"
fr: Changer '{0}' en '{1}' pour utiliser 'Collection<T>', 'ReadOnlyCollection<T>' ou 'KeyedCollection<K,V>'
it: Modificare '{0}' in '{1}' per usare 'Collection<T>', 'ReadOnlyCollection<T>' o 'KeyedCollection<K,V>'
ko: '{1}'의 '{0}'이(가) 'Collection<T>', 'ReadOnlyCollection<T>' 또는 'KeyedCollection<K,V>'를 사용하도록 변경합니다.
pl: Zmień element „{0}” w „{1}”, aby użyć elementu „Collection<T>”, „ReadOnlyCollection<T>” lub „KeyedCollection<K,V>”
pt_br: Altere '{0}' em '{1}' para usar 'Collection<T>', 'ReadOnlyCollection<T>' ou 'KeyedCollection<K,V>'
ru: Измените "{0}" в "{1}" так, чтобы использовать "Collection<T>", "ReadOnlyCollection<T>" или "KeyedCollection<K,V>"
tr: 'Collection<T>', 'ReadOnlyCollection<T>' veya 'KeyedCollection<K,V>' kullanmak için '{1}' içindeki '{0}' öğesini değiştirin
zh_hans: 更改 {1} 中的 {0} 以使用 "Collection<T>"、"ReadOnlyCollection<T>" 或 "KeyedCollection<K,V>"
zh_hant: 將 '{1}' 中的 '{0}' 變更為使用 'Collection<T>'、'ReadOnlyCollection<T>' 或 'KeyedCollection<K,V>'

# DoNotExposeGenericListsTitle
source: Do not expose generic lists
cs: Nezveřejňujte obecné seznamy
de: Generische Listen nicht verfügbar machen
es: No exponer listas genéricas
fr: Ne pas exposer de listes génériques
it: Non esporre elenchi generici
ko: 제네릭 목록을 노출하지 마십시오.
pl: Nie ujawniaj list ogólnych
pt_br: Não expor listas genéricas
ru: Не предоставляйте универсальные списки
tr: Genel listeleri gösterme
zh_hans: 不要公开泛型列表
zh_hant: 不要公開泛型清單

# DoNotDeclareEventFieldsAsVirtualDescription
source: Do not declare virtual events in a base class. Overridden events in a derived class have undefined behavior. The C# compiler does not handle this correctly and it is unpredictable whether a subscriber to the derived event will actually be subscribing to the base class event.
cs: Nedeklarujte virtuální události v základní třídě. Přepsané události v odvozené třídě mají nedefinované chování. Kompilátor jazyka C# tuto situaci nezpracovává správně a je nepředvídatelné, jestli se odběratel odvozené událostí skutečně přihlásí k odběru události základní třídy.
de: Deklarieren Sie keine virtuellen Ereignisse in einer Basisklasse. Überschriebene Ereignisse in einer abgeleiteten Klasse weisen ein undefiniertes Verhalten auf. Der C#-Compiler verarbeitet sie nicht ordnungsgemäß, und es ist nicht vorhersehbar, ob ein Abonnent des abgeleiteten Ereignisses tatsächlich das Ereignis der Basisklasse abonniert.
es: No debe declarar eventos virtuales en una clase base. Los eventos invalidados en una clase derivada tienen un comportamiento no definido. El compilador de C# no los controla correctamente y no se puede predecir si un suscriptor del evento derivado se estará suscribiendo en realidad al evento de clase base.
fr: Ne déclarez pas d'événements virtuels dans une classe de base. Les événements substitués dans une classe dérivée ont un comportement non défini. Le compilateur C# ne gère pas cela correctement. Il n'est pas possible de prévoir si un abonné à l'événement dérivé va s'abonner réellement à l'événement de classe de base.
it: Non dichiara eventi virtuali in una classe di base. Il comportamento degli eventi di cui è stato eseguito l'override in una classe derivata è indefinito. Il compilatore C# non gestisce correttamente questa condizione e non è possibile prevedere se un sottoscrittore dell'evento derivato verrà effettivamente sottoscritto all'evento della classe di base.
ko: 기본 클래스에서 가상 이벤트를 선언하지 마세요. 파생 클래스에서 재정의된 이벤트에는 정의되지 않은 동작이 있습니다. C# 컴파일러는 이를 올바르게 처리하지 않으며 파생 이벤트에 대한 구독자가 실제로 기본 클래스 이벤트를 구독하는지 여부를 예측할 수 없습니다.
pl: Nie deklaruj zdarzeń wirtualnych w klasie bazowej. Przesłonięte zdarzenia w klasie pochodnej mają niezdefiniowane zachowanie. Kompilator języka C# nie obsługuje takiej sytuacji poprawnie i nie da się przewidzieć, czy subskrybent zdarzenia pochodnego w rzeczywistości będzie subskrybował zdarzenie klasy bazowej.
pt_br: Não declare os eventos virtuais em uma classe base. Os eventos substituídos em uma classe derivada têm um comportamento indefinido. O compilador C# não manipula isso corretamente e não há como prever se um assinante do evento derivado realmente estará assinando o evento da classe base.
ru: Не объявляйте виртуальные события в базовом классе. Переопределенные события в производном классе имеют неопределенное поведение. Компилятор C# не обрабатывает такие события корректно, поэтому невозможно предсказать, будет ли подписчик на событие производного класса действительно подписан на событие базового класса.
tr: Bir temel sınıfta sanal olayları bildirmeyin. Türetilmiş bir sınıfta geçersiz kılınan olaylar tanımlanmamış davranışa sahiptir. C# derleyicisi bunları doğru işlemez ve türetilen olayın abonesinin gerçekte temel sınıf olayına abone olup olmayacağı öngörülemez.
zh_hans: 不要在基类中声明虚拟事件。派生类中已替代的事件具有未定义的行为。C# 编译器没有正确处理此内容，而且无法预测出派生事件的订阅者实际上是否将订阅基类事件。
zh_hant: 請勿在基底類別中宣告虛擬事件。在有未定義行為的衍生類別中覆寫事件。C# 編譯器無法正確地處理此事件，而且無法預期衍生事件的訂閱者是否會實際訂閱基底類別事件。

# DoNotDeclareEventFieldsAsVirtualMessage
source: Event '{0}' should not be declared virtual
cs: Událost {0} by se neměla deklarovat jako virtuální.
de: Das Ereignis "{0}" darf nicht als virtuell deklariert werden.
es: No debe declararse como virtual el evento "{0}"
fr: L'événement '{0}' ne doit pas être déclaré en tant qu'événement virtuel
it: L'evento '{0}' non deve essere dichiarato come virtuale
ko: '{0}' 이벤트는 가상으로 선언할 수 없습니다.
pl: Zdarzenie „{0}” nie powinno być zadeklarowane jako wirtualne
pt_br: O evento '{0}' não deve ser declarado como virtual
ru: Событие "{0}" не следует объявлять как виртуальное.
tr: '{0}' olayı sanal olarak bildirilmemelidir
zh_hans: 不得将事件“{0}”声明为虚拟事件
zh_hant: 事件 '{0}' 不應宣告為虛擬

# DoNotDeclareEventFieldsAsVirtualTitle
source: Do not declare event fields as virtual
cs: Nedeklarovat pole událostí jako virtuální
de: Ereignisfelder nicht als virtuell deklarieren
es: No declarar los campos de eventos como virtuales
fr: Ne pas déclarer de champs d'événement comme virtuels
it: Non dichiarare i campi evento come virtuali
ko: 이벤트 필드를 가상으로 선언하지 않음
pl: Nie deklaruj pól zdarzeń jako wirtualnych
pt_br: Não declare os campos de evento como virtuais
ru: Не объявляйте поля событий как виртуальные
tr: Olay alanlarını sanal olarak bildirme
zh_hans: 不要将事件字段声明为“虚拟”
zh_hant: 請勿將事件欄位宣告為虛擬

# DoNotOverloadOperatorEqualsOnReferenceTypesDescription
source: For reference types, the default implementation of the equality operator is almost always correct. By default, two references are equal only if they point to the same object. If the operator is providing meaningful value equality, the type should implement the generic 'System.IEquatable' interface.
cs: Pro odkazové typy je výchozí implementace operátoru rovnosti téměř vždy správná. Ve výchozím nastavení jsou dva odkazy stejné jenom v případě, že odkazují na stejný objekt. Pokud operátor poskytuje smysluplnou rovnost hodnot, měl by typ implementovat obecné rozhraní System.IEquatable.
de: Bei Verweistypen ist die Standardimplementierung des Gleichheitsoperators fast immer korrekt. Standardmäßig sind zwei Verweise nur dann gleich, wenn Sie auf dasselbe Objekt zeigen. Wenn der Operator eine aussagekräftige Wertgleichheit bereitstellt, muss der Typ die generische Schnittstelle "System.IEquatable" implementieren.
es: Para los tipos de referencia, la implementación predeterminada del operador de igualdad es casi siempre correcta. De forma predeterminada, dos referencias solo son iguales si apuntan al mismo objeto. Si el operador proporciona una igualdad de valores significativa, el tipo debe implementar la interfaz "System. IEquatable" genérica.
fr: Pour les types référence, l'implémentation par défaut de l'opérateur d'égalité est presque toujours correcte. Par défaut, deux références sont égales uniquement si elles pointent vers le même objet. Si l'opérateur fournit une égalité de valeur significative, le type doit implémenter l'interface générique 'System.IEquatable'.
it: Per i tipi riferimento l'implementazione predefinita dell'operatore di uguaglianza è quasi sempre corretta. Per impostazione predefinita, due riferimenti sono uguali solo se puntano allo stesso oggetto. Se l'operatore offre uguaglianza di valori significativa, il tipo deve implementare l'interfaccia 'System.IEquatable' generica.
ko: 참조 형식의 경우 같음 연산자의 기본 구현은 거의 항상 올바릅니다. 기본적으로 두 참조는 같은 개체를 가리키는 경우에만 같습니다. 연산자가 의미 있는 값 같음을 제공하는 경우 형식은 제네릭 'System.IEquatable' 인터페이스를 구현해야 합니다.
pl: W przypadku typów referencyjnych domyślna implementacja operatora równości jest prawie zawsze prawidłowa. Domyślnie dwa odwołania są równe tylko wtedy, gdy wskazują ten sam obiekt. Jeśli operator zapewnia istotną równość wartość, typ powinien implementować ogólny interfejs „System.IEquatable”.
pt_br: Para os tipos de referência, a implementação padrão do operador de igualdade quase sempre está correta. Por padrão, duas referências são iguais somente quando apontam para o mesmo objeto. Se o operador estiver fornecendo uma igualdade de valor significativa, o tipo deverá implementar a interface genérica 'System.IEquatable'.
ru: Для ссылочных типов реализация оператора равенства по умолчанию почти всегда является правильной. По умолчанию две ссылки равны только в том случае, если они указывают на один и тот же объект. Если оператор предоставляет осмысленное равенство значений, тип должен реализовывать универсальный интерфейс "System.IEquatable".
tr: Başvuru türleri için, eşitlik işlecinin varsayılan uygulaması neredeyse her zaman doğrudur. Varsayılan olarak, iki başvuru yalnızca aynı nesneye işaret ettiklerinde eşittir. İşleç anlamlı bir değer eşitliği sağlıyorsa tür genel 'System.IEquatable' arabirimini uygulamalıdır.
zh_hans: 对于引用类型，相等运算符的默认实现几乎总是正确的。默认情况下，仅当两个引用指向同一个对象时，它们才相等。如果运算符提供有意义的值相等，则该类型应实现泛型 "System.iequatable" 接口。
zh_hant: 對參考型別而言，等號比較運算子的預設實作幾乎永遠正確。根據預設，只有當兩項參考都指向相同物件時才會相等。如果運算子提供有意義的值相等，則型別應實作泛型 'System.IEquatable' 介面。

# DoNotOverloadOperatorEqualsOnReferenceTypesMessage
source: '{0}' should not overload the equality operator
cs: {0} by neměl přetížit operátor rovnosti.
de: "{0}" darf den Gleichheitsoperator nicht überladen.
es: "{0}" no debe sobrecargar el operador de igualdad.
fr: '{0}' ne doit pas surcharger l'opérateur d'égalité
it: '{0}' non deve eseguire l'overload dell'operatore di uguaglianza
ko: '{0}'은(는) 같음 연산자를 오버로드하면 안 됩니다.
pl: Element „{0}” nie powinien przeciążać operatora równości
pt_br: '{0}' não deve sobrecarregar o operador de igualdade
ru: В "{0}" не следует перегружать оператор равенства.
tr: '{0}' eşitlik işlecini aşırı yüklememelidir
zh_hans: “{0}”不应重载相等运算符
zh_hant: '{0}' 不應該多載等號比較運算子

# DoNotOverloadOperatorEqualsOnReferenceTypesTitle
source: Do not overload equality operator on reference types
cs: Nepřetěžujte operátor rovnosti na odkazových typech
de: Gleichheitsoperator für Verweistypen nicht überladen
es: No sobrecargar el operador de igualdad en los tipos de referencia
fr: Ne pas surcharger l'opérateur d'égalité sur les types référence
it: Non eseguire l'overload dell'operatore di uguaglianza per i tipi riferimento
ko: 참조 형식에 같음 연산자를 오버로드하지 마세요.
pl: Nie przeciążaj operatora równości w typach referencyjnych
pt_br: Não sobrecarregar o operador de igualdade em tipos de referência
ru: Не перегружайте оператор равенства для ссылочных типов
tr: Eşitlik işlecini başvuru türlerinde aşırı yüklemeyin
zh_hans: 不要对引用类型重载相等运算符
zh_hant: 請勿多載參考型別上的等號比較運算子

# DoNotPassDisposablesIntoUnawaitedTasksDescription
source: Unawaited tasks that use 'IDisposable' instances may use those instances long after they have been disposed. Ensure tasks using those instances are completed before the instances are disposed.
cs: Nepřipravené úlohy, které používají instance IDisposable, můžou tyto instance používat dlouho po jejich vyřazení. Před odstraněním instancí se ujistěte, že úlohy, které tyto instance používají, se dokončily.
de: Nicht abgewartete Aufgaben, die „IDisposable“-Instanzen verwenden, können diese Instanzen lange nach deren Löschen nutzen. Stellen Sie sicher, dass Aufgaben, die diese Instanzen verwenden, abgeschlossen sind, bevor die Instanzen gelöscht werden.
es: Las tareas no esperadas que usan instancias de "IDisposable" pueden usar esas instancias mucho después de que se hayan eliminado. Asegúrese de que las tareas que usan esas instancias se completan antes de que se eliminen las instancias.
fr: Les tâches non attendues qui utilisent des instances « IDisposable » peuvent utiliser ces instances longtemps après leur suppression. Vérifiez que les tâches utilisant ces instances sont terminées avant que les instances ne soient supprimées.
it: Le attività non previste che usano istanze 'IDisposable' possono usare tali istanze molto tempo dopo l'eliminazione. Assicurati che le attività che utilizzano queste istanze vengano completate prima che le istanze vengano eliminate.
ko: 'IDisposable' 인스턴스를 사용하는 무await 작업은 해당 인스턴스가 삭제된 후에도 오랫동안 사용할 수 있습니다. 인스턴스가 삭제되기 전에 해당 인스턴스를 사용하는 작업이 완료되었는지 확인하세요.
pl: Nieoczekiwane zadania używające wystąpień „IDisposable” mogą używać tych wystąpień długo po ich usunięciu. Przed usunięciem wystąpień upewnij się, że zadania korzystające z tych wystąpień zostały ukończone.
pt_br: As tarefas não aguardadas que usam as instâncias ''IDisposable'' podem utilizá-las muito depois de terem sido descartadas. Certifique-se de que as tarefas que usam essas instâncias estejam concluídas antes que as instâncias sejam descartadas.
ru: Неожидаемые задачи, использующие экземпляры IDisposable, могут продолжать использовать эти экземпляры долго после их удаления. Убедитесь, что задачи, использующие эти экземпляры, завершены перед удалением экземпляров.
tr: "IDisposable" örnekler kullanan beklemesi kaldırılmış görevler, iptal edildikten uzun süre sonra bu örnekleri kullanabilir. Bu örnekleri kullanan görevlerin örnekler iptal edilmeden tamamlandığından emin olun.
zh_hans: 使用 'IDisposable' 实例的未等待任务可能会在释放这些实例后长时间使用这些实例。确保在释放实例之前完成使用这些实例的任务。
zh_hant: 未等候的工作如果使用 'IDisposable' 執行個體，處置這些執行個體後，可能仍會使用它們。請確保在處置這些執行個體之前，已完成使用這些執行個體的工作。

# DoNotPassDisposablesIntoUnawaitedTasksMessage
source: Ensure tasks using 'IDisposable' instances complete before the instances are disposed
cs: Před vyřazením instancí se ujistěte, že úlohy využívající instance IDisposable se dokončily.
de: Stellen Sie sicher, dass Aufgaben, die „IDisposable“-Instanzen verwenden, abgeschlossen sind, bevor die Instanzen gelöscht werden.
es: Asegúrese de que las tareas que usan instancias de "IDisposable" se completan antes de que se eliminen las instancias
fr: Vérifiez que les tâches utilisant des instances « IDisposable » sont terminées avant que les instances ne soient supprimées
it: Assicurati che le attività che utilizzano le istanze di 'IDisposable' siano completate prima che le istanze vengano eliminate
ko: 인스턴스가 삭제되기 전에 'IDisposable' 인스턴스를 사용하는 작업이 완료되었는지 확인하세요.
pl: Upewnij się, że zadania używające wystąpień „IDisposable” zostały ukończone przed usunięciem wystąpień
pt_br: Certifique-se de que as tarefas que usam as instâncias ''IDisposable'' sejam concluídas antes que as instâncias sejam descartadas
ru: Убедитесь, что задачи, использующие экземпляры IDisposable, завершены перед удалением экземпляров
tr: Örnekler atılmadan önce "IDisposable" örneği kullanan görevlerin tamamlandığından emin olun
zh_hans: 确保在释放实例之前完成使用 'IDisposable' 实例的任务
zh_hant: 確保使用 'IDisposable' 執行個體的工作在處置執行個體之前完成

# DoNotPassDisposablesIntoUnawaitedTasksTitle
source: Do not pass 'IDisposable' instances into unawaited tasks
cs: Nepředávejte instance IDisposable do nepřipravených úloh
de: Übergeben Sie keine „IDisposable“-Instanzen an nicht abgewartete Aufgaben.
es: No pasar instancias de "IDisposable" a tareas no esperadas
fr: Ne passez pas les instances « IDisposable » à des tâches non attendues
it: Non passare istanze di 'IDisposable' in attività non attese
ko: 'IDisposable' 인스턴스를 무await 작업에 전달하지 마세요.
pl: Nie przekazuj wystąpień „IDisposable” do zadań, które nie są oczekiwane
pt_br: Não passe instâncias ''IDisposable'' em tarefas não aguardadas
ru: Не передавайте экземпляры IDisposable в неожидаемые задачи
tr: Beklemesi kaldırılmış görevlere "IDisposable" örneklerini geçirmeyin
zh_hans: 不要将 ‘IDisposable’ 实例传递到未等待的任务中
zh_hant: 請勿將 'IDisposable' 執行個體傳遞至未等候的工作中
