Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TypeNamesShouldNotMatchNamespacesMessageDefault
source: The type name {0} conflicts in whole or in part with the namespace name '{1}'. Change either name to eliminate the conflict.
cs: Název typu {0} koliduje úplně nebo částečně s názvem názvového prostoru {1}. Změnou některého názvu zabraňte tomuto konfliktu.
de: Der Typname "{0}" verursacht vollständig oder teilweise einen Konflikt mit dem Namespacenamen "{1}". Ändern Sie einen der Namen, um den Konflikt zu beseitigen.
es: El nombre de tipo {0} está en conflicto total o parcialmente con el nombre del espacio de nombres “{1}”. Cambie uno de los nombres para eliminar el conflicto.
fr: Le nom de type {0} est en conflit partiellement ou totalement avec le nom d'espace de noms '{1}'. Changez l'un de ces deux noms pour éliminer le conflit.
it: Il nome di tipo {0} è completamente o parzialmente in conflitto con il nome di spazio dei nomi '{1}'. Modificare uno dei due nomi per eliminare il conflitto.
ja: 型名 {0} は、名前空間の名前 '{1}' と全体または部分的に競合します。競合を解消するには、どちらかの名前を変更してください。
ko: 형식 이름 {0}이(가) 네임스페이스 이름 '{1}'과(와) 전부 또는 부분적으로 충돌합니다. 충돌이 발생하지 않도록 둘 중 하나의 이름을 변경하세요.
pl: Nazwa typu {0} powoduje konflikt w całości lub częściowo z nazwą przestrzeni nazw „{1}”. Zmień jedną z tych nazw, aby wyeliminować konflikt.
pt_br: O nome de tipo {0} está em conflito, no todo ou em parte, com o nome de namespace '{1}'. Altere um desses nomes para eliminar o conflito.
ru: Имя типа {0} полностью или частично конфликтует с именем пространства имен "{1}". Измените одно из имен, чтобы устранить конфликт.
tr: {0} tür adı, '{1}' ad alanı adıyla tamamen veya kısmen çakışıyor. Çakışmayı ortadan kaldırmak için iki addan birini değiştirin.
zh_hans: 类型名 {0} 与命名空间名称“{1}”整体或部分冲突。请更改其中任一名称以消除冲突。
zh_hant: 整個類型名稱 {0} 或其中的一部分，與命名空間名稱 '{1}' 相衝突。變更任一名稱以排除該衝突。

# TypeNamesShouldNotMatchNamespacesMessageSystem
source: The type name {0} conflicts in whole or in part with the namespace name '{1}' defined in the .NET Framework. Rename the type to eliminate the conflict.
cs: Název typu {0} koliduje úplně nebo částečně s názvem názvového prostoru {1} definovaným v rozhraní .NET Framework. Přejmenováním typu zabraňte tomuto konfliktu.
de: Der Typname "{0}" verursacht vollständig oder teilweise einen Konflikt mit dem im .NET Framework definierten Namespacenamen "{1}". Benennen Sie den Typ um, um den Konflikt zu beseitigen.
es: El nombre de tipo {0} está en conflicto total o parcialmente con el nombre del espacio de nombres “{1}” definido en .NET Framework. Cambie el nombre del tipo para eliminar el conflicto.
fr: Le nom de type {0} est en conflit partiellement ou totalement avec le nom d'espace de noms '{1}' défini dans le .NET Framework. Renommez le type pour éliminer le conflit.
it: Il nome di tipo {0} è completamente o parzialmente in conflitto con il nome di spazio dei nomi '{1}' definito in .NET Framework. Rinominare il tipo per eliminare il conflitto.
ja: 型名 {0} は、.NET Framework で定義されている名前空間の名前 '{1}' と全体または部分的に競合します。競合を解消するには、型名を変更してください。
ko: 형식 이름 {0}이(가) .NET Framework에서 정의된 네임스페이스 이름 '{1}'과(와) 전부 또는 부분적으로 충돌합니다. 충돌이 발생하지 않도록 형식의 이름을 바꾸세요.
pl: Nazwa typu {0} powoduje konflikt w całości lub częściowo z nazwą przestrzeni nazw „{1}” zdefiniowaną w programie .NET Framework. Zmień nazwę typu, aby wyeliminować konflikt.
pt_br: O nome de tipo {0} está em conflito, no todo ou em parte, com o nome de namespace '{1}' definido no .NET Framework. Renomeie o tipo para eliminar o conflito.
ru: Имя типа {0} полностью или частично конфликтует с именем пространства имен "{1}", определенным в .NET Framework. Переименуйте тип, чтобы устранить конфликт.
tr: {0} tür adı, .NET Framework’te tanımlanan '{1}' ad alanı adıyla tamamen veya kısmen çakışıyor. Çakışmayı ortadan kaldırmak için türü yeniden adlandırın.
zh_hans: 类型名 {0} 与在 .NET Framework 中定义的命名空间名称“{1}”整体或部分冲突。请重命名该类型以消除冲突。
zh_hant: 整個類型名稱 {0} 或其中的一部分，與 .NET Framework 中定義的命名空間名稱 '{1}' 相衝突。重新命名類型以排除該衝突。

# ParameterNamesShouldMatchBaseDeclarationTitle
source: Parameter names should match base declaration
cs: Názvy parametrů se mají shodovat se základní deklarací.
de: Parameternamen müssen mit der Basisdeklaration übereinstimmen
es: Los nombres de parámetro deben coincidir con la declaración base
fr: Les noms de paramètres doivent correspondre à la déclaration de base
it: I nomi di parametro devono corrispondere alla dichiarazione di base
ja: パラメーター名は基本宣言と同一でなければなりません
ko: 매개 변수 이름은 기본 선언과 일치해야 합니다.
pl: Nazwy parametrów powinny być zgodne z deklaracją podstawową
pt_br: Nomes de parâmetros devem corresponder à declaração base
ru: Имена параметров должны соответствовать базовому объявлению
tr: Parametre adları temel bildirimle eşleşmelidir
zh_hans: 参数名应与基声明保持一致
zh_hant: 參數名稱應與基底類型宣告相符

# ParameterNamesShouldMatchBaseDeclarationDescription
source: Consistent naming of parameters in an override hierarchy increases the usability of the method overrides. A parameter name in a derived method that differs from the name in the base declaration can cause confusion about whether the method is an override of the base method or a new overload of the method.
cs: Konzistentní pojmenování parametrů v hierarchii přepisů zvyšuje použitelnost přepisů metod. Název parametru v odvozené metodě, který se liší od názvu v základní deklaraci, může způsobit zmatek v tom, jestli je tato metoda přepisem základní metody, nebo nové přetížení této metody.
de: Durch eine konsistente Benennung von Parametern in einer Außerkraftsetzungshierarchie erhöht sich die Nutzbarkeit der Methodenaußerkraftsetzungen. Ein Parameter in einer abgeleiteten Methode, der von dem Namen in der Basisdeklaration abweicht, kann zu Verwirrung im Hinblick darauf führen, ob es sich bei der Methode um eine Außerkraftsetzung der Basismethode oder um eine neue Überladung der Methode handelt.
es: El uso del mismo nombre para un parámetro en una jerarquía de reemplazo aumenta la utilidad de los reemplazos de método. Cuando el nombre de un parámetro en un método derivado es distinto del nombre de la declaración base, puede resultar difícil determinar si el método es un reemplazo del método base o una nueva sobrecarga del método.
fr: Un nommage cohérent des paramètres dans une hiérarchie de remplacement augmente la facilité d'utilisation des remplacements de méthode. Un nom de paramètre dans une méthode dérivée qui diffère du nom dans la déclaration de base peut créer une confusion au moment de déterminer si la méthode est un remplacement de la méthode de base ou une nouvelle surcharge de la méthode.
it: Una denominazione coerente dei parametri in una gerarchia di override aumenta l'usabilità degli override di metodo. Un nome di parametro in un metodo derivato diverso dal nome nella dichiarazione di base può generare confusione sulla natura del metodo, ovvero se si tratta di un override del metodo di base o di un nuovo overload del metodo.
ja: オーバーライド階層でのパラメーターに対する一貫した名前付けにより、メソッド オーバーライドの使いやすさが向上します。派生メソッドのパラメーター名が基本宣言のパラメーター名と異なると、メソッドが基本メソッドのオーバーライドかメソッドの新しいオーバーロードかに関して混乱が生じる可能性があります。
ko: 재정의 계층 구조에서 일관성 있는 매개 변수의 명명 규칙을 사용하면 메서드 재정의의 유용성이 증가합니다. 기본 선언의 이름과 다른 파생된 메서드의 매개 변수 이름으로 인해 이 메서드가 기본 메서드의 재정의인지 메서드의 새 오버로드인지 혼동이 발생할 수 있습니다.
pl: Spójne nazewnictwo parametrów w hierarchii przesłaniania zwiększa użyteczność przesłonięć metod. Nazwa parametru w metodzie pochodnej różniąca się od nazwy w deklaracji podstawowej może utrudnić zrozumienie tego, czy metoda przesłania metodę podstawową, czy jest jej nowym przeciążeniem.
pt_br: A nomenclatura consistente de parâmetros em uma hierarquia de substituição aumenta a usabilidade das substituições de método. Um nome de parâmetro em um método derivado que é diferente do nome na declaração base pode causar confusão sobre se o método é uma substituição do método base ou uma nova sobrecarga do método.
ru: Согласованное именование параметров в иерархии переопределений расширяет возможности по использованию переопределений методов. Имя параметра в производном методе, которое отличается от имени в базовом объявлении, может привести к путанице с тем, является ли метод переопределением базового метода или новой перегрузкой метода.
tr: Bir geçersiz kılma hiyerarşisindeki parametrelerin tutarlı bir biçimde adlandırılması, yöntem geçersiz kılmalarının kullanılabilirliğini artırır. Türetilmiş bir yöntemde temel bildirimden farklı olan bir parametre adı, ilgili yöntemin temel yöntemin geçersiz kılması mı yoksa yöntemin yeni bir aşırı yüklemesi mi olduğu konusunda kafa karışıklığı yaratabilir.
zh_hans: 在重写层次结构中对参数进行一致命名会增加方法重写的可用性。派生方法中的参数名与基声明中的名称不同，可能在该方法是基方法的重写还是方法的新重载方面产生混淆。
zh_hant: 在覆寫階層中的參數命名方式一致，可增加方法覆寫的可用性。與基底宣告中的名稱不同之衍生方法內的參數名稱，可能會造成一些混淆，不確定方法為基底方法的覆寫或為方法的新多載。

# ParameterNamesShouldMatchBaseDeclarationMessage
source: In member {0}, change parameter name {1} to {2} in order to match the identifier as it has been declared in {3}
cs: V členovi {0} změňte název parametru {1} na {2}, aby se shodoval s identifikátorem deklarovaným v {3}.
de: Ändern Sie im Member "{0}" den Parameternamen "{1}" in "{2}", damit er der Deklaration des Bezeichners in "{3}" entspricht.
es: En el miembro {0}, cambie el nombre del parámetro {1} a {2} para que coincida con el identificador tal como se ha declarado en {3}.
fr: Dans le membre {0}, changez le nom de paramètre {1} en {2} pour faire correspondre l'identificateur tel qu'il a été déclaré dans {3}
it: Nel membro {0} modificare il nome di parametro {1} in {2} in modo che corrisponda all'identificatore come è stato dichiarato in {3}
ko: {3}에 선언된 식별자와 일치하도록 {0} 멤버의 매개 변수 이름 {1}을(를) {2}(으)로 변경하세요.
pl: W składowej {0} zmień nazwę parametru {1} na {2}, aby zapewnić zgodność z identyfikatorem zadeklarowanym w elemencie {3}
pt_br: No membro {0}, altere o nome de parâmetro {1} para {2} a fim de corresponder ao identificador conforme declarado em {3}
ru: В члене {0} измените имя параметра {1} на {2}, чтобы привести идентификатор в соответствие с объявлением в {3}.
tr: {0} üyesinde, {1} parametre adının {3} içinde bildirilen şekilde tanımlayıcıyla eşleşmesini sağlamak için adı {2} olarak değiştirin
zh_hans: 在成员 {0} 中，将参数名 {1} 改为 {2}，使其与已在 {3} 中声明的标识符匹配
zh_hant: 在成員 {0} 中，將參數名稱從 {1} 變更為 {2}，以符合已於 {3} 中宣告的識別項

# OverrideEqualsAndOperatorEqualsOnValueTypesTitle
source: Override equals and operator equals on value types
cs: Přepište Equals a operátor rovnosti u typů hodnot.
de: Equals und Gleichheitsoperator für Werttypen außer Kraft setzen
es: Reemplazar Equals y el operador Equals en los tipos de valor
fr: Remplacer Equals et l'opérateur égal à dans les types valeur
it: Eseguire l'override di Equals e dell'operatore di uguaglianza sui tipi di valore
ja: equals および operator equals を値型でオーバーライドします
ko: 값 형식에서 Equals 또는 같음 연산자를 재정의하세요.
pl: Przesłoń metodę Equals i operator równości w typach wartości
pt_br: Substitua Equals e o operador Equals em tipos de valores
ru: Переопределите операторы Equals и равенства для типов значений
tr: Değer türlerinde eşittirleri ve işleç eşittirleri geçersiz kılın
zh_hans: 重写值类型上的 Equals 和相等运算符
zh_hant: 覆寫實值型別上的 Equals 與等號比較運算子

# OverrideEqualsAndOperatorEqualsOnValueTypesDescription
source: For value types, the inherited implementation of Equals uses the Reflection library and compares the contents of all fields. Reflection is computationally expensive, and comparing every field for equality might be unnecessary. If you expect users to compare or sort instances, or to use instances as hash table keys, your value type should implement Equals.
cs: Zděděná implementace Equals používá pro typy hodnot knihovnu reflexe a porovnává obsah všech polí. Reflexe je výpočetně náročná a porovnání rovnosti u každého pole může být zbytečné. Pokud očekáváte, že uživatelé budou porovnávat nebo řadit instance, nebo používat instance jako klíče zatřiďovací tabulky, měl by typ hodnoty implementovat Equals.
de: Für Werttypen verwendet die geerbte Implementierung von "Equals" die Reflektionsbibliothek und vergleicht die Inhalte aller Felder. Die Reflektion ist im Hinblick auf die Rechenleistung teuer, und der Vergleich sämtlicher Felder auf Übereinstimmung ist möglicherweise nicht erforderlich. Wenn Sie erwarten, dass Benutzer Instanzen vergleichen oder sortieren oder Instanzen als Hashtabellenschlüssel verwenden, sollte Ihr Werttyp "Equals" implementieren.
es: Para los tipos de valor, la implementación heredada de Equals usa la biblioteca de reflexiones y compara el contenido de todos los campos. El proceso de reflexión requiere un uso elevado de los recursos y puede que no sea necesario comparar cada campo para comprobar si hay igualdad. Si espera que los usuarios comparen las instancias o las ordenen, o bien que las usen como claves de tabla hash, el tipo de valor debe implementar Equals.
fr: Pour les types valeur, l'implémentation héritée de Equals utilise la bibliothèque Reflection et compare le contenu de tous les champs. L'utilisation de Reflection sollicite le processeur de manière intensive, et la comparaison de chaque champ à la recherche d'une égalité peut s'avérer inutile. Si les utilisateurs sont susceptibles de comparer ou de trier des instances, ou de les utiliser en tant que clés de table de hachage, votre type valeur doit implémenter Equals.
it: Per i tipi di valore l'implementazione ereditata di Equals usa la libreria Reflection e confronta il contenuto di tutti i campi. La libreria Reflection è onerosa dal punto di vista del calcolo; inoltre il confronto di ogni campo per determinarne l'uguaglianza potrebbe essere superfluo. Se si prevede che gli utenti confrontino o ordinino le istanze oppure le usino come chiavi di tabelle hash, il tipo valore deve implementare Equals.
ja: 値型の場合、Equals を継承した実装が Reflection ライブラリを使用して、すべてのフィールドの内容を比較します。Reflection は計算コストが高いため、場合によってはすべてのフィールドで等値性を比較する必要はありません。ユーザーがインスタンスの比較または並べ替えを行うことや、ハッシュ テーブル キーとしてインスタンスを使用することが予想される場合には、値型に Equals を実装する必要があります。
ko: 값 형식의 경우 Equals의 상속된 구현에서 리플렉션 라이브러리를 사용하고 모든 필드의 콘텐츠를 비교합니다. 리플렉션은 계산을 많이 해야 하는 작업이며 모든 필드가 같은지 비교할 필요가 없습니다. 사용자가 인스턴스를 비교 또는 정리하거나 해시 테이블 키로 인스턴스를 사용할 것으로 예상하는 경우 값 형식이 Equals를 구현해야 합니다.
pl: W przypadku typów wartości dziedziczona implementacja metody Equals używa biblioteki odbić i porównuje zawartość wszystkich pól. Odbicia wymagają kosztownych obliczeń, a porównywanie wszystkich pól pod kątem równości może być niepotrzebne. Jeśli oczekujesz, że użytkownicy będą porównywać lub sortować wystąpienia albo używać wystąpień jako kluczy tablicy skrótów, typ wartości powinien implementować metodę Equals.
pt_br: Para tipos de valor, a implementação herdada de Equals usa a Biblioteca de reflexão e compara o conteúdo de todos os campos. A reflexão é computacionalmente cara e comparar cada campo com relação a igualdade pode ser desnecessário. Se você espera que os usuários comparem ou classifiquem instâncias ou que usem instâncias como chaves de tabela de hash, seu tipo de valor deve implementar Equals.
ru: Для типов значений унаследованная реализация Equals использует библиотеку отражения и сравнивает содержимое всех полей. Отражение требует большого объема вычислений, и сравнение каждого поля на предмет равенства может не требоваться. Если вы ожидаете, что пользователи будут сравнивать или сортировать экземпляры либо использовать их в качестве ключей хэш-таблицы, ваш тип значения должен реализовывать Equals.
tr: Değer türleri için, devralınan Equals uygulaması Reflection kitaplığını kullanır ve tüm alanların içeriğini karşılaştırır. Reflection, çok işlem kaynağı gerektirir ve tüm alanların eşit olup olmadığının karşılaştırılması gereksiz olabilir. Kullanıcıların örnekleri karşılaştırmasını veya sıralamasını ya da karma tablo anahtarları olarak kullanmasını bekliyorsanız değer türünüz Equals uygulamalıdır.
zh_hans: 对于值类型，Equals 的继承实现使用反射库，并比较所有字段的内容。计算反射价格昂贵，而比较每个字段是否相等可能并无必要。如果希望用户对实例进行比较或排序，或将实例用作哈希表键，则值类型应实现 Equals。
zh_hant: 對於實值型別而言，Equals 的繼承實作會使用反映庫，並會比較所有欄位的內容。反映相當耗費運算資源，而且可能不需要比較每個欄位是否相等。若希望使用者比較或排序執行個體，或是將執行個體用作為雜湊資料表索引鍵，則您的實值型別應實作 Equals。

# OverrideEqualsAndOperatorEqualsOnValueTypesMessageEquals
source: {0} should override Equals
cs: {0} má přepsat Equals.
de: "{0}" muss "Equals" außer Kraft setzen.
es: {0} debe reemplazar Equals.
fr: {0} doit remplacer Equals
it: {0} deve eseguire l'override di Equals
ko: {0}은(는) Equals를 재정의해야 합니다.
pl: Typ {0} powinien przesłaniać metodę Equals
pt_br: {0} deve substituir Equals
ru: {0} должен переопределить метод Equals.
tr: {0}, Equals’ı geçersiz kılmalıdır
zh_hans: {0} 应重写 Equals
zh_hant: {0} 應該覆寫 Equals

# OverrideEqualsAndOperatorEqualsOnValueTypesMessageOpEquality
source: {0} should override the equality (==) and inequality (!=) operators
cs: {0} má přepsat operátory rovnosti (==) a nerovnosti (!=).
de: "{0}" muss die Operatoren für Gleichheit (==) und Ungleichheit (!=) außer Kraft setzen.
es: {0} debe reemplazar los operadores de igualdad (==) y desigualdad (!=).
fr: {0} doit remplacer les opérateurs d'égalité (==) et d'inégalité (!=)
it: {0} deve eseguire l'override degli operatori di uguaglianza (==) e disuguaglianza (!=)
ko: {0}은(는) 같음(==) 및 같지 않음(!=) 연산자를 재정의해야 합니다.
pl: Typ {0} powinien przesłaniać operatory równości (==) i nierówności (!=)
pt_br: {0} deve substituir os operadores de igualdade (==) e de desigualdade (!=)
ru: {0} должен переопределить операторы равенства (==) и неравенства (!=).
tr: {0}, eşitlik (==) ve eşitsizlik (!=) işleçlerini geçersiz kılmalıdır
zh_hans: {0} 应重写相等(==)和不相等(!=)运算符
zh_hant: {0} 應該覆寫等號比較運算子 (==) 以及不等比較運算子 (!=)

# PropertiesShouldNotReturnArraysTitle
source: Properties should not return arrays
cs: Vlastnosti nemají vracet pole.
de: Eigenschaften dürfen keine Arrays zurückgeben
es: Las propiedades no deben devolver matrices
fr: Les propriétés ne doivent pas retourner de tableaux
it: Le proprietà non devono restituire matrici
ja: プロパティは配列を返すことはできません
ko: 속성은 배열을 반환하지 않아야 합니다.
pl: Właściwości nie powinny zwracać tablic
pt_br: As propriedades não devem retornar matrizes
ru: Свойства не должны возвращать массивы
tr: Özellikler dizi döndürmemelidir
zh_hans: 属性不应返回数组
zh_hant: 屬性不應傳回陣列

# PropertiesShouldNotReturnArraysDescription
source: Arrays that are returned by properties are not write-protected, even when the property is read-only. To keep the array tamper-proof, the property must return a copy of the array. Typically, users will not understand the adverse performance implications of calling such a property.
cs: Pole, která jsou vracena vlastnostmi, nejsou chráněná proti zápisu, i když je vlastnost určená jen pro čtení. Aby se pole nedalo zfalšovat, musí vlastnost vracet kopii tohoto pole. Uživatelé zpravidla neporozumí nepříznivým výkonovým aspektům, které má volání takové vlastnosti.
de: Von Eigenschaften zurückgegebene Arrays sind auch dann nicht schreibgeschützt, wenn die Eigenschaft schreibgeschützt ist. Um das Array vor unbefugter Bearbeitung zu schützen, muss die Eigenschaft eine Kopie des Arrays zurückgeben. In der Regel sind Benutzer sich der Leistungsbeeinträchtigungen nicht bewusst, die durch den Aufruf einer solchen Eigenschaft entstehen.
es: Las matrices que devuelven las propiedades no están protegidas contra escritura, aun cuando la propiedad es de solo lectura. Para mantener la matriz a prueba de alteraciones, la propiedad debe devolver una copia de la matriz. Por lo general, los usuarios no entienden las implicaciones de rendimiento adversas que se originan al llamar a este tipo de propiedad.
fr: Les tableaux retournés par les propriétés ne sont pas protégés en écriture, même si la propriété est en lecture seule. Pour protéger le tableau de toute falsification, la propriété doit retourner une copie du tableau. En général, les utilisateurs ne comprennent pas l'incidence négative de l'appel d'une telle propriété sur les performances.
it: Le matrici restituite dalle proprietà non sono protette da scrittura, anche se la proprietà è di sola lettura. Per proteggere la matrice da eventuali alterazioni, la proprietà deve restituire una copia della matrice. Gli utenti non comprendono in genere le implicazioni negative sulle prestazioni derivanti dalla chiamata di una tale proprietà.
ja: プロパティが読み取り専用であっても、プロパティで返される配列は書き込み禁止ではありません。配列の改ざんを防ぐには、プロパティで配列のコピーを返す必要があります。一般に、このようなプロパティを呼び出すときのパフォーマンス低下は理解されません。
ko: 속성이 반환하는 배열은 이 속성이 읽기 전용인 경우에도 쓰기가 금지되지 않습니다. 배열이 변조되는 것을 방지하려면 속성이 배열의 복사본을 반환해야 합니다. 일반적으로 사용자는 이러한 속성의 호출로 인해 발생하는 성능 저하를 이해하지 못합니다.
pl: Tablice zwracane przez właściwości nie są chronione przed zapisem, nawet jeśli właściwość jest dostępna tylko do odczytu. Aby uniemożliwić naruszenie tablicy, właściwość musi zwracać jej kopię. Zazwyczaj użytkownicy nie rozumieją negatywnego wpływu na wydajność, jaki ma wywoływanie takiej właściwości.
pt_br: Matrizes retornadas por propriedades não são protegidas contra gravação, mesmo quando a propriedade é somente leitura. Para manter a matriz à prova de adulteração, a propriedade deve retornar uma cópia da matriz. Normalmente, os usuários não entenderão as implicações de desempenho adversas de chamar essa propriedade.
ru: Возвращаемый свойствами массивы не защищены от записи, даже если свойство доступно только для чтения. Чтобы предотвратить незаконное изменение массива, свойство должно возвращать копию массива. Обычно пользователи не осознают, какое негативное влияние на производительность оказывает вызов такого свойства.
tr: Özellikler tarafından döndürülen diziler, özellik salt okunur olsa bile yazma korumalı olmaz. Dizilerle oynanmasının engellenmesi için özellik, dizinin bir kopyasını döndürmelidir. Genellikle kullanıcılar böyle bir özelliği çağırmanın performans üzerindeki olumsuz etkilerini anlamaz.
zh_hans: 即使属性为只读时，由属性返回的数组也没有写保护。为了防止篡改数组，属性必须返回数组的副本。通常，用户不会理解调用这种属性所产生的不利性能影响。
zh_hant: 即使屬性是唯讀屬性，屬性會傳回的陣列也不會受到防寫保護。為避免陣列遭他人竄改，屬性必須傳回陣列的複本。一般而言，使用者不了解呼叫這類屬性所造成的不良效能影響。

# PropertiesShouldNotReturnArraysMessage
source: Properties should not return arrays
cs: Vlastnosti nemají vracet pole.
de: Eigenschaften dürfen keine Arrays zurückgeben
es: Las propiedades no deben devolver matrices
fr: Les propriétés ne doivent pas retourner de tableaux
it: Le proprietà non devono restituire matrici
ja: プロパティは配列を返すことはできません
ko: 속성은 배열을 반환하지 않아야 합니다.
pl: Właściwości nie powinny zwracać tablic
pt_br: As propriedades não devem retornar matrizes
ru: Свойства не должны возвращать массивы
tr: Özellikler dizi döndürmemelidir
zh_hans: 属性不应返回数组
zh_hant: 屬性不應傳回陣列

# OverrideGetHashCodeOnOverridingEqualsTitle
source: Override GetHashCode on overriding Equals
cs: Přepište GetHashCode při přepisu Equals.
de: GetHashCode beim Außerkraftsetzen von "Equals" außer Kraft setzen
es: Reemplazar GetHashCode al reemplazar Equals
fr: Remplacer GetHashCode au moment de remplacer Equals
it: Eseguire l'override di GetHashCode durante l'override di Equals
ja: オーバーライドする Equals で GetHashCode をオーバーライドします
ko: Equals를 재정의할 때 GetHashCode를 재정의하세요.
pl: Przesłoń metodę GetHashCode przy przesłanianiu metody Equals
pt_br: Substituir GetHashCode ao substituir Equals
ru: Переопределите GetHashCode при переопределении Equals
tr: Equals geçersiz kılındığında GetHashCode’u geçersiz kılın
zh_hans: 重写 Equals 时重写 GetHashCode
zh_hant: 覆寫 Equals 時覆寫 GetHashCode
