Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotDeclareStaticMembersOnGenericTypesDescription
source: When a static member of a generic type is called, the type argument must be specified for the type. When a generic instance member that does not support inference is called, the type argument must be specified for the member. In these two cases, the syntax for specifying the type argument is different and easily confused.
cs: Při volání statického člena obecného typu musí být pro tento typ zadaný argument typu. Při volání člena obecné instance, který nepodporuje rozhraní, musí být pro tohoto člena zadaný argument typu. Syntaxe pro zadání argumentu typu je v těchto dvou případech odlišná a snadno se zaměňuje.
de: Wenn ein statischer Member eines generischen Typs aufgerufen wird, muss das Typargument für den Typ angegeben werden. Wenn ein generischer Instanzmember aufgerufen wird, der keinen Rückschluss unterstützt, muss das Typargument für den Member angegeben werden. In diesen beiden Fällen gilt eine unterschiedliche Syntax für die Angabe des Typarguments, die leicht verwechselt wird.
es: Cuando se llama a un miembro static de un tipo genérico, se debe especificar el argumento de tipo correspondiente a ese tipo. Cuando se llama a un miembro de instancia genérico que no admite la inferencia, se debe especificar el argumento de tipo para el miembro. La sintaxis para especificar el argumento de tipo en ambos casos es diferente y resulta fácil confundirse.
fr: Quand un membre statique d'un type générique est appelé, l'argument de type doit être spécifié pour le type. Quand un membre d'instance générique qui ne prend pas en charge l'inférence est appelé, l'argument de type doit être spécifié pour le membre. Dans ces deux cas, la syntaxe permettant de spécifier l'argument de type est différente et facile à confondre.
it: Quando viene chiamato un membro statico di un tipo generico, è necessario specificare l'argomento tipo per il tipo. Quando viene chiamato un membro di istanza generico che non supporta l'inferenza, è necessario specificare l'argomento tipo per il membro. In questi due casi, la sintassi per specificare l'argomento tipo è diversa e può facilmente generare confusione.
ja: ジェネリック型の静的メンバーを呼び出すときには、その型の型引数も指定する必要があります。推論をサポートしない汎用インスタンス メンバーが呼び出されるときに、そのメンバーに型引数を指定する必要があります。この 2 つのケースでは、型引数を指定するための構文は異なりますが、混同されることがあります。
ko: 제네릭 형식의 정적 멤버가 호출되면 해당 형식에 대한 형식 인수를 지정해야 합니다. 유추를 지원하지 않는 제네릭 인스턴스 멤버가 호출되면 해당 멤버에 대한 형식 인수를 지정해야 합니다. 이 두 가지 경우에서 형식 인수를 지정하기 위한 구문은 다양하며 혼동되기 쉽습니다.
pl: Gdy jest wywoływany statyczny element członkowski typu ogólnego, dla tego typu musi być określony argument typu. Gdy jest wywoływany ogólny element członkowski wystąpienia nieobsługujący wnioskowania, dla tego elementu członkowskiego musi być określony argument typu. W tych dwóch przypadkach składnie określania argumentu typu są różne i można je łatwo pomylić.
pt_br: Quando um membro estático de um tipo genérico for chamado, o argumento de tipo deverá ser especificado para o tipo. Quando um membro de instância genérica que não dá suporte a inferência for chamado, o argumento de tipo deverá ser especificado para o membro. Nesses dois casos, a sintaxe para especificar o argumento de tipo é diferente e facilmente confundida.
ru: При вызове статического члена универсального типа требуется указать аргумент типа для типа. При вызове члена универсального экземпляра, не поддерживающего вывод, требуется указать аргумент типа для члена. В этих двух случаях синтаксис для указания аргумента типа различается, и его легко перепутать.
tr: Genel bir türün statik bir üyesi çağrıldığında, tür için tür bağımsız değişkeni belirtilmelidir. Çıkarımı desteklemeyen bir genel örnek üyesi çağrıldığında, üye için tür bağımsız değişkeni belirtilmelidir. Bu iki durumda, tür bağımsız değişkenini belirtmeye yönelik söz dizimi farklıdır ve kolayca karıştırılabilir.
zh_hans: 调用泛型类型的静态成员时，必须为该类型指定类型参数。调用不支持推断的泛型实例成员时，必须为该成员指定类型参数。在这两种情况下，用于指定类型参数的语法不同且容易混淆。
zh_hant: 呼叫泛型型別的靜態成員時，必須為類型指定型別引數。呼叫了不支援介面的泛型執行個體成員時，必須為成員指定型別引數。在上述兩種情況下，指定型別引數的語法不同且容易混淆。

# DoNotDeclareStaticMembersOnGenericTypesMessage
source: Do not declare static members on generic types
cs: Nedeklarujte statické členy u obecných typů.
de: Statische Member nicht in generischen Typen deklarieren
es: No declarar miembros estáticos en tipos genéricos
fr: Ne pas déclarer de membres comme étant static sur les types génériques
it: Non dichiarare membri statici su tipi generici
ja: ジェネリック型の静的メンバーを宣言しません
ko: 제네릭 형식에서 정적 멤버를 선언하지 마세요.
pl: Nie deklaruj statycznych elementów członkowskich dla typów ogólnych
pt_br: Não declarar membros estáticos em tipos genéricos
ru: Не объявляйте статические члены в универсальных типах
tr: Genel türlerde statik üyeler bildirmeyin
zh_hans: 不要在泛型类型中声明静态成员
zh_hant: 請勿在泛型型別上宣告靜態成員

# CollectionsShouldImplementGenericInterfaceTitle
source: Generic interface should also be implemented
cs: Mělo by se také implementovat obecné rozhraní
de: Die generische Schnittstelle muss ebenfalls implementiert werden.
es: La interfaz genérica también debe implementarse
fr: Une interface générique doit également être implémentée
it: È necessario implementare anche l'interfaccia generica
ja: ジェネリック インターフェイスも実装する必要があります
ko: 제네릭 인터페이스도 구현해야 합니다.
pl: Interfejs ogólny powinien być także zaimplementowany
pt_br: A interface genérica também deve ser implementada
ru: Также необходимо реализовать универсальный интерфейс
tr: Genel arabirim de uygulanmalıdır
zh_hans: 还应实现泛型接口
zh_hant: 應同時實作一般介面

# CollectionsShouldImplementGenericInterfaceDescription
source: To broaden the usability of a type, implement one of the generic interfaces. This is especially true for collections as they can then be used to populate generic collection types.
cs: Jestli chcete rozšířit použitelnost typu, implementujte jedno z obecných rozhraní. To platí především pro kolekce, protože se pak dají použít k naplnění obecných typů kolekce.
de: Implementieren Sie eine der generischen Schnittstellen, um die Einsatzmöglichkeiten eines Typs zu erweitern. Dies gilt insbesondere für Sammlungen, weil sie dann zum Auffüllen generischer Sammlungstypen verwendet werden können.
es: Para ampliar la capacidad de uso de un tipo, implemente alguna de las interfaces genéricas, especialmente con las colecciones, porque así se pueden usar para rellenar tipos de colección genéricos.
fr: Pour étendre l'efficacité d'utilisation d'un type, implémentez l'une des interfaces génériques. Cela est particulièrement vrai pour les collections, car elles peuvent ensuite être utilisées pour remplir les types de collection génériques.
it: Per ampliare l'usabilità di un tipo, implementare una delle interfacce generiche. Questa soluzione è particolarmente valida per le raccolte perché possono quindi essere usate per popolare tipi di raccolta generici.
ja: 型の操作性を拡充するには、ジェネリック インターフェイスの 1 つを実装します。これは特にコレクションの場合に有効です。これらを使用してジェネリック コレクション型にデータを設定できるようになるためです。
ko: 형식의 유용성을 확대하려면 제네릭 인터페이스 중 하나를 구현하세요. 제네릭 컬렉션 형식을 채우는 데 사용할 수 있는 컬렉션의 경우에는 특히 그렇습니다.
pl: Aby rozszerzyć przydatność typu, zaimplementuj jeden z interfejsów ogólnych. Jest to szczególnie prawdziwe w przypadku kolekcji, które można następnie wykorzystać do wypełniania ogólnych typów kolekcji.
pt_br: Para ampliar a usabilidade de um tipo, implemente uma das interfaces genéricas. Isso é especialmente verdadeiro para coleções, pois elas podem ser usadas para preencher tipos de coleção genéricos.
ru: Чтобы расширить использование типа, реализуйте один из универсальных интерфейсов. Это особенно важно для коллекций, так как в этом случае их можно использовать для заполнения универсальных типов коллекций.
tr: Bir türün kullanılabilirliğini genişletmek için genel arabirimlerden birini uygulayın. Bu arabirimler daha sonra genel koleksiyon türlerini doldurmak için kullanılabileceğinden bu durum özellikle koleksiyonlar için geçerlidir.
zh_hans: 若要扩大类型的可用性，请实现其中一个泛型接口。对于集合尤其如此，因为它们随后可用于填充泛型集合类型。
zh_hant: 若要擴大類型的可用性，請實作其中一個一般介面。這項做法特別適用於集合，原因是可以讓集合用於填入一般集合類型。

# CollectionsShouldImplementGenericInterfaceMessage
source: Type '{0}' directly or indirectly inherits '{1}' without implementing '{2}'. Publicly-visible types should implement the generic version to broaden usability.
cs: Typ {0} přímo nebo nepřímo dědí {1} bez implementace {2}. Veřejně viditelné typy by kvůli větší využitelnosti měly implementovat obecnou verzi.
de: Der Typ "{0}" erbt "{1}" direkt oder indirekt ohne Implementierung von "{2}". Öffentlich sichtbare Typen müssen die generische Version implementieren, um die Nutzbarkeit zu erweitern.
es: El tipo "{0}" hereda "{1}" de manera directa o indirecta sin implementar "{2}". Los tipos visibles públicamente deben implementar la versión genérica para ampliar su capacidad de uso.
fr: Le type '{0}' hérite directement ou indirectement de '{1}' sans implémenter '{2}'. Les types visibles de manière publique doivent implémenter la version générique pour étendre leur efficacité d'utilisation.
it: Il tipo '{0}' eredita in modo diretto o indiretto '{1}' senza implementare '{2}'. Per ampliare l'usabilità, i tipi visibili pubblicamente devono implementare la versione generica.
ja: 型 '{0}' は、'{2}' を実装することなく '{1}' を直接または間接的に継承します。公開されている型は、操作性の拡充のためジェネリック バージョンを実装する必要があります。
ko: 형식 '{0}'은(는) '{2}'을(를) 구현하지 않고 직접 또는 간접적으로 '{1}'을(를) 상속합니다. 공개된 형식의 유용성을 확대하려면 제네릭 버전을 구현해야 합니다.
pl: Typ „{0}” bezpośrednio lub pośrednio dziedziczy element „{1}” bez implementowania elementu „{2}”. Typy widoczne publicznie powinny dziedziczyć wersję ogólną w celu rozszerzenia użyteczności.
pt_br: O tipo '{0}' herda diretamente ou indiretamente '{1}' sem implementar '{2}'. Os tipos visíveis publicamente devem implementar a versão genérica para ampliar a usabilidade.
ru: Тип "{0}" прямо или косвенно наследует "{1}" без реализации "{2}". Общедоступные типы должны реализовывать универсальную версию для более широкого использования.
tr: '{0}' türü, '{2}' uygulamaksızın doğrudan veya dolaylı olarak şunu devralır: '{1}'. Genel olarak görülebilir türler, kullanılabilirliği genişletmek için genel sürümü uygulamalıdır.
zh_hans: 类型“{0}”直接或间接继承“{1}”，而不实现“{2}”。公共可见的类型应实现通用版本以扩大可用性。
zh_hant: 類型 '{0}' 未實作 '{2}' 便直接或間接繼承 '{1}'。公開顯示的類型應實作一般版本以擴大可用性。

# EnumStorageShouldBeInt32Title
source: Enum Storage should be Int32
cs: Úložiště výčtu má být typu Int32.
de: Enumerationsspeicher muss Int32 sein
es: El almacenamiento de la enumeración debe ser de tipo Int32
fr: Le stockage d'enum doit être de type Int32
it: Le risorse di archiviazione dell'enumerazione devono essere Int32
ja: 列挙ストレージは Int32 でなければなりません
ko: 열거형 스토리지는 Int32여야 합니다
pl: Wyliczenia powinny być przechowywane jako typ Int32
pt_br: Enum Storage deve ser Int32
ru: Хранилище перечислений должно относиться к типу Int32
tr: Sabit Listesi Depolama Alanı Int32 olmalıdır
zh_hans: 枚举存储应为 Int32
zh_hant: 列舉儲存體應為 Int32

# EnumStorageShouldBeInt32Description
source: An enumeration is a value type that defines a set of related named constants. By default, the System.Int32 data type is used to store the constant value. Although you can change this underlying type, it is not required or recommended for most scenarios.
cs: Výčet je typ hodnoty, který definuje sadu souvisejících pojmenovaných konstant. K uložení konstantní hodnoty se standardně používá datový typ System.Int32. Přestože tento podkladový typ můžete změnit, ve většině situací se to nevyžaduje ani nedoporučuje.
de: Eine Enumeration ist ein Werttyp, der eine Menge von verwandten benannten Konstanten definiert. Standardmäßig wird der Datentyp "System.Int32" zum Speichern des Konstantenwerts verwendet. Dieser zugrunde liegende Typ kann zwar geändert werden, aber dies ist für die meisten Szenarien weder erforderlich noch empfehlenswert.
es: Una enumeración es un tipo de valor que define un conjunto de constantes con nombre relacionadas. De forma predeterminada, el tipo de datos System.Int32 se usa para almacenar el valor constante. Aunque puede cambiar este tipo subyacente, no es necesario ni se recomienda en la mayoría de los escenarios.
fr: Une énumération est un type valeur qui définit un ensemble de constantes nommées associées. Par défaut, le type de données System.Int32 sert à stocker la valeur de la constante. Bien que vous puissiez changer ce type sous-jacent, il n'est pas obligatoire ou recommandé dans la plupart des scénarios.
it: Un'enumerazione è un tipo valore che definisce un set di costanti denominate correlate. Per impostazione predefinita, per archiviare il valore della costante viene usato il tipo di dati System.Int32. Anche se è possibile modificare questo tipo sottostante, tale operazione non è necessaria né consigliata nella maggior parte degli scenari.
ja: 列挙型は、関連する一連の名前付き定数を定義する値型です。既定では、System.Int32 データ型は、定数値の格納に使用されます。この基になる型を変更することはできますが、ほとんどの場合、変更する必要はなく、また推奨もされません。
ko: 열거형은 관련된 명명된 상수의 집합을 정의하는 값 형식입니다. 기본적으로 상수 값을 저장하는 데 System.Int32 데이터 형식이 사용됩니다. 기본 형식을 변경할 수는 있지만 대부분의 시나리오에서 필요하거나 권장되는 작업이 아닙니다.
pl: Wyliczenie to typ wartości, który definiuje zestaw powiązanych stałych nazwanych. Domyślnie do przechowywania wartości stałej jest używany typ danych System.Int32. Można zmienić ten typ bazowy, ale nie jest to wymagane ani zalecane w większości scenariuszy.
pt_br: Uma enumeração é um tipo de valor que define um conjunto de constantes nomeadas relacionadas. Por padrão, o tipo de dados System.Int32 é usado para armazenar o valor da constante. Embora seja possível alterar esse tipo subjacente, não é necessário nem recomendável para a maioria dos cenários.
ru: Перечисление — это тип значения, определяющий набор связанных именованных констант. По умолчанию тип данных System.Int32 используется для хранения постоянного значения. Хотя вы можете изменить этот базовый тип, для большинства сценариев делать это не требуется или не рекомендуется.
tr: Sabit listesi, bir ilgili adlandırılmış sabitler kümesini tanımlayan bir değer türüdür. Sabit değerin depolanması için varsayılan olarak System.Int32 veri türü kullanılır. Bu temel türü değiştirebilirsiniz, ancak çoğu senaryoda bunu yapmanız gerekmez veya önerilmez.
zh_hans: 枚举是一种值类型，它定义一组相关的命名常量。默认情况下，System.Int32 数据类型用于存储常量值。虽然你可以更改此基础类型，但在大多情况下，不需要或不建议这样做。
zh_hant: 列舉是一種實值型別，用以定義一組相關的具名常數。根據預設，System.Int32 資料類型會用於儲存常數值。雖然您可變更此基礎類型，但大多數的情況下仍不需要或不建議進行變更。

# EnumStorageShouldBeInt32Message
source: If possible, make the underlying type of {0} System.Int32 instead of {1}
cs: Pokud je to možné, nastavte podkladový typ {0} na System.Int32 místo na {1}.
de: Legen Sie nach Möglichkeit den zugrunde liegenden Typ von "{0}" auf "System.Int32" statt auf "{1}" fest.
es: Si es posible, convierta el tipo subyacente de {0} en System.Int32 en lugar de {1}.
fr: Si possible, faites en sorte que le type sous-jacent de {0} soit System.Int32 au lieu de {1}
it: Se possibile, impostare System.Int32 come tipo sottostante di {0} invece di {1}
ko: 가능한 경우 {1} 대신 {0} System.Int32의 기본 형식을 만드세요.
pl: Jeśli to możliwe, zmień typ bazowy wyliczenia {0} na System.Int32 zamiast {1}
pt_br: Se possível, crie o tipo subjacente de {0} System.Int32 em vez de {1}
ru: По возможности используйте для {0} базовый тип System.Int32 вместо {1}.
tr: Mümkünse {0} temel türünü {1} yerine System.Int32 yapın
zh_hans: 如有可能，请将 {0} 的基础类型设为 System.Int32，而不是 {1}
zh_hant: 若是可能，請將 {0} 的基礎型別變更為 System.Int32，而非 {1}

# UseEventsWhereAppropriateTitle
source: Use events where appropriate
cs: Tam, kde je to vhodné, použijte události.
de: Nach Möglichkeit Ereignisse verwenden
es: Usar eventos cuando resulte apropiado
fr: Utiliser des événements quand cela est approprié
it: Usare gli eventi dove appropriato
ja: 適切な場所にイベントを使用します
ko: 적합한 이벤트를 사용하세요.
pl: Użyj zdarzeń w odpowiednich miejscach
pt_br: Usar eventos sempre que apropriado
ru: Используйте события, когда это уместно
tr: Uygun durumlarda olayları kullanın
zh_hans: 在适用处使用事件
zh_hant: 適當時機使用事件

# UseEventsWhereAppropriateDescription
source: This rule detects methods that have names that ordinarily would be used for events. If a method is called in response to a clearly defined state change, the method should be invoked by an event handler. Objects that call the method should raise events instead of calling the method directly.
cs: Toto pravidlo zjišťuje metody s názvy, které by se běžně použily pro události. Pokud se v odpovědi na jasně definovanou změnu stavu volá metoda, měla by být vyvolána obslužnou rutinou události. Objekty, které tuto metodu volají, by místo přímého volání metody měly vyvolávat události.
de: Diese Regel erkennt Methoden mit Namen, die normalerweise für Ereignisse verwendet werden. Wenn eine Methode als Reaktion auf eine klar definierte Statusänderung aufgerufen wird, muss die Methode durch einen Ereignishandler aufgerufen werden. Objekte, die die Methode aufrufen, müssen Ereignisse auslösen, statt die Methode direkt aufzurufen.
es: Esta regla detecta métodos que tienen nombres que normalmente se usarían para eventos. Si se llama a un método en respuesta a un cambio de estado claramente definido, un controlador de eventos debe invocar al método. Los objetos que llaman al método deben generar eventos en lugar de llamar al método directamente.
fr: Cette règle détecte les méthodes dont les noms sont généralement utilisés pour des événements. Si une méthode est appelée en réponse à un changement d'état défini de manière claire, la méthode doit être appelée par un gestionnaire d'événements. Les objets qui appellent la méthode doivent déclencher des événements au lieu d'appeler directement la méthode.
it: Questa regola rileva i metodi con nomi usati normalmente per gli eventi. Se si chiama un metodo in risposta a una modifica dello stato definita in modo chiaro, il metodo deve essere richiamato da un gestore eventi. Gli oggetti che chiamano il metodo devono generare eventi invece di chiamare il metodo direttamente.
ja: この規則では、通常はイベントに使用される名前の付いたメソッドを検出します。明示的に定義された状態変化に応答してメソッドが呼び出される場合、メソッドはイベント ハンドラーから呼び出す必要があります。メソッドを呼び出すオブジェクトは、メソッドを直接呼び出すのではなく、イベントを発生させる必要があります。
ko: 이 규칙은 일반적으로 이벤트에 사용되는 이름을 가진 메서드를 검색합니다. 명확하게 정의된 상태 변경에 대한 응답으로 메서드가 호출되는 경우 이벤트 처리기에서 호출되어야 합니다. 해당 메서드를 호출하는 개체는 메서드를 직접 호출하는 대신 이벤트를 발생시켜야 합니다.
pl: Ta reguła wykrywa metody z nazwami, które zwykle są używane dla zdarzeń. Jeśli metoda jest wywoływana w odpowiedzi na wyraźnie zdefiniowaną zmianę stanu, powinna być wywoływana przez procedurę obsługi zdarzeń. Obiekty wywołujące metodę powinny zgłaszać zdarzenia zamiast bezpośredniego wywoływania metody.
pt_br: Esta regra detecta métodos que têm nomes que seriam normalmente usados para eventos. Se um método for chamado em resposta a uma alteração de estado claramente definida, o método deverá ser invocado por um manipulador de eventos. Os objetos que chamam o método devem gerar eventos em vez de chamar o método diretamente.
ru: Это правило обнаруживает методы с именами, которые в общем случае использовались бы для событий. Если метод вызывается в ответ на четко определенное изменение состояния, его должен вызывать обработчик событий. Объекты, вызывающие этот метод, должны порождать события вместо вызова метода напрямую.
tr: Bu kural, normalde olaylar için kullanılan adlara sahip yöntemleri algılar. Açıkça tanımlanmış bir durum değişikliğine yanıt olarak bir yöntem çağrılırsa, yöntemin bir olay işleyicisi tarafından çağrılması gerekir. Yöntemi çağıran nesneler, yöntemi doğrudan çağırmak yerine olay tetiklemelidir.
zh_hans: 此规则检测具有通常用于事件的名称的方法。如果调用某一方法来响应明确定义的状态更改，此方法应由事件处理程序调用。调用方法的对象应引发事件，而不是直接调用方法。
zh_hant: 此規則會偵測具有事件常用名稱的方法。若方法因為要回應清楚定義的狀態變更而被呼叫，應由事件處理常式叫用該方法。呼叫方法的物件應該要引發事件，而非直接呼叫方法。

# UseEventsWhereAppropriateMessage
source: Consider making '{0}' an event
cs: Zvažte převedení {0} na událost.
de: Ziehen Sie in Betracht, "{0}" als Ereignis festzulegen.
es: Considere convertir "{0}" en un evento.
fr: Faites de '{0}' un événement
it: Provare a impostare '{0}' come evento
ko: '{0}'을(를) 이벤트로 만드는 것이 좋습니다.
pl: Rozważ przekształcenie metody „{0}” w zdarzenie
pt_br: Considere tornar '{0}' um evento
ru: Рекомендуется сделать "{0}" событием.
tr: '{0}' öğesini olaya dönüştürmeyi deneyin
zh_hans: 考虑将“{0}”设置为事件
zh_hant: 請考慮將 '{0}' 設為事件

# ImplementStandardExceptionConstructorsTitle
source: Implement standard exception constructors
cs: Implementujte standardní konstruktory výjimek.
de: Standardausnahmekonstruktoren implementieren
es: Implementar constructores de excepción estándar
fr: Implémenter des constructeurs d'exception standard
it: Implementare costruttori di eccezioni standard
ja: 標準例外コンストラクターを実装します
ko: 표준 예외 생성자를 구현하세요.
pl: Zaimplementuj standardowe konstruktory wyjątku
pt_br: Implementar construtores de exceção padrão
ru: Реализуйте стандартные конструкторы исключения
tr: Standart özel durum oluşturucuları uygulayın
zh_hans: 实现标准异常构造函数
zh_hant: 實作標準例外狀況建構函式

# ImplementStandardExceptionConstructorsDescription
source: Failure to provide the full set of constructors can make it difficult to correctly handle exceptions.
cs: Neúplná sada konstruktorů může znesnadnit správné ošetření výjimek.
de: Wenn nicht der gesamte Satz an Konstruktoren angegeben wird, kann dies zu Schwierigkeiten bei der korrekten Verarbeitung von Ausnahmen führen.
es: No proporcionar el conjunto completo de constructores puede dificultar el control correcto de las excepciones.
fr: Si vous ne fournissez pas le jeu complet de constructeurs, cela peut compliquer la prise en charge appropriée des exceptions.
it: Se non viene fornito il set completo di costruttori, può risultare difficile gestire correttamente le eccezioni.
ja: すべてのコンストラクターを指定できなかった場合、例外を正しく処理することが困難になる可能性があります。
ko: 생성자의 전체 집합을 제공하지 못하면 예외를 올바르게 처리하는 것이 어려울 수 있습니다.
pl: Jeśli pełny zestaw konstruktorów nie zostanie zdefiniowany, może to utrudnić poprawną obsługę wyjątków.
pt_br: A falha ao fornecer o conjunto completo de construtores pode dificultar a manipulação correta das exceções.
ru: Неспособность предоставить полный набор конструкторов может затруднить правильную обработку исключений.
tr: Oluşturucuların tam kümesinin sağlanmaması, özel durumların doğru bir şekilde işlenmesini zorlaştırabilir.
zh_hans: 未能提供完整的构造函数集会导致难以正确处理异常。
zh_hant: 無法提供整組的建構函式，有可能會導致難以正確地處理例外狀況。

# ImplementStandardExceptionConstructorsMessageMissingConstructor
source: Add the following constructor to {0}: {1}
cs: Přidejte k {0} následující konstruktor: {1}.
de: Fügen Sie "{0}" den folgenden Konstruktor hinzu: {1}.
es: Agregue el constructor siguiente a {0}: {1}.
fr: Ajoutez le constructeur suivant à {0} : {1}
it: Aggiungere il costruttore seguente a {0}: {1}
ko: {1} 생성자를 {0}에 추가하세요.
pl: Dodaj następujący konstruktor do elementu {0}: {1}
pt_br: Adicione o construtor a seguir para {0}: {1}
ru: Добавьте в {0} следующий конструктор: {1}
tr: {0} öğesine şu oluşturucuyu ekleyin: {1}
zh_hans: 将下列构造函数添加到 {0}: {1}
zh_hant: 將下列建構函式新增至 {0}: {1}

# NestedTypesShouldNotBeVisibleTitle
source: Nested types should not be visible
cs: Vnořené typy nemají být viditelné.
de: Geschachtelte Typen dürfen nicht sichtbar sein
es: Los tipos anidados no deben ser visibles
fr: Les types imbriqués ne doivent pas être visibles
it: I tipi nidificati non devono essere visibili
ja: 入れ子にされた型を参照可能にすることはできません
ko: 중첩 형식을 표시하지 않아야 합니다.
pl: Typy zagnieżdżone nie powinny być widoczne
pt_br: Tipos aninhados não devem ser visíveis
ru: Вложенные типы не должны быть видимыми
tr: İç içe türler görünür olmamalıdır
zh_hans: 嵌套类型应不可见
zh_hant: 巢狀型別不應可見
