Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NestedTypesShouldNotBeVisibleDescription
source: A nested type is a type that is declared in the scope of another type. Nested types are useful to encapsulate private implementation details of the containing type. Used for this purpose, nested types should not be externally visible.
cs: Vnořený typ je typ, který je deklarovaný v oboru jiného typu. Vnořené typy se používají k zapouzdření privátních podrobností implementace obsahujícího typu. Pokud se vnořené typy používají k tomuto účelu, neměly by být externě viditelné.
de: Ein geschachtelter Typ ist ein Typ, der im Geltungsbereich eines anderen Typs deklariert wird. Geschachtelte Typen sind hilfreich, um private Implementierungsdetails des enthaltenden Typs zu kapseln. Wenn sie zu diesem Zweck verwendet werden, dürfen geschachtelte Typen nicht extern sichtbar sein.
es: Un tipo anidado es un tipo declarado dentro del ámbito de otro tipo. Los tipos anidados son útiles para encapsular los detalles de la implementación privada del tipo contenedor. Si se usan para este fin, los tipos anidados no deben ser visibles externamente.
fr: Un type imbriqué est un type déclaré dans la portée d'un autre type. Les types imbriqués permettent d'encapsuler les détails de l'implémentation privée du type conteneur. Utilisés à cette fin, les types imbriqués ne doivent pas être visibles de manière externe.
it: Un tipo nidificato è un tipo dichiarato nell'ambito di un altro tipo. I tipi nidificati sono utili per incapsulare i dettagli dell'implementazione privata del tipo contenitore. I tipi nidificati usati per questo scopo non devono essere visibili esternamente.
ja: 入れ子にされた型とは、別の型のスコープ内で宣言された型のことです。入れ子にされた型は、それを含む型のプライベート実装の詳細をカプセル化するときに便利です。このような用途のため、入れ子にされた型は外部から参照できないようにします。
ko: 중첩 형식은 다른 형식의 범위에서 선언된 형식입니다. 중첩 형식은 포함하는 형식의 프라이빗 구현 세부 정보를 캡슐화하는 데 유용합니다. 이러한 용도로 사용되는 중첩 형식은 외부에 표시하지 않아야 합니다.
pl: Typ zagnieżdżony to typ zadeklarowany w zakresie innego typu. Typy zagnieżdżone są przydatne do hermetyzowania prywatnych szczegółów implementacji zawierającego typu. Typy zagnieżdżone użyte do tego celu nie powinny być widoczne zewnętrznie.
pt_br: Um tipo aninhado é um tipo declarado no escopo de outro tipo. Os tipos aninhados são úteis para encapsular detalhes de implementação privada do tipo recipiente. Usados para essa finalidade, os tipos aninhados não devem ser visíveis externamente.
ru: Вложенным является тип, объявленный в области другого типа. Вложенные типы удобны для инкапсуляции сведений о закрытой реализации для содержащего типа. Применяемые для этого вложенные типы не должны быть видимы снаружи.
tr: İç içe tür, başka bir türün kapsamında belirtilen bir türdür. İç içe türler, kendilerini barındıran türlerin özel uygulama ayrıntılarını kapsüllemek için kullanışlıdır. Bu amaç için kullanılan iç içe türler dışarıdan görünmemelidir.
zh_hans: 嵌套类型是在另一种类型的范围内声明的类型。嵌套类型对于封装包含类型的私有实现详细信息非常有用。出于此目的，嵌套类型不应在外部可见。
zh_hant: 巢狀型別是在其他類型的範圍內宣告之類型。巢狀型別可用於封裝包含型別的私用實作詳細資料。因為用途如此，所以巢狀型別不應為外部可見。

# NestedTypesShouldNotBeVisibleMessageDefault
source: Do not nest type {0}. Alternatively, change its accessibility so that it is not externally visible.
cs: Nevnořujte typ {0}. Alternativně změňte jeho přístupnost tak, aby nebyl externě viditelný.
de: Schachteln Sie nicht den Typ "{0}". Ändern Sie alternativ dazu seine Zugänglichkeit so, dass er nicht extern sichtbar ist.
es: No anide el tipo {0}. Como alternativa, cambie su accesibilidad para que no esté visible externamente.
fr: N'imbriquez pas le type {0}. Vous pouvez aussi changer son accessibilité pour qu'il ne soit pas visible de manière externe.
it: Non annidare il tipo {0}. In alternativa, modificarne l'accessibilità in modo che non sia visibile esternamente.
ja: 型 {0} を入れ子にしないでください。外部から参照できなくするために、そのアクセシビリティを変更することもできます。
ko: {0} 형식을 중첩하지 마세요. 대신 형식이 외부에 표시되지 않도록 접근성을 변경하세요.
pl: Nie zagnieżdżaj typu {0}. Możesz też zmienić jego dostępność tak, aby nie był widoczny zewnętrznie.
pt_br: Não aninhe o tipo {0}. Alternativamente, altere a acessibilidade dele para que não seja visível externamente.
ru: Не делайте тип {0} вложенным. Вместо этого измените режим доступа к нему так, чтобы он не был виден снаружи.
tr: {0} türünü iç içe tür olarak kullanmayın. Alternatif olarak, erişilebilirliğini dışarıdan görünmeyecek şekilde değiştirin.
zh_hans: 不要嵌套类型 {0}。或者，更改其可访问性，使它在外部不可见。
zh_hant: 請勿將類型 {0} 巢狀化。或者，變更其存取範圍，使其非外部可見。

# NestedTypesShouldNotBeVisibleMessageVisualBasicModule
source: Do not nest type {0}. Alternatively, change its accessibility so that it is not externally visible. If this type is defined in a Visual Basic Module, it will be considered a nested type to other .NET languages. In that case, consider moving the type outside of the Module.
cs: Nevnořujte typ {0}. Alternativně změňte jeho přístupnost tak, aby nebyl externě viditelný. Pokud je tento typ definovaný v nějakém modulu Visual Basicu, budou ho jiné jazyky rozhraní .NET považovat za vnořený. V takovém případě zvažte přesunutí typu mimo tento modul.
de: Schachteln Sie nicht den Typ "{0}". Ändern Sie alternativ dazu seine Zugänglichkeit so, dass er nicht extern sichtbar ist. Wenn dieser Typ in einem Visual Basic-Modul definiert ist, wird er als geschachtelter Typ für andere .NET-Sprachen betrachtet. Ziehen Sie in diesem Fall in Erwägung, den Typ nach außerhalb des Moduls zu verschieben.
es: No anide el tipo {0}. Como alternativa, cambie su accesibilidad para que no esté visible externamente. Si este tipo está definido en un módulo de Visual Basic, se considerará un tipo anidado en otros lenguajes .NET. En ese caso, considere sacar el tipo del módulo.
fr: N'imbriquez pas le type {0}. Vous pouvez aussi changer son accessibilité pour qu'il ne soit pas visible de manière externe. Si ce type est défini dans un module Visual Basic, il est considéré comme un type imbriqué dans d'autres langages .NET. Dans ce cas, déplacez le type en dehors du module.
it: Non annidare il tipo {0}. In alternativa, modificarne l'accessibilità in modo che non sia visibile esternamente. Se questo tipo è definito in un modulo Visual Basic, verrà considerato come un tipo nidificato in altri linguaggi .NET. In tal caso, provare a spostare il tipo all'esterno del modulo.
ja: 型 {0} を入れ子にしないでください。外部から参照できなくするために、そのアクセシビリティを変更することもできます。この型は、Visual Basic モジュールで定義されている場合、他の .NET 言語への入れ子にされた型と見なされます。その場合、その型をモジュールの外部へ移動することを検討してください。
ko: {0} 형식을 중첩하지 마세요. 대신 형식이 외부에 표시되지 않도록 접근성을 변경하세요. 이 형식이 Visual Basic 모듈에 정의된 경우 다른 .NET 언어에 대해 중첩 형식으로 간주됩니다. 이 경우 형식을 모듈 외부로 이동하세요.
pl: Nie zagnieżdżaj typu {0}. Możesz też zmienić jego dostępność tak, aby nie był widoczny zewnętrznie. Jeśli ten typ jest zdefiniowany w module języka Visual Basic, będzie uznawany za typ zagnieżdżony przez inne języki .NET. W takim przypadku rozważ przeniesienie typu poza moduł.
pt_br: Não aninhe o tipo {0}. Alternativamente, altere a acessibilidade dele para que não seja visível externamente. Se este tipo for definido em um Módulo do Visual Basic, ele será considerado um tipo aninhado para outras linguagens .NET. Nesse caso, considere mover o tipo para fora do Módulo.
ru: Не делайте тип {0} вложенным. Вместо этого измените режим доступа к нему так, чтобы он не был виден снаружи. Если данный тип был определен в модуле Visual Basic, другими языками .NET он будет рассматриваться как вложенный тип. В этом случае рекомендуется переместить тип за пределы модуля.
tr: {0} türünü iç içe tür olarak kullanmayın. Alternatif olarak, erişilebilirliğini dışarıdan görünmeyecek şekilde değiştirin. Bu tür bir Visual Basic Modülünde tanımlanırsa, diğer .NET dilleri tarafından iç içe bir tür olarak değerlendirilir. Bu durumda, türü Modülün dışına taşımayı deneyin.
zh_hans: 不要嵌套类型 {0}。或者，更改其可访问性，使它在外部不可见。如果此类型是在 Visual Basic 模块中定义的，则其他 .NET 语言会将其视为嵌套类型。在这种情况下，请考虑将该类型移出 Visual Basic 模块。
zh_hant: 請勿將類型 {0} 巢狀化。或者，變更其存取範圍，使其非外部可見。若此類型定義於 Visual Basic 模組中，則其對於其他 .NET 語言而言會視作為巢狀型別。在這種情況下，請考慮將該類型移出模組。

# AvoidEmptyInterfacesTitle
source: Avoid empty interfaces
cs: Vyhněte se prázdným rozhraním.
de: Leere Schnittstellen vermeiden
es: Evitar interfaces vacías
fr: Éviter les interfaces vides
it: Evitare l'uso di interfacce vuote
ja: 空のインターフェイスは使用しません
ko: 빈 인터페이스를 사용하지 마세요.
pl: Unikaj pustych interfejsów
pt_br: Evitar interfaces vazias
ru: Не используйте пустые интерфейсы
tr: Boş arabirimler kullanmayın
zh_hans: 避免使用空接口
zh_hant: 避免空的介面

# AvoidEmptyInterfacesDescription
source: Interfaces define members that provide a behavior or usage contract. The functionality that is described by the interface can be adopted by any type, regardless of where the type appears in the inheritance hierarchy. A type implements an interface by providing implementations for the members of the interface. An empty interface does not define any members; therefore, it does not define a contract that can be implemented.
cs: Rozhraní definují členy poskytující kontrakt chování nebo použití. Funkčnost popsaná tímto rozhraním může být přijala jakýmkoli typem bez ohledu na to, kde v hierarchii dědičnosti se tento typ vyskytuje. Typ implementuje rozhraní poskytováním implementací pro členy tohoto rozhraní. Prázdné rozhraní nedefinuje žádné členy; nedefinuje proto kontrakt, který je možné implementovat.
de: Schnittstellen definieren Member, die einen Verhaltens- oder Nutzungsvertrag bereitstellen. Die durch die Schnittstelle beschriebene Funktionalität kann von jedem Typ übernommen werden, unabhängig von der Stelle in der Vererbungshierarchie, an der der Typ sich befindet. Ein Typ implementiert eine Schnittstelle, indem er Implementierungen für die Member der Schnittstelle bereitstellt. In einer leeren Schnittstelle sind keine Member definiert, und somit auch kein Vertrag, der implementiert werden kann.
es: Las interfaces definen miembros que proporcionan un contrato de uso o comportamiento. Cualquier tipo puede adoptar la funcionalidad descrita por la interfaz, sin tener en cuenta dónde aparece el tipo en la jerarquía de herencia. Para implementar una interfaz, un tipo proporciona implementaciones para los miembros de la interfaz. Una interfaz vacía no define ningún miembro, por lo tanto, no define ningún contrato que pueda implementarse.
fr: Les interfaces définissent les membres qui fournissent un comportement ou un contrat d'utilisation. Les fonctionnalités décrites par l'interface peuvent être adoptées par n'importe quel type, quelle que soit sa place dans la hiérarchie d'héritage. Un type implémente une interface en fournissant des implémentations pour les membres de celle-ci. Une interface vide ne définit aucun membre. Elle ne définit donc aucun contrat pouvant être implémenté.
it: Le interfacce definiscono membri che forniscono un comportamento o un contratto di utilizzo. La funzionalità descritta dall'interfaccia può essere adottata da qualsiasi tipo, indipendentemente dalla posizione del tipo nella gerarchia di ereditarietà. Un tipo implementa un'interfaccia fornendo implementazioni per i membri dell'interfaccia. Un'interfaccia vuota non definisce alcun membro. Di conseguenza, non definisce un contratto implementabile.
ja: インターフェイスは、動作や使用のコントラクトを提供するメンバーを定義します。インターフェイスで示される機能は、継承階層内に型が存在するかどうかにかかわらず、どの型からも適用できます。型ではインターフェイスのメンバーに実装を提供することで、インターフェイスが実装されます。空のインターフェイスではメンバーが定義されません。そのため、実装できるコントラクトも定義されません。
ko: 인터페이스는 동작 또는 사용 계약을 제공하는 멤버를 정의합니다. 인터페이스에서 설명하는 기능은 상속 계층 구조에서 형식이 표시되는 위치와 상관없이 모든 형식에서 적용할 수 있습니다. 형식은 인터페이스의 멤버에 대한 구현을 제공하여 인터페이스를 구현합니다. 빈 인터페이스는 멤버를 정의하지 않으므로 구현될 수 있는 계약을 정의하지 않습니다.
pl: Interfejsy definiują elementy członkowskie udostępniające kontrakt zachowania lub użycia. Funkcjonalność opisana przez interfejs może zostać zaadaptowana przez dowolny typ, niezależnie od miejsca występowania tego typu w hierarchii dziedziczenia. Typ implementuje interfejs przez udostępnienie implementacji dla elementów członkowskich interfejsu. Pusty interfejs nie definiuje żadnych elementów członkowskich, a zatem nie definiuje kontraktu, który można zaimplementować.
pt_br: As interfaces definem membros que fornecem um contrato de comportamento ou de uso. A funcionalidade descrita pela interface pode ser adotada por qualquer tipo, independentemente da posição em que o tipo aparece na hierarquia de herança. Um tipo implementa uma interface fornecendo implementações para os membros da interface. Uma interface vazia não define nenhum membro, portanto, ela não define um contrato que pode ser implementado.
ru: Интерфейсы определяют члены, предоставляющие поведение или контракт на использование. Описываемую интерфейсом функциональность может использовать любой тип, находящийся в любой части иерархии наследования. Тип реализует интерфейс, предоставляя реализации для членов интерфейса. Пустой интерфейс не определяет никакие члены, и поэтому он не определяет контракт, который можно реализовать.
tr: Arabirimler, bir davranış veya kullanım sözleşmesi sağlayan üyeler tanımlar. Arabirim tarafından açıklanan işlevsellik, devralma hiyerarşisinin neresinde göründüğünden bağımsız olarak herhangi bir tür tarafından devralınabilir. Bir tür, bir arabirimin üyeleri için uygulama sağlayarak arabirimi uygular. Boş bir arabirim herhangi bir üye tanımlamadığından, uygulanabilecek bir sözleşme tanımlamaz.
zh_hans: 接口定义提供行为或使用协定的成员。接口所描述的功能可由任何类型采用，而不管该类型在继承层次结构中的何处出现。类型通过提供接口成员的实现来实现接口。空接口不定义任何成员；因此，它不定义可以实现的协定。
zh_hant: 介面是用以定義提供行為或使用合約的成員。不論類型出現在繼承階層中的何處，介面所描述的功能皆可供所有類型採用。類型會實作介面，方法是提供介面成員的實作。空的介面不會定義任何成員，因此也不會定義能夠實作的合約。

# AvoidEmptyInterfacesMessage
source: Avoid empty interfaces
cs: Vyhněte se prázdným rozhraním.
de: Leere Schnittstellen vermeiden
es: Evitar interfaces vacías
fr: Éviter les interfaces vides
it: Evitare l'uso di interfacce vuote
ja: 空のインターフェイスは使用しません
ko: 빈 인터페이스를 사용하지 마세요.
pl: Unikaj pustych interfejsów
pt_br: Evitar interfaces vazias
ru: Не используйте пустые интерфейсы
tr: Boş arabirimler kullanmayın
zh_hans: 避免使用空接口
zh_hant: 避免空的介面

# ProvideObsoleteAttributeMessageTitle
source: Provide ObsoleteAttribute message
cs: Zadejte zprávu ObsoleteAttribute.
de: ObsoleteAttribute-Meldung bereitstellen
es: Proporcionar un mensaje ObsoleteAttribute
fr: Fournir un message ObsoleteAttribute
it: Fornire il messaggio per ObsoleteAttribute
ja: ObsoleteAttribute メッセージを指定します
ko: ObsoleteAttribute 메시지를 제공하세요.
pl: Określ komunikat dla atrybutu ObsoleteAttribute
pt_br: Fornecer a mensagem ObsoleteAttribute
ru: Укажите сообщение ObsoleteAttribute
tr: ObsoleteAttribute iletisi sağlayın
zh_hans: 提供 ObsoleteAttribute 消息
zh_hant: 提供 ObsoleteAttribute 訊息

# ProvideObsoleteAttributeMessageDescription
source: A type or member is marked by using a System.ObsoleteAttribute attribute that does not have its ObsoleteAttribute.Message property specified. When a type or member that is marked by using ObsoleteAttribute is compiled, the Message property of the attribute is displayed. This gives the user information about the obsolete type or member.
cs: Typ nebo člen je označený atributem System.ObsoleteAttribute, u kterého není zadaná vlastnost ObsoleteAttribute.Message. Když se typ nebo člen označený atributem ObsoleteAttribute zkompiluje, zobrazí se vlastnost Message tohoto atributu. Uživatel je tak informován o zastaralém typu nebo členovi.
de: Ein Typ oder ein Member wird anhand eines System.ObsoleteAttribute-Attributs markiert, dessen ObsoleteAttribute.Message-Eigenschaft nicht angegeben ist. Wenn ein mit dem ObsoleteAttribute markierter Typ oder Member kompiliert wird, wird die Message-Eigenschaft des Attributs angezeigt. So erhält der Benutzer Informationen zum veralteten Typ oder Member.
es: Un tipo o miembro se marca mediante un atributo System.ObsoleteAttribute para el que no se ha especificado la propiedad ObsoleteAttribute.Message. Cuando se compila un tipo o un miembro marcado con ObsoleteAttribute, se muestra la propiedad Message del atributo. Esto proporciona información al usuario sobre el miembro o tipo obsoleto.
fr: Un type ou un membre est marqué à l'aide d'un attribut System.ObsoleteAttribute dont la propriété ObsoleteAttribute.Message n'est pas spécifiée. Quand un type ou un membre marqué à l'aide de ObsoleteAttribute est compilé, la propriété Message de l'attribut s'affiche. Cela fournit à l'utilisateur des informations sur le type ou le membre obsolète.
it: Un tipo o un membro viene contrassegnato con un attributo System.ObsoleteAttribute per il quale non è stata specificata la proprietà ObsoleteAttribute.Message. Quando si compila un membro o un tipo contrassegnato usando ObsoleteAttribute, viene visualizzata la proprietà Message dell'attributo. In questo modo vengono fornite le informazioni utente sul tipo o sul membro obsoleto.
ja: 型またはメンバーが System.ObsoleteAttribute 属性でマークされていますが、この属性では ObsoleteAttribute.Message プロパティが指定されていません。ObsoleteAttribute でマークされている型またはメンバーをコンパイルすると、属性の Message プロパティが表示されます。これにより、古いの型またはメンバーに関する情報がユーザーに表示されます。
ko: 형식 또는 멤버가 지정된 ObsoleteAttribute.Message 속성이 없는 System.ObsoleteAttribute 특성을 사용하여 표시됩니다. ObsoleteAttribute를 사용하여 표시된 형식 또는 멤버가 컴파일되면 해당 특성의 메시지 속성이 표시됩니다. 이를 통해 사용되지 않는 형식 또는 멤버에 대한 사용자 정보를 얻을 수 있습니다.
pl: Typ lub element członkowski jest oznaczony atrybutem System.ObsoleteAttribute, dla którego nie określono właściwości ObsoleteAttribute.Message. Gdy jest kompilowany typ lub element członkowski oznaczony atrybutem ObsoleteAttribute, wyświetlana jest właściwość Message atrybutu. Zapewnia to użytkownikowi informację o przestarzałym typie lub elemencie członkowskim.
pt_br: Um tipo ou membro marcado usando um atributo System.ObsoleteAttribute que não tem a respectiva propriedade ObsoleteAttribute.Message especificada. Quando um tipo ou membro marcado usando ObsoleteAttribute é compilado, a propriedade Message do atributo é exibida. Isso dá ao usuário informações sobre o tipo ou o membro obsoleto.
ru: Тип или член помечен с помощью атрибута System.ObsoleteAttribute, для которого не задано свойство ObsoleteAttribute.Message. При компиляции типа или члена, помеченного с помощью ObsoleteAttribute, отображается свойство Message этого атрибута. Оно предоставляет пользователю сведения об устаревшем типе или члене.
tr: Bir tür veya üye, ObsoleteAttribute.Message özelliği belirtilmemiş bir System.ObsoleteAttribute özniteliği kullanılarak işaretlenir. ObsoleteAttribute kullanılarak işaretlenmiş bir tür veya üye derlendiğinde, özniteliğin Message özelliği görüntülenir. Bu, kullanıcıya eski tür veya üye hakkında bilgi verir.
zh_hans: 使用 System.ObsoleteAttribute 特性标记类型或成员，该特性的 ObsoleteAttribute.Message 属性尚未指定。编译使用 ObsoleteAttribute 标记的类型或成员时，将显示该特性的消息属性。这为用户提供有关过时的类型或成员的信息。
zh_hant: 類型或成員使用並未指定其 ObsoleteAttribute.Message 屬性 (Property) 的 System.ObsoleteAttribute 屬性 (Attribute) 加以標記。編譯使用 ObsoleteAttribute 標記的類型或成員之後，會顯示屬性 (Attribute) 的 Message 屬性 (Property)，以便提供使用者有關過時類型或成員的資訊。

# ProvideObsoleteAttributeMessageMessage
source: Provide a message for the ObsoleteAttribute that marks {0} as Obsolete
cs: Zadejte pro atribut ObsoleteAttribute zprávu, která {0} označí jako zastaralý.
de: Geben Sie eine Meldung für das ObsoleteAttribute an, das "{0}" als veraltet markiert.
es: Proporcione un mensaje para ObsoleteAttribute que marque {0} como Obsolete.
fr: Fournir un message pour l'attribut ObsoleteAttribute qui marque {0} comme étant obsolète
it: Fornire un messaggio per ObsoleteAttribute che contrassegna {0} come obsoleto
ja: {0} を Obsolete に設定する ObsoleteAttribute のメッセージを指定します。
ko: {0}을(를) 사용되지 않는 것으로 표시하는 ObsoleteAttribute에 대한 메시지를 제공하세요.
pl: Określ komunikat dla atrybutu ObsoleteAttribute, który oznacza element {0} jako przestarzały
pt_br: Fornecer uma mensagem para o ObsoleteAttribute que marca {0} como Obsoleto
ru: Укажите сообщение для ObsoleteAttribute, помечающего {0} как устаревший
tr: {0} öğesini Obsolete olarak işaretleyen ObsoleteAttribute için bir ileti sağlayın
zh_hans: 为将 {0} 标记为过时的 ObsoleteAttribute 提供消息
zh_hant: 提供將 {0} 標記為 Obsolete 的 ObsoleteAttribute 之訊息

# PropertiesShouldNotBeWriteOnlyTitle
source: Properties should not be write only
cs: Vlastnosti nemají být jen pro zápis.
de: Eigenschaften dürfen nicht lesegeschützt sein
es: Las propiedades no deben ser de solo escritura
fr: Les propriétés ne doivent pas être en écriture seule
it: Le proprietà non devono essere di sola scrittura
ja: プロパティを書き込み専用にすることはできません
ko: 속성은 쓰기 전용이 아니어야 합니다.
pl: Właściwości nie powinny być dostępne tylko do zapisu
pt_br: As propriedades não devem ser somente gravação
ru: Свойства не могут быть доступны только на запись
tr: Özellikler salt yazılır olmamalıdır
zh_hans: 属性不应是只写的
zh_hant: 屬性不應為唯寫屬性
