Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotInitializeUnnecessarilyDescription
source: The .NET runtime initializes all fields of reference types to their default values before running the constructor. In most cases, explicitly initializing a field to its default value in a constructor is redundant, adding maintenance costs and potentially degrading performance (such as with increased assembly size), and the explicit initialization can be removed. In some cases, such as with static readonly fields that permanently retain their default value, consider instead changing them to be constants or properties.
cs: Před spuštěním konstruktoru modul runtime .NET inicializuje všechna pole typů odkazů na výchozí hodnoty. Ve většině případů je explicitní inicializace pole na výchozí hodnotu v konstruktoru redundantní, zvyšuje náklady na údržbu, může snižovat výkon (například kvůli většímu sestavení) a dá se odebrat. V některých případech, například u statických polí určených jen pro čtení, která trvale uchovávají svou výchozí hodnotu, zvažte možnost je změnit na konstanty nebo vlastnosti.
de: Die .NET Runtime initialisiert alle Felder von Verweistypen mit ihren Standardwerten, bevor der Konstruktor ausgeführt wird. In den meisten Fällen ist das explizite Initialisieren eines Felds mit dem Standardwert in einem Konstruktor redundant, wodurch Wartungskosten und möglicherweise Leistungseinbußen entstehen (z. B. bei einer erhöhten Assemblygröße), und die explizite Initialisierung kann entfernt werden. In einigen Fällen, z. B. bei statischen schreibgeschützten Feldern, die ihren Standardwert dauerhaft beibehalten, sollten Sie diese stattdessen in Konstanten oder Eigenschaften ändern.
es: El entorno de ejecución .NET inicializa todos los campos de tipos de referencia en sus valores predeterminados antes de ejecutar el constructor. En la mayoría de los casos, la inicialización explícita de un campo en su valor predeterminado en un constructor es redundante, lo cual agrega costos de mantenimiento y puede degradar el rendimiento (por ejemplo, con un tamaño de ensamblado incrementado), por lo que la inicialización explícita puede eliminarse. En algunos casos, como el de los campos estáticos de solo lectura que mantienen su valor predeterminado de forma permanente, considere la posibilidad de cambiarlos para que sean constantes o propiedades.
fr: Le runtime .NET initialise tous les champs des types référence à leurs valeurs par défaut avant d'exécuter le constructeur. Dans la plupart des cas, l'initialisation explicite d'un champ à sa valeur par défaut dans un constructeur est redondante, l'ajout des coûts de maintenance, la dégradation potentielle des performances (comme avec l'augmentation de la taille d'assembly) et l'initialisation explicite peuvent être supprimés. Dans certains cas, tels que les champs en lecture seule statiques qui conservent définitivement leur valeur par défaut, envisagez de les remplacer par des constantes ou des propriétés.
it: Il runtime di .NET Inizializza tutti i campi dei tipi riferimento con i rispettivi valori predefiniti prima di eseguire il costruttore. Nella maggior parte dei casi l'inizializzazione esplicita di un campo con il valore predefinito in un costruttore è ridondante e può essere rimossa perché comporta un aumento dei costi di manutenzione, nonché una possibile riduzione del livello delle prestazioni, come nel caso dell'incremento delle dimensioni dell'assembly. In alcuni casi, ad esempio con i campi di sola lettura statici che mantengono il valore predefinito in modo definitivo, provare a convertirli in costanti o proprietà.
ko: .NET 런타임은 생성자를 실행하기 전에 참조 형식의 모든 필드를 기본값으로 초기화합니다. 대부분의 경우 생성자에서 명시적으로 필드를 기본값으로 초기화하는 것은 중복되는 작업이며 이로 인해 유지 관리 비용이 늘어나고 성능이 저하될 수 있으며(예: 늘어난 어셈블리 크기 때문), 명시적 초기화는 제거할 수 있습니다. 기본값을 영구적으로 유지하는 정적 읽기 전용 필드와 같은 일부 경우에는 대신 상수 또는 속성으로 변경하는 것이 좋습니다.
pl: Środowisko uruchomieniowe platformy .NET inicjuje wszystkie pola typów referencyjnych wartościami domyślnymi przed uruchomieniem konstruktora. W większości przypadków jawne zainicjowanie pola jego wartością domyślną w konstruktorze jest zbędne, powoduje dodanie kosztu związanego z konserwacją i potencjalnie obniża wydajność (np. zwiększa rozmiar zestawu), dlatego jawne inicjowanie można usunąć. W niektórych przypadkach, takich jak statyczne pola tylko do odczytu, które trwale zachowują swoje wartości domyślne, warto rozważyć ich zmianę na stałe lub właściwości.
pt_br: O runtime do .NET inicializa todos os campos dos tipos de referência com os valores padrão antes de executar o construtor. Na maioria dos casos, a inicialização explícita de um campo com o valor padrão em um construtor é redundante, aumentando os custos de manutenção e podendo prejudicar o desempenho (por exemplo, com o aumento do tamanho do assembly). A inicialização explícita pode ser removida. Em alguns casos, como nos campos estáticos readonly que retêm o valor padrão permanentemente, considere alterá-los para constantes ou propriedades.
ru: Среда выполнения .NET инициализирует все поля ссылочных типов значениями по умолчанию перед запуском конструктора. В большинстве случаев явная инициализация поля значением по умолчанию в конструкторе является избыточной: в этом случае появляются затраты на обслуживание и может ухудшиться производительность (например, из-за увеличения размера сборки), а явная инициализация может быть удалена. В некоторых случаях, например при использовании статических полей только для чтения, которые постоянно сохраняют значение по умолчанию, рекомендуется заменить их на константы или свойства.
tr: .NET çalışma zamanı, oluşturucuyu çalıştırmadan önce başvuru türlerinin tüm alanlarını varsayılan değerlerine başlatır. Çoğu durumda, bir kurucu içindeki bir alanı açık bir şekilde varsayılan değerine başlatmak gereksizdir, bakım maliyetleri ekler ve performansı düşürebilir (örneğin, derleme boyutunu artırarak) ve açık başlatma işlemleri kaldırılabilir. Varsayılan değerlerini kalıcı olarak koruyan statik salt okunur alanlar gibi bazı durumlarda, bunları sabit veya özellik olarak değiştirmeniz önerilir.
zh_hans: 在运行构造函数之前，.NET 运行时会将引用类型的所有字段初始化为它们的默认值。在大多数情况下，在构造函数中将字段显式初始化为其默认值这个操作是多余的，这增加了维护成本并可能降低性能(例如随着程序集大小的增加)，而显式初始化是可被删除的。在某些情况下(例如使用永久保留其默认值的静态只读字段时)，考虑将它们改为常量或属性。
zh_hant: .NET 執行階段在執行建構函式之前，會先將所有參考型別欄位初始化為其預設值。在多數情況下，將建構函式中的欄位明確地初始化為其預設值是多餘的動作，不僅增加維護成本，而且可能會降低效能 (例如增加了組件大小)，因此可以將明確初始化移除。在某些情況 (例如會永久保留預設值的靜態唯讀欄位) 下，應考慮將其變更為常數或屬性。

# DoNotInitializeUnnecessarilyMessage
source: Member '{0}' is explicitly initialized to its default value
cs: Člen {0} je explicitně inicializovaný na svou výchozí hodnotu.
de: Der Member "{0}" wird explizit mit dem Standardwert initialisiert.
es: El miembro "{0}" se inicializa explícitamente en el valor predeterminado.
fr: Le membre '{0}' est explicitement initialisé en fonction de sa valeur par défaut
it: Il membro '{0}' è inizializzato in modo esplicito in base al relativo valore predefinito
ko: '{0}' 멤버는 명시적으로 기본값으로 초기화되었습니다.
pl: Składowa „{0}” jest jawnie inicjowana do wartości domyślnej
pt_br: O membro '{0}' foi inicializado explicitamente para o valor padrão
ru: Элемент "{0}" явно инициализирован со значением по умолчанию.
tr: '{0}' üyesi, varsayılan değeriyle açıkça başlatılmış
zh_hans: 成员“{0}”已显式初始化为其默认值
zh_hant: 已明確將成員 '{0}' 初始化為其預設值

# PreferJaggedArraysOverMultidimensionalTitle
source: Prefer jagged arrays over multidimensional
cs: Upřednostnění vícenásobných polí před multidimenzionálními
de: Jagged Arrays mehrdimensionalen Arrays vorziehen
es: Preferir las matrices escalonadas antes que multidimensionales
fr: Préférer les tableaux en escalier aux tableaux multidimensionnels
it: Preferire matrici di matrici rispetto a matrici multidimensionali
ja: 複数次元の配列ではなくジャグ配列を使用します
ko: 다차원 배열보다 가변 배열을 사용하세요.
pl: Wybieraj tablice nieregularne zamiast wielowymiarowych
pt_br: Prefira matrizes denteadas a matrizes multidimensionais
ru: Используйте массивы массивов вместо многомерных массивов
tr: Çok boyutlu yerine düzensiz dizileri tercih edin
zh_hans: 与多维数组相比，首选使用交错数组
zh_hant: 多維度上建議使用不規則陣列

# PreferJaggedArraysOverMultidimensionalDescription
source: A jagged array is an array whose elements are arrays. The arrays that make up the elements can be of different sizes, leading to less wasted space for some sets of data.
cs: Vícenásobné pole je pole, jehož prvky jsou pole. Pole, která tvoří tyto prvky, mohou mít různou velikost, což u některých sad dat může vést k lépe využitému místu.
de: Ein Jagged Array ist ein Array, dessen Elemente ebenfalls Arrays sind. Diese Arrayelemente können verschiedene Größen aufweisen, sodass für einige Datenmengen weniger Platz vergeudet wird.
es: Una matriz escalonada es una matriz cuyos elementos son matrices. Las matrices que constituyen los elementos pueden ser de tamaños diferentes, reduciendo el espacio desaprovechado para algunos conjuntos de datos.
fr: Un tableau en escalier est un tableau dont les éléments sont des tableaux. Les tableaux qui composent les éléments peuvent être de tailles distinctes, ce qui réduit l'espace perdu pour certains jeux de données.
it: Una matrice di matrici è una matrice i cui elementi sono costituiti da matrici. Le matrici che costituiscono gli elementi possono essere di dimensioni diverse, di conseguenza la quantità di spazio inutilizzato sarà inferiore per alcuni set di dati.
ja: ジャグ配列とは、その要素も配列である配列です。要素を構成する配列のサイズは異なる場合があるため、データ セットによっては無駄な空間が少なくなります。
ko: 요소가 배열인 배열이 가변 배열입니다. 요소를 구성하는 배열의 크기는 다양하기 때문에 일부 데이터 집합의 공간을 절약할 수 있습니다.
pl: Tablica nieregularna jest tablicą, której elementami są tablice. Tablice będące elementami mogą mieć różny rozmiar, co sprawia, że w przypadku niektórych zestawów danych marnowane jest mniej miejsca.
pt_br: Uma matriz denteada é uma matriz cujos elementos são matrizes. As matrizes que compõem os elementos podem ser de tamanhos diferentes, levando a menos espaço perdido para alguns conjuntos de dados.
ru: Массив массивов состоит из массивов. Массивы, элементы которых могут иметь разный размер, позволяют экономнее расходовать место для нескольких наборов данных.
tr: Düzensiz dizi, öğeleri diziler halinde olan bir dizidir. Öğeleri oluşturan diziler farklı boyutlarda olabileceğinden, bazı veri kümeleri için daha az alan israfı sağlar.
zh_hans: 交错数组的元素为数组。构成元素的数组可以大小不同，使某些数据集的浪费空间减少。
zh_hant: 不規則陣列是其元素為陣列的陣列。構成元素的這些陣列可能大小不一，讓某些資料集可以少浪費一些空間。

# PreferJaggedArraysOverMultidimensionalMessageDefault
source: {0} is a multidimensional array. Replace it with a jagged array if possible.
cs: {0} je multidimenzionální pole. Pokud je to možné, nahraďte ho vícenásobným polem.
de: "{0}" ist ein mehrdimensionales Array. Ersetzen Sie es nach Möglichkeit durch ein Jagged Array.
es: {0} es una matriz multidimensional. Sustitúyala por una matriz escalonada si fuera posible.
fr: {0} est un tableau multidimensionnel. Remplacez-le, si possible, par un tableau en escalier.
it: {0} è una matrice multidimensionale. Se possibile, sostituirla con una matrice di matrici.
ja: {0} は多次元配列です。可能である場合、ジャグ配列で置き換えてください。
ko: {0}은(는) 다차원 배열입니다. 가능한 경우 가변 배열로 바꾸세요.
pl: {0} jest tablicą wielowymiarową. Należy ją zastąpić tablicą nieregularną, jeśli to możliwe.
pt_br: {0} é uma matriz multidimensional. Se possível, substitua-a por uma matriz denteada.
ru: {0} является многомерным массивом. По возможности замените его массивом массивов.
tr: {0}, çok boyutlu bir dizi. Mümkünse bunu düzensiz bir diziyle değiştirin.
zh_hans: {0} 是多维数组。如有可能，请使用交错数组来替代它。
zh_hant: {0} 是多維度陣列。如果可能，請用不規則陣列取代它。

# PreferJaggedArraysOverMultidimensionalMessageReturn
source: {0} returns a multidimensional array of {1}. Replace it with a jagged array if possible.
cs: {0} vrací multidimenzionální pole {1}. Pokud je to možné, nahraďte ho vícenásobným polem.
de: "{0}" gibt ein mehrdimensionales Array von "{1}" zurück. Ersetzen Sie es nach Möglichkeit durch ein Jagged Array.
es: {0} devuelve una matriz multidimensional de {1}. Sustitúyala por una matriz escalonada si fuera posible.
fr: {0} retourne un tableau multidimensionnel de {1}. Remplacez-le, si possible, par un tableau en escalier.
it: {0} restituisce una matrice multidimensionale di {1}. Se possibile, sostituirla con una matrice di matrici.
ja: {0} は {1} の多次元配列を返します。可能である場合、ジャグ配列で置き換えてください。
ko: {0}이(가) {1}의 다차원 배열을 반환합니다. 가능한 경우 가변 배열로 바꾸세요.
pl: {0} zwraca tablicę wielowymiarową {1}. Należy ją zastąpić tablicą nieregularną, jeśli to możliwe.
pt_br: {0} retorna uma matriz multidimensional de {1}. Se possível, substitua-a por uma matriz denteada.
ru: {0} возвращает многомерный массив размером {1}. По возможности замените его массивом массивов.
tr: {0}, çok boyutlu {1} dizisini döndürüyor. Mümkünse bunu düzensiz bir diziyle değiştirin.
zh_hans: {0} 返回多维数组 {1}。如有可能，请使用交错数组来替代它。
zh_hant: {0} 會傳回多維度陣列 {1}。如果可能，請用不規則陣列取代它。

# PreferJaggedArraysOverMultidimensionalMessageBody
source: {0} uses a multidimensional array of {1}. Replace it with a jagged array if possible.
cs: {0} používá multidimenzionální pole {1}. Pokud je to možné, nahraďte ho vícenásobným polem.
de: "{0}" verwendet ein mehrdimensionales Array von "{1}". Ersetzen Sie es nach Möglichkeit durch ein Jagged Array.
es: {0} utiliza una matriz multidimensional de {1}. Sustitúyala por una matriz escalonada si fuera posible.
fr: {0} utilise un tableau multidimensionnel de {1}. Remplacez-le, si possible, par un tableau en escalier.
it: {0} usa una matrice multidimensionale di {1}. Se possibile, sostituirla con una matrice di matrici.
ja: {0} は {1} の多次元配列を使用します。可能である場合、ジャグ配列で置き換えてください。
ko: {0}이(가) {1}의 다차원 배열을 사용합니다. 가능한 경우 가변 배열로 바꾸세요.
pl: {0} powoduje użycie tablicy wielowymiarowej {1}. Należy ją zastąpić tablicą nieregularną, jeśli to możliwe.
pt_br: {0} usa uma matriz multidimensional de {1}. Se possível, substitua-a por uma matriz denteada.
ru: {0} использует многомерный массив размером {1}. По возможности замените его массивом массивов.
tr: {0}, çok boyutlu {1} dizisini kullanıyor. Mümkünse bunu düzensiz bir diziyle değiştirin.
zh_hans: {0} 使用多维数组 {1}。如有可能，请使用交错数组来替代它。
zh_hant: {0} 使用多維度陣列 {1}。如果可能，請用不規則陣列取代它。

# MarkMembersAsStaticTitle
source: Mark members as static
cs: Označení členů jako statických
de: Member als statisch markieren
es: Marcar miembros como static
fr: Marquer les membres comme étant static
it: Contrassegnare i membri come static
ja: メンバーを static に設定します
ko: 멤버를 static으로 표시하세요.
pl: Oznaczaj elementy członkowskie jako statyczne
pt_br: Marcar membros como estáticos
ru: Пометьте члены как статические
tr: Üyeleri statik olarak işaretleyin
zh_hans: 将成员标记为 static
zh_hant: 將成員標記為靜態

# MarkMembersAsStaticDescription
source: Members that do not access instance data or call instance methods can be marked as static. After you mark the methods as static, the compiler will emit nonvirtual call sites to these members. This can give you a measurable performance gain for performance-sensitive code.
cs: Členy, které nemají přístup k datům instance nebo volají metody instance, je možné označit jako statické. Po označení metod jako statických bude kompilátor pro tyto členy generovat nevirtuální lokality volání. Tím u kódu citlivého na výkon získáte měřitelný nárůst výkonu.
de: Member, die nicht auf Instanzdaten zugreifen oder Instanzmethoden aufrufen, können als "static" markiert werden. Nachdem Sie die Methoden als statisch markiert haben, gibt der Compiler nicht virtuelle Aufrufsites an diese Member aus. Dadurch kann sich für leistungsabhängigen Code eine spürbare Leistungssteigerung ergeben.
es: Los miembros que no tienen acceso a datos de instancia o que llaman a métodos de instancia se pueden marcar como static. Después de marcar los métodos como static, el compilador emitirá los sitios de llamada no virtuales para estos miembros. Esto puede proporcionar una mejora apreciable del rendimiento del código sensible al rendimiento.
fr: Les membres qui n'accèdent pas aux données d'instance ou qui n'appellent pas de méthodes d'instance peuvent être marqués comme étant static. Une fois que vous avez marqué les méthodes comme étant static, le compilateur émet des sites d'appel non virtuels pour ces membres. Cela peut apporter un gain de performances mesurable pour le code qui en dépend.
it: I membri che non accedono ai dati di istanza o non chiamano metodi di istanza possono essere contrassegnati come static. Dopo aver contrassegnato i metodi come static, il compilatore creerà siti di chiamata non virtual per questi membri. Si potrà così ottenere un sensibile miglioramento delle prestazioni per il codice sensibile alle prestazioni.
ja: インスタンス データにアクセスしないメンバーまたはインスタンス メソッドを呼び出さないメンバーは、static にマークできます。メソッドを static にマークすると、コンパイラではこれらのメンバーに対する非仮想呼び出しサイトを出力します。これにより、パフォーマンスを要求されるコードでは、大幅にパフォーマンスが改善されます。
ko: 인스턴스 데이터에 액세스하지 않거나 인스턴스 메서드를 호출하지 않는 멤버는 static으로 표시할 수 있습니다. 메서드를 static으로 표시하면 컴파일러가 이와 같은 멤버에 비가상 호출 사이트를 내보냅니다. 성능에 민감한 코드의 경우 이 방법으로 성능을 크게 향상할 수 있습니다.
pl: Składowe, które nie uzyskują dostępu do danych wystąpienia ani nie wywołują metod wystąpienia, można oznaczyć jako statyczne. Po oznaczeniu metod jako statycznych kompilator będzie emitować niewirtualne miejsca wywołań do tych składowych. Może to spowodować wymierną poprawę wydajności kodu wrażliwego na zmiany wydajności.
pt_br: Os membros que não acessam os dados da instância nem chamam os métodos da instância podem ser marcados como estáticos. Depois que você marcar os métodos como estáticos, o compilador emitirá os sites de chamada não virtuais para esses membros. Isso pode oferecer um ganho de desempenho mensurável para códigos sensíveis ao desempenho.
ru: Члены, которые не обращаются к данным экземпляров и не вызывают методы экземпляров, можно пометить как статические. После этого компилятор создаст невиртуальные места для вызова этих членов. Это может привести к ощутимому росту производительности для чувствительного к производительности кода.
tr: Örnek verilerine erişmeyen veya örnek yöntemlerini çağırmayan üyeler statik olarak işaretlenebilir. Yöntemleri statik olarak işaretledikten sonra, derleyici bu üyelere yönelik sanal olmayan çağrı konumlarını gösterir. Bu, performans açısından duyarlı kod için önemli ölçüde performans kazanımı sağlar.
zh_hans: 不访问实例数据或调用实例方法的成员可标记为 static。将方法标记为 static 后，编译器将向这些成员发出非虚拟调用站点。这样可使对性能比较敏感的代码获得显著的性能提升。
zh_hant: 不會存取執行個體資料或呼叫執行個體方法的成員，可標記為靜態。當您將方法標記為靜態之後，編譯器會對這些成員發出非虛擬呼叫位置。您如此即可針對重視效能的程式碼，取得可衡量的效能提升。

# MarkMembersAsStaticMessage
source: Member '{0}' does not access instance data and can be marked as static
cs: Člen {0} nemá přístup k datům instance a je možné ho označit jako statický.
de: Der Member "{0}" greift nicht auf Instanzdaten zu und kann als "static" markiert werden.
es: El miembro "{0}" no tiene acceso a los datos de la instancia y se puede marcar como static.
fr: Le membre '{0}' n'accède pas aux données d'instance et peut être marqué comme étant static
it: Il membro {0} non accede ai dati di istanza e può essere contrassegnato come static
ja: メンバー '{0}' はインスタンス データにアクセスしないため、static にマークできます
ko: '{0}' 멤버는 인스턴스 데이터에 액세스하지 않으며 static으로 표시할 수 있습니다.
pl: Składowa „{0}” nie uzyskuje dostępu do danych wystąpienia i może zostać oznaczona jako statyczna
pt_br: O membro '{0}' não acessa os dados da instância e pode ser marcado como estático
ru: Член "{0}" не обращается к данным экземпляров, поэтому его можно пометить как статический.
tr: '{0}' adlı üye örnek verilerine erişmiyor ve statik olarak işaretlenebilir
zh_hans: 成员“{0}”不访问实例数据，可标记为 static
zh_hant: 成員 '{0}' 不會存取執行個體資料，因而可標記為靜態

# SealMethodsThatSatisfyPrivateInterfacesTitle
source: Seal methods that satisfy private interfaces
cs: Zapečetění metod, které vyhovují privátním rozhraním
de: Methoden versiegeln, die die Bedingungen privater Schnittstellen erfüllen
es: Sellar los métodos que cumplan las interfaces privadas
fr: Sceller les méthodes qui satisfont les interfaces privées
it: Impostare come sealed i metodi che soddisfano interfacce private
ja: プライベート インターフェイスを満たすメソッドをシールします
ko: private 인터페이스를 만족하는 메서드를 봉인하세요.
pl: Pieczętuj metody, które spełniają wymagania interfejsów prywatnych
pt_br: Métodos de lacre que satisfazem interfaces privadas
ru: Запечатайте методы, соответствующие частным интерфейсам
tr: Özel arabirimleri karşılayan mühürleme yöntemleri
zh_hans: 密封满足私有接口的方法
zh_hant: 密封滿足私用介面的方法

# SealMethodsThatSatisfyPrivateInterfacesDescription
source: An inheritable public type provides an overridable method implementation of an internal (Friend in Visual Basic) interface. To fix a violation of this rule, prevent the method from being overridden outside the assembly.
cs: Dědičný veřejný typ poskytuje přepisovatelnou implementaci metody interního rozhraní (Friend ve Visual Basicu). Pokud chcete opravit porušení tohoto pravidla, zabraňte tomu, aby se metoda přepisovala mimo sestavení.
de: Ein vererbbarer öffentlicher Typ stellt eine überschreibbare Methodenimplementierung einer internal-Schnittstelle bereit ("Friend" in Visual Basic). Um einen Verstoß gegen diese Regel zu korrigieren, verhindern Sie ein Außerkraftsetzen der Methode außerhalb der Assembly.
es: Un tipo público heredable proporciona una implementación de método reemplazable de una interfaz internal (Friend en Visual Basic). Para corregir una infracción de esta regla, evite que el método se invalide fuera del ensamblado.
fr: Un type public héritable fournit une implémentation de méthode substituable d'une interface internal (Friend en Visual Basic). Pour corriger une violation de cette règle, empêchez le remplacement de la méthode en dehors de l'assembly.
it: Un tipo public ereditabile fornisce un'implementazione di metodo sottoponibile a override di un'interfaccia internal (Friend in Visual Basic). Per correggere una violazione di questa regola, impedire che l'override del metodo venga eseguito all'esterno dell'assembly.
ja: 継承可能なパブリック型により、internal (Visual Basic では Friend) インターフェイスのオーバーライド可能なメソッド実装が提供されます。この規則の違反を修正するには、アセンブリの外側でメソッドがオーバーライドされないようにします。
ko: 상속 가능한 public 형식은 내부(Visual Basic의 경우 Friend) 인터페이스의 재정의 가능한 메서드 구현을 제공합니다. 이 규칙 위반 문제를 해결하려면 어셈블리 외부에서 메서드가 재정의되지 않도록 합니다.
pl: Typ publiczny podlegający dziedziczeniu zapewnia implementację metody z możliwością przesłonięcia interfejsu (Friend w języku Visual Basic). Aby naprawić naruszenie tej reguły, należy uniemożliwić przesłonięcie tej metody poza zespołem.
pt_br: Um tipo público herdável oferece uma implementação de método substituível de uma interface interna (Friend no Visual Basic). Para corrigir uma violação dessa regra, impeça o método de ser substituído fora do assembly.
ru: Наследуемый общий тип предоставляет переопределяемую реализацию метода для внутреннего интерфейса (Friend в Visual Basic). Чтобы устранить нарушение этого правила, предотвратите переопределение этого метода вне сборки.
tr: Devralınabilen bir genel tür, bir iç (Visual Basic’te Friend) arabirimin geçersiz kılınabilecek bir yöntem uygulamasını sağlar. Bu kuralın ihlal edildiği bir durumu düzeltmek için yöntemin bütünleştirilmiş kod dışında geçersiz kılınmasını engelleyin.
zh_hans: 可继承的公共类型提供内部(在 Visual Basic 中为 Friend)接口的可重写方法实现。若要修复与该规则的冲突，请阻止在程序集外部重写该方法。
zh_hant: 可繼承的公用型別提供內部 (在 Visual Basic 中為 Friend) 介面的可覆寫方法實作。若要修正此規則的違規，請讓方法無法於組件之外進行覆寫。
