Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotHideBaseClassMethodsDescription
source: A method in a base type is hidden by an identically named method in a derived type when the parameter signature of the derived method differs only by types that are more weakly derived than the corresponding types in the parameter signature of the base method.
cs: Některá metoda v základním typu je skrytá identicky pojmenovanou metodou v odvozeném typu, kdy se podpis parametru odvozené metody odlišuje jenom typy, které jsou odvozené slaběji než odpovídající typy v podpisu parametru základní metody.
de: Eine Methode in einem Basistyp wird durch eine identisch benannte Methode in einem abgeleiteten Typ verdeckt, wenn die Parametersignatur der abgeleiteten Methode sich nur durch Typen unterscheidet, die schwächer abgeleitet werden als die entsprechenden Typen in der Parametersignatur der Basismethode.
es: Un método de un tipo base queda oculto por un método del mismo nombre en un tipo derivado cuando la signatura del parámetro del método derivado solo se diferencia en los tipos derivados de forma más flexible que los tipos correspondientes de la signatura del parámetro del método base.
fr: Une méthode dans un type de base est masquée par une méthode portant le même nom dans un type dérivé quand la signature de paramètre de la méthode dérivée diffère uniquement par les types qui sont dérivés plus faiblement que les types correspondants dans la signature de paramètre de la méthode de base.
it: Un metodo in un tipo di base è nascosto da un metodo con nome identico in un tipo derivato quando la firma del parametro del metodo derivato differisce solo per i tipi che presentano una derivazione più debole rispetto ai tipi corrispondenti nella firma del parametro del metodo di base.
ja: 派生メソッドのパラメーター シグネチャ内のある型が、基本メソッドのパラメーター シグネチャ内のそれに対応する型より弱く型指定されていることが、両者の唯一の相違点である場合、基本型内のメソッドが派生型内の同じ名前のメソッドによって隠されます。
ko: 파생 메서드의 매개 변수 시그니처가 기본 메서드의 매개 변수 시그니처에서 해당 형식보다 더 약하게 파생된 형식과만 다른 경우 기본 형식의 메서드는 파생 형식의 이름이 동일한 메서드에 의해 숨겨집니다.
pl: Metoda w typie podstawowym jest ukryta przez metodę o takiej samej nazwie w typie pochodnym, jeśli sygnatura parametrów metody pochodnej różni się tylko typami, które są wyżej w hierarchii dziedziczenia niż odpowiadające typy w sygnaturze parametrów metody podstawowej.
pt_br: Um método em um tipo base é oculto por um método com nome idêntico em um tipo derivado quando a única diferença entre a assinatura do parâmetro do método derivado e a assinatura do parâmetro do método base está nos tipos da primeira, que são derivados de modo mais fraco.
ru: Метод в базовом классе скрывается аналогично названным методом в производном типе, когда сигнатура параметра производного метода отличается только типами, которые унаследованы слабее, чем соответствующие типы в сигнатуре параметра базового метода.
tr: Türetilen bir yöntemin parametre imzası, yalnızca temel yöntemin parametre imzasındaki karşılık gelen türlerden daha zayıf bir şekilde türetilmiş türler açısından değişiklik gösteriyorsa, temel türdeki bir yöntem, türetilmiş türdeki aynı ada sahip bir yöntem tarafından gizlenir.
zh_hans: 当派生方法的参数签名与基方法的参数签名之间的差异仅在于其派生类型比相应类型更弱时，基类型中的方法被派生类型中的同名方法隐藏。
zh_hant: 只有在衍生方法的參數簽章因類型衍生時，較基底方法參數簽章中的類型來得弱時，基底類型中的方法才會被衍生類型中相同的具名方法所隱藏。

# DoNotHideBaseClassMethodsMessage
source: Change or remove '{0}' because it hides a more specific base class method: '{1}'
cs: Změňte nebo odeberte {0}, protože skrývá konkrétnější metodu základní třídy: {1}.
de: Ändern oder entfernen Sie "{0}", weil dadurch eine spezifischere Basisklassenmethode verdeckt wird: {1}.
es: Cambie o quite "{0}", porque oculta un método de clase base más específico: "{1}".
fr: Changez ou supprimez '{0}', car il masque une méthode de classe de base plus spécifique : '{1}'
it: Modificare o rimuovere '{0}' perché nasconde un metodo della classe di base più specifico: '{1}'
ko: 더 구체적인 기본 클래스 메서드인 '{1}'이(가) 숨겨지므로 '{0}'을(를) 변경하거나 제거하세요.
pl: Zmień lub usuń metodę „{0}”, ponieważ ukrywa ona bardziej wyspecjalizowaną metodę klasy podstawowej: „{1}”
pt_br: Altere ou remova '{0}', porque ele oculta um método de classe base mais específico: '{1}'
ru: Измените или удалите "{0}", так как он скрывает более конкретный метод базового класса: "{1}".
tr: '{0}' daha belirli bir temel sınıf metodunu ('{1}') gizlediğinden bunu değiştirin veya kaldırın
zh_hans: 更改或删除“{0}”，因为它会隐藏更具体的基类方法:“{1}”
zh_hant: 變更或移除 '{0}'，因為其會隱藏較特殊的基底類別方法: '{1}'

# DoNotHideBaseClassMethodsTitle
source: Do not hide base class methods
cs: Neskrývejte metody základní třídy.
de: Basisklassenmethoden nicht verdecken
es: No ocultar métodos de clases base
fr: Ne pas masquer les méthodes de classe de base
it: Non nascondere i metodi della classe di base
ja: 基底クラス メソッドを非表示にしません
ko: 기본 클래스 메서드를 숨기지 마세요.
pl: Nie ukrywaj metod klasy podstawowej
pt_br: Não ocultar métodos de classe base
ru: Не скрывайте методы базовых классов
tr: Temel sınıf yöntemlerini gizlemeyin
zh_hans: 不要隐藏基类方法
zh_hant: 請勿隱藏基底類別方法

# UseGenericEventHandlerInstancesForDelegateMessage
source: Remove '{0}' and replace its usage with a generic EventHandler, for example EventHandler<T>, where T is a valid EventArgs
cs: Odeberte {0} a nahraďte jeho použití obecným EventHandlerem, třeba EventHandler<T>, kde T je platné EventArgs.
de: Entfernen Sie "{0}", und ersetzen Sie die zugehörige Syntax durch einen generischen EventHandler, z. B. EventHandler<T>, wobei T einem gültigen EventArgs-Wert entspricht.
es: Quite "{0}" y reemplace su uso con un elemento EventHandler genérico, por ejemplo, EventHandler<T>, donde T es un elemento EventArgs válido.
fr: Supprimez '{0}' et remplacez son utilisation par un EventHandler générique, par exemple EventHandler<T>, où T est un EventArgs valide
it: Rimuovere '{0}' e sostituirne l'utilizzo con un elemento EventHandler generico, ad esempio EventHandler<T>, dove T è un elemento EventArgs valido
ko: '{0}'을(를) 제거하고 대신 제네릭 EventHandler(예: EventHandler<T>)를 사용합니다. 여기에서 T는 유효한 EventArgs입니다.
pl: Usuń element „{0}” i zamień jego użycie na ogólną procedurę EventHandler, np. EventHandler<T>, gdzie T to prawidłowe argumenty zdarzenia
pt_br: Remova '{0}' e substitua o uso dele por um EventHandler genérico, como EventHandler<T>, em que T é um EventArgs válido
ru: Удалите "{0}" и замените его использование универсальным EventHandler, например EventHandler<T>, где T — это допустимый EventArgs.
tr: '{0}' öğesini kaldırın ve kullanımını genel bir EventHandler ile değiştirin. Örneğin, EventHandler<T>. Burada T, geçerli bir EventArgs değeridir
zh_hans: 删除“{0}”并将其用法替换为泛型的 EventHandler，例如 EventHandler<T>，其中 T 是有效的 EventArgs
zh_hant: 移除 '{0}'，並以泛型 EventHandler 取代其用法，例如 EventHandler<T>，其中的 T 是有效的 EventArgs

# UseGenericEventHandlerInstancesForDelegateDescription
source: A type contains a delegate that returns void, whose signature contains two parameters (the first an object and the second a type that is assignable to EventArgs), and the containing assembly targets Microsoft .NET Framework?2.0.
cs: Typ obsahuje delegáta, který vrací hodnotu void, jehož podpis obsahuje dva parametry (prvním je objekt a druhým je typ, který se dá přiřadit k EventArgs), přičemž cílem obsahujícího sestavení je Microsoft .NET Framework 2.0.
de: Ein Typ enthält einen Delegaten, der "void" zurückgibt und dessen Signatur zwei Parameter enthält (als ersten ein Objekt und als zweiten einen Typ, der EventArgs zugeordnet werden kann), und die enthaltene Assembly ist auf Microsoft .NET Framework 2.0 ausgerichtet.
es: Un tipo contiene un delegado que devuelve void, cuya signatura contiene dos parámetros (el primero un objeto y el segundo un tipo asignable a EventArgs) y el ensamblado contenedor está destinado a Microsoft .NET Framework 2.0.
fr: Un type contient un délégué qui retourne void, dont la signature contient deux paramètres (le premier est un objet et le second est un type pouvant être assigné à EventArgs), et l'assembly conteneur cible Microsoft .NET Framework 2.0.
it: Un tipo contiene un delegato che restituisce void, la cui firma contiene due parametri (il primo è un oggetto e il secondo è un tipo assegnabile a EventArgs) e l'assembly che lo contiene è destinato a Microsoft .NET Framework 2.0.
ja: 型に void を返すデリゲートが含まれており、デリゲートのシグネチャに 2 つのパラメーター (1 つはオブジェクト、もう 1 つは EventArgs に割り当て可能な型) が含まれ、包含アセンブリの対象が .NET Framework 2.0 です。
ko: 형식이 void를 반환하는 대리자를 포함하며 이 형식의 시그니처는 매개 변수 2개(개체 및 EventArgs에 할당할 수 있는 형식) 및 포함하는 어셈블리 대상 Microsoft .NET Framework 2.0을 포함합니다.
pl: Typ zawiera delegata zwracającego typ void, którego sygnatura zawiera dwa parametry (pierwszy jest obiektem, a drugi typem, który można przypisać do typu EventArgs), a zawierający zestaw jest przeznaczony dla programu Microsoft .NET Framework 2.0.
pt_br: Um tipo contém um delegado que retorna void, cuja assinatura contém dois parâmetros (o primeiro é um objeto e o segundo é um tipo atribuível a EventArgs) e o assembly recipiente é direcionado para o Microsoft .NET Framework 2.0.
ru: Тип содержит делегат, возвращающий значение void, сигнатура которого содержит два параметра (первый является объектом, а второй — типом, назначаемым для EventArgs), а содержащая сборка ориентирована на платформу Microsoft .NET Framework 2.0.
tr: Bir tür, void döndüren ve imzası iki parametre (ilki bir nesne, ikincisi EventArgs’a atanabilen bir tür) içeriyor ve bunu içeren bütünleştirilmiş kod Microsoft .NET Framework?2.0 sürümünü hedefliyor.
zh_hans: 类型包含返回 void 的委托，其签名包含两个参数(第一个参数为对象，第二个参数为分配给 EventArgs 的类型)，且包含程序集的目标为 Microsoft .NET Framework 2.0。
zh_hant: 類型包含傳回 void 的委派，其簽章包含兩個參數 (第一個參數是物件，第二個參數則是可指派給 EventArgs 的類型)，而內含的組件則以 Microsoft .NET Framework 2.0 為目標。

# UseGenericEventHandlerInstancesForEventMessage
source: Change the event '{0}' to replace the type '{1}' with a generic EventHandler, for example EventHandler<T>, where T is a valid EventArgs
cs: Změňte událost {0} tak, aby nahradila typ {1} obecným EventHandlerem, třeba EventHandler<T>, kde T je platné EventArgs.
de: Ändern Sie das Ereignis "{0}", um den Typ "{1}" durch einen generischen EventHandler zu ersetzen, z. B. EventHandler<T>, wobei T einem gültigen EventArgs-Wert entspricht.
es: Cambie el evento "{0}" para que reemplace al tipo "{1}" con un elemento EventHandler genérico, por ejemplo, EventHandler<T>, donde T es un elemento EventArgs válido.
fr: Changez l'événement '{0}' pour remplacer le type '{1}' par un EventHandler générique, par exemple EventHandler<T>, où T est un EventArgs valide
it: Modificare l'evento '{0}' per sostituire il tipo '{1}' con un elemento EventHandler generico, ad esempio EventHandler<T>, dove T è un elemento EventArgs valido
ko: '{0}' 이벤트를 변경하여 '{1}' 형식을 제네릭 EventHandler(예: EventHandler<T>)로 바꿉니다. 여기에서 T는 유효한 EventArgs입니다.
pl: Zmień zdarzenie „{0}”, aby zamienić typ „{1}” na ogólną procedurę EventHandler, np. EventHandler<T>, gdzie T to prawidłowy element EventArgs
pt_br: Altere o evento '{0}' para substituir o tipo '{1}' por um EventHandler genérico, por exemplo EventHandler<T>, em que T é um EventArgs válido
ru: Измените событие "{0}", чтобы заменить тип "{1}" универсальным EventHandler, например EventHandler<T>, где T — это допустимый EventArgs.
tr: '{0}' olayını, '{1}' türünün yerine genel bir EventHandler gelecek şekilde değiştirin. Örneğin, EventHandler<T>. Burada T, geçerli bir EventArgs değeridir
zh_hans: 更改事件“{0}”以将类型“{1}”替换为泛型 EventHandler，例如 EventHandler<T>，其中 T 是有效的 EventArgs
zh_hant: 變更事件 '{0}' 來取代具有泛型 EventHandler 的型別 '{1}'，例如 EventHandler<T>，其中的 T 是有效的 EventArgs

# UseGenericEventHandlerInstancesForEventDescription
source: A delegate that handles a public or protected event does not have the correct signature, return type, or parameter names.
cs: Delegát, který zpracovává veřejnou nebo chráněnou událost, nemá správný podpis, návratový typ nebo názvy parametrů.
de: Ein Delegat, der ein öffentliches oder geschütztes Ereignis verarbeitet, weist nicht die richtige Signatur oder nicht den richtigen Rückgabetyp oder Parameternamen auf.
es: Un delegado que trata un evento público o protegido no tiene la firma, el tipo de devolución o los nombres de parámetros correctos.
fr: Un délégué qui gère un événement public ou protégé n'a pas la signature, le type de retour ou les noms de paramètres appropriés.
it: I nomi di parametro, tipo o firma di un delegato che gestisce un evento pubblico o protetto non sono corretti.
ja: 公開イベントまたは保護されたイベントを処理するデリゲートに正しいシグネチャがないか、型またはパラメーター名を返します。
ko: public 또는 protected 이벤트를 처리하는 대리자에 올바른 시그니처, 반환 형식 또는 매개 변수 이름이 없습니다.
pl: Delegat obsługujący publiczne lub chronione zdarzenie nie ma prawidłowej sygnatury, typu zwracanego lub nazw parametrów.
pt_br: Um representante que manipula um evento público ou protegido não tem a assinatura, o tipo de retorno ou os nomes de parâmetro corretos.
ru: Делегат, который обрабатывает общедоступное или защищенное событие, имеет неверную сигнатуру, тип возвращаемого значения или имена параметров.
tr: Genel veya korumalı bir olayı işleyen bir temsilci doğru imza, dönüş türü veya parametre adlarına sahip değil.
zh_hans: 处理公开或受保护事件的委托不具有正确的签名、返回类型或参数名称。
zh_hant: 處理公開或受保護事件的委派沒有正確的簽章、傳回類型或參數名稱。

# UseGenericEventHandlerInstancesForEvent2Message
source: Change the event '{0}' to use a generic EventHandler by defining the event type explicitly, for e.g. Event MyEvent As EventHandler(Of MyEventArgs).
cs: Explicitním definováním typu události (například Event MyEvent As EventHandler(Of MyEventArgs)) změňte událost {0} tak, aby používala obecnou obslužnou rutinu EventHandler.
de: Ändern Sie das Ereignis "{0}" zur Verwendung eines generischen EventHandlers ab, indem Sie den Ereignistyp explizit definieren. Beispiel: Event MyEvent As EventHandler(Of MyEventArgs).
es: Cambie el evento "{0}" para que use un valor EventHandler genérico mediante la definición del tipo de evento de forma explícita. Por ejemplo: Event MyEvent As EventHandler(Of MyEventArgs).
fr: Changez l'événement '{0}' pour utiliser un EventHandler générique en définissant explicitement le type d'événement, par exemple Event MyEvent As EventHandler(Of MyEventArgs).
it: Modificare l'evento '{0}' per l'uso di un elemento EventHandler generico definendo il tipo di evento in modo esplicito, ad esempio Event MyEvent As EventHandler(Of MyEventArgs).
ja: 汎用 EventHandler を使用するために、イベント型を明示的に定義して、イベント '{0}' を変更します。例: Event MyEvent As EventHandler(Of MyEventArgs)
ko: Event MyEvent As EventHandler(Of MyEventArgs)와 같이 이벤트 형식을 명시적으로 정의하여 제네릭 EventHandler를 사용하도록 이벤트 '{0}'을(를) 변경하세요.
pl: Zmień zdarzenie „{0}”, aby użyć ogólnego elementu EventHandler, definiując jawnie typ zdarzenia, na przykład Event MyEvent As EventHandler(Of MyEventArgs).
pt_br: Altere o evento '{0}' para usar um EventHandler genérico definindo o tipo de evento de forma explícita, por exemplo, Evento MyEvent como EventHandler(Of MyEventArgs).
ru: Измените событие "{0}" так, чтобы использовать универсальный обработчик событий, явно определив тип события. Например: Event MyEvent As EventHandler(Of MyEventArgs).
tr: Olay türünü açık bir şekilde belirterek (örneğin, Event MyEvent As EventHandler(Of MyEventArgs)), '{0}' olayını genel bir EventHandler kullanacak şekilde değiştirin.
zh_hans: 通过显式定义事件类型，将事件“{0}”更改为使用泛型 EventHandler，例如 Event MyEvent As EventHandler(Of MyEventArgs)。
zh_hant: 明確定義事件類型，以將事件 '{0}' 變更為使用泛型 EventHandler，例如 Event MyEvent As EventHandler(Of MyEventArgs)。

# UseGenericEventHandlerInstancesForEvent2Description
source: A type contains an event that declares an EventHandler delegate that returns void, whose signature contains two parameters (the first an object and the second a type that is assignable to EventArgs), and the containing assembly targets Microsoft .NET Framework?2.0.
cs: Typ obsahuje událost, která deklaruje delegáta EventHandler, který vrací hodnotu void, jehož podpis obsahuje dva parametry (prvním je objekt a druhým je typ, který se dá přiřadit k EventArgs), přičemž cílem obsahujícího sestavení je Microsoft .NET Framework 2.0.
de: Ein Typ enthält ein Ereignis mit Deklaration eines EventHandler-Delegaten, der "void" zurückgibt und dessen Signatur zwei Parameter enthält (als ersten ein Objekt und als zweiten einen Typ, der EventArgs zugeordnet werden kann), und die enthaltene Assembly ist auf Microsoft .NET Framework 2.0 ausgerichtet.
es: Un tipo contiene un evento que declara un delegado de EventHandler que devuelve void, cuya signatura contiene dos parámetros (el primero un objeto y el segundo un tipo asignable a EventArgs) y el ensamblado contenedor está destinado a Microsoft .NET Framework 2.0.
fr: Un type contient un événement qui déclare un délégué EventHandler, qui retourne void, dont la signature contient deux paramètres (le premier est un objet et le second est un type pouvant être assigné à EventArgs). De plus, l'assembly conteneur cible Microsoft .NET Framework 2.0.
it: Un tipo contiene un evento che dichiara un delegato di EventHandler che restituisce void, la cui firma contiene due parametri (il primo è un oggetto e il secondo è un tipo assegnabile a EventArgs) e l'assembly che lo contiene è destinato a Microsoft .NET Framework 2.0.
ja: 型に void を返す EventHandler デリゲートを宣言するイベントが含まれており、デリゲートのシグネチャに 2 つのパラメーター (1 つはオブジェクト、もう 1 つは EventArgs に割り当て可能な型) が含まれ、包含アセンブリの対象が .NET Framework 2.0 です。
ko: 형식이 void를 반환하는 EventHandler 대리자를 선언하는 이벤트를 포함하며 이 형식의 시그니처는 매개 변수 2개(개체 및 EventArgs에 할당할 수 있는 형식) 및 포함하는 어셈블리 대상 Microsoft .NET Framework 2.0을 포함합니다.
pl: Typ zawiera zdarzenie, które deklaruje delegata EventHandler zwracającego wartość void i ma sygnaturę zawierającą dwa parametry (pierwszy jest obiektem, a drugi typem z możliwością przypisania do elementu EventArgs) oraz zawiera zestaw przeznaczony dla platformy Microsoft .NET Framework?2.0.
pt_br: Um tipo contém um evento que declara um representante EventHandler que retorna nulo, cuja assinatura contém dois parâmetros (o primeiro é um objeto e o segundo é um tipo atribuível a EventArgs), e o assembly recipiente é direcionado ao Microsoft .NET Framework 2.0.
ru: Тип содержит событие, которое объявляет делегат EventHandler. Этот делегат возвращает значение void, а его сигнатура содержит два параметра (первый является объектом, а второй — типом, назначаемым для EventArgs). Используемая сборка нацелена на платформу Microsoft .NET Framework 2.0.
tr: Bir tür, imzası iki parametre (ilki bir nesne, ikincisi EventArgs’a atanabilen bir tür) içeren ve void döndüren bir EventHandler temsilcisi bildiren bir olay içeriyor ve bunu içeren bütünleştirilmiş kod Microsoft .NET Framework 2.0 sürümünü hedefliyor.
zh_hans: 类型包含一个声明 EventHandler 委托返回 void 的事件，其签名包含两个参数(第一个参数为对象，第二个参数为分配给 EventArgs 的类型)，且包含程序集的目标为 Microsoft .NET Framework 2.0。
zh_hant: 類型包含的事件會宣告傳回 void 的 EventHandler 委派，其簽章內含兩個參數 (第一個為物件，第二個為可指派至 EventArgs 的類型)，而內含的組件則以 Microsoft .NET Framework 2.0 為目標。

# OverrideMethodsOnComparableTypesMessageBoth
source: {0} should define operator(s) '{1}' and Equals since it implements IComparable
cs: {0} má definovat operátory {1} a Rovná se, protože implementuje rozhraní IComparable.
de: "{0}" muss die Operatoren "{1}" und "Equals" definieren, weil IComparable implementiert wird.
es: {0} debe definir los operadores "{1}" y también Equals, porque implementa IComparable.
fr: {0} doit définir le ou les opérateurs '{1}' et Égal, car il implémente IComparable
it: {0} deve definire l'operatore o gli operatori '{1}' e Equals perché implementa IComparable
ko: {0}은(는) IComparable을 구현하므로 '{1}' 및 같음 연산자를 정의해야 합니다.
pl: Typ {0} powinien definiować operatory „{1}” i metodę Equals, ponieważ implementuje interfejs IComparable
pt_br: {0} deve definir os operadores '{1}' e Equals, pois implementa IComparable
ru: {0} должен определять операторы "{1}" и Equals, так как он реализует IComparable.
tr: {0}, IComparable'ı uyguladığından '{1}' işleçlerini ve Equals'ı tanımlamalıdır
zh_hans: 由于 {0} 实现 IComparable，因此它应定义“{1}”运算符和等于运算符
zh_hant: 因為 {0} 會實作 IComparable，所以應該定義運算子 '{1}' 與 Equals

# AvoidUsingCrefTagsWithAPrefixTitle
source: Avoid using cref tags with a prefix
cs: Nepoužívejte značky cref s předponou
de: Verwendung von cref-Tags mit einem Präfix vermeiden
es: Evitar el uso de etiquetas cref con un prefijo.
fr: Éviter d'utiliser des balises cref avec un préfixe
it: Evitare di usare tag cref con un prefisso
ja: cref タグをプレフィックスと共に使用しない
ko: 접두사와 cref 태그를 동시에 사용하지 마세요.
pl: Unikaj korzystania z tagów cref z prefiksem
pt_br: Evitar usar tags cref com um prefixo
ru: Не используйте теги cref в префиксе
tr: Ön ek içeren cref etiketlerini kullanmayın
zh_hans: 避免将 cref 标记与前缀结合使用
zh_hant: 避免使用有前置詞的 cref 標籤
