Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# LoggerMessageDiagnosticConcatenationInFormatStringTitle
source: Template should be a static expression
cs: Šablona by měla být statický výraz
de: Vorlage muss ein statischer Ausdruck sein
es: La plantilla debe ser una expresión estática
fr: Le modèle doit être une expression statique.
it: Il modello deve essere un'espressione statica
ko: 템플릿은 정적 표현식이어야 합니다.
pl: Szablon powinien być wyrażeniem statycznym
pt_br: O modelo deve ser uma expressão estática
ru: Шаблон должен быть статическим выражением
tr: Şablon statik bir ifade olmalıdır
zh_hans: 模板应为静态表达式
zh_hant: 範本應為靜態運算式

# LoggerMessageDiagnosticFormatParameterCountMismatchDescription
source: Number of parameters supplied in the logging message template do not match the number of named placeholders.
cs: Počet parametrů zadaných v šabloně zprávy protokolování neodpovídá počtu pojmenovaných zástupných objektů.
de: Die Anzahl der in der Vorlage für Protokollierungsnachrichten angegebenen Parameter stimmt nicht mit der Anzahl benannter Platzhalter überein.
es: El número de parámetros proporcionados en la plantilla de mensaje de registro no coincide con el número de marcadores de posición con nombre
fr: Le nombre de paramètres fournis dans le modèle de message de journalisation ne correspond pas au nombre d’espaces réservés nommés.
it: Il numero di parametri specificati nel modello di messaggio di registrazione non corrisponde al numero di segnaposto denominati.
ko: 로깅 메시지 템플릿에 제공된 매개 변수 수가 명명된 자리 표시자의 수와 일치하지 않습니다.
pl: Liczba parametrów podanych w szablonie wiadomości rejestrowania jest niezgodna z liczbą nazwanych symboli zastępczych.
pt_br: O número de parâmetros fornecidos no modelo de mensagem de log não corresponde ao número de espaços reservados nomeados.
ru: Количество параметров, указанных в шаблоне сообщения о ведении журнала, не соответствует количеству именованных заполнителей.
tr: Günlük kaydı ileti şablonunda sağlanan parametrelerin sayısı, adlandırılmış yer tutucular sayısıyla eşleşmiyor.
zh_hans: 日志记录消息模板中所提供参数的数量与已命名占位符的数量不匹配。
zh_hant: 記錄訊息範本中提供的參數數目不符合已命名預留位置的數目。

# LoggerMessageDiagnosticFormatParameterCountMismatchMessage
source: Number of parameters supplied in the logging message template do not match the number of named placeholders
cs: Počet parametrů zadaných v šabloně zprávy protokolování neodpovídá počtu pojmenovaných zástupných objektů.
de: Die Anzahl der in der Protokollierungsmeldungsvorlage angegebenen Parameter stimmt nicht mit der Anzahl der benannten Platzhalter überein
es: El número de parámetros proporcionados en la plantilla de mensaje de registro no coincide con el número de marcadores de posición con nombre
fr: Le nombre de paramètres fournis dans le modèle de message de journalisation ne correspond pas au nombre d’espaces réservés nommés.
it: Il numero di parametri specificati nel modello di messaggio di registrazione non corrisponde al numero di segnaposto denominati
ko: 로깅 메시지 템플릿에 제공된 매개 변수 수가 명명된 자리 표시자의 수와 일치하지 않습니다
pl: Liczba parametrów podanych w szablonie wiadomości rejestrowania jest niezgodna z liczbą nazwanych symboli zastępczych
pt_br: O número de parâmetros fornecidos no modelo de mensagem de log não corresponde ao número de espaços reservados nomeados
ru: Количество параметров, указанных в шаблоне сообщения о ведении журнала, не соответствует количеству именованных заполнителей
tr: Günlük kaydı ileti şablonunda sağlanan parametrelerin sayısı, adlandırılmış yer tutucuların sayısıyla eşleşmiyor
zh_hans: 日志记录消息模板中所提供参数的数量与已命名占位符的数量不匹配
zh_hant: 記錄訊息範本中提供的參數數目不符合已命名預留位置的數目

# LoggerMessageDiagnosticFormatParameterCountMismatchTitle
source: Parameter count mismatch
cs: Neshoda počtu parametrů.
de: Konflikt bei der Parameteranzahl
es: El recuento de parámetros no coincide
fr: Nombre de paramètres incorrects.
it: Numero di parametri non corrispondente
ko: 매개 변수의 개수가 일치하지 않음
pl: Niezgodność liczby parametrów
pt_br: Incompatibilidade de contagem de parâmetros
ru: Несоответствие количества параметров
tr: Parametre sayısı uyuşmazlığı
zh_hans: 参数计数不匹配。
zh_hant: 參數計數不符

# LoggerMessageDiagnosticMessageTemplateBracesMismatchDescription
source: The braces present in the message template are invalid. Ensure any braces in the message template are valid opening/closing braces, or are escaped.
cs: Složené závorky v šabloně zprávy jsou neplatné. Ujistěte se, že všechny složené závorky v šabloně zprávy jsou platné levé a pravé složené závorky nebo jsou uvozeny řídicími znaky.
de: Die in der Nachrichtenvorlage vorhandenen geschweiften Klammern sind ungültig. Stellen Sie sicher, dass alle geschweiften Klammern in der Nachrichtenvorlage gültige öffnende und schließende Klammern sind oder mit Escapezeichen versehen werden.
es: Las llaves presentes en la plantilla de mensaje no son válidas. Asegúrese de que las llaves de la plantilla de mensaje sean llaves de apertura o cierre válidas o que tengan caracteres de escape.
fr: Les accolades présentes dans le modèle de message ne sont pas valides. Vérifiez que les accolades du modèle de message sont des accolades ouvrantes/fermantes valides ou qu’elles sont placées dans une séquence d’échappement.
it: Le parentesi graffe presenti nel modello di messaggio non sono valide. Verifica che le parentesi graffe nel modello di messaggio siano parentesi graffe di apertura/chiusura valide o che siano precedute da un carattere di escape.
ko: 메시지 템플릿에 있는 중괄호가 잘못되었습니다. 메시지 템플릿의 중괄호가 올바른 여는 중괄호/닫는 중괄호이거나 이스케이프되어 있는지 확인하세요.
pl: Nawiasy klamrowe obecne w szablonie komunikatu są nieprawidłowe. Upewnij się, że wszystkie nawiasy klamrowe w szablonie komunikatu są prawidłowymi nawiasami klamrowymi otwierającymi/zamykającymi lub że zostały zmienione.
pt_br: As chaves presentes no modelo de mensagem são inválidas. Verifique se as chaves no modelo de mensagem são chaves de abertura/fechamento válidas ou se estão escapadas.
ru: В шаблоне сообщения есть недопустимые фигурные скобки. Убедитесь, что все фигурные скобки в шаблоне сообщения являются допустимыми открывающими/закрывающими скобками или экранированы.
tr: Mesaj şablonundaki küme ayraçları geçersiz. Mesaj şablonundaki tüm küme ayraçlarının geçerli açılış/kapanış küme ayraçları olduğundan veya kaçışının sağlandığından emin olun.
zh_hans: 消息模板中存在的大括号无效。确保消息模板中的任何大括号都是有效的左大括号/右大括号，或是转义的。
zh_hant: 顯示在訊息範本中的大括弧無效。請確保訊息範本中的任何大括弧都是有效的開啟/關閉大括弧，或已逸出。

# LoggerMessageDiagnosticMessageTemplateBracesMismatchMessage
source: The braces present in the message template are invalid
cs: Složené závorky v šabloně zprávy jsou neplatné.
de: Die in der Nachrichtenvorlage vorhandenen geschweiften Klammern sind ungültig.
es: Las llaves presentes en la plantilla de mensaje no son válidas
fr: Les accolades présentes dans le modèle de message ne sont pas valides
it: Le parentesi graffe presenti nel modello di messaggio non sono valide
ko: 메시지 템플릿에 있는 중괄호가 잘못되었습니다.
pl: Nawiasy klamrowe obecne w szablonie komunikatu są nieprawidłowe
pt_br: As chaves presentes no modelo de mensagem são inválidas
ru: В шаблоне сообщения есть недопустимые фигурные скобки
tr: Mesaj şablonunda bulunan küme ayraçları geçersiz
zh_hans: 消息模板中存在的大括号无效
zh_hant: 顯示在訊息範本中的大括弧無效

# LoggerMessageDiagnosticMessageTemplateBracesMismatchTitle
source: Invalid braces in message template
cs: Neplatné složené závorky v šabloně zprávy
de: Ungültige geschweifte Klammern in der Nachrichtenvorlage
es: Llaves no válidas en la plantilla de mensaje
fr: Accolades non valides dans le modèle de message
it: Parentesi graffe non valide nel modello di messaggio
ko: 메시지 템플릿의 중괄호가 잘못되었습니다.
pl: Nieprawidłowe nawiasy klamrowe w szablonie wiadomości
pt_br: Chaves inválidas no modelo de mensagem
ru: Недопустимые фигурные скобки в шаблоне сообщения
tr: Mesaj şablonunda geçersiz küme ayraçları
zh_hans: 消息模板中的大括号无效
zh_hant: 訊息範本中的大括號無效

# LoggerMessageDiagnosticNumericsInFormatStringDescription
source: Named placeholders in the logging message template should not be comprised of only numeric characters.
cs: Pojmenované zástupné symboly v šabloně zprávy protokolování by neměly obsahovat jenom číselné znaky.
de: Benannte Platzhalter in der Vorlage für Protokollierungsnachrichten dürfen nicht nur aus numerischen Zeichen bestehen.
es: Los marcadores de posición con nombre de la plantilla de mensaje de registro no deben estar formados solo por caracteres numéricos.
fr: Les espaces réservés nommés dans le modèle de message de journalisation ne doivent pas être composés uniquement de caractères numériques.
it: I segnaposto denominati nel modello di messaggio di registrazione non devono contenere solo caratteri numerici.
ko: 로깅 메시지 템플릿의 명명된 자리 표시자는 숫자로만 구성되어서는 안 됩니다.
pl: Nazwane symbole zastępcze w szablonie wiadomości rejestrowania nie powinny składać się tylko z samych cyfr.
pt_br: Espaços reservados nomeados no modelo de mensagem de log não devem ser compostos apenas de caracteres numéricos.
ru: Именованные заполнители в шаблоне сообщения о ведении журнала не должны состоять только из цифр.
tr: Günlük ileti şablonundaki adlandırılmış yer tutucular, yalnızca sayısal karakterlerden oluşmamalıdır
zh_hans: 日志记录消息模板中的已命名占位符不应仅由数值字符组成。
zh_hant: 記錄訊息範本中命名的預留位置不能只包含數值字元。

# LoggerMessageDiagnosticNumericsInFormatStringMessage
source: Named placeholders in the logging message template should not be comprised of only numeric characters
cs: Pojmenované zástupné symboly v šabloně zprávy protokolování by neměly obsahovat jenom číselné znaky
de: Benannte Platzhalter in der Vorlage für Protokollierungsnachrichten dürfen nicht nur aus numerischen Zeichen bestehen.
es: Los marcadores de posición con nombre de la plantilla de mensaje de registro no deben estar formados solo por caracteres numéricos
fr: Les espaces réservés nommés dans le modèle de message de journalisation ne doivent pas être composés uniquement de caractères numériques.
it: I segnaposto denominati nel modello di messaggio di registrazione non devono contenere solo caratteri numerici
ko: 로깅 메시지 템플릿의 명명된 자리 표시자는 숫자로만 구성되어서는 안 됩니다.
pl: Nazwane symbole zastępcze w szablonie wiadomości rejestrowania nie powinny składać się tylko z samych cyfr
pt_br: Espaços reservados nomeados no modelo de mensagem de log não devem ser compostos apenas de caracteres numéricos
ru: Именованные заполнители в шаблоне сообщения о ведении журнала не должны состоять только из цифр
tr: Günlük ileti şablonundaki adlandırılmış yer tutucular, yalnızca sayısal karakterlerden oluşmamalıdır
zh_hans: 日志记录消息模板中的已命名占位符不应仅由数字字符组成
zh_hant: 記錄訊息範本中命名的預留位置不能只包含數值字元

# LoggerMessageDiagnosticNumericsInFormatStringTitle
source: Named placeholders should not be numeric values
cs: Pojmenované zástupné symboly by neměly být číselné hodnoty.
de: Benannte Platzhalter dürfen keine numerischen Werte sein
es: Los marcadores de posición con nombre no deben ser valores numéricos
fr: Les espaces réservés nommés ne doivent pas être des valeurs numériques.
it: I segnaposto denominati non devono essere valori numerici
ko: 명명된 자리 표시자는 숫자 값이 아니어야 합니다.
pl: Nazwane symbole zastępcze nie powinny być wartościami liczbowymi
pt_br: Espaços reservados nomeados não devem ser valores numéricos
ru: Именованные заполнители не должны быть числовыми значениями
tr: Adlandırılmış yer tutucular sayısal değerler olmamalıdır
zh_hans: 已命名占位符不应是数值
zh_hant: 命名的預留位置不應為數值

# LoggerMessageDiagnosticUseCompiledLogMessagesDescription
source: For improved performance, use the LoggerMessage delegates.
cs: Pokud chcete zvýšit výkon, použijte delegáty LoggerMessage.
de: Um die Leistung zu verbessern, verwenden Sie die LoggerMessage-Delegaten.
es: Para mejorar el rendimiento, use los delegados LoggerMessage.
fr: Pour de meilleures performances, utilisez les délégués LoggerMessage.
it: Per prestazioni ottimali, usare i delegati di LoggerMessage.
ko: 성능 향상을 위해 LoggerMessage 대리자를 사용하세요.
pl: Aby zwiększyć wydajność, użyj delegatów LoggerMessage.
pt_br: Para melhorar o desempenho, use os delegados LoggerMessage.
ru: Для повышения производительности используйте делегаты LoggerMessage.
tr: İyileştirilmiş performans için LoggerMessage temsilcilerini kullanın
zh_hans: 若要提高性能，请使用 LoggerMessage 委托。
zh_hant: 為提高效能，請使用 LoggerMessage 委派。

# LoggerMessageDiagnosticUseCompiledLogMessagesMessage
source: For improved performance, use the LoggerMessage delegates instead of calling '{0}'
cs: Pro lepší výkon použijte delegáty LoggerMessage místo volání {0}
de: Um die Leistung zu verbessern, verwenden Sie die LoggerMessage-Delegaten, statt "{0}" aufzurufen.
es: Para mejorar el rendimiento, use los delegados LoggerMessage en lugar de llamar a "{0}"
fr: Pour de meilleures performances, utilisez les délégués LoggerMessage au lieu d’appeler ' {0} '.
it: Per prestazioni ottimali, usare i delegati di LoggerMessage invece di chiamare '{0}'
ko: 성능 향상을 위해 '{0}'을(를) 호출하는 대신 LoggerMessage 대리자를 사용하세요.
pl: Aby zwiększyć wydajność, użyj delegatów LoggerMessage zamiast wywoływać metodę „{0}”
pt_br: Para melhorar o desempenho, use os delegados LoggerMessage em vez de chamar '{0}'
ru: Для повышения производительности используйте делегаты LoggerMessage вместо вызова "{0}"
tr: İyileştirilmiş performans için '{0}' çağırmak yerine LoggerMessage temsilcilerini kullanın
zh_hans: 为了提高性能，请使用 LoggerMessage 委托，而不是调用“{0}”
zh_hant: 為提高效能，請使用 LoggerMessage 委派而不是呼叫 '{0}'

# LoggerMessageDiagnosticUseCompiledLogMessagesTitle
source: Use the LoggerMessage delegates
cs: Použít delegáty LoggerMessage
de: LoggerMessage-Delegaten verwenden
es: Usar los delegados LoggerMessage
fr: Utiliser les délégués LoggerMessage
it: Usare i delegati di LoggerMessage
ko: LoggerMessage 대리자 사용
pl: Użyj delegatów LoggerMessage
pt_br: Usar os delegados LoggerMessage
ru: Использовать делегаты LoggerMessage
tr: LoggerMessage temsilcilerini kullanın
zh_hans: 使用 LoggerMessage 委托
zh_hant: 請使用 LoggerMessage 委派

# LoggerMessageDiagnosticUsePascalCasedLogMessageTokensDescription
source: Use PascalCase for named placeholders in the logging message template.
cs: Pro pojmenované zástupné symboly v šabloně zprávy protokolování použijte možnost AspxCase.
de: Verwenden Sie PascalCase für benannte Platzhalter in der Vorlage für Protokollierungsnachrichten.
es: Use PascalCase para marcadores de posición con nombre en la plantilla de mensaje de registro.
fr: Utilisez casse Pascal pour les espaces réservés nommés dans le modèle de message de journalisation.
it: Usare la notazione Pascal per i segnaposto denominati nel modello di messaggio di registrazione.
ko: 로깅 메시지 템플릿에서 명명된 자리 표시자에 대해 PascalCase를 사용합니다.
pl: Użyj formatu PascalCase dla nazwanych symboli zastępczych w szablonie wiadomości rejestrowania.
pt_br: Use o PascalCase para espaços reservados nomeados no modelo de mensagem de log.
ru: Используйте PascalCase для именованных заполнителей в шаблоне сообщения о ведении журнала.
tr: Günlük ileti şablonunda adlandırılmış yer tutucular için PascalCase kullanın.
zh_hans: 在日志记录消息模板中将 PascalCase 用于已命名占位符。
zh_hant: 在記錄訊息範本中為命名的預留位置使用首字母大寫。

# LoggerMessageDiagnosticUsePascalCasedLogMessageTokensMessage
source: Use PascalCase for named placeholders in the logging message template
cs: Pro pojmenované zástupné symboly v šabloně zprávy protokolování použijte možnost AspxCase.
de: Verwenden Sie PascalCase für benannte Platzhalter in der Vorlage für Protokollierungsnachrichten.
es: Usar PascalCase para marcadores de posición con nombre en la plantilla de mensaje de registro
fr: Utilisez casse Pascal pour les espaces réservés nommés dans le modèle de message de journalisation.
it: Usare la notazione Pascal per i segnaposto denominati nel modello di messaggio di registrazione
ko: 로깅 메시지 템플릿의 명명된 자리 표시자에 PascalCase 사용
pl: Użyj formatu PascalCase dla nazwanych symboli zastępczych w szablonie wiadomości rejestrowania
pt_br: Usar o PascalCase para espaços reservados nomeados no modelo de mensagem de log
ru: Использовать PascalCase для именованных заполнителей в шаблоне сообщения о ведении журнала
tr: Günlük ileti şablonunda adlandırılmış yer tutucular için PascalCase kullanın
zh_hans: 在日志记录消息模板中将 PascalCase 用于已命名占位符
zh_hant: 在記錄訊息範本中為命名的預留位置使用首字母大寫

# LoggerMessageDiagnosticUsePascalCasedLogMessageTokensTitle
source: Use PascalCase for named placeholders
cs: Používat PascalCase pro pojmenované zástupné objekty
de: PascalCase für benannte Platzhalter verwenden
es: Usar PascalCase para marcadores de posición con nombre
fr: Utiliser casse Pascal pour les espaces réservés nommés
it: Usare la notazione Pascal per i segnaposto denominati
ko: 명명된 자리 표시자에 대해 PascalCase 사용
pl: Używanie języka PascalCase dla nazwanych symboli zastępczych
pt_br: Usar o PascalCase nos espaços reservados nomeados
ru: Использовать PascalCase для именованных заполнителей
tr: Adlandırılmış yer tutucular için PascalCase kullanın
zh_hans: 将 PascalCase 用于已命名占位符
zh_hant: 將 PascalCase 用於已命名的預留位置

# MakeTypesInternalCodeFixTitle
source: Make the public type internal
cs: Nastavte veřejný typ jako interní
de: Öffentlichen Typ als intern festlegen
es: Hacer que el tipo de público sea interno
fr: Rendre le type public interne
it: Imposta il tipo pubblico come interno
ko: 공개 형식을 내부로 만들기
pl: Ustaw typ publiczny jako wewnętrzny
pt_br: Tornar interno o tipo público
ru: Сделать общедоступный тип внутренним
tr: Genel türü dahili yapma
zh_hans: 使公共类型成为内部类型
zh_hant: 將公用類型設為內部

# MakeTypesInternalDescription
source: Unlike a class library, an application's API isn't typically referenced publicly, so types can be marked internal.
cs: Na rozdíl od knihovny tříd se na rozhraní API aplikace obvykle neodkazuje veřejně, takže typy se dají označit jako interní.
de: Im Gegensatz zu einer Klassenbibliothek wird in der Regel nicht öffentlich auf die API einer Anwendung verwiesen, sodass Typen als intern markiert werden können.
es: A diferencia de una biblioteca de clases, normalmente no se hace referencia públicamente a la API de una aplicación, por lo que los tipos se pueden marcar como internos.
fr: Contrairement à une bibliothèque de classes, l’API d’une application n’est généralement pas référencée publiquement. Les types peuvent donc être marqués comme internes.
it: A differenza di una libreria di classi, in genere non viene fatto riferimento pubblicamente all'API di un'applicazione, quindi i tipi possono essere contrassegnati come interni.
ko: 클래스 라이브러리와 달리 애플리케이션의 API는 일반적으로 공개적으로 참조되지 않으므로 형식을 내부로 표시할 수 있습니다.
pl: W przeciwieństwie do biblioteki klas, interfejs API aplikacji nie jest zwykle przywoływany publicznie, więc typy mogą być oznaczone jako wewnętrzne.
pt_br: Ao contrário de uma biblioteca de classes, a API de um aplicativo normalmente não é referenciada publicamente, portanto, os tipos podem ser marcados como internos.
ru: В отличие от библиотеки классов, для API приложения обычно не используется общедоступная ссылка, поэтому типы можно пометить как внутренние.
tr: Sınıf kitaplığından farklı olarak, uygulamanın API'sine genel olarak başvurulamadığından türler dahili olarak işaretlenebilir.
zh_hans: 与类库不同，应用程序的 API 通常不会公开引用，因此可以将类型标记为内部类型。
zh_hant: 與類別庫不同，應用程式的 API 通常不會公開參照，因此可將類型標示為內部。

# MakeTypesInternalMessage
source: Because an application's API isn't typically referenced from outside the assembly, types can be made internal
cs: Vzhledem k tomu, že rozhraní API aplikace obvykle neodkazuje mimo sestavení, je možné typy nastavit jako interní.
de: Da die API einer Anwendung normalerweise nicht von außerhalb der Assembly referenziert wird, können Typen intern gemacht werden.
es: Dado que no se suele hacer referencia a la API de una aplicación desde fuera del ensamblado, los tipos se pueden hacer internos
fr: Étant donné que l’API d’une application n’est généralement pas référencée en dehors de l’assembly, les types peuvent être rendus internes
it: Poiché all'API di un'applicazione non viene fatto riferimento dall'esterno dell'assembly, è possibile rendere i tipi interni
ko: 애플리케이션의 API는 일반적으로 어셈블리 외부에서 참조되지 않으므로 내부 형식을 만들 수 있습니다.
pl: Ze względu na to, że interfejs API aplikacji nie jest zwykle odwoływany spoza zespołu, typy mogą być wewnętrzne
pt_br: Como a API de um aplicativo normalmente não é referenciada de fora do assembly, é possível tornar os tipos internos
ru: Так как для API приложения обычно не используется ссылка из-за пределов сборки, типы можно сделать внутренними
tr: Bir uygulamanın API'sine genellikle derlemenin dışından başvurulmadığından türler dahili olarak kullanılabilir
zh_hans: 由于应用程序的 API 通常不是从程序集外部引用的，因此可以将类型设置为内部类型
zh_hant: 因為應用程式的 API 通常不是從組件外部參考，所以可以將類型設定為內部

# MakeTypesInternalTitle
source: Consider making public types internal
cs: Zvažte interní nastavení veřejných typů
de: Erwägen Sie, öffentliche Typen intern zu machen.
es: Considere la posibilidad de hacer que los tipos públicos sean internos
fr: Envisager de rendre les types publics internes
it: Provare a rendere i tipi pubblici interni
ko: 공개 형식을 내부로 만드는 것이 좋습니다.
pl: Rozważ wprowadzenie typów publicznych jako wewnętrznych
pt_br: Considere tornar internos os tipos públicos
ru: Рассмотрите возможность сделать общедоступные типы внутренними
tr: Genel türleri dahili hale getirmeyi düşünün
zh_hans: 考虑将公共类型设为内部类型
zh_hant: 請考慮將公用類型設為內部

# MarkAttributesWithAttributeUsageCodeFix
source: Apply 'AttributeUsageAttribute'
cs: Použít AttributeUsageAttribute
de: "AttributeUsageAttribute" anwenden
es: Aplicar "AttributeUsageAttribute"
fr: Appliquer 'AttributeUsageAttribute'
it: Applica 'AttributeUsageAttribute'
ko: 'AttributeUsageAttribute' 적용
pl: Zastosuj element „AttributeUsageAttribute”
pt_br: Aplicar 'AttributeUsageAttribute'
ru: Применить "AttributeUsageAttribute"
tr: 'AttributeUsageAttribute' uygula
zh_hans: 应用 "AttributeUsageAttribute"
zh_hant: 套用 'AttributeUsageAttribute'

# OperatorOverloadsHaveNamedAlternatesCodeFixTitle
source: Add operator overload named alternate
cs: Přidat přetížení operátoru s názvem alternate
de: Operatorüberladung mit alternativem Namen hinzufügen
es: Agregar alternativa con nombre de la sobrecarga del operador
fr: Ajouter une surcharge d'opérateur nommée alternate
it: Aggiungi l'overload degli operatori con nome alternativo
ko: 연산자 오버로드 명명된 대체 항목 추가
pl: Dodawanie nazwanego elementu alternatywnego przeciążenia operatora
pt_br: Adicionar uma alternativa nomeada de sobrecarga do operador
ru: Добавление перегрузки оператора с другим именем
tr: Alternatif adlı işleç aşırı yüklemesi ekleme
zh_hans: 添加名为“替代”的运算符重载
zh_hant: 新增名稱為 alternate 的運算子多載

# RemoveRedundantElementInitializationCodeFixTitle
source: Remove redundant element initializer
cs: Odebrat redundantní inicializátor prvků
de: Redundanten Elementinitialisierer entfernen
es: Quitar el inicializador del elemento redundante
fr: Supprimer l'initialiseur d'élément redondant
it: Rimuovere l'inizializzatore di elemento ridondante
ko: 중복 요소 이니셜라이저 제거
pl: Usuń nadmiarowy inicjator elementów
pt_br: Remover inicializador de elemento redundante
ru: Удалите лишний инициализатор элементов
tr: Gereksiz öğe başlatıcısını kaldır
zh_hans: 删除冗余的元素初始值设定项
zh_hant: 移除多餘的項目初始設定式

# TypesThatOwnDisposableFieldsShouldBeDisposableTitle
source: Types that own disposable fields should be disposable
cs: Typy, které vlastní jednoúčelová pole, mají být jednoúčelové.
de: Typen mit eigenen verwerfbaren Feldern müssen verwerfbar sein
es: Los tipos que poseen campos descartables deben ser descartables
fr: Les types qui ont des champs supprimables doivent être supprimables
it: I tipi proprietari di campi Disposable devono essere Disposable
ja: 破棄可能なフィールドを所有する型は、破棄可能でなければなりません
ko: 삭제 가능한 필드가 있는 형식은 삭제해야 합니다.
pl: Typy zawierające pola możliwe do likwidacji powinny być możliwe do likwidacji
pt_br: Tipos que têm campos descartáveis devem ser descartáveis
ru: Типы, владеющие высвобождаемыми полями, должны быть высвобождаемыми
tr: Atılabilir alanlara sahip olan türler atılabilir olmalıdır
zh_hans: 具有可释放字段的类型应该是可释放的
zh_hant: 擁有可處置欄位的類型，本身應為可處置
