Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AvoidOutParametersMessage
source: Avoid 'out' parameters as they are not designed for general audience
cs: Nenastavujte parametry out, protože nejsou určené pro širokou cílovou skupinu.
de: Vermeiden Sie out-Parameter, weil diese nicht für eine allgemeine Zielgruppe vorgesehen sind.
es: Evite los parámetros "out" porque no están diseñados para el público en general.
fr: Évitez les paramètres 'out', car ils ne sont pas conçus pour une audience non spécialisée
it: Evitare i parametri 'out' perché non sono progettati per utenti generici
ko: 'out' 매개 변수는 일반 사용자용으로 설계되지 않았으므로 사용하지 마세요.
pl: Unikaj parametrów „out”, ponieważ nie są one przeznaczone dla wszystkich
pt_br: Evite parâmetros 'out', pois eles não são projetados para o público em geral
ru: Избегайте параметров "out", так как они не предназначены для общей аудитории.
tr: Genel hedef kitle için tasarlanmadığından 'out' parametrelerini kullanmaktan kaçının
zh_hans: 请避免使用 "out" 参数，因为它们不是针对一般受众设计的
zh_hant: 因為不是為一般對象設計，所以請避免使用 'out' 參數

# AvoidOutParametersTitle
source: Avoid out parameters
cs: Vyhněte se výstupním parametrům
de: out-Parameter vermeiden
es: Evitar parámetros out
fr: Éviter les paramètres out
it: Evitare parametri out
ja: out パラメーターを使用しません
ko: out 매개 변수를 사용하지 마십시오.
pl: Unikaj parametrów out
pt_br: Evitar parâmetros out
ru: Не используйте параметры out
tr: out parametrelerinden kaçının
zh_hans: 避免使用 out 参数
zh_hant: 避免使用 out 參數

# CollectionsShouldImplementGenericInterfaceMultipleMessage
source: Type '{0}' directly or indirectly inherits '{1}' without implementing any of '{2}'. Publicly-visible types should implement the generic version to broaden usability.
cs: Typ {0} přímo nebo nepřímo dědí {1} bez implementace kterékoli položky {2}. Veřejně viditelné typy by kvůli větší využitelnosti měly implementovat obecnou verzi.
de: Der Typ "{0}" erbt "{1}" direkt oder indirekt ohne Implementierung von "{2}". Öffentlich sichtbare Typen müssen die generische Version implementieren, um die Nutzbarkeit zu erweitern.
es: El tipo "{0}" hereda "{1}" de manera directa o indirecta sin implementar cualquier "{2}". Los tipos visibles públicamente deben implementar la versión genérica para ampliar su capacidad de uso.
fr: Le type '{0}' hérite directement ou indirectement de tout '{1}' sans implémenter '{2}'. Les types visibles de manière publique doivent implémenter la version générique pour étendre leur efficacité d'utilisation.
it: Il tipo '{0}' eredita direttamente o indirettamente '{1}' senza implementare '{2}'. I tipi visibili pubblicamente devono implementare la versione generica per ampliare l'usabilità.
ko: 형식 '{0}'은(는) '{2}' 중 무엇도 구현하지 않고 직접 또는 간접적으로 '{1}'을(를) 상속합니다. 공개된 형식의 유용성을 확대하려면 제네릭 버전을 구현해야 합니다.
pl: Typ „{0}” bezpośrednio lub pośrednio dziedziczy element „{1}”, bez implementowania żadnego z elementów „{2}”. Typy widoczne publicznie powinny implementować wersję ogólną, aby zwiększyć użyteczność.
pt_br: O tipo '{0}' herda direta ou indiretamente '{1}' sem implementar nenhum dos '{2}'. Tipos publicamente visíveis devem implementar a versão genérica para ampliar a usabilidade.
ru: Тип "{0}" прямо или косвенно наследует "{1}" без реализации какого-либо из "{2}". Общедоступные типы должны реализовывать универсальную версию для повышения удобства использования.
tr: '{0}' türü, herhangi bir '{2}' uygulamaksızın doğrudan veya dolaylı olarak şunu devralır: '{1}'. Herkese görünür türler, kullanılabilirliği genişletmek için genel sürümü uygulamalıdır.
zh_hans: 类型“{0}”会直接或间接继承“{1}”，而不实现任何“{2}”。公共可见的类型应实现通用版本以扩大可用性。
zh_hant: 類型 '{0}' 未實作任何 '{2}' 便直接或間接繼承 '{1}'。公開顯示的類型應實作一般版本以擴大可用性。

# DoNotCatchGeneralExceptionTypesDescription
source: A general exception such as System.Exception or System.SystemException or a disallowed exception type is caught in a catch statement, or a general catch clause is used. General and disallowed exceptions should not be caught.
cs: Obecná výjimka, třeba System.Exception, System.SystemException, nebo nepovolený typ výjimky se zachytávají příkazem catch nebo se používá obecná klauzule catch. Obecné a nepovolené výjimky by se neměly zachytávat.
de: Eine allgemeine Ausnahme wie "System.Exception" oder "System.SystemException" oder ein unzulässiger Ausnahmetyp wurde durch eine catch-Anweisung abgefangen, oder es wird eine Klausel verwendet, um Ausnahmen generell abzufangen. Allgemeine und unzulässige Ausnahmen sollten jedoch nicht abgefangen werden.
es: Una excepción general, como System.Exception o System.SystemException, o un tipo de excepción no permitido se captura con una instrucción catch, o bien se utiliza una cláusula catch general. No deben capturarse excepciones generales o no permitidas.
fr: Une exception générale comme System.Exception ou System.SystemException, ou un type d'exception interdit, est interceptée dans une instruction catch, ou une clause catch générale est utilisée. Les exceptions générales ou interdites ne doivent pas être interceptées.
it: In un'istruzione catch è stato rilevato un tipo di eccezione non consentito o un'eccezione generale, come System.Exception o System.SystemException, oppure viene usata una clausola catch generale. Le eccezioni generali e non consentite non dovrebbero essere rilevate.
ja: System.Exception や System.SystemException などの一般的な例外、または許可されていない例外の種類は catch ステートメントでキャッチされます。または一般的な catch 句を使用します。一般的な例外と許可されていない例外をキャッチしないでください。
ko: System.Exception이나 System.SystemException과 같은 일반 예외 또는 허용되지 않는 예외 형식이 catch 문에서 catch되거나, 일반 catch 절이 사용됩니다. 일반 예외와 허용되지 않는 예외는 catch되면 안 됩니다.
pl: W instrukcji catch przechwycono wyjątek ogólny, taki jak System.Exception lub System.SystemException albo wyjątek niedozwolonego typu, lub jest używana ogólna klauzula catch. Wyjątki ogólne i niedozwolone nie powinny być przechwytywane.
pt_br: Uma exceção geral, como System.Exception ou System.SystemException, ou uma exceção não permitida foi capturada em uma instrução catch ou uma cláusula catch geral foi usada. As exceções gerais e não permitidas não devem ser capturadas.
ru: Общее исключение, такое как System.Exception, System.SystemException или недопустимый тип исключения, перехватывается в выражении catch либо используется общее выражение catch. Общие и недопустимые исключения не должны перехватываться.
tr: System.Exception veya System.SystemException gibi genel bir ifade veya izin verilmeyen bir özel durum türü bir catch ifadesinde yakalandı ya da genel bir catch ifadesi kullanıldı. Genel özel durumlar yakalanmamalıdır.
zh_hans: 在 catch 语句中捕获到了 System.Exception 或 System.SystemException 等常规异常或不允许的异常类型，或者已使用常规 catch 子句。不应捕获常规异常和不允许的异常。
zh_hant: 在 catch 陳述式中捕捉到了 System.Exception 或 System.SystemException 等一般例外狀況或不允許的例外狀況類型，或是使用了一般 catch 子句。不應捕捉到一般例外狀況。

# DoNotCatchGeneralExceptionTypesMessage
source: Modify '{0}' to catch a more specific allowed exception type, or rethrow the exception
cs: Pokud chcete zachytit konkrétnější povolený typ výjimky, upravte {0} nebo výjimku vyvolejte znovu.
de: Ändern Sie "{0}", um spezifischere zulässige Ausnahmetypen abzufangen, oder lösen Sie die Ausnahme erneut aus.
es: Modifique "{0}" para capturar un tipo de excepción permitido más específico o bien reinicie la excepción.
fr: Modifiez '{0}' pour intercepter un type d'exception autorisé plus spécifique ou levez une nouvelle fois l'exception
it: Modificare '{0}' in modo da rilevare un tipo di eccezione consentito più specifico o generare di nuovo l'eccezione
ko: '{0}'을(를) 수정하여 좀 더 구체적인 허용 예외 형식을 catch하거나 해당 예외를 다시 throw합니다.
pl: Zmodyfikuj element „{0}”, aby przechwytywać dokładniej określony dozwolony typ wyjątku, lub ponownie zgłoś wyjątek
pt_br: Modifique '{0}' para capturar um tipo de exceção permitida mais específico ou gerar a exceção novamente
ru: Измените "{0}", чтобы перехватывать исключение более конкретного типа или выдать исключение повторно.
tr: Daha belirli bir izin verilen özel durum türünü yakalamak için '{0}' öğesini değiştirin veya özel durumu yeniden oluşturun
zh_hans: 请修改“{0}”以捕获更具体的允许异常类型，或者重新抛出该异常
zh_hant: 請修改 '{0}' 來捕捉更具體的允許例外狀況型別，或重新擲回例外狀況

# DoNotCatchGeneralExceptionTypesTitle
source: Do not catch general exception types
cs: Nezachytávejte obecné typy výjimek
de: Keine allgemeinen Ausnahmetypen abfangen
es: No capture tipos de excepción generales.
fr: Ne pas intercepter les types d'exception générale
it: Non rilevare tipi di eccezione generali
ja: 一般的な例外の種類はキャッチしません
ko: 일반적인 예외 형식을 catch하지 마세요.
pl: Nie przechwytuj ogólnych typów wyjątków
pt_br: Não capturar exceptions de tipos genéricos
ru: Не перехватывать исключения общих типов
tr: Genel özel durum türlerini yakalama
zh_hans: 不捕获常规异常类型
zh_hant: 不要攔截一般例外狀況類型

# DoNotDeclareProtectedMembersInSealedTypesDescription
source: Types declare protected members so that inheriting types can access or override the member. By definition, you cannot inherit from a sealed type, which means that protected methods on sealed types cannot be called.
cs: Typy deklarují chráněné členy, aby dědící typy k nim měly přístup nebo je mohly přepisovat. Z definice plyne, že ze zapečetěného typu není možné dědit, což znamená, že chráněné metody zapečetěných typů není možné volat.
de: Typen deklarieren geschützte Member so, dass erbende Typen auf das Element zugreifen oder es außer Kraft setzen können. Per Definition ist eine Vererbung durch einen versiegelten Typ nicht möglich, d. h. geschützte Methoden in versiegelten Typen können nicht aufgerufen werden.
es: Los tipos declaran miembros protegidos para que los tipos de herencia puedan acceder al miembro o reemplazarlo. Por definición, no se puede heredar de un tipo sellado, lo que significa que no se puede llamar a los métodos protegidos en los tipos sellados.
fr: Les types déclarent des membres protégés pour que les types qui héritent puissent accéder au membre ou l'écraser. Par définition, vous ne pouvez pas hériter d'un type sealed, ce qui signifie que les méthodes protégées des types sealed ne peuvent pas être appelées.
it: I tipi dichiarano membri protetti in modo che i tipi che ereditano possano accedere o eseguire l'override del membro. Per definizione, non è possibile ereditare da un tipo sealed, di conseguenza non è possibile chiamare metodi protetti su tipi sealed.
ko: 형식은 상속하는 형식이 멤버에 액세스하거나 멤버를 재정의할 수 있도록 protected 멤버를 선언합니다. 정의에 따라 sealed 형식에서는 상속할 수 없습니다. 즉, sealed 형식에 대한 protected 메서드는 호출할 수 없습니다.
pl: Typy deklarują chronione składowe, więc dziedziczące typy mogą uzyskać dostęp do składowej lub ją przesłonić. Zgodnie z definicją nie można dziedziczyć z zapieczętowanego typu, co oznacza, że nie można wywoływać chronionych metod w zapieczętowanych typach.
pt_br: Os tipos declaram membros protegidos para que os tipos de herança possam acessar ou substituir o membro. Por definição, você não pode herdar de um tipo selado, o que significa que métodos protegidos em tipos selados não podem ser chamados.
ru: Типы объявляют защищенные члены, чтобы наследующие типы могли получить доступ к члену или переопределить его. По определению вы не можете наследовать от запечатанного типа, то есть невозможно вызывать защищенные методы в запечатанных типах.
tr: Türler, korumalı üyeleri, devralan türlerin erişebilmesi veya geçersiz kılabilmesi için bildirir. Tanım olarak, kapalı bir türü devralamazsınız; yani kapalı türlerin korumalı üyeleri çağrılamaz.
zh_hans: 类型声明受保护的成员，以便继承类型可以访问或重写成员。根据定义，不能从密封类型继承，这意味着不能调用密封类型上的受保护方法。
zh_hant: 類型會宣告受保護的成員，讓繼承類型可以存取或覆寫該成員。根據定義，您無法從密封類型進行繼承，這表示無法呼叫密封類型上的受保護方法。

# DoNotDeclareProtectedMembersInSealedTypesMessage
source: '{0}' is a new protected member in the 'NonInheritable' class '{1}'
cs: {0} je nový chráněný člen ve třídě NonInheritable {1}.
de: '"{0}" ist ein neuer geschützter Member in der NonInheritable-Klasse "{1}".
es: "{0}" es un nuevo miembro protegido de la clase "NonInheritable" "{1}"
fr: '{0}' est un nouveau membre protégé dans la classe 'NonInheritable' '{1}'
it: '{0}' è un nuovo membro protetto nella classe '{1}' di 'NonInheritable'
ko: '{0}'은(는) 'NonInheritable' 클래스 '{1}'의 새 protected 멤버입니다.
pl: „{0}” to nowa chroniona składowa w klasie „NonInheritable” „{1}”
pt_br: '{0}' é um novo membro protegido na classe 'NonInheritable' '{1}'
ru: "{0}" — новый защищенный элемент в "ненаследуемом" классе "{1}".
tr: '{0}', '{1}' adlı 'NonInheritable' sınıfında yeni bir korumalı üye
zh_hans: “{0}”是 NonInheritable 类“{1}”中新的受保护成员
zh_hant: '{0}' 是 'NonInheritable' 類別 '{1}' 中新的受保護成員

# DoNotDeclareProtectedMembersInSealedTypesTitle
source: Do not declare protected member in sealed type
cs: Nedeklarovat chráněný člen v zapečetěném typu
de: Geschützte Member nicht in versiegelten Typen deklarieren
es: No declarar miembro protegido en tipo sellado
fr: Ne pas déclarer un membre protégé dans un type sealed
it: Non dichiarare il membro protetto nel tipo sealed
ko: protected 멤버를 sealed 형식으로 선언하지 마세요.
pl: Nie deklaruj chronionej składowej w zapieczętowanym typie
pt_br: Não declarar o membro protegido no tipo selado
ru: Не объявляйте защищенный член в запечатанном типе
tr: Bir kapalı türde korumalı üye bildirme
zh_hans: 不要在密封类型中声明受保护的成员
zh_hant: 不要在密封類型中宣告受保護成員

# DoNotIgnoreMethodResultsMessageLinqMethod
source: '{0}' calls '{1}' but does not use the value the method returns. Linq methods are known to not have side effects. Use the result in a conditional statement, assign the result to a variable, or pass it as an argument to another method.
cs: {0} volá {1}, ale nepoužívá hodnotu, kterou tato metoda vrací. O metodách Linq se ví, že nemají vedlejší účinky. Použijte výsledek v podmíněném příkazu, přiřaďte výsledek proměnné nebo ho předejte jako argument jiné metodě.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht den von der Methode zurückgegebenen Wert. Linq-Methoden sind bekannt dafür, dass sie keine Nebeneffekte haben. Verwenden Sie das Ergebnis in einer Bedingungsanweisung, weisen Sie das Ergebnis einer Variablen zu, oder übergeben Sie es als Argument an eine andere Methode.
es: "{0}" llama a "{1}", pero no usa el valor que el método devuelve. Los métodos LINQ son conocidos por no tener efectos secundarios. Use el resultado en una instrucción condicional, asigne el resultado a una variable o páselo como argumento a otro método.
fr: '{0}' appelle '{1}' mais n'utilise pas la valeur retournée par la méthode. Les méthodes Linq sont connues pour ne pas avoir d'effets secondaires. Utilisez le résultat dans une instruction conditionnelle, assignez-le à une variable ou passez-le en tant qu'argument à une autre méthode.
it: '{0}' chiama '{1}' ma non usa il valore restituito dal metodo. È noto che i metodi Linq non presentino effetti collaterali. Usare il risultato in un'istruzione condizionale, assegnare il risultato a una variabile o passarlo come argomento a un altro metodo.
ko: '{0}'이(가) '{1}'을(를) 호출하지만 메서드에서 반환된 값을 사용하지 않습니다. LINQ 메서드는 부작용이 없는 것으로 알려져 있습니다. 결과를 조건문에 사용하거나, 변수에 할당하거나, 다른 메서드에 인수로 전달하세요.
pl: Element „{0}” wywołuje element „{1}”, ale nie używa wartości zwracanej przez metodę. Metody linq mają efekty uboczne. Użyj wyniku w instrukcji warunkowej, przypisz wynik do zmiennej lub przekaż go jako argument do innej metody.
pt_br: '{0}' chama '{1}', mas não usa o valor que o método retorna. Os métodos LINQ são conhecidos por não terem efeitos colaterais. Use o resultado em uma instrução condicional, atribua o resultado a uma variável ou passe-o como argumento para outro método.
ru: "{0}" вызывает "{1}", но не использует значение, возвращаемое методом. Методы Linq не имеют известных побочных эффектов. Используйте результат в условном операторе, присвойте его переменной или передайте его в качестве аргумента другому методу.
tr: '{0}' '{1}' çağırıyor ancak metodun döndürdüğü değeri kullanmıyor. Linq metotlarının yan etkileri yoktur. Bir koşullu ifadedeki sonucu kullanın, sonucu bir değişkene atayın veya bir bağımsız değişken olarak başka bir metoda geçirin.
zh_hans: “{0}”会调用“{1}”，但不使用方法返回的值。据了解，Linq 方法没有负面影响。在条件语句中使用结果，将结果赋给变量，或将其作为实参传递给另一个方法。
zh_hant: '{0}' 呼叫了 '{1}'，但未使用方法傳回的值。LINQ 方法已知沒有副作用。請使用條件陳述式中的結果、將結果指派給變數，或將其以引數的形式傳遞給另一個方法。

# DoNotIgnoreMethodResultsMessageUserDefinedMethod
source: '{0}' calls '{1}' but does not use the value the method returns. This method is defined as a user-option. Use the result in a conditional statement, assign the result to a variable, or pass it as an argument to another method.
cs: {0} volá {1}, ale nepoužívá hodnotu, kterou tato metoda vrací. Tato metoda je definovaná jako user-option. Použijte výsledek v podmíněném příkazu, přiřaďte výsledek proměnné nebo ho předejte jako argument jiné metodě.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht den von der Methode zurückgegebenen Wert. Diese Methode ist als Benutzeroption definiert. Verwenden Sie das Ergebnis in einer Bedingungsanweisung, weisen Sie das Ergebnis einer Variablen zu, oder übergeben Sie es als Argument an eine andere Methode.
es: "{0}" llama a "{1}", pero no usa el valor que el método devuelve. Este método se define como opción del usuario. Use el resultado en una instrucción condicional, asigne el resultado a una variable o páselo como argumento a otro método.
fr: '{0}' appelle '{1}' mais n'utilise pas la valeur retournée par la méthode. Cette méthode est définie en tant qu'option utilisateur. Utilisez le résultat dans une instruction conditionnelle, affectez le résultat à une variable ou passez-le en tant qu'argument à une autre méthode.
it: '{0}' chiama '{1}' ma non usa il valore restituito dal metodo. Questo metodo è definito come opzione dell'utente. Usare il risultato in un'istruzione condizionale, assegnare il risultato a una variabile o passarlo come argomento a un altro metodo.
ko: '{0}'이(가) '{1}'을(를) 호출하지만 메서드가 반환하는 값을 사용하지 않습니다. 이 메서드가 사용자 옵션으로 정의되어 있습니다. 결과를 조건문에 사용하거나 변수에 할당하거나 다른 메서드에 인수로 전달하세요.
pl: Element „{0}” wywołuje element „{1}”, ale nie używa wartości zwracanej przez metodę. Ta metoda jest zdefiniowana jako opcja użytkownika. Użyj wyniku w instrukcji warunkowej, przypisz wynik do zmiennej lub przekaż go jako argument do innej metody.
pt_br: '{0}' chama '{1}', mas não usa o valor retornado pelo método. Esse método é definido como uma opção do usuário. Use o resultado em uma instrução condicional, atribua o resultado a uma variável ou passe-o como argumento para outro método.
ru: "{0}" вызывает "{1}", но не использует значение, возвращаемое методом. Этот метод определен как пользовательский. Используйте результат в условном операторе, присвойте его переменной или передайте его в качестве аргумента другому методу.
tr: '{0}', '{1}' metodunu çağırıyor ancak metodun döndürdüğü değeri kullanmıyor. Bu metot kullanıcı seçeneği olarak tanımlanır. Sonucu bir koşullu ifadede kullanın, bir değişkene atayın veya başka bir metoda bağımsız değişken olarak geçirin.
zh_hans: “{0}”调用“{1}”，但不使用方法返回的值。此方法被定义为用户选项。请使用条件语句中的结果，并将结果赋给变量或将其作为自变量传递给另一个方法。
zh_hant: '{0}' 呼叫了 '{1}'，但並未使用方法所傳回的值。此方法定義為使用者選項。請使用條件陳述式中的結果，再將結果指派給變數，或是將其以引數方式傳遞到另一個方法。

# DoNotInitializeUnnecessarilyFix
source: Remove the unnecessary assignment.
cs: Odeberte nepotřebné přiřazení.
de: Entfernen Sie die unnötige Zuweisung.
es: Quite la asignación innecesaria.
fr: Supprimez l'affectation inutile.
it: Rimuovere l'assegnazione non necessaria.
ko: 불필요한 할당을 제거하세요.
pl: Usuń niepotrzebne przypisanie.
pt_br: Remover a atribuição desnecessária.
ru: Удалите ненужное назначение.
tr: Gereksiz atamayı kaldırın.
zh_hans: 删除不必要的分配。
zh_hant: 移除不必要的指派。

# DoNotNameEnumValuesReservedDescription
source: This rule assumes that an enumeration member that has a name that contains "reserved" is not currently used but is a placeholder to be renamed or removed in a future version. Renaming or removing a member is a breaking change.
cs: Tato role předpokládá, že člen výčtu s názvem, který obsahuje reserved, se v tuto chvíli nepoužívá, ale představuje zástupný symbol, který se má přejmenovat nebo odebrat v budoucí verzi. Přejmenování nebo odebrání členu je změna způsobující chybu.
de: Diese Regel setzt voraus, dass ein Enumerationsmember mit "reserved" im Namen aktuell nicht verwendet wird, aber als Platzhalter fungiert, der in einer zukünftigen Version umbenannt oder entfernt werden soll. Das Umbenennen oder Entfernen eines Members ist ein Breaking Change.
es: Esta regla asume que un miembro de enumeración con un nombre que contiene "reservado" no se usa actualmente, sino que es un marcador de posición que se cambiará de nombre o se quitará en una versión futura. Quitar un miembro o cambiarlo de nombre es un cambio importante.
fr: Cette règle part du principe qu'un membre d'énumération dont le nom contient "reserved" n'est pas utilisé mais qu'il représente un espace réservé à renommer ou à supprimer dans une version future. Le renommage ou la suppression d'un membre est un changement cassant.
it: Questa regola presuppone che un membro di enumerazione il cui nome contiene la parola "reserved" non sia attualmente usato, ma che sia un segnaposto da rinominare o rimuovere in una versione futura. La ridenominazione o la rimozione di un membro è una modifica che causa un'interruzione.
ko: 이 규칙에서 이름에 "reserved"가 포함된 열거형 멤버는 현재 사용되고 있지 않으며 이후 버전에서 이름을 바꾸거나 제거할 자리 표시자라고 가정합니다. 멤버 제거 또는 이름 바꾸기는 호환성이 손상되는 변경 내용입니다.
pl: W tej regule przyjęto założenie, że element członkowski wyliczenia, który ma nazwę zawierającą wyraz „reserved”, nie jest obecnie używany, ale jest symbolem zastępczym, którego nazwa może zostać zmieniona lub usunięta w przyszłej wersji. Zmiana nazwy lub usunięcie elementu członkowskiego jest zmianą powodującą niezgodność.
pt_br: Esta regra considera que um membro de enumeração com um nome contendo "reservado" não está sendo usado no momento, mas é um espaço reservado a ser renomeado ou removido em uma versão futura. A renomeação ou a remoção de um membro é uma alteração interruptiva.
ru: Это правило предполагает, что элемент перечисления, имя которого содержит "reserved", сейчас не используется, но является заполнителем, который будет переименован или удален в будущей версии. Переименование или удаление элемента является критическим изменением.
tr: Bu kural, "ayrılmış" içeren bir ada sahip bir numaralandırma üyesinin şu anda kullanılmadığını ancak ileride yeniden adlandırılabilecek veya kaldırılabilecek bir yer tutucu olduğunu varsayar. Bir üyeyi yeniden adlandırmak veya kaldırmak hataya neden olan bir değişikliktir.
zh_hans: 此规则假设当前未使用名称中包含 "reserved" 的枚举成员，且该成员是要在未来版本中重命名或删除的占位符。重命名或删除成员是一个中断性变更。
zh_hant: 此規則假設名稱包含 "reserved" 的列舉成員目前並未使用，而是要在未來版本中重新命名或移除的預留位置。重新命名或移除成員為中斷性變更。
