Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# OperatorOverloadsHaveNamedAlternatesDescription
source: An operator overload was detected, and the expected named alternative method was not found. The named alternative member provides access to the same functionality as the operator and is provided for developers who program in languages that do not support overloaded operators.
cs: Bylo zjištěno přetížení operátoru, přičemž se nenašla očekávaná pojmenovaná alternativní metoda. Pojmenovaný alternativní člen poskytuje přístup ke stejné funkčnosti jako tento operátor a je určený vývojářům programujícím v jazycích, které nepodporují přetížené operátory.
de: Eine Operatorüberladung wurde ermittelt, und die erwartete benannte alternative Methode wurde nicht gefunden. Der benannte alternative Member bietet Zugriff auf dieselbe Funktionalität wie der Operator und wird für Entwickler bereitgestellt, die in Sprachen programmieren, die keine überladenen Operatoren unterstützen.
es: Se detectó una sobrecarga del operador y no se encontró el método alternativo con nombre esperado. El miembro alternativo con nombre proporciona acceso a la misma funcionalidad que el operador. Esto se ofrece para los desarrolladores que programan en lenguajes que no admiten operadores sobrecargados.
fr: Une surcharge d'opérateur a été détectée, et la méthode de remplacement nommée attendue est introuvable. Le membre de remplacement nommé donne accès aux mêmes fonctionnalités que l'opérateur. Il est fourni aux développeurs qui programment dans les langages qui ne prennent pas en charge les opérateurs surchargés.
it: È stato rilevato un overload degli operatori e non è stato trovato il metodo alternativo denominato previsto. Il membro alternativo denominato consente di accedere alla stessa funzionalità dell'operatore e viene fornito per gli sviluppatori che programmano in linguaggi che non supportano operatori di overload.
ja: 演算子オーバーロードが検出され、予想される名前の代替メソッドが検出されませんでした。名前付きの代替メンバーは、演算子と同じ機能へアクセスを提供し、オーバーロードされた演算子をサポートしていない言語でプログラミングを行う開発者にも提供されます。
ko: 연산자 오버로드가 검색되었으며 필요한 명명된 대체 메서드는 발견되지 않았습니다. 명명된 대체 멤버는 연산자와 동일한 기능에 대한 액세스를 제공하며 해당 멤버는 오버로드된 연산자를 지원하지 않는 언어로 프로그래밍하는 개발자에게 제공됩니다.
pl: Wykryto przeciążenie operatora i nie znaleziono oczekiwanej nazwanej metody alternatywnej. Nazwany alternatywny element członkowski udostępnia tę samą funkcjonalność co operator i jest udostępniany dla deweloperów programujących w językach, które nie obsługują przeciążonych operatorów.
pt_br: Foi detectada uma sobrecarga de operador e o método alternativo nomeado esperado não foi encontrado. O membro alternativo nomeado fornece acesso à mesma funcionalidade que o operador e é fornecido para desenvolvedores que programam em linguagens que não dão suporte a operadores sobrecarregados.
ru: Обнаружена перегрузка оператора, а ожидаемый именованный альтернативный метод не найден. Именованный альтернативный член предоставляет доступ к тем же функциям, что и этот оператор, и предназначен для разработчиков, которые используют языки, не поддерживающие перегруженные операторы.
tr: Bir işleç aşırı yüklemesi algılandı ve beklenen ad alternatif yöntemi bulunamadı. Adlandırılmış alternatif üye, işleç ile aynı işlevselliğe erişim sağlar ve aşırı yüklenmiş işleçleri desteklemeyen dillerde programlama yapan geliştiriciler için sağlanır.
zh_hans: 检测到运算符重载，但未找到预期的命名备用方法。命名备选成员提供对与运算符相同的功能的访问，并供以不支持重载运算符的语言编程的开发人员使用。
zh_hant: 偵測到運算子多載，且找不到應有的具名替代方法。具名替代成員可存取與運算子相同的功能，且可供以不支援多載運算子的語言設計程式之開發人員使用。

# OperatorOverloadsHaveNamedAlternatesMessageDefault
source: Provide a method named '{0}' as a friendly alternate for operator {1}
cs: Zadejte metodu s názvem {0} jako vhodnou alternativu pro operátor {1}.
de: Geben Sie eine Methode namens "{0}" als Kurzform für den Operator "{1}" an.
es: Proporcione un método con el nombre "{0}" como texto alternativo descriptivo para el operador {1}.
fr: Fournissez une méthode nommée '{0}' comme solution de remplacement conviviale de l'opérateur {1}
it: Fornire un metodo denominato '{0}' come alternativa descrittiva per l'operatore {1}
ko: {1} 연산자의 적절한 대체 메서드로 이름이 '{0}'인 메서드를 제공하세요.
pl: Określ metodę o nazwie „{0}” jako metodę alternatywną operatora {1} o przyjaznej nazwie
pt_br: Forneça um método chamado '{0}' como alternativa amigável ao operador {1}
ru: Предоставьте метод с именем "{0}" в качестве понятной альтернативы оператору {1}.
tr: {1} işleci için kolay bir alternatif olarak '{0}' adlı bir metot sağlayın
zh_hans: 提供名为“{0}”的方法作为运算符 {1} 的友好备用项
zh_hant: 請提供名為 '{0}' 的方法作為運算子 {1} 的易記替代項

# OperatorOverloadsHaveNamedAlternatesMessageProperty
source: Provide a property named '{0}' as a friendly alternate for operator {1}
cs: Zadejte vlastnost s názvem {0} jako vhodnou alternativu pro operátor {1}.
de: Geben Sie eine Eigenschaft namens "{0}" als Kurzform für den Operator "{1}" an.
es: Proporcione una propiedad con el nombre "{0}" como texto alternativo descriptivo para el operador {1}.
fr: Fournissez une propriété nommée '{0}' comme solution de remplacement conviviale de l'opérateur {1}
it: Fornire una proprietà denominata '{0}' come alternativa descrittiva per l'operatore {1}
ko: {1} 연산자의 적절한 대체 속성으로 이름이 '{0}'인 속성을 제공하세요.
pl: Określ właściwość o nazwie „{0}” jako właściwość alternatywną operatora {1} o przyjaznej nazwie
pt_br: Forneça uma propriedade chamada '{0}' como alternativa amigável ao operador {1}
ru: Предоставьте свойство с именем "{0}" в качестве понятной альтернативы оператору {1}.
tr: {1} işleci için kolay bir alternatif olarak '{0}' adlı bir özellik sağlayın
zh_hans: 提供名为“{0}”的属性作为运算符 {1} 的友好备用项
zh_hant: 請提供名為 '{0}' 的屬性作為運算子 {1} 的易記替代項

# OperatorOverloadsHaveNamedAlternatesMessageMultiple
source: Provide a method named '{0}' or '{1}' as an alternate for operator {2}
cs: Zadejte metodu s názvem {0} nebo {1} jako alternativu pro operátor {2}.
de: Geben Sie eine Methode namens "{0}" oder "{1}" als Alternative für den Operator "{2}" an.
es: Proporcione un método con el nombre "{0}" o "{1}" como texto alternativo para el operador {2}.
fr: Fournissez une méthode nommée '{0}' ou '{1}' comme solution de remplacement de l'opérateur {2}
it: Fornire un metodo denominato '{0}' o '{1}' come alternativa per l'operatore {2}
ko: {2} 연산자의 대체 메서드로 이름이 '{0}' 또는 '{1}'인 메서드를 제공하세요.
pl: Określ metodę o nazwie „{0}” lub „{1}” jako metodę alternatywną operatora {2}
pt_br: Forneça um método chamado '{0}' ou '{1}' como alternativa ao operador {2}
ru: Предоставьте метод с именем "{0}" или "{1}" в качестве альтернативы оператору {2}.
tr: {2} işleci için bir alternatif olarak '{0}' veya '{1}' adlı bir metot sağlayın
zh_hans: 提供名为“{0}”或“{1}”的方法作为运算符 {2} 的备用项
zh_hant: 請提供名為 '{0}' 或 '{1}' 的方法作為運算子 {2} 的替代項

# OperatorOverloadsHaveNamedAlternatesMessageVisibility
source: Mark {0} as public because it is a friendly alternate for operator {1}
cs: Označte {0} jako veřejný, protože jde o vhodnou alternativu pro operátor {1}.
de: Markieren Sie "{0}" als öffentlich, weil es sich um eine Kurzform des Operators "{1}" handelt.
es: Marque {0} como public porque es un texto alternativo descriptivo para el operador {1}.
fr: Marquez {0} comme étant public, car il s'agit d'une solution de remplacement conviviale de l'opérateur {1}
it: Contrassegnare {0} come public perché è un'alternativa descrittiva per l'operatore {1}
ko: {0}은(는) {1} 연산자의 적절한 대체 항목이므로 공개로 표시하세요.
pl: Oznacz metodę {0} jako publiczną, ponieważ jest ona metodą alternatywną operatora {1} o przyjaznej nazwie
pt_br: Marque {0} como público, porque é uma alternativa amigável ao operador {1}
ru: Пометьте {0} как открытый, так как он является понятной альтернативой оператору {1}
tr: {0}, {1} işleci için kolay bir alternatif olduğundan öğeyi genel olarak işaretleyin
zh_hans: 将 {0} 标记为 public，因为它是运算符 {1} 的友好备用项
zh_hant: 因為 {0} 是運算子 {1} 的易記替代項，所以將其標記為公用

# OperatorsShouldHaveSymmetricalOverloadsTitle
source: Operators should have symmetrical overloads
cs: Operátory mají mít symetrická přetížení.
de: Operatoren müssen symmetrische Überladungen aufweisen
es: Los operadores deben tener sobrecargas simétricas
fr: Les opérateurs doivent contenir des surcharges symétriques
it: Per gli operatori devono esistere overload simmetrici
ja: 演算子は対称型オーバーロードを含まなければなりません
ko: 연산자에는 대칭 오버로드가 있어야 합니다.
pl: Operatory powinny mieć symetryczne przeciążenia
pt_br: Os operadores devem ter sobrecargas simétricas
ru: Перегрузки операторов должны быть симметричными
tr: İşleçler simetrik aşırı yüklemelere sahip olmalıdır
zh_hans: 运算符应有对称重载
zh_hant: 運算子應有對稱的多載

# OperatorsShouldHaveSymmetricalOverloadsDescription
source: A type implements the equality or inequality operator and does not implement the opposite operator.
cs: Některý typ implementuje operátor rovnosti nebo nerovnosti, ale neimplementuje opačný operátor.
de: Ein Typ implementiert den Operator für Gleichheit oder Ungleichheit und implementiert nicht den gegenteiligen Operator.
es: Un tipo implementa el operador de igualdad o de desigualdad y no implementa el operador opuesto.
fr: Un type implémente l'opérateur d'égalité ou d'inégalité, et n'implémente pas l'opérateur opposé.
it: Un tipo implementa l'operatore di uguaglianza o di disuguaglianza e non implementa l'operatore opposto.
ja: 型で等値演算子または非等値演算子を実装し、逆の働きをする演算子を実装しません。
ko: 형식은 같음 또는 같지 않음 연산자를 구현하지만 반대 연산자는 구현하지 않습니다.
pl: Typ implementuje operator równości lub nierówności i nie implementuje operatora przeciwnego.
pt_br: Um tipo implementa o operador de igualdade ou desigualdade e não implementa o operador oposto.
ru: Тип реализует оператор равенства или неравенства и не реализует противоположный оператор.
tr: Bir tür, eşitlik veya eşitsizlik işlecini uygular ve zıt işleci uygulamaz.
zh_hans: 类型实现相等运算符或不相等运算符，但不实现相反运算符。
zh_hant: 類型會實作等號比較運算子或不等比較運算子，但不會實作相反運算子。

# CollectionPropertiesShouldBeReadOnlyTitle
source: Collection properties should be read only
cs: Vlastnosti kolekce mají být jen pro čtení.
de: Sammlungseigenschaften müssen schreibgeschützt sein
es: Las propiedades de colección deben ser de solo lectura
fr: Les propriétés de collection doivent être en lecture seule
it: Le proprietà delle raccolte devono essere di sola lettura
ja: コレクション プロパティは読み取り専用でなければなりません
ko: 컬렉션 속성은 읽기 전용이어야 합니다.
pl: Właściwości kolekcji powinny być dostępne tylko do odczytu
pt_br: As propriedades de coleção devem ser somente leitura
ru: Свойства коллекций должны быть доступны только для чтения
tr: Koleksiyon özellikleri salt okunur olmalıdır
zh_hans: 集合属性应为只读
zh_hant: 集合屬性應為唯讀

# CollectionPropertiesShouldBeReadOnlyDescription
source: A writable collection property allows a user to replace the collection with a different collection. A read-only property stops the collection from being replaced but still allows the individual members to be set.
cs: Zapisovatelná vlastnost kolekce umožňuje uživateli nahradit takovou kolekci jinou kolekcí. Vlastnost jen pro čtení zabraňuje nahrazení kolekce, ale přesto umožňuje nastavení jednotlivých členů.
de: Eine schreibbare Sammlungseigenschaft ermöglicht einem Benutzer das Ersetzen der Sammlung durch eine andere Sammlung. Durch eine schreibgeschützte Eigenschaft wird die Sammlung nicht mehr ersetzt, die einzelnen Member können jedoch weiterhin festgelegt werden.
es: Una propiedad de colección de escritura permite al usuario reemplazar la colección por otra distinta. Una propiedad de solo lectura impide que la colección se reemplace, pero sí permite establecer miembros individuales.
fr: Une propriété de collection accessible en écriture permet à un utilisateur de remplacer la collection par une autre collection. Une propriété en lecture seule empêche le remplacement de la collection, mais permet quand même aux membres individuels d'être définis.
it: Una proprietà di raccolta scrivibile consente a un utente di sostituire la raccolta con una raccolta diversa. Una proprietà di sola lettura interrompe la sostituzione della raccolta, ma consente comunque l'impostazione dei singoli membri.
ja: 書き込み可能なコレクション プロパティにより、ユーザーはコレクションを別のコレクションに置き換えることができます。読み取り専用のプロパティでは、コレクションを置き換えることはできませんが、引き続き個々のメンバーは設定できます。
ko: 쓰기 가능한 컬렉션 속성은 사용자가 컬렉션을 다른 컬렉션으로 바꿀 수 있도록 허용합니다. 읽기 전용 속성을 사용하면 컬렉션을 더 이상 바꿀 수 없지만 계속해서 개별 멤버를 설정할 수 있습니다.
pl: Właściwość kolekcji dostępna do zapisu umożliwia użytkownikowi zamianę kolekcji na inną kolekcję. Właściwość tylko do odczytu uniemożliwia zastąpienie kolekcji, lecz nadal umożliwia ustawianie poszczególnych elementów członkowskich.
pt_br: Uma propriedade de coleção gravável permite que um usuário substitua a coleção por uma coleção diferente. Uma propriedade somente leitura interrompe a substituição da coleção, mas ainda permite que membros individuais sejam definidos.
ru: Доступное для записи свойство коллекции позволяет пользователю заменить коллекцию на другую коллекцию. Свойство, доступное только для чтения, не позволяет заменить коллекцию, но при этом позволяет задавать отдельные члены.
tr: Yazılabilir bir koleksiyon özelliği, bir kullanıcının koleksiyonu başka bir koleksiyonla değiştirmesine imkan tanır. Salt okunur bir özellik koleksiyonun değiştirilmesini engeller, ancak yine de bireysel üyelerin ayarlanmasına izin verir.
zh_hans: 通过可写集合属性，用户可将集合替换为不同集合。只读属性阻止替换集合，但仍允许设置单个成员。
zh_hant: 可寫入的集合屬性允許使用者以不同的集合來取代該集合。唯讀屬性會讓集合無法被取代，但是仍然允許設定個別成員。

# CollectionPropertiesShouldBeReadOnlyMessage
source: Change '{0}' to be read-only by removing the property setter
cs: Odeberte metodu Set vlastnosti {0} a nastavte ji jen pro čtení.
de: Legen Sie "{0}" als schreibgeschützt fest, indem Sie den Setter für die Eigenschaft entfernen.
es: Cambie "{0}" para que sea de solo lectura mediante la eliminación del establecedor de propiedades.
fr: Supprimez la méthode setter de propriété pour que '{0}' soit en lecture seule
it: Modificare '{0}' in modo che sia di sola lettura rimuovendo il setter proprietà
ko: 속성 setter를 제거하여 '{0}'을(를) 읽기 전용으로 변경하세요.
pl: Zmień element „{0}” w tylko do odczytu, usuwając metodę ustawiającą właściwości
pt_br: Altere '{0}' para ser somente leitura removendo o setter da propriedade
ru: Удалите метод задания свойств для "{0}", чтобы сделать его доступным только для чтения.
tr: Özellik ayarlayıcısını kaldırarak '{0}' değerini salt okunur olarak değiştirin
zh_hans: 通过移除属性 setter 将“{0}”更改为只读
zh_hant: 透過移除屬性 setter，將 '{0}' 變更為唯讀

# OverloadOperatorEqualsOnOverridingValueTypeEqualsTitle
source: Overload operator equals on overriding value type Equals
cs: Operátor přetížení je roven přepisující hodnotě typu Equals.
de: Gleichheitsoperator beim Überschreiben von "Equals" für den Werttyp überladen
es: Sobrecargar el operador de igualdad al reemplazar el tipo de valor Equals
fr: Surcharger l'opérateur d'égalité en remplaçant ValueType.Equals
it: Eseguire l'overload dell'operatore di uguaglianza all'override del tipo valore Equals
ja: 値型 Equals のオーバーライドで、演算子 equals をオーバーロードします
ko: 값 형식 Equals를 재정의할 때 같음 연산자를 오버로드하세요.
pl: Przeciąż operator równości przy przesłanianiu metody Equals dla typu wartości
pt_br: Sobrecarregar operador equals ao substituir o tipo de valor Equals
ru: Оператор перегрузки равен переопределяющему типу значения Equals
tr: Aşırı yükleme işleci, Equals geçersiz kılma değer türüne eşittir
zh_hans: 重写值类型的 Equals 方法时应重载相等运算符
zh_hant: 覆寫實值型別 Equals 時，多載等號比較運算子

# OverloadOperatorEqualsOnOverridingValueTypeEqualsDescription
source: In most programming languages there is no default implementation of the equality operator (==) for value types. If your programming language supports operator overloads, you should consider implementing the equality operator. Its behavior should be identical to that of Equals.
cs: Ve většině programovacích jazyků neexistuje výchozí implementace operátoru rovnosti (==) pro typy hodnot. Pokud váš programovací jazyk podporuje přetížení operátorů, měli byste zvážit implementaci operátoru rovnosti. Jeho chování by mělo být identické jako Equals.
de: In den meisten Programmiersprachen gibt es keine Standardimplementierung des Gleichheitsoperators (==) für Werttypen. Wenn Ihre Programmiersprache Operatorüberladungen unterstützt, sollten Sie die Implementierung des Gleichheitsoperators in Betracht ziehen. Sein Verhalten sollte mit dem von "Equals" identisch sein.
es: En la mayoría de los lenguajes de programación no hay una implementación predeterminada del operador de igualdad (==) para los tipos de valor. Si su lenguaje de programación admite las sobrecargas de operador, considere implementar el operador de igualdad. Su comportamiento debe ser idéntico al de Equals.
fr: La plupart des langages de programmation n'ont aucune implémentation par défaut de l'opérateur d'égalité (==) pour les types valeur. Si votre langage de programmation prend en charge les surcharges d'opérateur, implémentez l'opérateur d'égalité. Son comportement doit être identique à celui de Equals.
it: La maggior parte dei linguaggi di programmazione non prevede alcuna implementazione predefinita dell'operatore di uguaglianza (==) per i tipi valore. Se il linguaggio di programmazione supporta gli overload degli operatori, è consigliabile provare a implementare l'operatore di uguaglianza. Il relativo comportamento dovrebbe essere identico a quello di Equals.
ko: 대부분의 프로그래밍 언어에서는 값 형식에 같음 연산자(==)를 기본적으로 구현하지 않습니다. 프로그래밍 언어에서 연산자 오버로드를 지원하는 경우 같음 연산자를 구현해야 합니다. 해당 연산자의 동작은 Equals의 동작과 같아야 합니다.
pl: W większości języków programowania nie ma domyślnej implementacji operatora równości (==) dla typów wartości. Jeśli używasz języka programowania, który obsługuje przeciążanie operatorów, rozważ zaimplementowanie operatora równości. Jego zachowanie powinno być takie samo jak metody Equals.
pt_br: Na maioria das linguagens de programação, não há uma implementação padrão do operador de igualdade (==) para tipos de valor. Se a sua linguagem de programação dá suporte a sobrecargas de operador, você deve considerar implementar o operador de igualdade. O comportamento dele deve ser idêntico ao de Equals.
ru: В большинстве языков программирования нет реализации оператора равенства (==) по умолчанию для типов значений. Если ваш язык программирования поддерживает перегрузки операторов, рекомендуется реализовать оператор равенства. Он должен работать аналогично Equals.
tr: Çoğu programlama dilinde, değer türleri için eşitlik işlecinin (==) varsayılan bir uygulaması yoktur. Programlama diliniz işleç aşırı yüklemelerini destekliyorsa eşitlik işlecini uygulamayı denemelisiniz. Bu işlecin davranışı Equals ile aynı olmalıdır.
zh_hans: 在大多数编程语言中，对于值类型并无相等运算符 (==) 的默认实现。如果编程语言支持运算符重载，则应考虑实现相等运算符。其行为应与 Equals 相同。
zh_hant: 在大多數的程式設計語言中，實值型別沒有等號比較運算子 (==) 的預設實作。若程式設計語言支援運算子多載，請考慮實作等號比較運算子。其行為與 Equals 完全相同。

# OverloadOperatorEqualsOnOverridingValueTypeEqualsMessage
source: Implement the equality operators and make their behavior identical to that of the Equals method
cs: Implementujte operátory rovnosti a zajistěte, aby se jejich chování shodovalo s metodou Equals.
de: Implementieren Sie die Gleichheitsoperatoren, und legen Sie deren Verhalten auf das der Equals-Methode fest.
es: Implementar los operadores de igualdad y hacer que su comportamiento sea idéntico al del método Equals
fr: Permet d'implémenter les opérateurs d'égalité et de rendre leur comportement identique à celui de la méthode Equals
it: Implementare gli operatori di uguaglianza e impostare il comportamento in modo che sia identico a quello del metodo Equals
ko: 같음 연산자를 구현하고 해당 동작을 Equals 메서드의 동작과 같게 만드세요.
pl: Zaimplementuj operatory równości i ustaw ich zachowanie na identyczne z metodą Equals
pt_br: Implementar os operadores de igualdade e fazer com que o comportamento deles seja idêntico ao do método Equals
ru: Реализуйте операторы равенства и сделайте их поведение идентичным поведению метода "Equals".
tr: Eşitlik işleçlerini uygula ve işleç davranışlarını Equals metodununkiyle aynı yap
zh_hans: 实现相等运算符，并使其行为与 Equals 方法的行为相同
zh_hant: 實作等號運算子，並使其行為與 Equals 方法的行為相同

# PassSystemUriObjectsInsteadOfStringsTitle
source: Pass system uri objects instead of strings
cs: Místo řetězců předávejte objekty systémových identifikátorů URI.
de: System-URI-Objekte anstelle von Zeichenfolgen übergeben
es: Pasar objetos URI de sistema en lugar de cadenas
fr: Passer des objets d'URI système à la place de chaînes
it: Passare oggetti System.Uri invece di stringhe
ja: 文字列ではなくシステム uri オブジェクトを渡します
ko: 문자열 대신 시스템 uri 개체를 전달하세요.
pl: Przekazuj systemowe obiekty URI zamiast ciągów
pt_br: Passar objetos do URI do sistema em vez de cadeias de caracteres
ru: Передавайте объекты системного URI вместо строк
tr: Dizeler yerine System.Uri nesneleri geçirin
zh_hans: 传递系统 URI 对象而不是字符串
zh_hant: 傳遞系統 URI 物件而非傳遞字串

# PassSystemUriObjectsInsteadOfStringsDescription
source: A call is made to a method that has a string parameter whose name contains "uri", "URI", "urn", "URN", "url", or "URL". The declaring type of the method contains a corresponding method overload that has a System.Uri parameter.
cs: Volá se metoda obsahující řetězcový parametr, jehož název obsahuje uri, URI, urn, URN, url nebo URL. Deklarující typ této metody obsahuje přetížení odpovídající metody s parametrem System.Uri.
de: Ein Aufruf erfolgt an eine Methode mit einem Zeichenfolgenparameter, dessen Name "uri", "URI", "urn", "URN", "url" oder "URL" enthält. Der deklarierende Typ der Methode enthält eine entsprechende Methodenüberladung mit einem System.Uri-Parameter.
es: Se realiza una llamada a un método que tiene un parámetro de cadena cuyo nombre contiene "uri", "URI", "urn", "URN", "url" o "URL". El tipo declarativo del método contiene una sobrecarga del método correspondiente que tiene un parámetro System.Uri.
fr: Un appel à une méthode doté d'un paramètre de chaîne dont le nom contient "uri", "URI", "urn", "URN", "url" ou "URL" est effectué. Le type déclarant de la méthode contient une surcharge de méthode correspondante dotée d'un paramètre System.Uri.
it: Viene effettuata una chiamata a un metodo che include un parametro di stringa il cui nome contiene "uri", "URI", "urn", "URN", "url" o "URL". Il tipo dichiarante del metodo contiene un overload del metodo corrispondente con un parametro System.Uri.
ja: 名前に "uri"、"URI"、"urn"、"URN"、"url"、または "URL" が含まれている文字列パラメーターが指定されたメソッドが呼び出されます。そのメソッドの宣言する型には、System.Uri パラメーターが指定されている対応するメソッド オーバーロードが含まれています。
ko: 이름에 "uri", "URI", "urn", "URN", "url" 또는 "URL"이 포함된 문자열 매개 변수가 있는 메서드를 호출합니다. 메서드의 선언 형식은 System.Uri 매개 변수가 있는 해당 메서드 오버로드를 포함합니다.
pl: Wywołano metodę z parametrem ciągu o nazwie zawierającej ciąg „uri”, „URI”, „urn”, „URN”, „url” lub „URL”. Typ deklarujący metody zawiera odpowiednie przeciążenie metody z parametrem System.Uri.
pt_br: Uma chamada é realizada a um método que tem um parâmetro de cadeia de caracteres cujo nome contém "uri", "URI", "urn", "URN", "url" ou "URL". O tipo declarativo do método contém uma sobrecarga de método correspondente que tem um parâmetro System.Uri.
ru: Выполнен вызов метода со строковым параметром, имя которого содержит "uri", "URI", "urn", "URN", "url" или "URL". Объявляющий тип метода содержит соответствующую перегрузку метода с параметром System.Uri.
tr: Adı "uri", "URI", "urn", "URN", "url" veya "URL" içeren bir dize parametresine sahip bir yönteme çağrı yapılır. Yöntemin bildirim türü, bir System.Uri parametresine sahip karşılık gelen bir yöntem aşırı yüklemesi içerir.
zh_hans: 已调用具有字符串参数的方法，该字符串参数的名称包含 "uri"、"URI"、"urn"、"URN"、"url" 或 "URL"。该方法的声明类型包含一个具有 System.Uri 参数的相应方法重载。
zh_hant: 呼叫其字串參數名稱包含 "uri"、"URI"、"urn"、"URN"、"url" 或 "URL" 的方法。此方法的宣告類型包含具有 System.Uri 參數的相對應方法多載。
