Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Append .ConfigureAwait(true)
cs: Připojit .ConfigureAwait(true)
de: "ConfigureAwait(true)" anfügen
es: Anexar .ConfigureAwait(true)
fr: Ajouter .ConfigureAwait(true)
it: Accoda .ConfigureAwait(true)
ja: .ConfigureAwait(true) を追加します
ko: .ConfigureAwait(true) 추가
pl: Dołącz element .ConfigureAwait(true)
pt_br: Acrescentar .ConfigureAwait(true)
ru: Добавить .ConfigureAwait(true)
tr: Ekle .ConfigureAwait(true)
zh_hans: 附加 .ConfigureAwait(true)
zh_hant: 附加 .ConfigureAwait(true)

# AssigningSymbolAndItsMemberInSameStatementDescription
source: Assigning to a symbol and its member (field/property) in the same statement is not recommended. It is not clear if the member access was intended to use symbol's old value prior to the assignment or new value from the assignment in this statement. For clarity, consider splitting the assignments into separate statements.
cs: Přiřazení symbolu a jeho členu (pole/vlastnost) ve stejném příkazu se nedoporučuje. Není jasné, zda by měl přístup člena v tomto příkazu použít starou hodnotu symbolu před přiřazením nebo novou hodnotu z přiřazení. Kvůli lepší přehlednosti zvažte rozdělení přiřazení do samostatných příkazů.
de: Die Zuweisung zu einem Symbol und dem zugehörigen Member (Feld/Eigenschaft) in derselben Anweisung wird nicht empfohlen. In diesem Fall bleibt unklar, ob beim Memberzugriff der alte Wert des Symbols vor der Zuweisung oder der neue Wert aus der Zuweisung in dieser Anweisung verwendet werden soll. Aus Gründen der Übersichtlichkeit sollten die Zuweisungen in separate Anweisungen aufgeteilt werden.
es: No se recomienda asignar a un símbolo y su miembro (campo/propiedad) en la misma instrucción. No queda claro si la intención del acceso a miembros era usar el valor anterior del símbolo antes de la asignación o el valor nuevo de la asignación en esta instrucción. Para mayor claridad, considere la posibilidad de dividir las asignaciones en instrucciones separadas.
fr: L'affectation à un symbole et à son membre (champ/propriété) dans la même instruction n'est pas recommandée. Il est difficile de déterminer si l'accès membre était destiné à utiliser l'ancienne valeur du symbole avant l'assignation ou la nouvelle valeur de l'assignation dans cette instruction. Pour plus de clarté, divisez les assignations en instructions distinctes.
it: È consigliabile evitare l'assegnazione a un simbolo e al relativo membro (campo/proprietà) nella stessa istruzione. Non è chiaro se per l'accesso ai membri si intendeva usare il valore precedente del simbolo prima dell'assegnazione o il nuovo valore dell'assegnazione in questa istruzione. Per chiarezza, provare a dividere le assegnazioni in istruzioni separate.
ja: 同じステートメントにシンボルとそのメンバー (フィールドとプロパティ) を代入することは推奨されていません。メンバー アクセスが、代入前のシンボルの古い値を使用するのか、このステートメントの代入からの新しい値を使用するのかが明確ではありません。わかりやすくするために、代入を個別のステートメントに分割することをご検討ください。
ko: 동일한 문의 기호 및 해당 멤버(필드/속성)에 할당하는 것은 권장되지 않습니다. 멤버 액세스가 할당 전 기호의 이전 값을 사용하려는 것인지 이 문의 할당에서 새 값을 사용하려는 것인지 명확하지 않습니다. 명확성을 위해 할당을 개별 문으로 분할하세요.
pl: Przypisywanie do symbolu i jego składowej (pole/właściwość) w tej samej instrukcji nie jest zalecane. W takiej sytuacji nie jest jasne, czy dostęp do składowej miał obejmować użycie starej wartości symbolu przed przypisaniem, czy nowej wartości z przypisania w tej instrukcji. W celu zachowania jednoznaczności rozważ rozdzielenie przypisań na oddzielne instrukcje.
pt_br: Não é recomendável designar um símbolo e seu membro (campo/propriedade) na mesma instrução. Não fica claro se o acesso para membros deveria usar o antigo valor do símbolo antes da atribuição ou o novo valor da atribuição nessa instrução. Para fins de clareza, considere dividir as atribuições em instruções separadas.
ru: Присваивать значения символу и его элементу (полю/свойству) в одном операторе не рекомендуется. При обращении к элементу не ясно, следует ли использовать старое значение символа до присвоения в этом операторе или новое значение. Для ясности рекомендуется присваивать значения в отдельных операторах.
tr: Bir simgeye ve aynı deyimdeki üyesine (alan/özellik) atama önerilmez. Üye erişiminin bu deyimde simgenin atamadan önceki eski değerini kullanması veya bu deyimdeki yeni değeri kullanmasının amaçlandığı belirlenemiyor. Daha net olması için atamaları ayrı ifadelere bölmeniz faydalı olabilir.
zh_hans: 建议不要在同一语句中分配符号及其成员(字段/属性)。因为不清楚此语句中成员访问要使用分配前的符号旧值还是由分配得来的新值。为清楚起见，请考虑将分配拆分到独立语句中。
zh_hant: 不建議在相同的陳述式中指派給符號及其成員 (欄位/屬性)。如果成員存取要在指派之前使用符號的舊值，或在此陳述式的指派中有新值，則不明確。為清晰起見，請考慮將指派分割為不同的陳述式。

# AssigningSymbolAndItsMemberInSameStatementMessage
source: Symbol '{0}' and its member '{1}' are both assigned in the same statement. You are at risk of assigning the member of an unintended object.
cs: Symbol {0} a jeho člen {1} jsou oba přiřazeny ve stejném příkazu. Hrozí riziko přiřazení člena nezamýšleného objektu.
de: Das Symbol "{0}" und der zugehörige Member "{1}" werden beide in derselben Anweisung zugewiesen. Damit riskieren Sie, dass der Member eines unbeabsichtigten Objekts zugewiesen wird.
es: El símbolo "{0}" y su miembro "{1}" están asignados en la misma instrucción. Corre el riesgo de asignar el miembro de un objeto no intencionado.
fr: Le symbole '{0}' et son membre '{1}' sont tous deux affectés dans la même instruction. Vous risquez d'affecter le membre d'un objet non souhaité.
it: Il simbolo '{0}' e il relativo membro '{1}' sono entrambi assegnati nella stessa istruzione. Si corre il rischio di assegnare il membro di un oggetto non previsto.
ja: シンボル '{0}' とそのメンバー '{1}' の両方が同じステートメントに割り当てられています。意図しないオブジェクトのメンバーが割り当てられているおそれがあります。
ko: '{0}' 기호와 해당 멤버 '{1}'이(가) 모두 동일한 문에 할당되어 있으므로 의도하지 않은 개체의 멤버를 할당할 위험이 있습니다.
pl: Symbol „{0}” i jego składowa „{1}” są przypisane w tej samej instrukcji. Istnieje ryzyko przypisania składowej niezamierzonego obiektu.
pt_br: O símbolo '{0}' e seu membro '{1}' estão designados na mesma instrução. Você corre o risco de designar o membro de um objeto não desejado.
ru: Символу "{0}" и его элементу "{1}" присваиваются значения в одном операторе. Есть риск, что значение будет присвоено элементу не требуемого объекта.
tr: '{0}' sembolü ve '{1}' üyesi aynı deyimde atandı. İstenmeyen bir nesnenin üyesini atıyor olabilirsiniz.
zh_hans: 在同一语句中分配了符号 "{0}" 及其成员 "{1}"。可能为该成员分配意外的对象。
zh_hant: 符號 '{0}' 及其成員 '{1}' 兩者都指派在相同的陳述式中。您有指派非預期物件成員的風險。

# AssigningSymbolAndItsMemberInSameStatementTitle
source: Assigning symbol and its member in the same statement
cs: Přiřazení symbolu a jeho členu v témže příkazu
de: Das Symbol und der zugehörige Member werden in der gleichen Anweisung zugewiesen
es: La asignación de un símbolo y su miembro en la misma instrucción
fr: Affectation du symbole et de son membre dans la même instruction
it: Assegnazione del simbolo e del relativo membro nella stessa istruzione
ko: 동일한 문에서 기호 및 해당 멤버 할당
pl: Przypisywanie symbolu i jego składowej w tej samej instrukcji
pt_br: Designando o símbolo e o membro na mesma instrução
ru: Присвоение значения символу и его элементу в одном операторе
tr: Sembolü ve üyesini aynı deyimde atama
zh_hans: 在同一语句中分配符号及其成员
zh_hant: 在相同的陳述式中指派符號及其成員

# AvoidExcessiveParametersOnGenericTypesDescription
source: The more type parameters a generic type contains, the more difficult it is to know and remember what each type parameter represents.
cs: Čím více parametrů typů obecný typ obsahuje, tím obtížnější bude vědět a zapamatovat si, co jednotlivé parametry typů představují.
de: Je mehr Typparameter ein generischer Typ enthält, desto schwieriger ist es, die durch jeden Typparameter repräsentierten Werte zu kennen und sich diese zu merken.
es: Cuantos más parámetros de tipo contenga un tipo genérico, más difícil resultará saber y recordar qué representa cada parámetro de tipo.
fr: Plus un type générique contient de paramètres de type, plus il est difficile de savoir et de mémoriser ce que représente chaque paramètre de type.
it: Maggiore è il numero di parametri di tipo contenuti in un tipo generico, più difficile sarà conoscere e ricordare il significato di ogni parametro di tipo.
ko: 제네릭 형식에 포함된 형식 매개 변수가 많을수록 각 형식 매개 변수가 나타내는 항목을 파악하고 기억하기가 더 어려워집니다.
pl: Im więcej parametrów typu zawiera typ ogólny, tym trudniej jest dowiedzieć się zapamiętać, co reprezentuje każdy parametr typu.
pt_br: Quanto mais parâmetros de tipo estão contidos em um tipo genérico, mais difícil é saber e lembrar o que cada um deles representa.
ru: Чем больше параметров типа содержит универсальный тип, тем сложнее определить и запомнить, что представляет каждый параметр типа.
tr: Genel bir tür ne kadar fazla tür parametresi içeriyorsa, her bir tür parametresinin neyi temsil ettiğini bilmek ve hatırlamak o kadar zorlaşır.
zh_hans: 泛型类型包含的类型参数越多，就越难了解和记住每个类型参数表示的内容。
zh_hant: 泛型型別包含的型別參數愈多，就愈難知道並記住每個型別參數所代表的意義。

# AvoidExcessiveParametersOnGenericTypesMessage
source: Consider a design where '{0}' has no more than {1} type parameters
cs: Zvažte návrh, kde {0} nemá více než tento počet parametrů typu: {1}
de: Erwägen Sie einen Entwurf, bei dem "{0}" höchstens {1} Typparameter aufweist.
es: Considere el uso de un diseño donde "{0}" no tenga más de {1} parámetros de tipo.
fr: Utilisez une conception où '{0}' n'a pas plus de {1} paramètres de type
it: Provare a usare una progettazione in cui '{0}' contiene più di {1} parametri di tipo
ko: '{0}'의 형식 매개 변수가 {1}개를 넘지 않는 디자인이 좋습니다.
pl: Rozważ użycie projektu, w którym element „{0}” ma nie więcej niż następująca liczba parametrów typu: {1}
pt_br: Considere um design no qual '{0}' não tenha mais de {1} parâmetros de tipo
ru: Измените архитектуру, так чтобы число параметров типа в "{0}" не превышало {1}.
tr: '{0}' öğesinin {1} tür parametresinden fazlasına sahip olmadığı bir tasarım kullanabilirsiniz
zh_hans: 考虑使用“{0}”所含类型参数不超过 {1} 个的设计
zh_hant: 請考慮設計成 '{0}' 最多僅有 {1} 個型別參數的樣子

# AvoidExcessiveParametersOnGenericTypesTitle
source: Avoid excessive parameters on generic types
cs: Vyhněte se nadbytečným parametrům na obecných typech
de: Übermäßige Anzahl von Parametern in generischen Typen vermeiden
es: Evite parámetros excesivos en tipos genéricos
fr: Éviter les paramètres excessifs sur les types génériques
it: Evitare un uso eccessivo di parametri nei tipi generici
ko: 제네릭 형식에 매개 변수를 너무 많이 사용하지 마십시오.
pl: Unikaj nadmiernego użycia parametrów w typach ogólnych
pt_br: Evitar parâmetros excessivos em tipos genéricos
ru: Не используйте слишком много параметров в универсальных типах
tr: Genel türlerde aşırı parametre kullanmaktan kaçının
zh_hans: 避免泛型类型的参数过多
zh_hant: 避免在泛型類型上包含過多參數

# AvoidInfiniteRecursionMessageMaybe
source: Do not assign the property within its setter. This call might result in an infinite recursion.
cs: Nepřiřazujte vlastnost v její metodě setter. Toto volání může způsobit nekonečnou rekurzi.
de: Weisen Sie die Eigenschaft nicht innerhalb ihres Setters zu. Dieser Aufruf führt möglicherweise zu einer Endlosrekursion.
es: No asigne la propiedad dentro de su establecedor. Esta llamada puede dar lugar a una recursividad infinita.
fr: N'affectez pas la propriété dans sa méthode setter. Cet appel peut entraîner une récursivité infinie.
it: Non assegnare la proprietà all'interno del relativo setter. Questa chiamata potrebbe causare una ricorsione infinita.
ja: プロパティをそのセッター内に割り当てないでください。この呼び出しにより、無限再帰が発生する可能性があります。
ko: setter 내에서 속성을 할당하지 마세요. 이 호출로 인해 무한 재귀가 발생할 수 있습니다.
pl: Nie przypisuj właściwości za pomocą jej metody ustawiającej. To wywołanie może spowodować nieskończoną rekursję.
pt_br: Não atribua a propriedade em seu próprio setter. Essa chamada pode resultar em uma recursão infinita.
ru: Не присваивайте свойство в его методе задания. Такой вызов может привести к бесконечной рекурсии.
tr: Özelliği kendi ayarlayıcısı içinde atamayın. Bu çağrı sonsuz özyineleme ile sonuçlanabilir.
zh_hans: 请勿在资源库中分配该属性。此调用可能导致无限递归。
zh_hant: 請不要在屬性的 setter 中指派屬性。此呼叫可能會導致無限遞迴。

# AvoidInfiniteRecursionMessageSure
source: Do not assign the property within its setter. This call will result in an infinite recursion.
cs: Nepřiřazujte vlastnost v její metodě setter. Toto volání způsobí nekonečnou rekurzi.
de: Weisen Sie die Eigenschaft nicht innerhalb ihres Setters zu. Dieser Aufruf führt zu einer Endlosrekursion.
es: No asigne la propiedad dentro de su establecedor. Esta llamada dará lugar a una recursividad infinita.
fr: N'affectez pas la propriété dans sa méthode setter. Cet appel va entraîner une récursivité infinie.
it: Non assegnare la proprietà all'interno del relativo setter. Questa chiamata causerà una ricorsione infinita.
ja: プロパティをそのセッター内に割り当てないでください。この呼び出しにより、無限再帰が発生します。
ko: setter 내에서 속성을 할당하지 마세요. 이 호출로 인해 무한 재귀가 발생합니다.
pl: Nie przypisuj właściwości za pomocą jej metody ustawiającej. To wywołanie spowoduje nieskończoną rekursję.
pt_br: Não atribua a propriedade em seu próprio setter. Essa chamada resultará em uma recursão infinita.
ru: Не присваивайте свойство в его методе задания. Такой вызов приведет к бесконечной рекурсии.
tr: Özelliği kendi ayarlayıcısı içinde atamayın. Bu çağrı sonsuz özyineleme ile sonuçlanır.
zh_hans: 请勿在资源库中分配该属性。此调用将导致无限递归。
zh_hant: 請不要在屬性的 setter 中指派屬性。此呼叫將會導致無限遞迴。

# AvoidInfiniteRecursionTitle
source: Avoid infinite recursion
cs: Zabránit nekonečné rekurzi
de: Endlosrekursion vermeiden
es: Evitar la recursividad infinita
fr: Éviter la récursivité infinie
it: Evitare la ricorsione infinita
ja: 無限再帰の回避
ko: 무한 재귀 방지
pl: Unikaj nieskończonej rekursji
pt_br: Evitar a recursão infinita
ru: Избегайте бесконечной рекурсии
tr: Sonsuz özyinelemeyi önleme
zh_hans: 避免无限递归
zh_hant: 避免無限遞迴

# AvoidLengthCalculationWhenSlicingToEndCodeFixTitle
source: Remove redundant length argument
cs: Odeberte argument redundantní délky
de: Redundantes Längenargument entfernen
es: Quitar argumento de longitud redundante
fr: Supprimer l’argument de longueur redondante
it: Rimuovere l'argomento di lunghezza ridondante
ko: 중복 길이 인수 제거
pl: Usuń argument długości nadmiarowej
pt_br: Remover o argumento de comprimento redundante
ru: Удалить избыточный аргумент длины
tr: Yedekli uzunluk bağımsız değişkenini kaldırma
zh_hans: 移除冗余长度参数
zh_hant: 移除冗余的長度引數

# AvoidLengthCalculationWhenSlicingToEndDescription
source: An explicit length calculation can be error-prone and can be avoided when slicing to end of the buffer.
cs: Explicitní výpočet délky může být náchylný k chybám a lze se vyhnout při vytváření řezů na konec vyrovnávací paměti.
de: Eine explizite Längenberechnung kann fehleranfällig sein und durch Segmentieren am Ende des Puffers vermieden werden.
es: Un cálculo de longitud explícito puede ser propenso a errores y se puede evitar al segmentar hasta el final del búfer.
fr: Un calcul de longueur explicite peut être sujet aux erreurs et peut être évité lors du découpage jusqu’à la fin de la mémoire tampon.
it: Un calcolo esplicito della lunghezza può essere soggetto a errori e può essere evitato quando si esegue il sezionamento fino alla fine del buffer.
ko: 명시적 길이 계산은 오류가 발생하기 쉬울 수 있으며 버퍼의 끝으로 조각화할 때 방지할 수 있습니다.
pl: Wyraźne obliczenie długości może być podatne na błędy i można go uniknąć podczas wycinania do końca bufora.
pt_br: Um cálculo de comprimento explícito pode ser propenso a erros e pode ser evitado ao fatiar até o final do buffer.
ru: Явное вычисление длины может быть подвержено ошибкам, и его можно избегать при срезе до конца буфера.
tr: Açık uzunluk hesaplaması hataya açık olabileceğinden arabellek sonuna dilimlerken bundan kaçınılabilir.
zh_hans: 在切片到缓冲区末尾时，显式长度计算可能会出错，可以避免这种情况。
zh_hant: 明確長度計算可能會造成錯誤，而可在切入緩衝區結尾時避免。

# AvoidLengthCalculationWhenSlicingToEndMessage
source: '{0}' uses a redundant length calculation that can be removed
cs: {0} používá výpočet redundantní délky, který se dá odebrat.
de: "{0}" verwendet eine redundante Längenberechnung, die entfernt werden kann.
es: "{0}" usa un cálculo de longitud redundante que se puede quitar
fr: « {0} » utilise un calcul de longueur redondant qui peut être supprimé
it: '{0}' usa un calcolo della lunghezza ridondante che può essere rimosso
ko: '{0}'은(는) 제거할 수 있는 중복 길이 계산을 사용합니다.
pl: „{0}” używa nadmiarowego obliczenia długości, które można usunąć
pt_br: “{0}” usa um cálculo de comprimento redundante que pode ser removido
ru: "{0}" использует избыточное вычисление длины, которое можно удалить
tr: '{0}', kaldırılabilecek yedekli bir uzunluk hesaplaması kullanır
zh_hans: “{0}”使用可移除的冗余长度计算
zh_hant: '{0}' 使用可移除的冗余長度計算

# AvoidLengthCalculationWhenSlicingToEndTitle
source: Avoid redundant length argument
cs: Vyhněte se argumentu redundantní délky
de: Redundantes Längenargument vermeiden
es: Evitar argumento de longitud redundante
fr: Éviter l’argument de longueur redondante
it: Evitare l'argomento di lunghezza ridondante
ko: 중복 길이 인수 방지
pl: Unikaj argumentu długości nadmiarowej
pt_br: Evitar o argumento de comprimento redundante
ru: Избегайте избыточного аргумента длины
tr: Yedekli uzunluk bağımsız değişkenini önleme
zh_hans: 避免冗余长度参数
zh_hant: 避免冗余的長度引數

# AvoidMultipleEnumerationsMessage
source: Possible multiple enumerations of 'IEnumerable' collection. Consider using an implementation that avoids multiple enumerations.
cs: Je možných více výčtů kolekce IEnumerable. Zvažte použití implementace, která zabraňuje více výčtům.
de: Mögliche mehrere Enumerationen der IEnumerable-Auflistung. Erwägen Sie die Verwendung einer Implementierung, die mehrere Enumerationen vermeidet.
es: Posibles enumeraciones múltiples de la colección “IEnumerable”. Considere la posibilidad de usar una implementación que evite varias enumeraciones.
fr: Possibilité d'énumérations multiples de la collection 'IEnumerable'. Envisagez d'utiliser une mise en œuvre qui évite les énumérations multiples.
it: Possibili enumerazioni multiple della raccolta 'IEnumerable'. Considerare l'utilizzo di un'implementazione che eviti enumerazioni multiple.
ko: 'IEnumerable' 컬렉션에 대해 여러 개의 열거형이 가능합니다. 여러 열거형을 방지하는 구현을 사용하는 것이 좋습니다.
pl: Możliwe wielokrotne wyliczenia kolekcji „IEnumerable”. Rozważ użycie implementacji, która pozwala uniknąć wielu wyliczeń.
pt_br: Possíveis várias enumerações da coleção 'IEnumerable'. Considere usar uma implementação que evite várias enumerações.
ru: Возможно несколько перечислений коллекции IEnumerable. Рассмотрите возможность использования реализации без нескольких перечислений.
tr: 'IEnumerable' koleksiyonunun birden çok numaralandırması olabilir. Birden çok numaralandırmayı önleyen bir uygulama kullanmayı düşünün.
zh_hans: “IEnumerable” 集合可能的多个枚举。请考虑使用避免多个枚举的实现。
zh_hant: 'IEnumerable' 集合可能有多個列舉。請考慮避免使用多個列舉的實作。

# AvoidMultipleEnumerationsTitle
source: Possible multiple enumerations of 'IEnumerable' collection
cs: Je možných více výčtů kolekce IEnumerable
de: Mögliche mehrere Enumerationen der „IEnumerable“-Auflistung
es: Posibles enumeraciones múltiples de la colección “IEnumerable”
fr: Possibilité d'énumérations multiples de la collection 'IEnumerable'.
it: Possibili enumerazioni multiple della raccolta 'IEnumerable'
ko: 'IEnumerable' 컬렉션에 대해 여러 개의 열거 가능
pl: Możliwe wielokrotne wyliczenia kolekcji „IEnumerable“
pt_br: Possíveis várias enumerações da coleção 'IEnumerable'
ru: Возможно несколько перечислений коллекции IEnumerable
tr: 'IEnumerable' koleksiyonunun olası birden çok numaralandırması
zh_hans: “IEnumerable”集合可能的多个枚举
zh_hant: 'IEnumerable' 集合可能有多個列舉

# AvoidOutParametersDescription
source: Passing types by reference (using 'out' or 'ref') requires experience with pointers, understanding how value types and reference types differ, and handling methods with multiple return values. Also, the difference between 'out' and 'ref' parameters is not widely understood.
cs: Předávání typů podle odkazu (jako out nebo ref) vyžaduje zkušenost s ukazateli, porozumění rozdílu mezi hodnotovými a odkazovými typy a obeznámenost s metodami s více návratovými hodnotami. Navíc není široce rozšířeno chápání rozdílu mezi parametry out a ref.
de: Das Übergeben von Typen als Verweis (mit "out" oder "ref") erfordert Erfahrung mit Zeigern, den Unterschieden zwischen Werttypen und Verweistypen sowie der Verarbeitung von Methoden mit mehreren Rückgabewerten. Auch der Unterschied zwischen den Parametern "out" und "ref" ist nicht allgemein geläufig.
es: Para pasar tipos por referencia (mediante "out" o "ref") se necesita tener experiencia con punteros, comprender en qué se diferencian los tipos de valor y los tipos de referencia y saber usar métodos con varios valores devueltos. Además, la diferencia entre los parámetros "out" y "ref" no se ha entendido del todo.
fr: Le passage de types par référence (via 'out' ou 'ref') nécessite une bonne connaissance des pointeurs, une bonne compréhension des différences entre les types valeur et les types référence ainsi qu'une certaine expérience de la gestion des méthodes avec plusieurs valeurs de retour. En effet, la différence entre les paramètres 'out' et 'ref' n'est pas comprise par tout le monde.
it: Oltre all'esperienza con i puntatori, per passare tipi per riferimento (con 'out' o 'ref'), è necessario comprendere le differenze tra tipi valore e tipi riferimento e gestire i metodi con più valori restituiti. Anche la differenza tra parametri 'out' e 'ref' non è del tutto compresa.
ja: ('out' または 'ref' を使用して) 型を参照によって渡すには、ポインターの使用経験、値型と参照型の違いの理解、および複数の戻り値を持つ処理メソッドが必要です。また、'out' と 'ref' のパラメーターの違いはあまり理解されていません。
ko: 'out' 또는 'ref'를 사용하여 참조로 형식을 전달하려면 포인터 사용 경험, 값 형식과 참조 형식이 어떻게 다른지에 대한 이해 및 반환 값이 여러 개인 메서드 처리가 필요합니다. 또한 'out' 매개 변수와 'ref' 매개 변수의 차이점은 널리 이해되지 않습니다.
pl: Przekazywanie typów przez odwołanie (zastosowanie parametrów „out” lub „ref”) wymaga doświadczenia w pracy ze wskaźnikami, rozumienia różnic między typami wartości i typami odwołań oraz umiejętności stosowania metod z wieloma wartościami zwracanymi. Ponadto różnice między parametrami „out” i „ref” nie są powszechnie zrozumiałe.
pt_br: Passar tipos por referência (usando 'out' ou 'ref') requer experiência com ponteiros, reconhecimento de como os tipos de valor e tipos de referência diferem e manipulação de métodos com vários valores retornados. Além disso, a diferença entre os parâmetros 'out' e 'ref' não é amplamente compreendida.
ru: Для передачи типов по ссылке (с использованием "out" или "ref") необходим опыт работы с указателями, понимание различий между типами значений и ссылочными типами, а также использование методов с несколькими возвращаемыми значениями. Кроме того, разница между параметрами "out" и "ref" не является очевидной.
tr: Türleri başvuruya göre geçirmek ('out' veya 'ref' kullanılarak) için işaretçiler konusunda deneyim, değer ve başvuru türleri arasındaki farkları anlamak ve birden çok dönüş değeri içeren yöntemleri işlemeyi bilmek gerekir. Ayrıca 'out' ve 'ref' parametreleri arasındaki fark yaygın olarak anlaşılmadı.
zh_hans: 按引用(使用 "out" 或 "ref")传递类型需要使用指针，了解值类型和引用类型有何不同，以及处理具有多个返回值的方法。此外，"out" 和 "ref" 参数之间的差异不太容易理解。
zh_hant: 藉傳址傳遞類型 (使用 'out' 或 'ref') 需有指標經驗、了解實值型別與參考型別之間的差異，以及處理具有多個傳回值的方法。而且，大家普遍不了解 'out' 與 'ref' 參數之間的差異。
