Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.CodeQuality.Analyzers/xlf/MicrosoftCodeQualityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SealMethodsThatSatisfyPrivateInterfacesMessage
source: Seal methods that satisfy private interfaces
cs: Zapečetění metod, které vyhovují privátním rozhraním
de: Methoden versiegeln, die die Bedingungen privater Schnittstellen erfüllen
es: Sellar los métodos que cumplan las interfaces privadas
fr: Sceller les méthodes qui satisfont les interfaces privées
it: Impostare come sealed i metodi che soddisfano interfacce private
ja: プライベート インターフェイスを満たすメソッドをシールします
ko: private 인터페이스를 만족하는 메서드를 봉인하세요.
pl: Pieczętuj metody, które spełniają wymagania interfejsów prywatnych
pt_br: Métodos de lacre que satisfazem interfaces privadas
ru: Запечатайте методы, соответствующие частным интерфейсам
tr: Özel arabirimleri karşılayan mühürleme yöntemleri
zh_hans: 密封满足私有接口的方法
zh_hant: 密封滿足私用介面的方法

source: Remove empty Finalizers
cs: Odebrání prázdných finalizačních metod
de: Leere Finalizer entfernen
es: Quitar los finalizadores vacíos
fr: Supprimer les finaliseurs vides
it: Rimuovere i finalizzatori vuoti
ja: 空のファイナライザーを削除します
ko: 빈 종료자를 제거하세요.
pl: Usuwaj puste finalizatory
pt_br: Remover finalizadores vazios
ru: Удалите пустые завершающие методы
tr: Boş Finalizer’ları kaldırın
zh_hans: 移除空终结器
zh_hant: 移除空的完成項

# RemoveEmptyFinalizersDescription
source: Finalizers should be avoided where possible, to avoid the additional performance overhead involved in tracking object lifetime.
cs: Pokud je to možné, neměli byste používat finalizační metody, abyste předešli dalším nárokům na výkon v rámci sledování doby života objektu.
de: Finalizer sollten nach Möglichkeit vermieden werden, um den zusätzlichen Leistungsaufwand zum Nachverfolgen der Objektlebensdauer zu vermeiden.
es: Siempre que pueda, evite los finalizadores debido a la sobrecarga de rendimiento adicional necesaria para el seguimiento de la duración del objeto.
fr: Si possible, évitez d'utiliser les finaliseurs. Vous éviterez ainsi la surcharge de performances qu'implique le suivi de la durée de vie des objets.
it: Quando possibile, è opportuno evitare i finalizzatori per non sovraccaricare ulteriormente le prestazioni durante il rilevamento della durata dell'oggetto.
ja: オブジェクトの有効期間の追跡に関連するパフォーマンスの低下を避けるために、可能な場合は、ファイナライザーの使用を避けてください。
ko: 개체 수명 추적과 관련된 추가적인 성능 오버헤드를 피하기 위해 가능하면 종료자를 사용하지 마세요.
pl: W miarę możliwości należy unikać finalizatorów, aby nie mnożyć czynników powodujących zmniejszenie wydajności związane ze śledzeniem czasu życia obiektów.
pt_br: Os finalizadores devem ser evitados sempre que possível, para evitar a sobrecarga adicional de desempenho envolvida no acompanhamento do tempo de vida do objeto.
ru: Если возможно, следует избегать завершающих методов, чтобы исключить дополнительные издержки, связанные с отслеживанием времени существования объектов.
tr: Nesne yaşam döngüsünün izlenmesi için gereken performans ek yükünden kaçınmak amacıyla sonlandırıclar mümkün olduğunca kullanılmamalıdır.
zh_hans: 应尽可能避免使用终结器，避免跟踪对象生存期时产生额外的性能开销。
zh_hant: 請盡量不要使用完成項，以避免在追蹤物件存留期時產生了額外的效能負荷。

source: Do not call overridable methods in constructors
cs: Nevolejte přepsatelné metody v konstruktorech
de: Überschreibbare Methoden in Konstruktoren nicht aufrufen
es: No llamar a métodos reemplazables en constructores
fr: N'appelez pas de méthodes substituables dans les constructeurs
it: Non chiamare metodi sottoponibili a override nei costruttori
ja: コンストラクターのオーバーライド可能なメソッドを呼び出しません
ko: 생성자에서 재정의 가능한 메서드를 호출하지 마세요.
pl: Nie wywołuj w konstruktorach metod, które można przesłaniać
pt_br: Não chamar métodos substituíveis em construtores
ru: Не вызывайте переопределяемые методы в конструкторах
tr: Oluşturucularda geçersiz kılınabilen yöntemleri çağırmayın
zh_hans: 不要在构造函数中调用可重写的方法
zh_hant: 請勿呼叫建構函式中的可覆寫方法

# DoNotCallOverridableMethodsInConstructorsDescription
source: Virtual methods defined on the class should not be called from constructors. If a derived class has overridden the method, the derived class version will be called (before the derived class constructor is called).
cs: Virtuální metody definované u třídy byste neměli volat z konstruktorů. Pokud odvozená třída přepsala metodu, bude se volat verze odvozené třídy (před voláním konstruktoru odvozené třídy).
de: Für die Klasse definierte virtuelle Methoden dürfen von Konstruktoren nicht aufgerufen werden. Wenn die Methode durch eine abgeleitete Klasse außer Kraft gesetzt wurde, wird die abgeleitete Klassenversion aufgerufen (bevor der Konstruktor der abgeleiteten Klasse aufgerufen wird).
es: Los métodos virtuales definidos en la clase no deben llamarse desde los constructores. Si una clase derivada ha reemplazado el método, se llamará a la versión de clase derivada (antes de que se llame al constructor de clase derivada).
fr: Les méthodes virtuelles définies sur la classe ne doivent pas être appelées à partir de constructeurs. Si une classe dérivée a remplacé la méthode, la version de la classe dérivée est appelée (avant que le constructeur de la classe dérivée ne soit appelé).
it: I metodi virtual definiti sulla classe non devono essere chiamati dai costruttori. Se una classe derivata ha eseguito l'override del metodo, la versione della classe derivata verrà chiamata prima del costruttore della classe derivata.
ja: クラスで定義された仮想メソッドはコンストラクターから呼び出すことができません。派生クラスがメソッドをオーバーライドした場合、派生クラス コンストラクターの前に、派生クラス バージョンが呼び出されます。
ko: 클래스에 정의된 가상 메서드는 생성자에서 호출하면 안 됩니다. 파생 클래스가 메서드를 재정의하면 파생 클래스 생성자가 호출되기 전에 파생 클래스 버전이 호출됩니다.
pl: Metody wirtualne zdefiniowane dla klasy nie powinny być wywoływane z konstruktorów. Jeśli klasa pochodna przesłoniła metodę, zostanie wywołana wersja klasy pochodnej (przed wywołaniem konstruktora klasy pochodnej).
pt_br: Os métodos virtuais definidos na classe não devem ser chamados de construtores. Se uma classe derivada tiver substituído o método, a versão da classe derivada será chamada (antes que o construtor da classe derivada seja chamado).
ru: Виртуальные методы, определенные в классе, не следует вызывать из конструкторов. Если производный класс переопределил метод, будет вызвана версия производного класса (до вызова конструктора производного класса).
tr: Sınıfta tanımlanan sanal yöntemler oluşturuculardan çağrılmamalıdır. Türetilen bir sınıf yöntemi geçersiz kıldıysa, türetilen sınıf sürümü çağrılır (türetilen sınıf oluşturucusu çağrılmadan önce).
zh_hans: 不应通过构造函数调用类中定义的虚方法。如果某个派生类已重写该虚方法，则将在调用派生类的构造函数前，调用此派生类重写后的方法。
zh_hant: 不應從建構函式呼叫類別上定義的虛擬方法。若衍生的類別覆寫了此方法，就會 (在呼叫衍生類別建構函式之前) 呼叫此衍生類別版本。

# RethrowToPreserveStackDetailsMessage
source: Re-throwing caught exception changes stack information
cs: Opakované vyvolání zachycené výjimky změní informace zásobníku.
de: Durch ein erneutes Auslösen einer abgefangenen Ausnahme werden die Stapelinformationen geändert.
es: Si inicia de nuevo la excepción detectada, se cambia la información de la pila.
fr: Quand une exception interceptée est levée à nouveau, cela entraîne un changement des informations de la pile
it: La rigenerazione dell'eccezione rilevata implica la modifica delle informazioni sullo stack
ko: catch한 예외를 다시 throw하면 스택 정보가 변경됩니다.
pl: Ponowne zgłoszenie przechwyconego wyjątku powoduje zmianę informacji o stosie
pt_br: Gerar novamente uma exceção detectada altera as informações de pilha
ru: Повторное порождение перехваченного исключения изменяет сведения стека.
tr: Yakalanan özel durumun yeniden oluşturulması, yığın bilgilerini değiştirir
zh_hans: 再次引发捕获到的异常会更改堆栈信息
zh_hant: 重新擲回攔截到的例外狀況變更堆疊資訊

# RethrowToPreserveStackDetailsTitle
source: Rethrow to preserve stack details
cs: Vyvolat znovu, aby se zachovaly podrobnosti zásobníku
de: Erneut ausführen, um Stapeldetails beizubehalten
es: Iniciar de nuevo para preservar los detalles de la pila
fr: Lever à nouveau une exception pour conserver les détails de la pile
it: Eseguire il rethrow per conservare i dettagli dello stack
ko: 다시 throw하여 스택 정보를 유지하세요.
pl: Zgłoś ponownie wyjątek, aby zachować szczegóły stosu
pt_br: Gerar novamente para preservar detalhes da pilha
ru: Повторно порождайте исключения для сохранения сведений стека
tr: Yığın ayrıntılarını korumak için yeniden oluşturun
zh_hans: 再次引发以保留堆栈详细信息
zh_hant: 重新擲回以保存堆疊詳細資料

source: Make declaring type internal.
cs: Nastavte deklarační typ jako interní.
de: Legen Sie den deklarierenden Typ als intern fest.
es: Convierta el tipo de declaración en interno.
fr: Rendez le type déclarant interne.
it: Impostare il tipo dichiarante come internal.
ja: 宣言する型を internal に設定します。
ko: 선언 형식을 internal로 설정하세요.
pl: Ustaw typ deklarujący jako wewnętrzny.
pt_br: Torne o tipo declarativo interno.
ru: Сделайте объявляющий тип внутренним.
tr: Bildirim türünü dahili yapın.
zh_hans: 使声明类型为 internal。
zh_hant: 將宣告類型設內部類型。

source: Make declaring type sealed.
cs: Nastavte deklarační typ jako zapečetěný.
de: Legen Sie den deklarierenden Typ als versiegelt fest.
es: Convierta el tipo de declaración en sellado.
fr: Rendez le type déclarant sealed.
it: Impostare il tipo dichiarante come sealed.
ja: 宣言する型をシールドに設定します。
ko: 선언 형식을 sealed로 설정하세요.
pl: Ustaw typ deklarujący jako zapieczętowany.
pt_br: Torne o tipo declarativo selado.
ru: Сделайте объявляющий тип запечатанным.
tr: Bildirim türünü mühürlü yapın.
zh_hans: 使声明类型为密封。
zh_hant: 將宣告類型設為密封類型。

source: Make member not overridable.
cs: Nastavte člen jako nepřepisovatelný.
de: Legen Sie den Member als nicht überschreibbar fest.
es: Haga que el miembro no sea reemplazable.
fr: Rendez le membre non substituable.
it: Impostare il membro come non sottoponibile a override.
ja: メンバーをオーバーライド不可能にします。
ko: 멤버를 not overridable로 설정하세요.
pl: Ustaw element członkowski jako niemożliwy do przesłonięcia.
pt_br: Torne o membro não substituível.
ru: Сделайте член непереопределяемым.
tr: Üyeyi geçersiz kılınamaz yapın.
zh_hans: 使成员不可重写。
zh_hant: 將成員設為不可覆寫。

# DoNotRaiseExceptionsInExceptionClausesDescription
source: When an exception is raised in a finally clause, the new exception hides the active exception. This makes the original error difficult to detect and debug.
cs: Při vyvolání výjimky v klauzuli finally nová výjimka skryje aktivní výjimku. V takovém případě je totiž obtížné zjistit a ladit původní chybu.
de: Wenn eine Ausnahme in einer finally-Klausel ausgelöst wird, wird die aktive Ausnahme durch die neue Ausnahme verborgen. Dadurch ist der ursprüngliche Fehler schwierig zu erkennen und zu debuggen.
es: Cuando se inicia una excepción en una cláusula finally, la nueva excepción oculta la excepción activa. Esto provoca que el error original sea difícil de detectar y depurar.
fr: Quand une exception est levée dans une clause finally, la nouvelle exception masque l'exception active. Cela rend l'erreur d'origine difficile à détecter et à corriger.
it: Quando viene generata un'eccezione in una clausola finally, la nuova eccezione nasconde quella attiva. Il rilevamento e il debug dell'errore originale diventano quindi più difficili.
ja: finally 句で例外が発生すると、新しい例外によってアクティブな例外が隠れます。これにより、元のエラーの検出およびデバッグが困難になります。
ko: finally 절에서 예외가 발생하는 경우 새로운 예외가 활성 예외를 숨깁니다. 이로 인해 원래 오류를 감지하거나 디버그하기 어려워집니다.
pl: Wyjątek zgłoszony z klauzuli finally ukrywa aktywny wyjątek. Utrudnia to wykrycie i zdebugowanie pierwotnego błędu.
pt_br: Quando uma exceção é gerada em uma cláusula finally, a nova exceção oculta a exceção ativa. Isso torna o erro original difícil de ser detectado e depurado.
ru: Когда в предложении finally порождается исключение, новое исключение скрывает активное исключение. Это затрудняет обнаружение и отладку исходной ошибки.
tr: Bir finally yan tümcesinde özel durum tetiklenirse yeni özel durum etkin özel durumu gizler. Bu, özgün hatanın algılanmasını ve ayıklanmasını zorlaştırır.
zh_hans: 在 finally 子句中引发异常时，新异常将隐藏活动异常。这样会使原来的错误难以检测和调试。
zh_hant: 當 Finally 子句中引發例外狀況時，新的例外狀況會隱藏作用中的例外狀況。這會讓原始錯誤的偵測與偵錯更加困難。

# DoNotRaiseExceptionsInExceptionClausesMessageFinally
source: Do not raise an exception from within a finally clause
cs: Nevyvolávejte výjimku z klauzule finally.
de: Lösen Sie keine Ausnahme innerhalb einer finally-Klausel aus.
es: No genere una excepción desde una cláusula finally.
fr: Ne levez pas une exception à partir d'une clause finally
it: Non generare un'eccezione dall'interno di una clausola finally
ko: finally 절 내에서 예외가 발생하지 않도록 하세요.
pl: Nie zgłaszaj wyjątku z klauzuli finally
pt_br: Não gere uma exceção de dentro de uma cláusula finally
ru: Не порождайте исключение изнутри предложения finally.
tr: Bir finally yan tümcesinin içinden özel durum oluşturmayın
zh_hans: 不要在 finally 子句中引发异常。
zh_hant: 請勿在 finally 子句中引發例外狀況

# DoNotRaiseExceptionsInExceptionClausesTitle
source: Do not raise exceptions in finally clauses
cs: Nevyvolávejte výjimky v klauzulích finally
de: Keine Ausnahmen in finally-Klauseln auslösen
es: No emitir excepciones en cláusulas finally
fr: Ne pas lever d'exceptions dans les clauses finally
it: Non generare eccezioni in clausole finally
ja: finally 句で例外を発生させません
ko: finally 절에서 예외를 발생시키지 마세요.
pl: Nie zgłaszaj wyjątków w klauzulach finally
pt_br: Não gerar exceções em cláusulas finally
ru: Не порождайте исключения в предложениях finally
tr: Finally yan tümcelerinde özel durum oluşturmayın
zh_hans: 不要在 finally 子句中引发异常
zh_hant: 請勿在 finally 子句中引發例外狀況

# UseLiteralsWhereAppropriateCodeActionTitle
source: Change to constant
cs: Změna na konstantu
de: In Konstante ändern
es: Cambiar a constant
fr: Changer en constante
it: Cambiare in constant
ja: 定数に変更します
ko: 상수로 변경하세요.
pl: Zmień na stałą
pt_br: Alterar para constante
ru: Измените на константу
tr: Sabit olarak değiştirin
zh_hans: 更改为常量
zh_hant: 變更為常數

# AvoidDuplicateElementInitializationDescription
source: Indexed elements in objects initializers must initialize unique elements. A duplicate index might overwrite a previous element initialization.
cs: Indexované prvky v inicializátorech objektů musí inicializovat jedinečné prvky. Duplicitní index může přepsat předchozí inicializaci prvku.
de: Indizierte Elemente in Objektinitialisierern müssen eindeutige Elemente initialisieren. Durch einen doppelten Index kann eine vorherige Elementinitialisierung überschrieben werden.
es: Los elementos indexados en inicializadores de objetos deben inicializar elementos únicos. Un índice duplicado podría sobrescribir una inicialización de elementos anterior.
fr: Les éléments indexés dans des initialiseurs d'objets doivent initialiser des éléments uniques. Un index dupliqué peut remplacer une précédente initialisation d'éléments.
it: Gli elementi indicizzati negli inizializzatori di oggetti devono inizializzare elementi univoci. Un indice duplicato potrebbe sovrascrivere un'inizializzazione di oggetti precedente.
ja: オブジェクト初期化子のインデックス付き要素は、一意の要素を初期化する必要があります。インデックスが重複していると、先に行われた要素の初期化が上書きされる可能性があります。
ko: 개체 이니셜라이저의 인덱싱된 요소는 고유한 요소를 초기화해야 합니다. 중복된 인덱스는 이전 요소의 초기화를 덮어쓸 수 있습니다.
pl: Indeksowane elementy w inicjatorach obiektów muszą inicjować unikatowe elementy. Zduplikowany indeks może powodować zastąpienie wcześniejszego zainicjowania elementu.
pt_br: Os elementos indexados em inicializadores de objetos devem inicializar elementos únicos. Um índice duplicado pode substituir uma inicialização do elemento anterior.
ru: При индексации элементов в инициализаторах объектов необходимо инициализировать уникальные элементы. Повторяющийся индекс может перезаписать предыдущую инициализацию элемента.
tr: Nesne başlatıcılarındaki dizine eklenmiş öğeler, benzersiz öğeleri başlatmalıdır. Yinelenen dizin, önceki öğe başlatmasının üzerine yazabilir.
zh_hans: 对象初始值设定项中已索引的元素必须初始化唯一元素。重复索引可能覆盖先前的元素初始值设定项。
zh_hant: 物件初始設定式中的索引元素必須將唯一元素初始化。重複的索引可能會覆寫先前的元素初始化。

# AvoidDuplicateElementInitializationMessage
source: Redundant element initialization at index '{0}'. Object initializer has another element initializer with the same index that overwrites this value.
cs: Redundantní inicializace prvků na indexu {0}. Inicializátor objektu má další inicializátor prvků se stejným indexem, který tuto hodnotu přepisuje.
de: Redundante Elementinitialisierung bei Index "{0}". Der Objektinitialisierer weist einen anderen Elementinitialisierer mit demselben Index auf, der diesen Wert überschreibt.
es: Inicialización de un elemento redundante en el índice "{0}". El inicializador de objeto tiene otro inicializador de elemento con el mismo índice que sobrescribe este valor.
fr: Initialisation d'élément redondante sur l'index '{0}'. L'initialiseur d'objet a un autre initialiseur d'élément avec le même index qui remplace cette valeur.
it: Inizializzazione di elemento ridondante nell'indice '{0}'. L'inizializzatore di oggetto contiene un altro inizializzatore di elemento con lo stesso indice che sovrascrive questo valore.
ko: 인덱스 '{0}'에 중복 요소 초기화가 있습니다. 개체 이니셜라이저에 이 값을 덮어쓰는 인덱스가 같은 다른 요소 이니셜라이저가 있습니다.
pl: Nadmiarowe inicjowanie elementu w indeksie „{0}”. Inicjator obiektów ma inny inicjator elementu z tym samym indeksem, który zastępuje tę wartość.
pt_br: Inicialização de elemento redundante no índice '{0}'. O inicializador de objeto tem outro inicializador de elemento com o mesmo índice que substitui esse valor.
ru: Избыточная инициализация элемента с индексом "{0}". Инициализатор объекта содержит другой инициализатор элементов с тем же индексом, который перезаписывает это значение.
tr: '{0}' dizininde gereksiz öğe başlatma. Nesne başlatıcısının bu değerin üzerine yazan aynı dizine sahip başka bir öğe başlatıcısı var.
zh_hans: 索引“{0}”处的元素初始化冗余。对象初始值设定项还有一个元素初始值设定项具有相同索引，它会覆盖此值。
zh_hant: 索引 '{0}' 有多餘的項目初始設定。物件初始設定式有另一個項目初始設定式具備相同的索引，該索引會覆寫此值。

# AvoidDuplicateElementInitializationTitle
source: Do not duplicate indexed element initializations
cs: Neduplikujte inicializace indexovaných prvků.
de: Keine Initialisierungen indizierter Elemente duplizieren
es: No duplicar inicializaciones de elementos indexados
fr: Ne pas dupliquer les initialisations d'éléments indexés
it: Non duplicare inizializzazioni di elementi indicizzati
ja: インデックス付き要素の初期化を重複させないでください
ko: 인덱싱된 요소의 초기화는 복제하면 안 됩니다.
pl: Nie duplikuj inicjowania indeksowanych elementów
pt_br: Não duplicar inicializações de elementos indexados
ru: Не повторяйте инициализацию индексируемых элементов
tr: Dizine eklenmiş öğe başlatmalarını yineleme
zh_hans: 不要复制已索引的元素初始值设定项
zh_hant: 請勿複製索引元素初始化

# ValidateArgumentsOfPublicMethodsDescription
source: An externally visible method dereferences one of its reference arguments without verifying whether that argument is 'null' ('Nothing' in Visual Basic). All reference arguments that are passed to externally visible methods should be checked against 'null'. If appropriate, throw an 'ArgumentNullException' when the argument is 'null'. If the method is designed to be called only by known assemblies, you should make the method internal.
cs: Externě viditelná metoda přistupuje přes ukazatel k datům jednoho ze svých atributů odkazů bez ověření, jestli argument není null (Nothing v jazyce Visual Basic). Ve všech argumentech odkazů, které se předávají externě viditelným metodám, by se měla kontrolovat hodnota null. V případě potřeby vyvolejte ArgumentNullException, když je argument null. Pokud je metoda navržená tak, že ji budou volat jen známá sestavení, měli byste ji převést na interní metodu.
de: Eine extern sichtbare Methode dereferenziert eines ihrer Verweisargumente, ohne zu verifizieren, ob das Argument NULL ist („Nothing“ in Visual Basic). Alle Verweisargumente, die an extern sichtbare Methoden übergeben werden, müssen mit NULL überprüft werden. Lösen Sie gegebenenfalls eine „ArgumentNullException“ aus, wenn das Argument NULL ist. Wenn die Methode so konzipiert ist, dass sie nur von bekannten Assemblys aufgerufen wird, müssen Sie die Methode als intern festlegen.
es: Un método visible externamente anula la referencia de uno de sus argumentos de referencia sin comprobar si ese argumento es nulo ("Nothing" en Visual Basic). Todos los argumentos de referencia pasados a métodos visibles externamente deben comprobarse para ver si son nulos. Si procede, inicie una excepción "ArgumentNullException" cuando el argumento sea nulo. Si el método está diseñado para que solo lo llamen ensamblados conocidos, debería convertirlo en interno.
fr: Une méthode visible de manière externe déréférence un de ses arguments de référence sans vérifier si cet argument a une valeur « null » (« Nothing en Visual Basic »). Tous les arguments de référence passés à des méthodes visibles de manière externe doivent faire l'objet d'une vérification permettant de déterminer s'ils ont une valeur « null ». Le cas échéant, « ArgumentNullException » doit être levé quand l'argument a une valeur « null », ou vous devez ajouter une condition préalable au contrat de code pour garantir que l'argument a une valeur non « null ». Si la méthode est conçue pour être appelée uniquement par des assemblys connus, rendez la méthode interne.
it: Un metodo visibile esternamente risolve i riferimenti a uno dei relativi argomenti di riferimento senza verificare se tale argomento è 'null' ('Nothing' in Visual Basic). Tutti gli argomenti di riferimento passati a metodi visibili esternamente devono essere verificati in base a valori 'null'. Se appropriato, generare un'eccezione 'ArgumentNullException' quando l'argomento è 'null'. Se il metodo è concepito per essere chiamato solo da assembly noti, è necessario impostare il metodo come interno.
ko: 외부에 표시되는 메서드는 인수가 'null'(Visual Basic의 'Nothing')인지 확인하지 않고 참조 인수 중 하나를 역참조합니다. 외부에 표시되는 메서드에 전달되는 모든 참조 인수가 null인지 확인해야 합니다. 해당하는 경우 인수가 'null'이면 'ArgumentNullException'을 throw합니다. 메서드가 알려진 어셈블리에서만 호출되도록 설계되어 있으면 메서드를 internal로 설정해야 합니다.
pl: Zewnętrznie widoczna metoda wyłuszcza jeden z argumentów odwołania bez sprawdzania, czy ten argument ma wartość „null” („Nothing” w języku Visual Basic). Wszystkie argumenty odwołania przekazywane do metod widocznych zewnętrznie powinny być sprawdzane pod kątem wartości „null”. W razie potrzeby zgłoś wyjątek „ArgumentNullException”, gdy argument ma wartość „null”. Jeśli metoda została zaprojektowana tak, aby była wywoływana tylko przez znane zestawy, należy ustawić metodę jako wewnętrzną.
pt_br: Um método visível externamente desreferencia um de seus argumentos de referência sem verificar se esse argumento é 'nulo' ('Nada' no Visual Basic). Todos os argumentos de referência que são passados para métodos visíveis externamente devem ser verificados contra 'null'. Se apropriado, lance um 'ArgumentNullException' quando o argumento for 'nulo'. Se o método for projetado para ser chamado apenas por assemblies conhecidos, você deverá tornar o método interno.
ru: Видимый извне метод разыменовывает один из своих аргументов ссылки, не проверяя, имеет ли этот аргумент значение NULL (Nothing в Visual Basic). Все аргументы ссылки, передаваемые в видимые извне методы, следует проверять на значение NULL. При необходимости следует вызвать исключение ArgumentNullException, если аргумент равен NULL. Если метод предназначен для вызова только известными сборками, следует сделать его внутренним.
tr: Dışarıdan görünen metot, bağımsız değişkenin null (Visual Basic’te ‘Nothing’) olup olmadığını doğrulamadan başvuru bağımsız değişkenlerinden birine başvurur. Dışarıdan görünen metotlara geçirilen tüm başvuru bağımsız değişkenlerinin null olup olmadığı denetlenmelidir. Uygunsa, bağımsız değişken null olduğunda bir ArgumentNullException oluşturun. Metot yalnızca bilinen derlemeler tarafından çağrılacak şekilde tasarlanmışsa metodu içeriden görünen hale getirmeniz gerekir.
zh_hans: 外部可见方法会在不验证该参数是否为 "null" (Visual Basic 中为 "Nothing")的情况下取消引用其某个引用参数。应检查传递给外部可见方法的所有引用参数中是否有参数为 "null"。如果适用，在参数为 "null" 时引发 "ArgumentNullException"。如果该方法应仅由已知程序集调用，则应将该方法设置为在内部。
zh_hant: 外部可見的方法，會解除參照其中一個它的參考引數，而會不確認該引數是否為 'null' (Visual Basic 中的 'Nothing')。但所有傳遞到外部可見方法的參考引數，都應檢查是否為 'null'。若可行的話，當引數為 'null' 時請擲回 'ArgumentNullException'。若該方法設計為只可由已知組件呼叫，則應將該方法設為內部方法。
