Repository: dotnet/sdk
Catalog: src/Compatibility/Microsoft.DotNet.ApiSymbolExtensions/xlf/Resources.*.xlf
Languages: cs, es, pt_br

# AssemblyLoaded
source: Assembly '{0}' loaded.
cs: Sestavení {0} bylo načteno.
es: Ensamblado "{0}" cargado.
pt_br: Assembly '{0}' carregado.

# AssemblyReferenceLoaded
source: Assembly '{0}' referenced by '{1}' loaded.
cs: Sestavení {0}, na které odkazuje {1}, bylo načteno.
es: Ensamblado "{0}" al que hace referencia "{1}" cargado.
pt_br: Assembly '{0}' referenciado por '{1}' carregado.

# CouldNotResolveReference
source: Could not resolve reference '{0}' directly or transitively referenced by {1} in any of the provided search directories.
cs: Nepodařilo se přeložit odkaz {0}, na který přímo nebo přechodně odkazuje {1}, v žádném ze zadaných vyhledávacích adresářů.
es: No se pudo resolver la referencia “{0}”, directamente o transitivamente, a la que hace referencia {1} en ninguno de los directorios de búsqueda proporcionados.
pt_br: Não foi possível resolver a referência '{0}', referenciada direta ou transitivamente por {1}, em nenhum dos diretórios de pesquisa fornecidos.

# LoadingAssemblies
source: Loading assemblies '{0}'.
cs: Načítají se sestavení {0}.
es: Cargando ensamblados "{0}".
pt_br: Carregando assemblies '{0}'.

# LoadingAssembliesFromArchive
source: Loading assemblies '{0}' ({1}).
cs: Načítají se sestavení {0} ({1}).
es: Cargando ensamblados "{0}" ({1}).
pt_br: Carregando assemblies '{0}' ({1}).

# LoadingAssembly
source: Loading assembly '{0}'.
cs: Načítá se sestavení {0}.
es: Cargando ensamblado "{0}".
pt_br: Carregando o assembly '{0}'.

# LoadingAssemblyFromStream
source: Loading assembly '{0}' from stream.
cs: Načítá se sestavení {0} ze streamu.
es: Cargando el ensamblado "{0}" de la secuencia.
pt_br: Carregando o assembly '{0}' a partir do fluxo.

# MatchingAssemblyNotFound
source: Could not find matching assembly: '{0}' in any of the search directories.
cs: V žádném z hledaných adresářů se nepovedlo najít odpovídající sestavení: {0}.
es: No se han encontrado coincidencias de ensamblado: "{0}" en ninguno de los directorios de búsqueda.
pt_br: Não foi possível encontrar o assembly correspondente: '{0}' em qualquer um dos diretórios de pesquisa.

# ProvidedPathToLoadBinariesFromNotFound
source: Could not find the provided path '{0}' to load binaries from.
cs: Nepovedlo se najít zadanou cestu {0}, ze které se mají načíst binární soubory.
es: No se pudo encontrar la ruta de acceso proporcionada "{0}" desde donde cargar archivos binarios.
pt_br: Não foi possível encontrar o caminho fornecido '{0}' para carregar os binários.

# ProvidedStreamDoesNotHaveMetadata
source: Provided stream for assembly '{0}' doesn't have any metadata to read. from.
cs: Poskytnutý datový proud pro sestavení {0} nemá žádná metadata pro čtení.
es: La secuencia proporcionada para el ensamblado "{0}" no tiene metadatos que leer.
pt_br: O fluxo fornecido para o assembly '{0}' não tem metadados para ler. desde.

source: Should not be null and contain at least one element.
cs: Nesmí být null a obsahovat alespoň jeden element.
es: No debe ser nulo y debe contener al menos un elemento.
pt_br: Não deve ser nulo e conter pelo menos um elemento.

# ShouldProvideValidAssemblyName
source: Should provide a valid assembly name.
cs: Zadejte platný název sestavení.
es: Debe proporcionar un nombre de ensamblado válido.
pt_br: Deve fornecer um nome de assembly válido.

# StreamPositionGreaterThanLength
source: Stream position is greater than it's length, so there are no contents available to read.
cs: Pozice streamu je větší než jeho délka, proto není k dispozici žádný obsah pro čtení.
es: La posición de la secuencia es mayor que su longitud, por lo que no hay contenido disponible para leer.
pt_br: A posição do fluxo é maior do que seu comprimento, portanto, não há conteúdo disponível para leitura.
