Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PublishDefinition
source: Publish a .NET project for deployment.
cs: Publikuje projekt .NET pro nasazení.
de: Hiermit wird ein .NET-Projekt für die Bereitstellung veröffentlicht.
es: Publica un proyecto de .NET para implementación.
fr: Publiez un projet .NET à des fins de déploiement.
it: Pubblica un progetto .NET per la distribuzione.
ja: .NET プロジェクトを配置のために公開します。
ko: 배포에 대해 .NET 프로젝트를 게시합니다.
pl: Opublikuj projekt platformy .NET do wdrożenia.
pt_br: Publicar um projeto do .NET para implantação.
ru: Публикация проекта .NET для развертывания.
tr: Bir .NET projesini dağıtım için yayımlar.
zh_hans: 发布 .NET 项目进行部署。
zh_hant: 為部署發佈 .NET 專案。

# PublishFrameworkOptionDescription
source: The target framework to publish for. The target framework has to be specified in the project file.
cs: Cílová architektura pro publikování. Cílová architektura musí být zadaná v souboru projektu.
de: Das Zielframework für die Veröffentlichung. Das Zielframework muss in der Projektdatei angegeben werden.
es: La plataforma de destino para la que se publica. La plataforma de destino se debe especificar en el archivo de proyecto.
fr: Framework cible pour lequel la publication est effectuée. Le framework cible doit être spécifié dans le fichier projet.
it: Framework di destinazione per cui eseguire la pubblicazione. Il framework di destinazione deve essere specificato nel file di progetto.
ja: 公開する対象のターゲット フレームワーク。ターゲット フレームワークはプロジェクト ファイルで指定する必要があります。
ko: 게시할 대상 프레임워크입니다. 대상 프레임워크는 프로젝트 파일에서 지정해야 합니다.
pl: Platforma docelowa publikacji. Platforma docelowa musi być określona w pliku projektu.
pt_br: A estrutura de destino da publicação. A estrutura de destino precisa ser especificada no arquivo de projeto.
ru: Целевая платформа публикации. Целевая платформа должна быть указана в файле проекта.
tr: Yayımlamanın yapılacağı hedef çerçeve. Hedef çerçevenin proje dosyasında belirtilmesi gerekir.
zh_hans: 要发布的目标框架。必须在项目文件中指定目标框架。
zh_hant: 要為其進行發佈的目標架構。該架構必須在專案檔中指定。

# PublishOutputOptionDescription
source: The output directory to place the published artifacts in.
cs: Výstupní adresář do kterého se mají umístit publikované artefakty
de: Das Ausgabeverzeichnis, in dem veröffentlichte Artefakte abgelegt werden.
es: El directorio de salida en el que se ubicarán los artefactos publicados.
fr: Répertoire de sortie dans lequel placer les artefacts publiés.
it: Directory di output in cui inserire gli artefatti pubblicati.
ja: 公開された成果物を配置する出力ディレクトリ。
ko: 게시된 아티팩트를 배치할 출력 디렉터리입니다.
pl: Katalog wyjściowy, w którym mają zostać umieszczone opublikowane artefakty.
pt_br: O diretório de saída no qual os artefatos publicados serão colocados.
ru: Выходной каталог для размещения опубликованных артефактов.
tr: Yayımlanan yapıtların yerleştirileceği çıkış dizini.
zh_hans: 要放置已发布项目的输出目录。
zh_hant: 放置發佈之成品的輸出目錄。

# PublishRuntimeOptionDescription
source: The target runtime to publish for. This is used when creating a self-contained deployment. The default is to publish a framework-dependent application.
cs: Modul runtime, který je cílem publikování. Používá se při vytváření samostatného nasazení. Ve výchozím nastavení je publikována aplikace závislá na architektuře.
de: Die Zielruntime für die Veröffentlichung. Diese wird verwendet, wenn eine eigenständige Bereitstellung erstellt wird. Standardmäßig wird eine Framework-abhängige Anwendung veröffentlicht.
es: El tiempo de ejecución objetivo para publicar. Esto se utiliza al crear una implementación independiente. El valor predeterminado es publicar una aplicación dependiente del marco.
fr: Runtime ciblé par la publication. Ceci est utilisé quand vous créez un déploiement autonome. La valeur par défaut est de publier une application dépendante du framework.
it: Runtime di destinazione per cui eseguire la pubblicazione. Viene usato durante la creazione di un pacchetto di distribuzione autonomo. Per impostazione predefinita, viene generato un pacchetto dipendente dal framework.
ja: 公開するターゲット ランタイムです。自己完結型の配置を作成するときに使用されます。 既定では、フレームワークに依存したアプリケーションが公開されます。
ko: 게시할 대상 런타임입니다. 자체 포함 배포를 만들 때 사용됩니다. 기본값은 프레임워크 종속 애플리케이션을 게시하는 것입니다.
pl: Docelowe środowisko uruchomieniowe na potrzeby publikowania. Jest używane podczas tworzenia samodzielnego wdrożenia. Domyślnie publikowana jest aplikacja zależna od struktury.
pt_br: O runtime de destino a ser publicado. Isto é usado quando estiver criando um deployment auto-contido. O padrão é publicar uma aplicação dependente de framework.
ru: Целевая среда для публикации. Используется при создании автономного развертывания. По умолчанию публикация выполняется в приложение, зависимое от платформы.
tr: Yayımlanacak hedef çalışma zamanı. Bu, şirket içinde barındırılan bir dağıtım oluştururken yararlıdır. Varsayılan durum, çerçeveye bağımlı bir uygulama yayımlamaktır.
zh_hans: 要发布的目标运行时。在创建自包含部署时使用。 默认情况下发布依赖于框架的应用程序。
zh_hant: 要發佈至的目標執行階段。在建立獨立式部署時會使用此項目。 預設為發佈與 Framework 相依的應用程式。

# RazorOptionDescription
source: Shut down the Razor build server.
cs: Vypne buildovací server Razor.
de: Hiermit wird der Razor-Buildserver heruntergefahren.
es: Apaga el servidor de compilación de Razor.
fr: Arrêtez le serveur de builds Razor.
it: Arresta il server di compilazione di Razor.
ja: Razor ビルド サーバーをシャットダウンします。
ko: Razor 빌드 서버를 종료합니다.
pl: Zamknij serwer kompilacji Razor.
pt_br: Desligar o servidor de build do Razor.
ru: Завершает работу сервера сборки Razor.
tr: Razor derleme sunucusunu kapatır.
zh_hans: 关闭 Razor 生成服务器。
zh_hant: 關閉 Razor 組建伺服器。

# ReferenceAddAppFullName
source: Add a project-to-project reference to the project.
cs: Přidat odkaz mezi projekty do projektu
de: Hiermit fügen Sie dem Projekt einen Projekt-zu-Projekt-Verweis hinzu.
es: Agrega referencia de proyecto a proyecto al proyecto.
fr: Ajoutez une référence projet à projet au projet.
it: Aggiunge un riferimento P2P (da progetto a progetto) al progetto.
ja: プロジェクト間参照をプロジェクトに追加します。
ko: 프로젝트에 프로젝트 간 참조를 추가합니다.
pl: Dodaj odwołanie między projektami do projektu.
pt_br: Adicione uma referência de projeto a projeto ao projeto.
ru: Добавление в проект ссылки из одного проекта на другой.
tr: Projeye bir projeden projeye başvuru ekleyin.
zh_hans: 向项目添加项目到项目引用。
zh_hant: 將專案對專案參考新增至專案。

# ReferenceAddCmdFrameworkDescription
source: Add the reference only when targeting a specific framework.
cs: Přidá odkaz jen v případě, že cílem je konkrétní architektura.
de: Hiermit wird der Verweis nur dann hinzugefügt, wenn ein bestimmtes Zielframework als Zielversion verwendet wird.
es: Agrega una referencia solo cuando el destino es una plataforma específica.
fr: Ajoutez la référence uniquement en cas de ciblage d'un framework spécifique.
it: Aggiunge il riferimento solo se destinato a un framework specifico.
ja: 特定のフレームワークを対象とする場合にのみ参照を追加します。
ko: 특정 프레임워크를 대상으로 지정할 때에만 참조를 추가합니다.
pl: Dodaj odwołanie tylko w przypadku określenia konkretnej platformy docelowej.
pt_br: Adicionar a referência apenas ao direcionar a uma estrutura específica.
ru: Добавление ссылки только для конкретной целевой платформы.
tr: Başvuruyu yalnızca belirli bir çerçeveyi hedeflerken ekler.
zh_hans: 仅针对特定框架添加引用。
zh_hant: 只有在以特定架構為目標時才新增此參考。

# ReferenceAddProjectPathArgumentDescription
source: The paths to the projects to add as references.
cs: Cesty k projektům, které se mají přidat jako odkazy
de: Die Pfade zu den Projekten, die als Verweise hinzugefügt werden sollen.
es: Las rutas a los proyectos para agregar como referencias.
fr: Chemins des projets à ajouter en tant que références.
it: Percorsi dei progetti da aggiungere come riferimenti.
ja: 参照として追加するプロジェクトへのパス。
ko: 참조로 추가할 프로젝트의 경로입니다.
pl: Ścieżki do projektów, które mają zostać dodane jako odwołania.
pt_br: Os caminhos para os projetos a serem adicionados como referências.
ru: Пути к проектам, которые добавляются как ссылки.
tr: Başvuru olarak eklenecek projelerin yolları.
zh_hans: 要添加为引用的项目路径。
zh_hant: 到達要新增為參考之專案的路徑。

# ReferenceDefinition
source: Add, remove, or list ProjectReferences for a .NET project.
cs: Umožňuje přidat, odebrat nebo vypsat ProjectReferences pro projekt .NET.
de: ProjectReferences für ein .NET-Projekt hinzufügen, entfernen oder auflisten.
es: Agregue, quite o enumere ProjectReferences para un proyecto de .NET.
fr: Ajoutez, supprimez ou répertoriez des ProjectReferences pour un projet .NET.
it: Aggiungi, rimuovi o elenca ProjectReferences per un progetto .NET.
ja: .NET プロジェクトの ProjectReferences を追加、削除、または一覧表示します。
ko: .NET 프로젝트에 대한 ProjectReferences를 추가, 제거 또는 나열합니다.
pl: Dodawanie, usuwanie lub wyświetlanie listy elementów ProjectReference dla projektu platformy .NET.
pt_br: Adicione, remova ou liste ProjectReferences para um projeto do .NET.
ru: Добавление, удаление или перечисление ProjectReferences для проекта .NET.
tr: Bir .NET projesi için ProjectReferences ekleyin, kaldırın veya listeleyin.
zh_hans: 添加、移除或列出 .NET 项目的 ProjectReferences。
zh_hant: 新增、移除或列出 .NET 專案的 ProjectReferences。

# ReferenceListAppFullName
source: List all project-to-project references of the project.
cs: Zobrazí všechny odkazy mezi projekty v projektu.
de: Hiermit listen Sie alle Projekt-zu-Projekt-Verweise des Projekts auf.
es: Enumera referencias de proyecto a proyecto del proyecto.
fr: Listez toutes les références projet à projet du projet.
it: Elenca tutti i riferimenti P2P (da progetto a progetto) del progetto.
ja: プロジェクトのすべてのプロジェクト間参照をリストします。
ko: 프로젝트의 모든 프로젝트 간 참조를 나열합니다.
pl: Wyświetl listę wszystkich odwołań między projektami w projekcie.
pt_br: Listar todas as referências de projeto a projeto do projeto.
ru: Вывод списка всех ссылок из одного проекта на другой.
tr: Projenin tüm projeden projeye başvurularını listeleyin.
zh_hans: 列出项目的所有项目到项目引用。
zh_hant: 列出專案的所有專案對專案參考。

# ReferenceRemoveAppFullName
source: Remove a project-to-project reference from the project.
cs: Odebrat odkaz mezi projekty z projektu
de: Hiermit entfernen Sie einen Projekt-zu-Projekt-Verweis aus dem Projekt.
es: Quita referencia de proyecto a proyecto del proyecto.
fr: Retirez une référence projet à projet du projet.
it: Rimuove un riferimento P2P (da progetto a progetto) dal progetto.
ja: プロジェクト間参照をプロジェクトから削除します。
ko: 프로젝트에서 프로젝트 간 참조를 제거합니다.
pl: Usuń odwołanie między projektami z projektu.
pt_br: Remova uma referência de projeto a projeto do projeto.
ru: Удаление в проекте ссылки из одного проекта на другой.
tr: Bir projeden projeye başvuruyu projeden kaldırın.
zh_hans: 从项目中删除项目到项目引用。
zh_hant: 從專案移除專案對專案參考。

# ReferenceRemoveCmdFrameworkDescription
source: Remove the reference only when targeting a specific framework.
cs: Odebere odkaz jen v případě, že cílem je konkrétní architektura.
de: Der Verweis wird nur dann entfernt, wenn ein bestimmtes Zielframework als Zielversion verwendet wird.
es: Quita una referencia solo cuando el destino es una plataforma específica.
fr: Supprimez la référence uniquement en cas de ciblage d'un framework spécifique.
it: Rimuove il riferimento solo se destinato a un framework specifico.
ja: 特定のフレームワークを対象とする場合にのみ参照を削除します。
ko: 특정 프레임워크를 대상으로 지정할 때에만 참조를 제거합니다.
pl: Usuń odwołanie tylko w przypadku określenia konkretnej platformy docelowej.
pt_br: Remover a referência apenas ao direcionar a uma estrutura específica.
ru: Удалять ссылку только для конкретной целевой платформы.
tr: Yalnızca belirli bir çerçeveyi hedeflerken başvuruyu kaldırır.
zh_hans: 仅针对特定框架删除引用。
zh_hant: 只有在以特定架構為目標時，才移除參考。

# ReferenceRemoveProjectPathArgumentDescription
source: The paths to the referenced projects to remove.
cs: Cesty k odkazovaným projektům, které se mají odebrat
de: Die Pfade zu den referenzierten Projekten, die entfernt werden sollen.
es: Las rutas a los proyectos a los que se hace referencia para quitar.
fr: Chemins des projets référencés à supprimer.
it: Percorsi dei progetti di riferimento da rimuovere.
ja: 削除する参照されたプロジェクトへのパス。
ko: 제거할 참조된 프로젝트의 경로입니다.
pl: Ścieżki do przywoływanych projektów, które mają zostać usunięte.
pt_br: Os caminhos para os projetos referenciados a serem removidos.
ru: Путь к проектам, добавленным в качестве ссылок, которые необходимо удалить.
tr: Kaldırılacak başvurulan projelerin yolları.
zh_hans: 要删除的引用项目的路径。
zh_hant: 到達要移除之參考專案的路徑。

# ReleasesLibraryFailed
source: Unable to get releases information: {0}
cs: Nedají se získat informace o vydaných verzích: {0}
de: Die Versionsinformationen können nicht abgerufen werden: {0}
es: No se puede obtener información de las versiones: {0}
fr: Impossible d'obtenir les informations sur les versions : {0}
it: Non è possibile ottenere informazioni sulle versioni: {0}
ja: リリース情報を取得できません: {0}
ko: 릴리스 정보를 가져올 수 없음: {0}
pl: Nie można uzyskać informacji o wersjach: {0}
pt_br: Não é possível obter informações sobre versões: {0}
ru: Не удалось получить сведения о выпусках: {0}
tr: Sürüm bilgileri alınamıyor: {0}
zh_hans: 无法获取发布信息: {0}
zh_hant: 無法取得發行資訊: {0}

# RemoveAppFullName
source: Remove one or more projects from a solution file.
cs: Odebere ze souboru řešení jeden nebo více projektů.
de: Entfernt ein oder mehrere Projekte von einer Projektmappendatei.
es: Quita uno o varios proyectos de un archivo de solución.
fr: Supprimez un ou plusieurs projets d'un fichier solution.
it: Consente di rimuovere uno o più progetti da un file di soluzione.
ja: 1 つ以上のプロジェクトをソリューション ファイルから削除します。
ko: 솔루션 파일에서 하나 이상의 프로젝트를 제거합니다.
pl: Usuń co najmniej jeden projekt z pliku rozwiązania.
pt_br: Remover um ou mais projetos de um arquivo de solução.
ru: Удаление проектов из файла решения.
tr: Bir çözüm dosyasından bir veya daha fazla projeyi kaldırır.
zh_hans: 从解决方案文件中删除一个或多个项目。
zh_hant: 從解決方案檔移除一或多個專案。

# RemoveProjectPathArgumentDescription
source: The project paths or names to remove from the solution.
cs: Cesty nebo názvy projektů, které se mají z řešení odebrat
de: Die Projektpfade oder Namen, die aus der Projektmappe entfernt werden sollen.
es: Las rutas o nombres de los proyectos que hay que eliminar de la solución.
fr: Les chemins ou noms de projet à supprimer de la solution.
it: I percorsi o nomi progetto da rimuovere dalla soluzione.
ja: ソリューションから削除するプロジェクトパスまたは名前。
ko: 솔루션에서 제거할 프로젝트 경로 또는 이름입니다.
pl: Ścieżki projektu lub nazwy do usunięcia z rozwiązania.
pt_br: Os caminhos ou nomes de projeto a serem removidos da solução.
ru: Пути или имена проектов, удаляемые из решения.
tr: Çözümden kaldırılacak proje yolları veya adları.
zh_hans: 要从解决方案中移除的项目路径或名称。
zh_hant: 要從解決方案移除的專案路徑或名稱。

# RemovingWorkloadInstallationRecord
source: Removing workload installation record for {0}...
cs: Odebírá se záznam instalace úlohy pro {0}…
de: Der Datensatz für die Workloadinstallation für "{0}" wird entfernt...
es: Quitando el registro de instalación de carga de trabajo para {0}...
fr: Suppression de l’enregistrement d’installation de charge de travail pour {0}...
it: Rimozione del record di installazione del carico di lavoro per {0}...
ja: {0} のワークロード インストール レコードを削除しています...
ko: {0}에 대한 워크로드 설치 레코드를 제거하는 중...
pl: Trwa usuwanie rekordu instalacji pakietu roboczego dla {0}...
pt_br: Removendo registo de instalação de carga de trabalho para {0}...
ru: Идет удаление записи установки рабочей нагрузки для {0}…
tr: {0} için iş yükü yükleme kaydı kaldırılıyor...
zh_hans: 正在删除 {0} 的工作负载安装记录...
zh_hant: 正在移除 {0} 的工作負載安裝記錄...

# RepairSucceeded
source: Successfully repaired workloads: {0}
cs: Úspěšně opravené úlohy: {0}
de: Erfolgreich reparierte Workloads: {0}
es: Cargas de trabajo reparadas correctamente: {0}
fr: Les charges de travail ont été réparés : {0}
it: Ripristino dei carichi di lavoro completato: {0}
ja: 正常に修復できたワークロード: {0}
ko: 워크로드를 복구했습니다. {0}
pl: Pomyślnie naprawione obciążenia: {0}
pt_br: Cargas de trabalho reparadas com êxito: {0}
ru: Рабочие нагрузки исправлены: {0}
tr: İş yükleri başarıyla onarıldı: {0}
zh_hans: 成功修复工作负载: {0}
zh_hant: 已成功修復工作負載: {0}

# RepairingWorkloads
source: Repairing workload installation for workloads: {0}
cs: Opravuje se instalace úlohy pro úlohy: {0}
de: Die Workload-Installation für Workloads wird repariert: {0}
es: Reparando la instalación de carga de trabajo para las cargas de trabajo: {0}
fr: Réparation de l’installation de la charge de travail pour les charges de travail : {0}
it: Ripristino dell'installazione del carico di lavoro per i carichi di lavoro: {0}
ja: ワークロードのワークロード インストールを修復しています: {0}
ko: 워크로드에 대한 워크로드 설치 복구 중: {0}
pl: Naprawianie instalacji obciążenia dla pakietów roboczych: {0}
pt_br: Reparando a instalação da carga de trabalho para as cargas de trabalho: {0}
ru: Исправление установки рабочей нагрузки для рабочих нагрузок: {0}
tr: Şu iş yükleri için iş yükü yüklemesi onarılıyor: {0}
zh_hans: 正在修复工作负荷的工作负荷安装: {0}
zh_hant: 正在修復工作負載的工作負載安裝: {0}

# RequiresWindows
source: This command can only be run on Windows
cs: Tento příkaz je možné spustit pouze ve Windows.
de: Dieser Befehl kann nur unter Windows ausgeführt werden.
es: Este comando solo se puede ejecutar en Windows
fr: Cette commande ne peut être exécutée que sur Windows.
it: Questo comando può essere eseguito solo su Windows
ja: このコマンドは Windows でのみ実行できます
ko: 이 명령은 Windows에서만 실행할 수 있습니다
pl: To polecenie można uruchomić tylko w systemie Windows
pt_br: Este comando só pode ser executado no Windows
ru: Эту команду можно выполнить только в Windows
tr: Bu komut yalnızca Windows’ta çalıştırılabilir
zh_hans: 此命令仅可在 Windows 上运行
zh_hant: 此命令只可在 Windows 上執行

# RestoreAppFullName
source: .NET dependency restorer
cs: Nástroj .NET pro obnovení závislostí
de: Funktion.zum Wiederherstellen der NET-Abhängigkeit
es: Restaurador de dependencia de .NET
fr: Programme de restauration de dépendances .NET
it: Utilità di ripristino dipendenze .NET
ja: .NET 依存関係復元ツール
ko: .NET 의존성 복원 도구
pl: Przywracanie zależności platformy .NET
pt_br: Restaurador de dependência do .NET
ru: Восстановитель зависимостей .NET
tr: .NET bağımlılık geri yükleyicisi
zh_hans: .NET 依赖项还原程序
zh_hant: .NET 相依性還原程式

# RestoreDefinition
source: Restore dependencies specified in a .NET project.
cs: Obnoví závislosti zadané v projektu .NET.
de: Hiermit werden im .NET-Projekt angegebene Abhängigkeiten wiederhergestellt.
es: Restaura dependencias especificadas en un proyecto de .NET.
fr: Restaurez les dépendances spécifiées dans un projet .NET.
it: Ripristina le dipendenze specificate in un progetto .NET.
ja: .NET プロジェクトに指定されている依存関係を復元します。
ko: .NET 프로젝트에 지정된 종속성을 복원합니다.
pl: Przywróć zależności określone w projekcie platformy .NET.
pt_br: Restaurar as dependências especificadas em um projeto do .NET.
ru: Восстановление зависимостей, указанных в проекте .NET.
tr: Bir .NET projesinde belirtilen bağımlılıkları geri yükler.
zh_hans: 还原 .NET 项目中指定的依赖项。
zh_hant: 還原 .NET 專案中指定的相依性。

source: Restore failed.
cs: Obnovení selhalo.
de: Fehler beim Wiederherstellen.
es: Error en la restauración.
fr: Échec de la restauration.
it: Il ripristino non è riuscito.
ja: 復元に失敗しました。
ko: 복원하지 못했습니다.
pl: Przywracanie nie powiodło się.
pt_br: Falha na restauração.
ru: Сбой восстановления.
tr: Geri yükleme başarısız oldu.
zh_hans: 还原失败。
zh_hant: 還原失敗。

source: Restore partially failed.
cs: Obnovení bylo částečně neúspěšné.
de: Die Wiederherstellung war nur teilweise möglich.
es: Error parcial de restauración.
fr: Échec partiel de la restauration.
it: Il ripristino non è riuscito parzialmente.
ja: 復元が部分的に失敗しました。
ko: 부분적으로 복원하지 못했습니다.
pl: Przywracanie częściowo nie powiodło się.
pt_br: Falha parcial na restauração.
ru: Восстановление частично не выполнено.
tr: Geri yükleme kısmen başarısız oldu.
zh_hans: 还原部分失败。
zh_hant: 還原部分失敗。

# RestoreSuccessful
source: Tool '{0}' (version '{1}') was restored. Available commands: {2}
cs: Nástroj {0} (verze {1}) se obnovil. Dostupné příkazy: {2}
de: Das Tool "{0}" (Version {1}) wurde wiederhergestellt. Verfügbare Befehle: {2}
es: Se restauró la herramienta "{0}" (versión "{1}"). Comandos disponibles: {2}
fr: L'outil '{0}' (version '{1}') a été restauré. Commandes disponibles : {2}
it: Lo strumento '{0}' (versione '{1}') è stato ripristinato. Comandi disponibili: {2}
ja: ツール '{0}' (バージョン '{1}') は復元されました。使用できるコマンド: {2}
ko: '{0}' 도구(버전 '{1}')가 복원되었습니다. 사용 가능한 명령: {2}
pl: Narzędzie „{0}” (wersja „{1}”) zostało przywrócone. Dostępne polecenia: {2}
pt_br: A ferramenta '{0}' (versão '{1}') foi restaurada. Comandos disponíveis: {2}
ru: Средство "{0}" (версия "{1}") было восстановлено. Доступные команды: {2}
tr: '{0}' aracı (sürüm '{1}') geri yüklendi. Kullanılabilen komutlar: {2}
zh_hans: 工具“{0}”(版本“{1}”)已还原。可用的命令: {2}
zh_hant: 已還原工具 '{0}' (版本 '{1}')。可用的命令: {2}

# RollForwardDefinition
source: Roll forward to framework version (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
cs: Posune se na vyšší verzi architektury (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
de: Rollforward zu Frameworkversion (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
es: Reenviar a la versión del marco (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
fr: Restaurer par progression la version du framework (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
it: Esegue il roll forward alla versione del framework (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
ja: フレームワーク バージョン (LatestPatch、Minor、LatestMinor、Major、LatestMajor、Disable) にロールフォワードします。
ko: 프레임워크 버전(LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable)으로 롤포워드합니다.
pl: Przewiń do wersji platformy (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
pt_br: Role para frente para a versão de estrutura (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
ru: Накат до версии платформы (LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable).
tr: Şu framework sürümüne ileri sarın: (LatestPatch, İkincil, LatestMinor, Ana, LatestMajor, Devre dışı).
zh_hans: 前滚至框架版本(LatestPatch, Minor, LatestMinor, Major, LatestMajor, Disable)。
zh_hant: 復原為架構版本 (LatestPatch、Minor、LatestMinor、Major、LatestMajor、Disable)。

# RollForwardOptionDescription
source: Allow a .NET tool to roll forward to newer versions of the .NET runtime if the runtime it targets isn't installed.
cs: Povolí nástroji .NET přejít na novější verze modulu .NET runtime, pokud není nainstalován modul runtime, na který cílí.
de: Ermöglicht einem .NET-Tool, ein Rollforward auf neuere Versionen der .NET-Runtime auszuführen, wenn die Runtime, auf die es abzielt, nicht installiert ist.
es: Permitir que una herramienta .NET se ponga al día a versiones más recientes del runtime de .NET si el runtime al que se dirige no está instalado.
fr: Autorisez un outil .NET à être restauré par progression vers des versions plus récentes du runtime .NET si le runtime qu’il cible n’est pas installé.
it: Consente a uno strumento .NET di eseguire il roll forward alle versioni più recenti del runtime .NET se il runtime di destinazione non è installato.
ja: 対象となるランタイムがインストールされていない場合、.NET ツールが新しいバージョンの .NET ランタイムにロールフォワードできるようにします。
ko: 대상으로 하는 런타임이 설치되지 않은 경우 .NET 도구가 최신 버전의 .NET 런타임으로 롤포워드하도록 허용합니다.
pl: Zezwalaj narzędziu środowiska .NET na przekazywanie do nowszych wersji środowiska uruchomieniowego .NET, jeśli docelowe środowiska uruchomieniowe nie są zainstalowane.
pt_br: Permitir que uma ferramenta .NET seja revertida para versões mais recentes do runtime do .NET se o runtime ao qual ela se destina não estiver instalado.
ru: Разрешить накат средства .NET до более новых версий среды выполнения .NET, если целевая среда выполнения для средства не установлена.
tr: Hedeflediği çalışma zamanı yüklü değilse, bir .NET aracının daha yeni .NET çalışma zamanı sürümlerine ileri alınmasına izin verin.
zh_hans: 如果未安装所面向的运行时，则允许 .NET 工具向前滚动到较新版本的 .NET 运行时。
zh_hant: 如果未安裝 .NET 執行階段目標，則允許 .NET 工具向前復原至較新版本的 .NET 執行階段。
