Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# HelpPlatformOptions
source: Platform Options:
cs: Parametry platformy:
de: Plattformoptionen:
es: Opciones de plataforma:
fr: Options de plateforme :
it: Opzioni piattaforma:
ja: プラットフォーム オプション:
ko: 플랫폼 옵션:
pl: Opcje platformy:
pt_br: Opções da Plataforma:
ru: Параметры платформы:
tr: Platform Seçenekleri:
zh_hans: 平台选项:
zh_hant: 平台選項:

# HelpUnavailableExtensionOptions
source: Unavailable extension options:
cs: Nedostupné parametry rozšíření:
de: Nicht verfügbare Erweiterungsoptionen:
es: Opciones de extensión no disponibles:
fr: Options d’extension non disponibles :
it: Opzioni estensione non disponibili:
ja: 利用できない拡張機能のオプション:
ko: 사용할 수 없는 확장 옵션:
pl: Niedostępne opcje rozszerzenia:
pt_br: Opções de extensão indisponíveis:
ru: Недоступные параметры расширения:
tr: Mevcut olmayan uzantı seçenekleri:
zh_hans: 不可用的扩展选项:
zh_hant: 無法使用的延伸模組選項:

# HelpUnavailableOptions
source: Unavailable options:
cs: Nedostupné parametry:
de: Nicht verfügbare Optionen:
es: Opciones no disponibles:
fr: Options non disponibles :
it: Opzioni non disponibili:
ja: 利用できないオプション:
ko: 사용할 수 없는 옵션:
pl: Niedostępne opcje:
pt_br: Opções indisponíveis:
ru: Недоступные параметры:
tr: Kullanılamayan seçenekler:
zh_hans: 不可用的选项:
zh_hant: 無法使用的選項:

# HelpWaitingForOptionsAndExtensions
source: Waiting for options and extensions...
cs: Čeká se na parametry a rozšíření...
de: Warten auf Optionen und Erweiterungen...
es: Esperando opciones y extensiones...
fr: En attente d’options et d’extensions...
it: In attesa di opzioni ed estensioni...
ja: オプションと拡張機能を待機しています...
ko: 옵션 및 확장을 기다리는 중...
pl: Trwa oczekiwanie na opcje i rozszerzenia...
pt_br: Aguardando opções e extensões...
ru: Ожидание параметров и расширений...
tr: Seçenekler ve uzantılar bekleniyor...
zh_hans: 正在等待选项和扩展...
zh_hant: 正在等候選項與延伸模組...

# HistoryManifestOnlyOptionDescription
source: Update to the workload versions specified in the history without changing which workloads are installed. Currently installed workloads will be updated to match the specified history version.
cs: Aktualizovat na verze úloh zadané v historii, aniž by se změnilo, které úlohy jsou nainstalovány. Aktuálně nainstalované úlohy budou aktualizovány tak, aby odpovídaly zadané verzi historie.
de: Aktualisieren die im Verlauf angegebenen Workloadversionen, ohne zu ändern, welche Workloads installiert werden. Aktuell installierte Workloads werden entsprechend der angegebenen Verlaufsversion aktualisiert.
es: Actualizar a las versiones de carga de trabajo especificadas en el historial sin cambiar las cargas de trabajo instaladas. Las cargas de trabajo instaladas actualmente se actualizarán para que coincidan con la versión del historial especificada.
fr: Mettre à jour les versions de charge de travail spécifiées dans l’historique sans modifier les charges de travail installées. Les charges de travail actuellement installées seront mises à jour pour correspondre à la version d’historique spécifiée.
it: Eseguire l'aggiornamento alle versioni del carico di lavoro specificate nella cronologia senza modificare i carichi di lavoro installati. I carichi di lavoro attualmente installati verranno aggiornati in modo che corrispondano alla versione della cronologia specificata.
ja: インストールされているワークロードを変更せずに、履歴で指定されたワークロード バージョンに更新します。現在インストールされているワークロードは、指定された履歴バージョンと一致するように更新されます。
ko: 설치된 워크로드를 변경하지 않고 기록에 지정된 워크로드 버전으로 업데이트합니다. 현재 설치된 워크로드는 지정된 기록 버전과 일치하도록 업데이트됩니다.
pl: Zaktualizuj do wersji obciążenia określonych w historii bez zmieniania, które obciążenia są instalowane. Aktualnie zainstalowane obciążenia zostaną zaktualizowane w celu dopasowania do określonej wersji historii.
pt_br: Atualize para as versões de carga de trabalho especificadas no histórico sem alterar quais cargas de trabalho estão instaladas. As cargas de trabalho instaladas no momento serão atualizadas para corresponder à versão do histórico especificada.
ru: Обновление до версий рабочих нагрузок, указанных в журнале, без изменения установленных рабочих нагрузок. Установленные сейчас рабочие нагрузки будут приведены в соответствие с указанной версией журнала.
tr: Hangi iş yüklerinin yüklü olduğunu değiştirmeden, geçmişte belirtilen iş yükü sürümlerine güncelleştirin. Şu anda yüklü iş yükleri belirtilen geçmiş sürümüyle eşleşecek şekilde güncelleştirilecek.
zh_hans: 更新到历史记录中指定的工作负载版本，而不更改安装的工作负载。当前安装的工作负载将更新为与指定的历史记录版本匹配。
zh_hant: 更新至歷程記錄中指定的工作負載版本，而不變更安裝的工作負載。目前安裝的工作負載將會更新以符合指定的歷程記錄版本。

# HostFxrCouldNotBeLoaded
source: Could not load hostfxr from '{0}'.
cs: Z {0} nelze načíst nástroj hostfxr.
de: „hostfxr“ konnte nicht aus „{0}“ geladen werden.
es: No se ha podido cargar hostfxr desde '{0}'.
fr: Impossible de charger hostfxr depuis '{0}'.
it: Non è stato possibile caricare hostfxr da '{0}'.
ja: '{0}' で hostfxr を読み込めませんでした。
ko: '{0}'에서 hostfxr를 로드할 수 없습니다.
pl: Nie można załadować pliku hostfxr z lokalizacji „{0}”.
pt_br: Não foi possível carregar hostfxr de '{0}'.
ru: Не удалось загрузить hostfxr из "{0}".
tr: '{0}' konumundan hostfxr yüklenemedi.
zh_hans: 无法从“{0}”加载 hostfxr。
zh_hant: 無法從 '{0}' 載入 Hostfxr。

source: Id
pl: Identyfikator
ru: ИД
tr: Kimlik
zh_hant: 識別碼

# IgnoredArgumentsMessage
source: The following arguments have been ignored : "{0}"
cs: Následující argumenty se ignorovaly: {0}
de: Die folgenden Argumente wurden ignoriert: {0}
es: Se han omitido los argumentos siguientes: "{0}"
fr: Les arguments suivants ont été ignorés : "{0}"
it: Gli argomenti seguenti sono stati ignorati: "{0}"
ja: 次の引数は無視されました: "{0}"
ko: "{0}" 인수가 무시되었습니다.
pl: Następujące argumenty zostały zignorowane: „{0}”
pt_br: Os argumentos a seguir foram ignorados: "{0}"
ru: Следующие аргументы пропущены: "{0}"
tr: Şu bağımsız değişkenler yoksayıldı: "{0}"
zh_hans: 已忽略以下参数:“{0}”
zh_hant: 已忽略下列引數: "{0}"

# InProcessArtifactsProduced
source: In process file artifacts produced:
cs: Vytvořené artefakty souboru v procesu:
de: In Bearbeitung Dateiartefakte erstellt:
es: Artefactos de archivo en proceso producidos:
fr: Artéfacts produits dans les dossiers en cours de traitement :
it: Artefatti file in fase di elaborazione prodotti:
ja: インプロセスのファイル成果物が生成されました:
ko: 생성된 In process 파일 아티팩트:
pl: Wygenerowane artefakty pliku w trakcie procesu:
pt_br: Artefatos de arquivo de processo produzidos:
ru: Созданные в процессе артефакты файлов:
tr: Üretilen işlem içi dosya yapıtları:
zh_hans: 生成的进程内文件项目:
zh_hant: 產生的流程内檔案成品：

# InRoot
source: Place project in root of the solution, rather than creating a solution folder.
cs: Umístěte projekt do kořene řešení, není potřeba vytvářet složku řešení.
de: Platzieren Sie das Projekt im Stamm der Projektmappe, statt einen Projektmappenordner zu erstellen.
es: Coloque el proyecto en la raíz de la solución, en lugar de crear una carpeta de soluciones.
fr: Place le projet à la racine de la solution, au lieu de créer un dossier solution.
it: Inserisce il progetto nella radice della soluzione invece di creare una cartella soluzione.
ja: ソリューション フォルダーを作成するのではなく、プロジェクトをソリューションのルートに配置します。
ko: 솔루션 폴더를 만드는 대신, 솔루션의 루트에 프로젝트를 배치하세요.
pl: Umieść projekt w katalogu głównym rozwiązania zamiast tworzyć folder rozwiązania.
pt_br: Coloque o projeto na raiz da solução, em vez de criar uma pasta da solução.
ru: Поместите проект в корень решения вместо создания папки решения.
tr: Bir çözüm klasörü oluşturmak yerine projeyi çözümün köküne yerleştirin.
zh_hans: 将项目放在解决方案的根目录下，而不是创建解决方案文件夹。
zh_hant: 請將專案放置在解決方案的根目錄中，而非放置於建立解決方案的資料夾中。

# InadequatePermissions
source: Inadequate permissions. Run the command with elevated privileges.
cs: Nedostatečná oprávnění. Spusťte příkaz se zvýšenými oprávněními.
de: Unzureichende Berechtigungen. Führen Sie den Befehl mit erhöhten Rechten aus.
es: Permisos inadecuados. Ejecute el comando con privilegios elevados.
fr: Autorisations insuffisantes. Exécutez la commande avec des privilèges élevés.
it: Autorizzazioni inadeguate. Eseguire il comando con privilegi elevati.
ja: 十分なアクセス許可がありません。昇格された特権を使用してコマンドを実行します。
ko: 권한이 부족합니다. 관리자 권한으로 명령을 실행합니다.
pl: Nieodpowiednie uprawnienia. Uruchom polecenie z podwyższonym poziomem uprawnień.
pt_br: Permissões inadequadas. Execute o comando com privilégios elevados.
ru: Недостаточные разрешения. Выполните команду с более высоким уровнем привилегий.
tr: İzinler yetersiz. Komutu yükseltilmiş ayrıcalıklarla çalıştırın.
zh_hans: 权限不足。请使用提升的权限运行该命令。
zh_hant: 權限不足。以較高的權限執行命令。

# IncludePreviewOptionDescription
source: Allow prerelease workload manifests.
cs: Povolit předběžné verze manifestů úloh.
de: Hiermit wird die Vorabversion von Workloadmanifesten zugelassen.
es: Permitir manifiestos de carga de trabajo de versión preliminar.
fr: Autorisez les manifestes de la charge de travail préliminaire.
it: Consenti i manifesti del carico di lavoro preliminari.
ja: プレリリースのワークロード マニフェストを許可します。
ko: 시험판 워크로드 매니페스트를 허용합니다.
pl: Zezwalaj na wstępnie wydane manifesty pakietów roboczych.
pt_br: Permitir manifestos de carga de trabalho de pré-lançamento.
ru: Разрешить предварительные манифесты рабочей нагрузки.
tr: Yayın öncesi iş yükü bildirimlerine izin ver.
zh_hans: 允许预发布工作负载清单。
zh_hant: 允許發行前階段工作負載資訊清單。

# InstallToolCommandInvalidGlobalAndLocalAndToolPath
source: The local option(--local), the global option (--global), the tool path option (--tool-path), can only have one at a time. Specify only one of the options: {0}.
cs: Možnost local (--local), možnost global (--global), možnost tool path (--tool-path), v jednu chvíli je možné mít jen jednu. Zadejte jen jednu z možností: {0}
de: Die lokale Option (--local), die globale Option (--global) und die Toolpfadoption (--tool-path) können nicht zusammen angegeben werden. Geben Sie nur eine der Optionen an: {0}.
es: La opción local (--local), la opción global (--global) y la opción de ruta de acceso de herramienta (--tool-path), solo pueden estar una cada vez. Especifique solo una de las opciones: {0}.
fr: L'option locale (--local), l'option globale (--global) et l'option de chemin d'outil (--tool-path) ne peuvent pas être utilisées simultanément. Spécifiez une seule des options : {0}.
it: Le opzioni locale (--local), globale (--global) e del percorso dello strumento (--tool-path) non possono essere specificate contemporaneamente. Specificare una sola di queste opzioni: {0}.
ja: ローカル オプション (--local)、グローバル オプション (--global)、ツール パス オプション (--tool-path) は、一度に 1 つだけ指定できます。オプションを 1 つだけ指定します: {0}。
ko: 로컬 옵션(--local), 전역 옵션(--global), 도구 경로 옵션(--tool-path)은 한 번에 하나씩만 사용할 수 있습니다. {0} 옵션 중에서 하나만 지정하세요.
pl: Można określić tylko jedną opcję jednocześnie: opcję lokalną (--local), opcję globalną (--global) lub opcję ścieżki do narzędzia (--tool-path). Podaj tylko jedną z opcji: {0}.
pt_br: As opções local (--local), global (--global) e do caminho da ferramenta (--tool-path) só podem ocorrer uma por vez. Especifique apenas uma das opções: {0}.
ru: Локальный параметр (--local), глобальный параметр (--global) и параметр пути к средству (--tool-path) можно использовать только отдельно друг от друга. Укажите только один из этих параметров: {0}.
tr: Yerel seçeneği (--local), genel seçeneği (--global), araç yolu seçeneği (--tool-path) arasından yalnızca biri seçilebilir. Seçeneklerden yalnızca birini belirtin: {0}.
zh_hans: 本地选项(--local)、全局选项(--global)和工具路径选项(--tool-path)一次只能有一个。请仅指定其中一个选项: {0}。
zh_hant: 一次只能有一個本機選項 (--local)、全域選項 (--global)、工具路徑選項 (--tool-path)。請僅指定其中一個選項: {0}。

# InstallingPackVersionMessage
source: Installing pack {0} version {1}...
cs: Instaluje se sada {0} verze {1}...
de: Pack "{0}" (Version {1}) wird installiert...
es: Instalando el paquete {0} versión {1}...
fr: Installation de la version {1} du pack {0}...
it: Installazione della versione {1} del pacchetto {0}...
ja: Pack {0} バージョン {1} をインストールしています...
ko: {0} 팩 버전 {1} 설치 중...
pl: Trwa instalowanie pakietu {0} w wersji {1}...
pt_br: Instalando o pacote {0} versão {1}...
ru: Идет установка пакета {0} версии {1}…
tr: Paket {0} sürümü {1} yükleniyor...
zh_hans: 正在安装包 {0} 版本 {1}...
zh_hant: 正在安裝套件 {0} 版本 {1}...

# InstallingWorkloadManifest
source: Installing workload manifest {0} version {1}...
cs: Probíhá instalace manifestu úlohy {0} verze {1}...
de: Das Workloadmanifest {0}, Version {1}, wird installiert…
es: Instalando el manifiesto de la carga de trabajo {0}, versión {1}...
fr: Installation de la version {1} du manifeste {0} de charge de travail...
it: Installazione del manifesto del carico di lavoro {0} versione {1} in corso...
ja: ワークロード マニフェスト {0} のバージョン {1} をインストールしています...
ko: 워크로드 매니페스트 {0} 버전 {1} 설치 중...
pl: Instalowanie manifestu obciążenia {0} w wersji {1}…
pt_br: Instalando o manifesto da carga de trabalho {0} versão {1}...
ru: Установка манифеста рабочей нагрузки {0} версии {1}...
tr: {0} iş yükü bildirimi sürüm {1} yükleniyor...
zh_hans: 正在安装工作负载清单 {0} 版本 {1}…
zh_hant: 正在安裝工作負載資訊清單 {0} 版本 {1}...

# InstallingWorkloads
source: Installing workloads: {0}
cs: Probíhá instalace úloh: {0}
de: Workloads werden installiert: {0}
es: Instalación de cargas de trabajo: {0}
fr: Installation de la charge de travail : {0}
it: Installazione del carico di lavoro: {0}
ja: ワークロードをインストールしています: {0}
ko: 워크로드 {0} 설치 중...
pl: Instalowanie obciążeń: {0}
pt_br: Instalando cargas de trabalho: {0}
ru: Установка рабочих нагрузок: {0}
tr: {0} iş yükleri yükleniyor
zh_hans: 正在安装工作负载“{0}”
zh_hant: 正在安裝工作負載: {0}

# InsufficientPrivilegeToStartServer
source: Insufficient privilege to start the server.
cs: Nedostatečná oprávnění pro spuštění serveru
de: Unzureichende Berechtigungen zum Starten des Servers.
es: Insuficientes privilegios para iniciar el servidor.
fr: Privilèges insuffisants pour démarrer le serveur
it: Privilegio insufficiente per l'avvio del server.
ja: サーバーを起動するための十分な特権がありません。
ko: 서버를 시작할 권한이 없습니다.
pl: Niewystarczające uprawnienia do uruchomienia serwera.
pt_br: Privilégio insuficiente para iniciar o servidor.
ru: Недостаточно разрешений для запуска сервера.
tr: Sunucuyu başlatmak için yeterli ayrıcalığa sahip değilsiniz.
zh_hans: 权限不足，无法启动服务器。
zh_hant: 權限不足，無法啟動伺服器。

# IntermediateWorkingDirOptionDescription
source: The working directory used by the command to execute.
cs: Pracovní adresář použitý příkazem, který se má spustit
de: Das vom auszuführenden Befehl verwendete Arbeitsverzeichnis.
es: El directorio de trabajo usado por el comando que se ejecutará.
fr: Répertoire de travail utilisé par la commande pour s'exécuter.
it: Directory di lavoro usata dal comando da eseguire.
ja: 実行のためにコマンドで使用される作業ディレクトリ。
ko: 실행할 명령에서 사용하는 작업 디렉터리입니다.
pl: Katalog roboczy używany do wykonania polecenia.
pt_br: O diretório de trabalho usado pelo comando para a execução.
ru: Рабочий каталог для выполняемой команды.
tr: Yürütülecek komut tarafından kullanılan çalışma dizini.
zh_hans: 由要执行的命令使用的工作目录。
zh_hant: 命令用於執行的工作目錄。

# InvalidDirectiveName
source: The directive at '{2}' should contain a name without special characters and an optional value separated by '{1}' like '#:{0} Name{1}Value'.
cs: Direktiva v {2} by měla obsahovat název bez speciálních znaků a volitelnou hodnotu oddělenou znakem {1}, například #:{0} Název{1}Hodnota.
de: Die Direktive bei "{2}" sollte einen Namen ohne Sonderzeichen und einen optionalen Wert enthalten, die durch "{1}" wie "#:{0} Name{1}Wert" getrennt ist.
es: La directiva de ''{2}'' debe contener un nombre sin caracteres especiales y un valor opcional separado por ''{1}'' como ''#:{0} Nombre{1}Valor''.
fr: La directive dans « {2} » doit contenir un nom sans caractères spéciaux et une valeur facultative séparée par « {1} » comme « # :{0} Nom{1}Valeur ».
it: La direttiva in "{2}" deve contenere un nome senza caratteri speciali e un valore facoltativo separato da "{1}" come "#:{0} Nome{1}Valore".
ja: '{2}' のディレクティブには、特殊文字のない名前と、'#:{0} Name{1}Value' などの '{1}' で区切られた省略可能な値を含める必要があります。
ko: '{2}'의 지시문에는 특수 문자가 없는 이름과 '{1}' 구분 기호로 구분되는 선택적 값('#:{0} 이름{1}값')이 포함되어야 합니다.
pl: Dyrektywa w „{2}” powinna zawierać nazwę bez znaków specjalnych i opcjonalną wartość oddzieloną znakiem „{1}”, na przykład "#:{0} wartość{1}nazwy”.
pt_br: A diretiva em "{2}" deve conter um nome sem caracteres especiais e um valor opcional separado por "{1}" como "#:{0} Name{1}Value".
ru: Директива в "{2}" должна содержать имя без специальных символов и необязательное значение, разделенные символом-разделителем "{1}", например "#":{0} Имя{1}Значение".
tr: '{2}' türündeki yönerge, özel karakter içermeyen bir ad ve '{1}' ile ayrılmış isteğe bağlı bir değer içermelidir, örneğin '#:{0} Ad{1}Değer'.
zh_hans: ‘{2}’ 处的指令应包含一个不带特殊字符的名称和一个可选值，并使用 ‘{1}’ 分隔，如 ‘#:{0} 名称{1} 值’ 等。
zh_hant: 位於 '{2}' 的指示詞應包含不含特殊字元的名稱，以及 '{1}' 分隔的選用值，例如 '#:{0} Name{1}Value'。

# InvalidFilePath
source: The specified file must exist and have '.cs' file extension: '{0}'
cs: Zadaný soubor musí existovat a musí mít příponu souboru .cs:{0}
de: Die angegebene Datei muss vorhanden sein und die Dateierweiterung ".cs" aufweisen: "{0}".
es: El archivo especificado debe existir y tener la extensión de archivo ".cs": "{0}"
fr: Le fichier spécifié doit exister et avoir l'extension « .cs » : « {0} »
it: Il file specificato deve esistere e avere l'estensione '.cs': '{0}'
ja: 指定されたファイルが存在し、ファイル拡張子が '.cs' である必要があります: '{0}'
ko: 지정한 파일이 존재해야 하며 '.cs' 파일 확장명이 있어야 합니다. '{0}'.
pl: Określony plik musi istnieć i mieć rozszerzenie pliku „.cs”: „{0}”
pt_br: O arquivo especificado deve existir e ter a extensão de arquivo ".cs": "{0}"
ru: Указанный файл должен существовать и иметь расширение ".cs": "{0}"
tr: Belirtilen dosya mevcut olmalıdır ve uzantısı '.cs' olmalıdır: '{0}'
zh_hans: 指定的文件必须存在且具有 ‘.cs’ 文件扩展名: ‘{0}’
zh_hant: 指定的檔案必須存在，並具有 '.cs' 副檔名:'{0}'

# InvalidOptionForFileBasedApp
source: Cannot specify option '{0}' when operating on a file-based app.
cs: Možnost {0} nelze zadat při práci se souborovou aplikací.
de: Die Option '{0}' kann nicht angegeben werden, wenn auf eine dateibasierte App zugegriffen wird.
es: No se puede especificar la opción '{0}' al trabajar con una aplicación basada en archivos.
fr: Nous ne pouvons pas spécifier l’option « {0} » lors de l’utilisation d’une application basée sur des fichiers.
it: Non è possibile specificare l'opzione '{0}' quando si eseguono operazioni su un'app basata su file.
ja: ファイル ベースのアプリで操作する場合は、オプション '{0}' を指定できません。
ko: 파일 기반 앱에서 작업할 때 '{0}' 옵션을 지정할 수 없습니다.
pl: Nie można określić opcji „{0}” podczas pracy z aplikacją opartą na plikach.
pt_br: Não é possível especificar a opção "{0}" ao operar em um aplicativo baseado em arquivo.
ru: Невозможно указать параметр "{0}" при работе с приложением на основе файлов.
tr: Dosya tabanlı bir uygulamada çalışırken ‘{0}’ seçeneği belirtilemez.
zh_hans: 在基于文件的应用上操作时，无法指定选项“{0}”。
zh_hant: 在檔案型應用程式上執行時，無法指定選項 '{0}'。

# InvalidOptionForStdin
source: Cannot specify option '{0}' when also using '-' to read the file from standard input.
cs: Nelze zadat parametr {0}, pokud se k načtení souboru ze standardního vstupního zařízení používá také parametr -.
de: Die Option „{0}“ kann nicht angegeben werden, wenn auch „-“ zum Lesen der Datei aus der Standardeingabe verwendet wird.
es: No se puede especificar la opción "{0}" cuando también se utiliza "-" para leer el archivo desde la entrada estándar.
fr: Impossible de spécifier l’option « {0} » lorsque vous utilisez également '-' pour lire le fichier à partir de l’entrée standard.
it: Non è possibile specificare l'opzione '{0}' quando si utilizza anche '-' per leggere il file dall'input standard.
ja: 標準入力からファイルを読み取るために '-' も使用している場合は、オプション '{0}' を指定できません。
ko: '-'를 사용하여 표준 입력에서 파일을 읽는 경우에도 '{0}' 옵션을 지정할 수 없습니다.
pl: Nie można określić opcji „{0}” przy jednoczesnym używaniu znaku „-” do odczytu pliku ze standardowych danych wejściowych.
pt_br: Não é possível especificar a opção '{0}' ao mesmo tempo em que se utiliza '-' para ler o arquivo da entrada padrão.
ru: Невозможно указать параметр "{0}", если также используется "-" для чтения файла из стандартного ввода.
tr: Standart girişten dosyayı okumak için ‘-’ kullanırken '{0}' seçeneği belirtilemez.
zh_hans: 当还使用 ‘-’ 从标准输入中读取文件时，无法指定选项 ‘{0}’。
zh_hant: 當使用「-」從標準輸入讀取檔案時，無法指定選項 '{0}'。

# InvalidProjectDirective
source: The '#:project' directive at '{0}' is invalid: {1}
cs: Direktiva #:project v {0} je neplatná: {1}.
de: Die Direktive "#:project" bei "{0}" ist ungültig: {1}.
es: La directiva "#:project" en "{0}" no es válida: {1}
fr: La directive « #:project » à « {0} » n’est pas valide : {1}
it: La direttiva '#:project' in '{0}' non è valida: {1}
ja: '{0}' の '#:p roject' ディレクティブが無効です: {1}
ko: '{0}'의 '#:project' 지시문이 잘못되었습니다. {1}.
pl: Dyrektywa „#:project” w lokalizacji „{0}” jest nieprawidłowa: {1}
pt_br: A diretiva "#:p roject" em "{0}" é inválida: {1}
ru: Недопустимая директива "#:project" в "{0}": {1}
tr: '{0}' konumundaki '#:project' yönergesi geçersiz: {1}
zh_hans: 位于 '{0}' 的 '#:project' 指令无效: {1}
zh_hant: 位於 '{0}' 的 '#:project' 指示詞無效: {1}

# InvalidSemVerVersionString
source: Failed to parse "{0}" as a semantic version.
cs: Nepovedlo se analyzovat {0} jako sémantickou verzi.
de: Fehler beim Analysieren von "{0}" als semantische Version.
es: Error al analizar "{0}" como una versión semántica.
fr: Échec de l’analyse de « {0} » en tant que version sémantique.
it: Non è stato possibile analizzare "{0}" come versione semantica.
ja: "{0}" をセマンティック バージョンとして解析できませんでした。
ko: '{0}'을(를) 의미 체계 버전으로 구문 분석하지 못했습니다.
pl: Nie można przeanalizować ciągu „{0}” jako wersji semantycznej.
pt_br: Falha ao analisar "{0}" como uma versão semântica.
ru: Не удалось выполнить разбор "{0}" как семантической версии.
tr: '{0}' bir anlamsal sürüm olarak ayrıştırılamadı.
zh_hans: 无法将 ‘{0}’ 分析为语义版本。
zh_hant: 無法將 '{0}' 剖析為語意版本。

# InvalidToolConfiguration
source: The settings file in the tool's NuGet package is invalid: {0}
cs: Soubor nastavení v balíčku NuGet nástroje je neplatný: {0}.
de: Die Einstellungsdatei im NuGet-Paket des Tools ist ungültig: {0}
es: El archivo de configuración del paquete NuGet de la herramienta no es válido: {0}
fr: Le fichier de paramètres dans le package NuGet de l'outil n'est pas valide : {0}
it: Il file di impostazioni nel pacchetto NuGet dello strumento non è valido: {0}
ja: ツールの NuGet パッケージ内の設定ファイルが無効です: {0}
ko: 도구의 NuGet 패키지에 있는 설정 파일이 잘못되었습니다. {0}
pl: Plik ustawień w pakiecie NuGet narzędzia jest nieprawidłowy: {0}
pt_br: O arquivo de configurações no pacote NuGet da ferramenta é inválido: {0}
ru: Недопустимый файл параметров в пакете NuGet инструмента: {0}
tr: Aracın NuGet paketindeki ayar dosyası geçersiz: {0}
zh_hans: 工具的 NuGet 包中的设置文件无效: {0}
zh_hant: 工具之 NuGet 套件中的設定檔案無效: {0}

# InvalidVersionForWorkload
source: Error parsing version '{1}' for workload manifest ID '{0}'
cs: Chyba při analýze verze {1} pro ID manifestu úlohy {0}
de: Fehler beim Analysieren der Version \"{1}\" für die Workloadmanifest-ID \"{0}\"
es: Error al analizar la versión \"{1}\" para el id. de manifiesto de carga de trabajo \"{0}\"
fr: Erreur lors de l’analyse de la version «{1}» pour l’ID de manifeste de charge de travail «{0}»
it: Errore durante l'analisi della versione '{1}' per l'ID manifesto del carico di lavoro '{0}'
ja: ワークロード マニフェスト ID '{0}' のバージョン '{1}' の解析でエラーが発生しました
ko: 작업 매니페스트 ID '{1}'의 버전 '{0}'을(를) 구문 분석하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas analizowania wersji „{1}” dla identyfikatora manifestu obciążenia „{0}”
pt_br: Erro ao analisar a versão '{1}' para a identificação do manifesto da carga de trabalho '{0}'
ru: Ошибка при анализе версии \"{1}\" идентификатора манифеста рабочей нагрузки \"{0}\"
tr: İş yükü bildirim kimliği '{0}' için hata ayrıştırma sürümü '{1}'
zh_hans: 分析工作负载清单 ID“{1}”的版本“{0}”时出错
zh_hant: 剖析工作負載資訊清單識別碼 '{1}' 的版本 '{0}' 時發生錯誤

source: Latest Version
cs: Nejnovější verze
de: Aktuelle Version
es: Última versión
fr: Dernière version
it: Ultima versione
ja: 最新バージョン
ko: 최신 버전
pl: Najnowsza wersja
pt_br: Última Versão
ru: Последняя версия
tr: En Son Sürüm
zh_hans: 最新版本
zh_hant: 最新版本
