Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RunFrameworkOptionDescription
source: The target framework to run for. The target framework must also be specified in the project file.
cs: Cílová architektura pro spuštění. Cílová architektura musí být určená také v souboru projektu.
de: Das Zielframework für die Ausführung. Das Zielframework muss auch in der Projektdatei angegeben werden.
es: La plataforma de destino para la que se ejecuta. La plataforma de destino se debe especificar en el archivo de proyecto.
fr: Framework cible pour lequel l'exécution est effectuée. Le framework cible doit également être spécifié dans le fichier projet.
it: Framework di destinazione da usare per l'esecuzione. Il framework di destinazione deve essere specificato anche nel file di progetto.
ja: 実行する対象のターゲット フレームワーク。ターゲット フレームワークはプロジェクト ファイルでも指定する必要があります。
ko: 실행할 대상 프레임워크입니다. 대상 프레임워크는 프로젝트 파일에도 지정되어야 합니다.
pl: Platforma docelowa uruchomienia. Platforma docelowa musi być również określona w pliku projektu.
pt_br: A estrutura de destino para a qual a execução ocorrerá. A estrutura de destino também precisa ser especificada no arquivo de projeto.
ru: Целевая платформа для запуска. Целевая платформа также должна быть указана в файле проекта.
tr: Çalıştırılacak hedef çerçeve. Hedef çerçevenin proje dosyasında da belirtilmesi gerekir.
zh_hans: 要运行的目标框架。必须在项目文件中指定目标框架。
zh_hant: 要為其執行的目標架構。該目標架構也必須在專案檔中指定。

# RunRuntimeOptionDescription
source: The target runtime to run for.
cs: Cílový modul runtime pro běh
de: Die Zielruntime, für die die Ausführung erfolgt.
es: El entorno de ejecución de destino en el que se ejecuta.
fr: Runtime cible à exécuter.
it: Runtime di destinazione per l'esecuzione.
ja: 実行対象のターゲット ランタイム。
ko: 실행할 대상 런타임입니다.
pl: Docelowe środowisko uruchomieniowe na potrzeby przebiegu.
pt_br: O runtime de destino a ser executado.
ru: Целевая среда выполнения.
tr: Çalıştırılacağı hedef çalışma zamanı.
zh_hans: 要为其运行的目标运行时。
zh_hant: 測試標的之目標執行階段。

source: Running tests from
cs: Spouštění testů z
de: Ausführen von Tests von
es: Ejecutando pruebas desde
fr: Exécuter des tests à partir de
it: Esecuzione di test da
ja: 次からテストを実行しています:
ko: 다음 위치에서 테스트를 실행하는 중
pl: Uruchamianie testów z
pt_br: Executando testes de
ru: Выполнение тестов из
tr: Testler çalıştırılıyor:
zh_hans: 正在从以下位置运行测试
zh_hant: 正從下列位置執行測試

# RuntimeConfigDefinition
source: Path to <application>.runtimeconfig.json file.
cs: Cesta k souboru <aplikace>.runtimeconfig.json.
de: Pfad zur Datei "<application>.runtimeconfig.json".
es: Ruta de acceso al archivo <application>.runtimeconfig.json.
fr: Chemin du fichier <application>.runtimeconfig.json.
it: Percorso del file <applicazione>.runtimeconfig.json.
ja: <application>.runtimeconfig.json ファイルへのパス。
ko: <application>.runtimeconfig.json 파일의 경로입니다.
pl: Ścieżka do pliku <aplikacja>.runtimeconfig.json.
pt_br: Caminho para o arquivo <application>. runtimeconfig.json.
ru: Путь к файлу <application>.runtimeconfig.json.
tr: <application>.runtimeconfig.json dosyasının yolu.
zh_hans: 指向 <application>.runtimeconfig.json 文件的路径。
zh_hant: <application>.runtimeconfig.json 檔案的路徑。

# RuntimePropertyNotFound
source: Runtime property 'HOSTFXR_PATH' was not set or empty.
cs: Vlastnost modulu runtime HOSTFXR_PATH nebyla nastavena nebo je prázdná.
de: Die Runtimeeigenschaft „HOSTFXR_PATH“ wurde nicht festgelegt oder ist leer.
es: La propiedad en tiempo de ejecución 'HOSTFXR_PATH' no se ha establecido o estaba vacía.
fr: La propriété de Runtime’HOSTFXR_PATH’n’est pas définie ou vide.
it: La proprietà di runtime ' HOSTFXR_PATH ' non è stata impostata o è vuota.
ja: ランタイム プロパティ 'HOSTFXR_PATH' が設定されていないか、空です。
ko: 런타임 속성 'HOSTFXR_PATH'이(가) 설정되지 않았거나 비어 있습니다.
pl: Właściwość środowiska uruchomieniowego „HOSTFXR_PATH” nie została określona lub jest pusta.
pt_br: A propriedade de tempo de execução ' HOSTFXR_PATH ' não foi definida ou está vazia.
ru: Свойство "HOSTFXR_PATH" среды выполнения не задано или пусто.
tr: 'HOSTFXR_PATH' çalışma zamanı özelliği ayarlanmamış veya boş.
zh_hans: 未设置运行时属性“HOSTFXR_PATH”或该属性为空。
zh_hant: 未設定執行階段屬性 'HOSTFXR_PATH'，或其為空白。

# RuntimeSectionHeader
source: .NET Runtimes:
cs: Moduly runtime rozhraní .NET:
es: Entornos de ejecución .NET:
fr: Runtimes .NET :
it: Runtime di .NET:
ja: .NET ランタイム:
ko: .NET 런타임:
pl: Środowiska uruchomieniowe platformy .NET:
pt_br: Runtimes do .NET:
ru: Среды выполнения .NET:
tr: .NET Çalışma Zamanları:
zh_hans: .NET 运行时:
zh_hant: .NET 執行階段:

# SDKCommandUsageDescription
source: Execute a .NET SDK command.
cs: Spustí příkaz sady .NET SDK.
de: Hiermit wird ein .NET SDK-Befehl ausgeführt.
es: Ejecute un comando del SDK de .NET.
fr: Exécutez une commande du kit SDK .NET.
it: Esegue un comando di .NET SDK.
ja: .NET SDK コマンドを実行します。
ko: .NET SDK 명령을 실행합니다.
pl: Wykonaj polecenie zestawu .NET SDK.
pt_br: Execute um comando do SDK do .NET.
ru: Выполнение команды пакета SDK для .NET.
tr: .NET SDK komutu yürütün.
zh_hans: 执行 .NET SDK 命令。
zh_hant: 執行 .NET SDK 命令。

# SDKInfoCommandDefinition
source: Display .NET information.
cs: Zobrazí informace o rozhraní .NET.
de: Hiermit werden .NET-Informationen angezeigt.
es: Muestra la información de .NET.
fr: Affichez les informations sur .NET.
it: Visualizza le informazioni su .NET.
ja: .NET 情報を表示します。
ko: .NET 정보를 표시합니다.
pl: Wyświetl informacje o platformie .NET.
pt_br: Exiba informações do .NET.
ru: Отображение сведений о .NET.
tr: .NET bilgilerini görüntüleyin.
zh_hans: 显示 .NET 信息。
zh_hant: 顯示 .NET 資訊。

# SDKListRuntimesCommandDefinition
source: Display the installed runtimes.
cs: Zobrazí nainstalované moduly runtime.
de: Die installierten Runtimes anzeigen.
es: Muestra los runtimes instalados.
fr: Affichez les runtimes installés.
it: Visualizza i runtime installati.
ja: インストール済みランタイムを表示します。
ko: 설치된 런타임을 표시합니다.
pl: Wyświetl zainstalowane środowiska uruchomieniowe.
pt_br: Exiba os runtimes instalados.
ru: Отображение установленных сред выполнения.
tr: Yüklü çalışma zamanlarını görüntüleyin.
zh_hans: 显示安装的运行时。
zh_hant: 顯示已安裝的執行階段。

# SDKListSdksCommandDefinition
source: Display the installed SDKs.
cs: Zobrazí nainstalované sady SDK.
de: Die installierten SDKs anzeigen.
es: Muestra los SDK instalados.
fr: Affichez les SDK installés.
it: Visualizza gli SDK installati.
ja: インストール済み SDK を表示します。
ko: 설치된 SDK를 표시합니다.
pl: Wyświetl zainstalowane zestawy SDK.
pt_br: Exiba os SDKs instalados.
ru: Отображение установленных пакетов SDK.
tr: Yüklü SDK’ları görüntüleyin.
zh_hans: 显示安装的 SDK。
zh_hant: 顯示已安裝的 SDK。

# SDKOptionsHelpDefinition
source: Show command line help.
cs: Zobrazí nápovědu příkazového řádku.
de: Hiermit wird die Hilfe zur Befehlszeile angezeigt.
es: Muestra ayuda de la línea de comandos.
fr: Affichez l'aide de la ligne de commande.
it: Visualizza la Guida della riga di comando.
ja: コマンド ラインのヘルプを表示します。
ko: 명령줄 도움말을 표시합니다.
pl: Pokaż pomoc wiersza polecenia.
pt_br: Mostrar a ajuda da linha de comando.
ru: Показать справку командной строки.
tr: Komut satırı yardımını gösterir.
zh_hans: 显示命令行帮助。
zh_hant: 顯示命令列說明。

# SDKVersionCommandDefinition
source: Display .NET SDK version in use.
cs: Zobrazí používanou verzi sady .NET SDK.
de: Hiermit wird die verwendete .NET SDK-Version angezeigt.
es: Muestra la versión del SDK de .NET en uso.
fr: Affichez la version utilisée du kit SDK .NET.
it: Visualizza la versione di .NET SDK in uso.
ja: 使用中の .NET SDK バージョンを表示します。
ko: 사용 중인 .NET SDK 버전을 표시합니다.
pl: Wyświetl używaną wersję zestawu .NET SDK.
pt_br: Exiba a versão do SDK do .NET em uso.
ru: Отображение используемой версии пакета SDK для .NET.
tr: Kullanımdaki .NET SDK sürümünü görüntüleyin.
zh_hans: 显示使用中的 .NET SDK 版本。
zh_hant: 顯示使用中的 .NET SDK 版本。

# SamePackageIdInOtherManifestFile
source: Warning: There are other manifest files in the directory hierarchy that will affect this local tool. The following files have not been changed: {0}
cs: Upozornění: V hierarchii se nacházejí i další soubory manifestu, které budou mít na tento místní nástroj vliv. Následující soubory se nezměnily: {0}
de: Warnung: Es sind weitere Manifestdateien in der Verzeichnishierarchie vorhanden, die sich auf dieses lokale Tool auswirken. Die folgenden Dateien wurden nicht geändert: {0}
es: Advertencia: Hay otros archivos de manifiesto en la jerarquía de directorios que afectarán a esta herramienta local. Los archivos siguientes no se han cambiado: {0}
fr: Avertissement : Il existe d'autres fichiers manifeste dans la hiérarchie du répertoire qui vont affecter cet outil local. Aucun changement n'a été apporté aux fichiers suivants : {0}
it: Avviso: nella gerarchia di directory sono presenti altri file manifesto che influiranno su questo strumento locale. I file seguenti non sono stati modificati: {0}
ja: 警告: このローカル ツールに影響を与えるその他のマニフェスト ファイルがディレクトリ階層内に存在します。次のファイルは変更されていません: {0}
ko: 경고: 이 로컬 도구에 영향을 줄 수 있는 다른 매니페스트 파일이 디렉터리 계층 구조에 있습니다. 다음 파일은 변경되지 않았습니다. {0}
pl: Ostrzeżenie: Istnieją inne pliki manifestu w hierarchii katalogów, które będą miały wpływ na to narzędzie lokalne. Następujące pliki nie zostały zmienione: {0}
pt_br: Aviso: há outros arquivos de manifesto na hierarquia de diretório que afetarão esta ferramenta local. Os arquivos a seguir não foram alterados: {0}
ru: Предупреждение: в иерархии каталогов имеются другие файлы манифеста, которые будут влиять на этот локальный инструмент. Следующие файлы не были изменены: {0}
tr: Uyarı: Dizin hiyerarşisinde bu yerel aracı etkileyecek başka bildirim dosyaları var. Aşağıdaki dosyalar değiştirilmedi: {0}
zh_hans: 警告: 目录层次结构中存在其他将影响此本地工具的清单文件。未更改以下文件: {0}
zh_hant: 警告: 目錄階層中有其他資訊清單檔會影響此本機工具。未變更的檔案如下: {0}

# SdkAppFullName
source: .NET SDK Command
cs: Příkaz sady .NET SDK
de: .NET SDK-Befehl
es: Comando del SDK de .NET
fr: Commande du kit SDK .NET
it: Comando SDK .NET
ja: .NET SDK コマンド
ko: .NET SDK 명령
pl: Polecenie zestawu .NET SDK
pt_br: Comando do SDK do .NET
ru: Команда .NET SDK
tr: .NET SDK Komutu
zh_hans: .NET SDK 命令
zh_hant: .NET SDK 命令

# SdkCheckAppFullName
source: .NET SDK Check Command
cs: Příkaz kontroly sady .NET SDK
de: Befehl zur .NET SDK-Überprüfung
es: Comando de comprobación del SDK de .NET
fr: Commande de vérification du kit SDK .NET
it: Comando per controllo disponibilità .NET SDK
ja: .NET SDK のチェック コマンド
ko: .NET SDK 확인 명령
pl: Polecenie sprawdzania zestawu .NET SDK
pt_br: Comando de Verificação do SDK do .NET
ru: Команда проверки пакета SDK для .NET
tr: .NET SDK Denetim Komutu
zh_hans: .NET SDK 检查命令
zh_hant: .NET SDK 檢查命令

# SdkDefinition
source: Manage .NET SDK installation.
cs: Umožňuje spravovat instalaci sady .NET SDK.
de: .NET SDK-Installation verwalten
es: Administra la instalación del SDK de .NET.
fr: Gérer l'installation du kit SDK .NET.
it: Gestisce l'installazione di .NET SDK.
ja: .NET SDK のインストールを管理します。
ko: .NET SDK 설치를 관리합니다.
pl: Zarządzaj instalacją zestawu .NET SDK.
pt_br: Gerencie a instalação do SDK do .NET.
ru: Управление установкой пакета SDK .NET.
tr: .NET SDK yüklemesini yönetin.
zh_hans: 管理 .NET SDK 安装。
zh_hant: 管理 .NET SDK 安裝。

# SdkInfoProvider_Message_InstallSdk
source: Go to aka.ms/get-dotnet and install any of the supported SDK versions: '{0}'.
cs: Přejděte na aka.ms/get-dotnet a nainstalujte některou z podporovaných verzí sady SDK:{0}.
de: Wechseln Sie zu aka.ms/get-dotnet, und installieren Sie eine der unterstützten SDK-Versionen: „{0}“.
es: Vaya a aka.ms/get-dotnet e instale cualquiera de las versiones de SDK admitidas: "{0}".
fr: Accédez à aka.ms/get-dotnet et installez l'une des versions de SDK prises en charge : '{0}'.
it: Passare a aka.ms/get-dotnet e installare una delle versioni supportate dell'SDK: '{0}'.
ja: aka.ms/get-dotnet に移動し、サポートされている SDK バージョン '{0}' のいずれかをインストールします。
ko: aka.ms/get-dotnet으로 이동하여 지원되는 SDK 버전 '{0}'을(를) 설치합니다.
pl: Przejdź do aka.ms/get-dotnet i zainstaluj dowolną z obsługiwanych wersji zestawu SDK: „{0}”.
pt_br: Acesse aka.ms/get-dotnet e instale qualquer uma das versões do SDK compatíveis: '{0}'.
ru: Перейдите aka.ms/get-dotnet и установите любую из поддерживаемых версий пакета SDK: "{0}".
tr: Desteklenen SDK sürümlerinden herhangi birini aka.ms/get-dotnet’e gidin ve yükleyin: '{0}'.
zh_hans: 转到 aka.ms/get-dotnet 并安装任何受支持的 SDK 版本:“{0}”。
zh_hant: 移至 aka.ms/get-dotnet 並安裝任何支援的 SDK 版本: '{0}'。

# SdkInfoProvider_Message_SwitchSdk
source: You have other SDK version(s) installed that can be used to run this template. Switch to any of the following SDK(s) on your system to run this template: '{0}'. Details on selecting SDK version to run: https://docs.microsoft.com/dotnet/core/tools/global-json.
cs: Máte nainstalované další verze sady SDK, které se dají použít ke spuštění této šablony. Pokud chcete spustit tuto šablonu, přepněte na některou z následujících sad SDK ve vašem systému: {0}. Podrobnosti o výběru verze sady SDK, která se má spustit: https://docs.microsoft.com/dotnet/core/tools/global-json.
de: Sie haben andere SDK-Versionen installiert, die zum Ausführen dieser Vorlage verwendet werden können. Wechseln Sie zu einem der folgenden SDK(s) auf Ihrem System, um diese Vorlage auszuführen: „{0}“. Details zum Auswählen der auszuführenden SDK-Version: https://docs.microsoft.com/dotnet/core/tools/global-json.
es: Tiene instaladas otras versiones del SDK que se pueden usar para ejecutar esta plantilla. Cambie a cualquiera de los siguientes SDK en el sistema para ejecutar esta plantilla: "{0}". Detalles sobre la selección de la versión del SDK que se va a ejecutar: https://docs.microsoft.com/dotnet/core/tools/global-json.
fr: Vous avez d'autres versions du SDK installées qui peuvent être utilisées pour exécuter ce modèle. Basculez vers l'un des SDK suivants sur votre système pour exécuter ce modèle : '{0}'. Détails sur la sélection de la version du SDK à exécuter : https://docs.microsoft.com/dotnet/core/tools/global-json.
it: Sono installate altre versioni dell'SDK che possono essere usate per eseguire questo modello. Per eseguire questo modello, passare a uno degli SDK seguenti nel sistema: '{0}'. Dettagli sulla selezione della versione SDK da eseguire: https://docs.microsoft.com/dotnet/core/tools/global-json.
ja: このテンプレートの実行に使用できる他の SDK バージョンがインストールされています。システム上の SDK '{0}' のいずれかに切り替えてこのテンプレートを実行してください。実行する SDK バージョンの選択の詳細については、https://docs.microsoft.com/dotnet/core/tools/global-json をご覧ください。
ko: 이 템플릿을 실행하는 데 사용할 수 있는 다른 SDK 버전이 설치되어 있습니다. 이 템플릿을 실행하려면 시스템에서 다음 SDK 중 하나로 전환하세요. '{0}'. 실행할 SDK 버전 선택에 대한 세부 정보: https://docs.microsoft.com/dotnet/core/tools/global-json.
pl: Masz zainstalowane inne wersje zestawów SDK, których można użyć do uruchomienia tego szablonu. Przełącz się do dowolnego z następujących zestawów SDK w systemie, aby uruchomić ten szablon: „{0}”. Szczegóły dotyczące wybierania wersji zestawu SDK do uruchomienia: https://docs.microsoft.com/dotnet/core/tools/global-json.
pt_br: Você tem outras versões do SDK instaladas que podem ser usadas para executar este modelo. Alterne para qualquer um dos seguintes SDKs em seu sistema para executar este modelo: '{0}'. Detalhes sobre como selecionar a versão do SDK a ser executada: https://docs.microsoft.com/dotnet/core/tools/global-json.
ru: У вас установлены другие версии пакета SDK, которые можно использовать для запуска этого шаблона. Переключитесь на любой из следующих пакетов SDK в системе, чтобы запустить этот шаблон: "{0}". Сведения о выборе версии пакета SDK для запуска: https://docs.microsoft.com/dotnet/core/tools/global-json.
tr: Bu şablonu çalıştırmak için kullanılabilen başka SDK sürümü/sürümleri yüklü. Bu şablonu çalıştırmak için sisteminizde aşağıdaki SDK’(lar)dan herhangi birine geçiş yapın: '{0}'. Çalıştırılacak SDK sürümünü seçmeyle ilgili ayrıntılar için: https://docs.microsoft.com/dotnet/core/tools/global-json.
zh_hans: 已安装可用于运行此模板的其他 SDK 版本。切换到系统上以下任一 SDK 以运行此模板:“{0}”。有关选择要运行的 SDK 版本的详细信息，请参阅: https://docs.microsoft.com/dotnet/core/tools/global-json。
zh_hant: 您已安裝其他可用來執行此範本的 SDK 版本。請在系統上切換至下列任一 SDK 以執行此範本: '{0}'。有關選取要執行之 SDK 版本的詳細資料: https://docs.microsoft.com/dotnet/core/tools/global-json。

# SdkSectionHeader
source: .NET SDKs:
cs: Sady .NET SDK:
es: SDK de .NET:
fr: Kits SDK .NET :
it: .NET SDK:
ja: .NET SDK:
ko: .NET SDK:
pl: Zestawy .NET SDK:
pt_br: SDKs do .NET:
ru: Пакеты SDK для .NET:
tr: .NET SDK'ları:
zh_hans: .NET SDK:
zh_hant: .NET SDK:

# SdkVersionOptionNotSupported
source: The --sdk-version option is no longer supported for this command.
cs: Možnost --sdk-version se už pro tento příkaz nepodporuje.
de: Die Option "--sdk-version" wird für diesen Befehl nicht mehr unterstützt.
es: La opción --sdk-version ya no es compatible con este comando.
fr: L’option --sdk-version n’est plus prise en charge pour cette commande.
it: L'opzione --sdk-version non è più supportata per questo comando.
ja: このコマンドでは、--sdk-version オプションはサポートされなくなりました。
ko: --sdk-version 옵션은 더 이상 이 명령의 지원을 받지 않습니다.
pl: Opcja --sdk-version nie jest już obsługiwana dla tego polecenia.
pt_br: A opção --sdk-version não tem mais suporte para este comando.
ru: Параметр --sdk-version больше не поддерживается для этой команды.
tr: --sdk-version seçeneği artık bu komut için desteklenmiyor.
zh_hans: 此命令不再支持 --sdk-version 选项。
zh_hant: 此命令已不再支援 --sdk-version 選項。

# ShouldInstallAWorkloadSet
source: No workload sets are installed. Run "dotnet workload restore" to install a workload set.
cs: Nejsou nainstalované žádné sady úloh. Spuštěním příkazu dotnet workload restore nainstalujte sadu úloh.
de: Es sind keine Workloadsätze installiert. Führen Sie „dotnet workload restore“ aus, um einen Workloadsatz zu installieren.
es: No hay conjuntos de cargas de trabajo instalados. Ejecute "dotnet workload restore" para instalar un conjunto de carga de trabajo.
fr: Aucun ensemble de charges de travail n’est installé. Exécutez « dotnet workload restore » pour installer un ensemble de charge de travail.
it: Non sono installati set di carico di lavoro. Esegui il "dotnet workload restore" per installare un set del carico di lavoro.
ja: ワークロード セットがインストールされていません。"dotnet workload restore" を実行してワークロード セットをインストールします。
ko: 워크로드 집합이 설치되어 있지 않습니다. "dotnet workload restore"를 실행하여 워크로드 집합을 설치하세요.
pl: Nie zainstalowano żadnych zestawów obciążeń. Uruchom „dotnet workload restore”, aby zainstalować zestaw obciążeń.
pt_br: Nenhum conjunto de cargas de trabalho está instalado. Execute "dotnet workload restore" para instalar um conjunto de cargas de trabalho.
ru: Наборы рабочих нагрузок не установлены. Запустите команду "dotnet workload restore", чтобы установить набор рабочей нагрузки.
tr: İş yükü kümesi yüklenmemiştir. Bir iş yükü seti yüklemek için “dotnet workload restore” komutunu çalıştırın.
zh_hans: 未安装任何 workload sets。运行 “dotnet workload restore” 以安装工作负载集。
zh_hant: 未安裝任何工作負載集合。執行 "dotnet workload restore" 以安裝工作負載集合。

# ShutDownFailed
source: {0} failed to shut down: {1}
cs: Nepovedlo se vypnout server {0}: {1}
de: Fehler beim Herunterfahren von "{0}": {1}
es: No se pudo apagar {0}: {1}
fr: Échec de l'arrêt de {0} : {1}
it: Non è stato possibile arrestare {0}: {1}
ja: {0} のシャットダウンが失敗しました: {1}
ko: {0}을(를) 종료하지 못했습니다. {1}
pl: Nie można zamknąć serwera {0}: {1}
pt_br: Falha ao desligar {0}: {1}
ru: Не удалось завершить работу {0}: {1}
tr: {0} kapatılamadı: {1}
zh_hans: 未能关闭 {0}: {1}
zh_hant: {0} 無法關閉: {1}

# ShutDownFailedWithPid
source: {0} (process {1}) failed to shut down: {2}
cs: Nepovedlo se vypnout {0} (proces {1}): {2}
de: Fehler beim Herunterfahren von "{0}" (Prozess "{1}"): {2}
es: No se pudo apagar {0} (proceso {1}): {2}
fr: Échec de l'arrêt de {0} (processus {1}) : {2}
it: Non è stato possibile arrestare {0} (processo {1}): {2}
ja: {0} (プロセス {1}) のシャットダウンが失敗しました: {2}
ko: {0}(프로세스 {1})을(를) 종료하지 못했습니다. {2}
pl: Nie można zamknąć serwera {0} (proces {1}): {2}
pt_br: O desligamento do {0} (processo {1}) falhou: {2}
ru: Не удалось завершить работу {0} (процесс {1}): {2}
tr: {0} (işlem {1}) kapatılamadı: {2}
zh_hans: 未能关闭 {0} (进程 {1}): {2}
zh_hant: {0} (處理序 {1}) 無法關閉: {2}

# ShutDownSucceeded
source: {0} shut down successfully.
cs: Vypnutí serveru {0} proběhlo úspěšně.
de: "{0}" wurde erfolgreich heruntergefahren.
es: {0} se apagó correctamente.
fr: {0} s'est arrêté correctement.
it: {0} è stato arrestato.
ja: {0} は正常にシャットダウンしました。
ko: {0}을(를) 종료했습니다.
pl: Serwer {0} został zamknięty pomyślnie.
pt_br: {0} desligado com sucesso.
ru: Работа {0} завершена.
tr: {0} başarıyla kapatıldı.
zh_hans: 成功关闭 {0}。
zh_hant: {0} 關閉成功。

# ShutDownSucceededWithPid
source: {0} (process {1}) shut down successfully.
cs: {0} (proces {1}) se úspěšně vypnul.
de: "{0}" (Prozess "{1}") wurde erfolgreich heruntergefahren.
es: {0} (proceso {1}) se apagó correctamente.
fr: {0} (processus {1}) s'est arrêté correctement.
it: {0} (processo {1}) è stato arrestato.
ja: {0} (プロセス {1}) は正常にシャットダウンしました。
ko: {0}(프로세스 {1})을(를) 종료했습니다.
pl: Serwer {0} (proces {1}) został zamknięty pomyślnie.
pt_br: O {0} (processo {1}) foi desligado com êxito.
ru: Работа {0} (процесс {1}) завершена.
tr: {0} (işlem {1}) başarıyla kapatıldı.
zh_hans: 成功关闭 {0} (进程 {1})。
zh_hant: {0} (處理序 {1}) 已成功關閉。

# ShuttingDownServer
source: Shutting down {0}...
cs: Vypíná se {0}...
de: "{0}" wird heruntergefahren...
es: Apagando {0}...
fr: Arrêt de {0}...
it: Arresto di {0}...
ja: {0} をシャットダウンしています...
ko: {0}을(를) 종료하는 중...
pl: Trwa zamykanie serwera {0}...
pt_br: Desligando {0}...
ru: Завершается работа {0}...
tr: {0} kapatılıyor...
zh_hans: 正在关闭 {0}...
zh_hant: 正在關閉 {0}...

# ShuttingDownServerWithPid
source: Shutting down {0} (process {1})...
cs: Vypíná se {0} (proces {1})...
de: "{0}" (Prozess "{1}") wird heruntergefahren...
es: Apagando {0} (proceso {1})...
fr: Arrêt de {0} (processus {1})...
it: Arresto di {0} (processo {1})...
ja: {0} をシャットダウンしています (プロセス {1})...
ko: {0}(프로세스 {1})을(를) 종료하는 중...
pl: Trwa zamykanie serwera {0} (proces {1})...
pt_br: Desligando o {0} (processo {1})...
ru: Завершается работа {0} (процесс {1})...
tr: {0} kapatılıyor (işlem {1})...
zh_hans: 正在关闭 {0} (进程 {1})...
zh_hant: 正在關閉 {0} (處理序 {1})...

# SkipManifestUpdateOptionDescription
source: Skip updating the workload manifests.
cs: Přeskočit aktualizaci manifestů úlohy
de: Überspringen Sie die Aktualisierung der Workload-Manifeste.
es: Omitir la actualización de los manifiestos de carga de trabajo.
fr: Ignorer la mise à jour des manifestes de charge de travail.
it: Salta l'aggiornamento dei manifesti del carico di lavoro.
ja: ワークロード マニフェストの更新をスキップします。
ko: 워크로드 매니페스트 업데이트 건너뛰기
pl: Pomiń aktualizowanie manifestów pakietu roboczego.
pt_br: Ignorar a atualização dos manifestos de carga de trabalho.
ru: Пропустить обновление манифестов рабочей нагрузки.
tr: İş yükü bildirimlerinin güncelleştirilmesini atlayın.
zh_hans: 跳过更新工作负载清单。
zh_hant: 跳過更新工作負載資訊清單。

# SkipOptimizationOptionDescription
source: Skip the optimization phase.
cs: Vynechá fázi optimalizace.
de: Hiermit wird die Optimierungsphase übersprungen.
es: Omite la fase de optimización.
fr: Ignorez la phase d'optimisation.
it: Ignora la fase di ottimizzazione.
ja: 最適化フェーズをスキップします。
ko: 최적화 단계를 건너뜁니다.
pl: Pomiń fazę optymalizacji.
pt_br: Ignorar a fase de otimização.
ru: Пропуск этапа оптимизации.
tr: İyileştirme aşamasını atlar.
zh_hans: 跳过优化阶段。
zh_hant: 跳過最佳化階段。
