Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SkipSignCheckInvalidOption
source: Unable to bypass signature verification. The specified option conflicts with a global policy.
cs: Nepovedlo se obejít ověření podpisu. Zadaná možnost je v konfliktu s globálními zásadami.
de: Die Signaturüberprüfung kann nicht umgangen werden. Die angegebene Option verursacht einen Konflikt mit einer globalen Richtlinie.
es: No se puede omitir la comprobación de firma. La opción especificada entra en conflicto con una directiva global.
fr: Impossible de contourner la vérification de signature. L’option spécifiée est en conflit avec une stratégie globale.
it: Non è possibile ignorare la verifica della firma. L'opzione specificata è in conflitto con un criterio globale.
ja: 署名の認証を回避できません。指定されたオプションがグローバル ポリシーと競合しています。
ko: 서명 확인을 무시할 수 없습니다. 지정한 옵션이 전역 정책과 충돌합니다.
pl: Nie można pominąć weryfikacji podpisu. Określona opcja powoduje konflikt z zasadami globalnymi.
pt_br: Não é possível ignorar a verificação de assinatura. A opção especificada está em conflito com uma política global.
ru: Не удаётся обойти проверку подписи. Указанный параметр конфликтует с глобальной политикой.
tr: İmza doğrulaması atlanamıyor. Belirtilen seçenek bir genel ilkeyle çakışıyor.
zh_hans: 无法绕过签名验证。指定的选项与全局策略冲突。
zh_hant: 無法跳過簽章驗證。指定的選項與全域原則衝突。

# SkipSignCheckOptionDescription
source: Skip signature verification of workload packages and installers.
cs: Přeskočit ověření podpisu balíčků úloh a instalačních programů
de: Überspringen Sie die Signaturüberprüfung von Workloadpaketen und -installationsprogrammen.
es: Omita la comprobación de firma de los paquetes de carga de trabajo y los instaladores.
fr: Ignorez la vérification de signature des packages de charge de travail et des programmes d’installation.
it: Ignora la verifica della firma dei pacchetti e dei programmi di installazione del carico di lavoro.
ja: ワークロード パッケージとインストーラーの署名の認証をスキップします。
ko: 워크로드 패키지 및 설치 관리자의 서명 확인을 건너뜁니다.
pl: Pomiń weryfikację podpisu pakietów obciążeń i instalatorów.
pt_br: Ignorar a verificação de assinatura de pacotes de carga de trabalho e instaladores.
ru: Пропустить проверку подписи пакетов рабочих нагрузок и установщиков.
tr: İş yükü paketlerinin ve yükleyicilerin imza doğrulamasını atlayın.
zh_hans: 跳过对工作负载包和安装程序的签名验证。
zh_hant: 略過工作負載套件和安裝程式的簽章驗證。

# SkipSymbolsOptionDescription
source: Skip creating symbol files which can be used for profiling the optimized assemblies.
cs: Vynechá vytvoření souborů symbolů, které lze použít k profilaci optimalizovaných sestavení.
de: Hiermit wird die Erstellung von Symboldateien übersprungen, die für die Profilerstellung der optimierten Assemblys verwendet werden können.
es: Omite la creación de archivos de símbolos que se pueden usar para generar perfiles para los ensamblados optimizados.
fr: Ignorez la création de fichiers de symboles pour le profilage des assemblys optimisés.
it: Non crea i file di simboli che è possibile usare per la profilatura degli assembly ottimizzati.
ja: 最適化されたアセンブリのプロファイルに使用できるシンボル ファイルの作成をスキップします。
ko: 최적화된 어셈블리 프로파일링에 대해 사용할 수 있는 기호 파일 만들기를 건너뜁니다.
pl: Pomiń tworzenie plików symboli, za pomocą których można profilować zoptymalizowane zestawy.
pt_br: Ignorar a criação de arquivos de símbolo que podem ser usados para criar o perfil de assemblies otimizados.
ru: Пропуск создания файлов символов, которые можно использовать для профилирования оптимизированных сборок.
tr: İyileştirilen bütünleştirilmiş kodların profilini oluşturmak için kullanılabilen sembol dosyalarını oluşturma işlemini atlar.
zh_hans: 跳过符号文件的创建操作，这些文件可用于分析已优化的程序集。
zh_hant: 跳過建立符號檔，該檔案可用於分析最佳化組件。

# SkippedLowercase
source: skipped
cs: vynecháno
de: übersprungen
es: omitido
fr: ignoré
it: ignorato
ja: スキップされました
ko: 건너뜀
pl: pominięte
pt_br: ignorado
ru: пропущено
tr: atlandı
zh_hans: 已跳过
zh_hant: 已跳過

# SkippingManifestUpdate
source: Manifest packages were not found. Skipping manifest update...
cs: Balíčky manifestu se nepovedlo najít. Aktualizace manifestu bude přeskočena...
de: Die Manifestpakete wurden nicht gefunden. Die Manifestaktualisierung wird übersprungen...
es: No se encontraron los paquetes de manifiesto. Se omitirá la actualización del manifiesto...
fr: Les packages de manifestes sont introuvables, mise à jour du manifeste ignorée...
it: Non sono stati trovati pacchetti manifesto. L’aggiornamento del manifesto verrà ignorato...
ja: マニフェスト パッケージが見つかりませんでした。マニフェストの更新をスキップしています...
ko: 매니페스트 패키지를 찾을 수 없습니다. 매니페스트 업데이트를 건너뛰는 중...
pl: Nie znaleziono pakietów manifestu — trwa pomijanie aktualizowania manifestu...
pt_br: Pacotes de manifesto não foram encontrados. Ignorando atualização de manifesto...
ru: Пакеты манифеста не найдены. Обновление манифеста пропускается...
tr: Bildirim paketleri bulunamadı. Bildirim güncelleştirmesi atlanıyor...
zh_hans: 找不到清单包。正在跳过清单更新...
zh_hant: 找不到資訊清單套件。正在略過資訊清單更新...

# SlnDefinition
source: Modify Visual Studio solution files.
cs: Upraví soubory řešení sady Visual Studio.
de: Hiermit werden Visual Studio-Projektmappendateien geändert.
es: Modifica los archivos de la solución de Visual Studio.
fr: Modifiez les fichiers solution Visual Studio.
it: Modifica i file di soluzione di Visual Studio.
ja: Visual Studio ソリューション ファイルを変更します。
ko: Visual Studio 솔루션 파일을 수정합니다.
pl: Modyfikuj pliki rozwiązania programu Visual Studio.
pt_br: Modificar os arquivos da solução do Visual Studio.
ru: Изменение файлов решения Visual Studio.
tr: Visual Studio çözüm dosyalarını değiştirir.
zh_hans: 修改 Visual Studio 解决方案文件。
zh_hant: 修改 Visual Studio 解決方案檔。

# SlnxGenerated
source: .slnx file {0} generated.
cs: .slnx soubor {0} byl vygenerován.
de: Die SLNX-Datei "{0}" wurde generiert.
es: Archivo .slnx {0} generado.
fr: Fichier .slnx {0} généré.
it: File .slnx {0} generato.
ja: .slnx ファイル {0} が生成されました。
ko: .slnx 파일 {0}이(가) 생성되었습니다.
pl: Wygenerowano plik .slnx {0}.
pt_br: Arquivo .slnx {0} gerado.
ru: Файл SLNX {0} создан.
tr: .slnx dosyası {0} oluşturuldu.
zh_hans: 已生成 .slnx 文件 {0}。
zh_hant: 產生的 .slnx 檔案 {0}。

# SolutionAddReferencedProjectsOptionDescription
source: Recursively add projects' ReferencedProjects to solution
cs: Rekurzivně přidá projekty ReferencedProjects do řešení.
de: Rekursives Hinzufügen von Projekten " ReferencedProjects" zur Projektmappe
es: Agregar recursivamente ReferencedProjects de los proyectos a la solución
fr: Ajouter de manière récursive les ReferencedProjects des projets à la solution
it: Aggiungi in modo ricorsivo i progetti ReferencedProjects alla soluzione
ja: プロジェクトの ReferencedProjects をソリューションに再帰的に追加します
ko: 프로젝트의 ReferencedProjects를 솔루션에 재귀적으로 추가
pl: Rekursywne dodawanie elementów ReferencedProjects projektów do rozwiązania
pt_br: Adicionar recursivamente ReferencedProjects dos projetos à solução
ru: Рекурсивно добавить ReferencedProjects проектов в решение
tr: Projenin ReferencedProjects öğesini çözüme özyinelemeli olarak ekle
zh_hans: 以递归方式将项目的 ReferencedProjects 添加到解决方案
zh_hant: 遞歸地將專案的 ReferencedProjects 新增至解決方案

# SolutionAppFullName
source: .NET modify solution file command
cs: Příkaz rozhraní .NET pro úpravy souboru řešení
de: .NET-Befehl zum Ändern von Projektmappendateien
es: Comando de .NET para modificar el archivo de solución
fr: Commande .NET Modifier un fichier solution
it: Comando Modifica file di soluzione .NET
ja: .NET ソリューション ファイルを変更するコマンド
ko: .NET 솔루션 파일 수정 명령
pl: Polecenie modyfikacji pliku rozwiązania dla platformy .NET
pt_br: Comando para modificar o arquivo de solução do .NET
ru: Команда .NET "Изменить файл решения"
tr: .NET çözüm dosyasını değiştir komutu
zh_hans: .NET“修改解决方案文件”命令
zh_hant: .NET 修改方案檔命令

# SolutionArgumentDescription
source: The solution file to operate on. If not specified, the command will search the current directory for one.
cs: Soubor řešení, s kterým se má pracovat. Pokud není zadaný, příkaz ho bude hledat v aktuálním adresáři.
de: Die zu verwendende Projektmappendatei. Wenn keine Projektmappendatei angegeben ist, sucht der Befehl im aktuellen Verzeichnis nach einer Datei.
es: El archivo de solución sobre el que se va a operar. Si no se especifica, el comando buscará uno en el directorio actual.
fr: Fichier solution à utiliser. Si aucun fichier n'est spécifié, la commande en recherche un dans le répertoire actif.
it: File di soluzione su cui intervenire. Se non si specifica un file, il comando ne cercherà uno nella directory corrente.
ja: 操作するソリューション ファイル。指定しない場合、コマンドによって現在のディレクトリから検索されます。
ko: 수행할 솔루션 파일입니다. 파일을 지정하지 않으면 명령이 현재 디렉터리에서 파일을 검색합니다.
pl: Plik rozwiązania, na którym ma zostać wykonana operacja. Jeśli nie określono pliku, polecenie przeszuka bieżący katalog pod jego kątem.
pt_br: O arquivo de solução no qual a operação ocorrerá. Se não for especificado, o comando pesquisará um arquivo de solução no diretório atual.
ru: Обрабатываемый файл решения. Если не указать его, команда будет искать его в текущем каталоге.
tr: Üzerinde işlem yapılacak çözüm dosyası. Belirtilmezse, komut geçerli dizinde böyle bir dosya arar.
zh_hans: 要操作的解决方案文件。如未指定，则命令会在当前目录下搜索一个文件。
zh_hant: 要進行作業的解決方案檔。若未指定檔案，此命令將會搜尋目前的目錄以取得一個檔案。

# SolutionFolderAndInRootMutuallyExclusive
source: The --solution-folder and --in-root options cannot be used together; use only one of the options.
cs: Parametry --solution-folder a --in-root nejdou použít společně; použijte jenom jeden z nich.
de: Die Optionen "--solution-folder" und "--in-root" können nicht zusammen verwendet werden; verwenden Sie nur eine der Optionen.
es: Las opciones --in-root y --solution-folder no se pueden usar juntas. Utilice solo una de ellas.
fr: N'utilisez pas en même temps les options --solution-folder et --in-root. Utilisez uniquement l'une des deux options.
it: Non è possibile usare contemporaneamente le opzioni --solution-folder e --in-root. Usare una sola delle opzioni.
ja: --solution-folder オプションと --in-root オプションを一緒に使用することはできません。いずれかのオプションだけを使用します。
ko: --solution-folder와 --in-root 옵션을 함께 사용할 수 없습니다. 옵션을 하나만 사용하세요.
pl: Opcji --solution-folder i --in-root nie można używać razem; użyj tylko jednej z tych opcji.
pt_br: As opções --solution-folder e --in-root não podem ser usadas juntas. Use somente uma das opções.
ru: Параметры --solution-folder и --in-root options не могут быть использованы одновременно; оставьте только один из параметров.
tr: --solution-folder ve --in-root seçenekleri birlikte kullanılamaz; seçeneklerden yalnızca birini kullanın.
zh_hans: --solution-folder 和 --in-root 选项不能一起使用；请仅使用其中一个选项。
zh_hant: 不可同時使用 --solution-folder 和 --in-root 選項; 請只使用其中一個選項。

# SolutionFolderHeader
source: Solution Folder(s)
cs: Složk(a/y) řešení
de: Projektmappenordner
es: Carpeta(s) de solución(es)
fr: Dossier(s) de solutions
it: Cartelle della soluzione
ja: ソリューション フォルダー
ko: 솔루션 폴더
pl: Foldery rozwiązań
pt_br: Pastas da Solução
ru: Папки решения
tr: Çözüm Klasörleri
zh_hans: 解决方案文件夹
zh_hant: 解決方案資料夾

# SourceArgumentName
source: Source
cs: Zdroj
de: Quelle
es: Origen
it: Origine
ja: ソース
ko: 원본
pl: Źródło
pt_br: Fonte
ru: Источник
tr: Kaynak
zh_hans: 源
zh_hant: 來源

# SourceDescription
source: The package source to search. You can pass multiple `--source` options to search multiple package sources. Example: `--source https://api.nuget.org/v3/index.json`.
cs: Zdroj balíčku, který se má vyhledat. Pokud chcete hledat více zdrojů balíčků, můžete předat více možností --source. Příklad: --source https://api.nuget.org/v3/index.json
de: Die zu durchsuchende Paketquelle. Sie können mehrere „--source“-Optionen übergeben, um mehrere Paketquellen zu durchsuchen. Beispiel: "--source https://api.nuget.org/v3/index.json".
es: Origen del paquete que se va a buscar. Puede pasar varias opciones '--source' para buscar varios orígenes de paquetes. Ejemplo: '--source https://api.nuget.org/v3/index.json'.
fr: Source du package à rechercher. Vous pouvez passer plusieurs options `--Source` pour rechercher plusieurs sources de package. Exemple : `--source https://api.nuget.org/v3/index.json`.
it: Origine del pacchetto in cui eseguire la ricerca. È possibile passare più opzioni `--source' per cercare più origini pacchetti. Esempio: `--source https://api.nuget.org/v3/index.json`.
ja: 検索するパッケージ ソース。複数の '--source' オプションを渡して、複数のパッケージ ソースを検索できます。例: '--source https://api.nuget.org/v3/index.json'。
ko: 검색할 패키지 원본입니다. 여러 '--source' 옵션을 전달하여 여러 패키지 원본을 검색할 수 있습니다. 예: '--source https://api.nuget.org/v3/index.json'.
pl: Źródło pakietu do wyszukania. Możesz przekazać wiele opcji „--source”, aby przeszukać wiele źródeł pakietów. Przykład: „--source https://api.nuget.org/v3/index.json”.
pt_br: A origem do pacote a ser pesquisada. Você pode passar várias opções de fonte para pesquisar várias fontes de pacote. Exemplo: '--source https://api.nuget.org/v3/index.json'.
ru: Источник пакета для поиска. Вы можете передать несколько вариантов "--source" для поиска в нескольких источниках пакетов. Пример: "--source https://api.nuget.org/v3/index.json".
tr: Aranacak paket kaynağı. Birden çok paket kaynağı aramak için birden çok “--source” seçeneğini geçirebilirsiniz. Örnek: `--source https://api.nuget.org/v3/index.json`.
zh_hans: 要搜索的包源。可以传递多个 `--Source` 选项来搜索多个包源。示例: `--source https://api.nuget.org/v3/index.json`。
zh_hant: 要搜尋的封裝來源。您可以傳遞多個 `--source` 選項來搜尋多個封裝來源。範例: `--source https://api.nuget.org/v3/index.json`。

# SpecifiedNoWorkloadVersionAndSpecificWorkloadVersion
source: 'useWorkloadVersions' specified to not use a workload version. This is not compatible with updating or installing with a specified workload version from the command line, global.json, or from a history record with a workload version.
cs: Pro nepoužití verze úlohy byla zadána hodnota useWorkloadVersions. To není kompatibilní s aktualizací nebo instalací se zadanou verzí úlohy z příkazového řádku, global.json nebo ze záznamu historie s verzí úlohy.
de: "useWorkloadVersions" wurde angegeben, um keine Workloadversion zu verwenden. Dies ist nicht mit der Aktualisierung oder Installation einer angegebenen Workloadversion über die Befehlszeile, global.json oder aus einem Verlaufsdatensatz mit einer Workloadversion kompatibel.
es: "useWorkloadVersions" especificado para no usar una versión de carga de trabajo. Esto no es compatible con la actualización o instalación con una versión de carga de trabajo especificada desde la línea de comandos, global.json o desde un registro de historial con una versión de carga de trabajo.
fr: « useWorkloadVersions » spécifié pour ne pas utiliser de version de charge de travail. Ceci n’est pas compatible avec la mise à jour ou l’installation d’une version de charge de travail spécifiée à partir de la ligne de commande, de global.json ou d’un enregistrement d’historique avec une version de charge de travail.
it: 'useWorkloadVersions' specificato per non usare una versione del carico di lavoro. Questa opzione non è compatibile con l'aggiornamento o l'installazione di una versione del carico di lavoro specificata dalla riga di comando, global.json o da un record di cronologia con una versione del carico di lavoro.
ja: 'useWorkloadVersions' がワークロード バージョンを使用しないように指定されました。指定されたワークロード バージョンを使用した更新またはインストールには対応していません。これには、コマンド ライン、global.json、またはワークロード バージョンを含む履歴レコードからの操作が含まれます。
ko: 'useWorkloadVersions'가 작업 버전을 사용하지 않도록 지정되었습니다. 이는 명령줄, global.json 또는 작업 버전이 있는 기록 레코드에서 지정된 워크로드 버전을 업데이트하거나 설치하는 것과 호환되지 않습니다.
pl: Określono element „useWorkloadVersions”, aby nie używać wersji obciążenia. Nie jest to zgodne z aktualizowaniem lub instalowaniem przy użyciu określonej wersji obciążenia z wiersza polecenia, global.json lub z rekordu historii z wersją obciążenia.
pt_br: ''useWorkloadVersions'' especificado para não usar uma versão de carga de trabalho. Isso não é compatível com a atualização ou instalação com uma versão de carga de trabalho especificada da linha de comando, global.json ou de um registro de histórico com uma versão de carga de trabalho.
ru: "useWorkloadVersions" указывает на запрет использования версии рабочей нагрузки. Это несовместимо с обновлением или установкой с указанной версией рабочей нагрузки из командной строки, global.json или из записи журнала с версией рабочей нагрузки.
tr: Bir iş yükü sürümünü kullanmamak için 'useWorkloadVersions' belirtildi. Bu, komut satırından, global.json dosyasından veya bir iş yükü sürümüne sahip bir geçmiş kaydından belirtilen bir iş yükü sürümünün güncelleştirilmesiyle veya yüklenmesiyle uyumlu değildir.
zh_hans: 已指定 ‘useWorkloadVersions’ 不使用工作负载版本。这与从命令行、global.json 或具有工作负载版本的历史记录更新或安装指定工作负载版本不兼容。
zh_hant: 指定 'useWorkloadVersions' 不使用工作負載版本。這與從命令列、global.json 或從具有工作負載版本的歷程記錄中更新或安裝指定的工作負載版本不相容。

# SpecifiedWorkloadVersionAndSpecificNonWorkloadVersion
source: 'useWorkloadVersions' specified to use a workload version. This option is not compatible with updating from a rollback file or from history using a set of manifests.
cs: Pro použití verze úlohy byla zadána hodnota useWorkloadVersions. Tato možnost není kompatibilní s aktualizací ze souboru vrácení zpět nebo z historie pomocí sady manifestů.
de: Für die Verwendung einer Workloadversion wurde "useWorkloadVersions" angegeben. Diese Option ist nicht mit dem Aktualisieren aus einer Rollbackdatei oder aus dem Verlauf mithilfe eines Manifestsatzes kompatibel.
es: "useWorkloadVersions" especificado para usar una versión de carga de trabajo. Esta opción no es compatible con la actualización desde un archivo de reversión o desde el historial mediante un conjunto de manifiestos.
fr: « useWorkloadVersions » spécifié pour utiliser de version de charge de travail. Cette option n’est pas compatible avec la mise à jour à partir d’un fichier de restauration ou de l’historique à l’aide d’un ensemble de manifestes.
it: 'useWorkloadVersions' specificato per usare una versione del carico di lavoro. Questa opzione non è compatibile con l'aggiornamento da un file di rollback o dalla cronologia usando un insieme di manifesti.
ja: 'useWorkloadVersions' がワークロード バージョンを使用するように指定されました。このオプションは、ロールバック ファイルからの更新や、マニフェストのセットを使用した履歴からの更新と互換性がありません。
ko: 'useWorkloadVersions'가 작업 버전을 사용하도록 지정되었습니다. 이 옵션은 롤백 파일 또는 매니페스트 집합을 사용하여 기록에서 업데이트하는 경우와 호환되지 않습니다.
pl: Określono element „useWorkloadVersions” do używania wersji obciążenia. Ta opcja nie jest zgodna z aktualizacją z pliku wycofywania lub historii przy użyciu zestawu manifestów.
pt_br: ''useWorkloadVersions'' especificado para usar uma versão de carga de trabalho. Essa opção não é compatível com a atualização de um arquivo de reversão ou do histórico usando um conjunto de manifestos.
ru: "useWorkloadVersions" указывает на использование версии рабочей нагрузки. Этот параметр несовместим с обновлением из файла отката или из журнала с использованием набора манифестов.
tr: Bir iş yükü sürümünü kullanmak için 'useWorkloadVersions' belirtildi. Bu seçenek, bir geri alma dosyasından veya bir dizi bildirim kullanarak geçmişten güncelleştirmeyle uyumlu değildir.
zh_hans: 已指定 ‘useWorkloadVersions’ 使用工作负载版本。此选项与使用一组清单从回滚文件或从历史记录更新不兼容。
zh_hant: 指定 'useWorkloadVersions' 使用工作負載版本。此選項與從復原檔案或使用一組資訊清單從歷程記錄中進行更新的方式不相容。

# SpecifyManifests
source: Specify at least one manifest with --manifest.
cs: Pomocí parametru --manifest zadejte alespoň jeden manifest.
de: Geben Sie mit "--manifest" mindestens ein Manifest an.
es: Especifique al menos un manifiesto con --manifest.
fr: Spécifiez au moins un manifeste avec --manifest.
it: Specificare almeno un manifesto con --manifest.
ja: --manifest を使用して、少なくとも 1 つのマニフェストを指定します。
ko: --manifest가 포함된 매니페스트를 하나 이상 지정하세요.
pl: Określ co najmniej jeden manifest przy użyciu elementu --manifest.
pt_br: Especifique pelo menos um manifesto com --manifest.
ru: Укажите по крайней мере один манифест с помощью --manifest.
tr: --manifest ile en az bir bildirim belirtin.
zh_hans: 至少使用 --manifest 指定一个清单。
zh_hant: 利用 --manifest 至少指定一個資訊清單。

# StackFrameAt
source: at
cs: v
de: um
es: a las
fr: sur
it: a
ja: 場所:
ko: 위치
pl: o
pt_br: em
ru: в
tr: şu yöntemle:
zh_hans: 在
zh_hant: 於

# StackFrameIn
source: in
cs: v
es: en
fr: dans
ja: 場所:
ko: 포함
pl: w
pt_br: em
ru: в
tr: şu dosyada:
zh_hans: 位于
zh_hant: 在

# StandardError
source: Error output
cs: Chybový výstup
de: Fehlerausgabe
es: Salida de error
fr: Sortie d’erreur
it: Output errori
ja: エラー出力
ko: 오류 출력
pl: Dane wyjściowe w przypadku błędu
pt_br: Saída de erros
ru: Вывод ошибок
tr: Hata çıkışı
zh_hans: 错误输出
zh_hant: 錯誤輸出

source: Standard output
cs: Standardní výstup
de: Standardausgabe
es: Salida estándar
fr: Sortie standard
it: Output standard
ja: 標準出力
ko: 표준 출력
pl: Standardowe dane wyjściowe
pt_br: Saída padrão
ru: Стандартный вывод
tr: Standart çıkış
zh_hans: 标准输出
zh_hant: 標準輸出

# StatusColumnHeader
source: Status
cs: Stav
es: Estado
fr: État
it: Stato
ja: 状態
ko: 상태
pl: Stan
ru: Состояние
tr: Durum
zh_hans: 状态
zh_hant: 狀態

# StoreAppDescription
source: Stores the specified assemblies for the .NET Platform. By default, these will be optimized for the target runtime and framework.
cs: Uloží určená sestavení pro platformu .NET. Standardně se optimalizují pro cílový modul runtime a architekturu.
de: Speichert die angegebenen Assemblys für die .NET-Plattform. Standardmäßig werden diese für die Zielruntime und das Framework optimiert.
es: Almacena los ensamblados especificados para la plataforma .NET. De forma predeterminada, estos se optimizarán para el tiempo de ejecución y la plataforma de destino.
fr: Stocke les assemblys spécifiés pour la plateforme .NET. Par défaut, ceux-ci sont optimisés pour le runtime et le framework cible.
it: Consente di archiviare gli assembly specificati per la piattaforma .NET. Per impostazione predefinita, gli assembly verranno ottimizzati per il framework e il runtime di destinazione.
ja: .NET Platform の指定されたアセンブリを格納します。既定では、これらはターゲットのランタイムとフレームワーク用に最適化されます。
ko: .NET 플랫폼에 대해 지정된 어셈블리를 저장합니다. 기본적으로 대상 런타임 및 프레임워크에 대해 최적화됩니다.
pl: Przechowuje określone zestawy platformy .NET. Domyślnie są one optymalizowane pod kątem docelowego środowiska uruchomieniowego i platformy docelowej.
pt_br: Armazena os assemblies especificados para a Plataforma .NET. Por padrão, serão otimizados para o runtime e a estrutura de destino.
ru: Хранит указанные сборки для платформы .NET. По умолчанию они оптимизируются для целевой среды выполнения и платформы.
tr: .NET Platformu için belirtilen bütünleştirilmiş kodları depolar. Varsayılan olarak, bunlar hedef çalışma zamanı ve çerçeve için iyileştirilir.
zh_hans: 存储为 .NET 平台指定的程序集。默认情况下，这些程序集将针对目标运行时和框架进行优化。
zh_hant: 儲存為 .NET 平台所指定的組件。根據預設，會為目標執行階段與架構，最佳化這些組件。

# StoreDefinition
source: Store the specified assemblies in the runtime package store.
cs: Uloží zadaná sestavení do úložiště balíčků modulu runtime.
de: Hiermit werden die angegebenen Assemblys im Runtimepaketspeicher gespeichert.
es: Almacena los ensamblados especificados en el almacén del paquete de tiempo de ejecución.
fr: Stockez les assemblys spécifiés dans le magasin de packages de runtime.
it: Memorizza gli assembly specificati nell'archivio pacchetti di runtime.
ja: 指定されたアセンブリをランタイム パッケージ ストアに格納します。
ko: 지정된 어셈블리를 런타임 패키지 저장소에 저장합니다.
pl: Przechowuj określone zestawy w magazynie pakietu środowiska uruchomieniowego.
pt_br: Armazenar os assemblies especificados no repositório de pacotes do runtime.
ru: Сохранение указанных сборок в хранилище пакетов среды выполнения.
tr: Belirtilen bütünleştirilmiş kodları çalışma zamanı paket deposunda depolar.
zh_hans: 在运行时包存储中存储指定的程序集。
zh_hant: 將指定的組件儲存到執行階段套件存放區中。
