Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CmdBlameDescription
source: Runs the tests in blame mode. This option is helpful in isolating problematic tests that cause the test host to crash or hang, but it does not create a memory dump by default. When a crash is detected, it creates an sequence file in TestResults/guid/guid_Sequence.xml that captures the order of tests that were run before the crash. Based on the additional settings, hang dump or crash dump can also be collected. Example: Timeout the test run when test takes more than the default timeout of 1 hour, and collect crash dump when the test host exits unexpectedly. (Crash dumps require additional setup, see below.) dotnet test --blame-hang --blame-crash Example: Timeout the test run when a test takes more than 20 minutes and collect hang dump. dotnet test --blame-hang-timeout 20min
cs: Spustí testy v režimu blame. Tento parametr se hodí pro izolaci problematických testů, které způsobují chybové ukončení nebo zablokování testovacího hostitele, ale ve výchozím nastavení nevytváří výpis paměti. Při zjištění chybového ukončení vytvoří soubor sekvence v souboru TestResults/guid/guid_Sequence.xml, který zachycuje pořadí testů, které byly spuštěny před chybou. Na základě dalších nastavení je také možné shromáždit výpis stavu systému nebo výpis stavu systému. Příklad: Vypršení časového limitu testovacího běhu, když test trvá déle než výchozí časový limit 1 hodina, a shromážděte výpis stavu systému, když se hostitel testu neočekávaně ukončí. (výpisy stavu systému vyžadují další nastavení, viz níže). dotnet test --blame-hang --blame-crash Příklad: Vypršení časového limitu testovacího běhu, když test trvá více než 20 minut, a shromáždění výpisu stavu systému. dotnet test --blame-hang-timeout 20 minut
de: Führt den Test im Modus "Verantwortung zuweisen" aus. Diese Option ist hilfreich zum Isolieren von problematischen Tests, die dazu geführt haben, dass der Testhost abgestürzt ist oder nicht mehr reagiert, aber kein standardmäßiges Speicherabbild des Arbeitsspeichers erstellt. Wird ein Absturz erkannt, wird in "TestResults/guid/guid_Sequence.xml" eine Sequenzdatei erstellt, in der die Reihenfolge der vor dem Absturz ausgeführten Tests erfasst wird. Basierend auf den zusätzlichen Einstellungen kann auch ein Blockade- oder Absturzabbild erfasst werden. Beispiel: Es wird ein Timeout für die Testausführung ausgelöst, wenn der Test länger als 1 Stunde (Standardtimeout) dauert, und es wird ein Absturzabbild erfasst, wenn der Testhost unerwartet beendet wird. (Für Absturzabbilder ist eine zusätzlicher Setup erforderlich, siehe unten.) dotnet test --blame-hang --blame-crash Beispiel: Es wird ein Timeout für die Testausführung ausgelöst, wenn der Test mehr als 20 Minuten dauert, und es wird ein Blockadeabbild erfasst. dotnet test --blame-hang-timeout 20min
es: Ejecuta las pruebas en modo de culpa. Esta opción es útil para aislar las pruebas problemáticas que hacen que el host de prueba se bloquee o se bloquee, pero no crea un volcado de memoria de forma predeterminada. Cuando se detecta un bloqueo, crea un archivo de secuencia en TestResults/guid/guid_Sequence.xml que captura el orden de las pruebas que se ejecutaron antes del bloqueo. En función de la configuración adicional, también se pueden recopilar volcados de bloqueo o volcados de memoria. Ejemplo: Se agotó la ejecución de la prueba cuando esta dura más de 1 hora como tiempo de espera predeterminado, y recopila el volcado de memoria cuando el host de prueba se cierra inesperadamente. (Los volcados de memoria requieren una configuración adicional, consulte a continuación). prueba de dotnet --blame-hang --blame-crash Ejemplo: Se agotó el tiempo de espera de la serie de pruebas cuando una prueba tarda más de 20 minutos y se recopila el volcado de memoria. prueba de dotnet --blame-hang-timeout 20min
fr: Exécute les tests en mode blame (responsabilité). Cette option permet d'isoler les tests problématiques à l'origine d'un plantage ou d'un blocage sur l'hôte de test, mais cela ne crée pas de vidage de mémoire par défaut. Quand un plantage est détecté, un fichier de séquence est créé dans TestResults/guid/guid_Sequence.xml pour capturer l'ordre des tests exécutés avant le plantage. En fonction de paramètres supplémentaires, des données de vidage sur blocage ou de vidage sur plantage peuvent également être collectées. Exemple : Définissez le délai d'expiration de la série de tests quand les tests prennent plus de temps que le délai par défaut (1 heure), et collectez les données de vidage sur plantage quand l'hôte de test se ferme de manière inattendue. (Les vidages sur plantage nécessitent une configuration supplémentaire, comme vous pouvez le voir ci-dessous.) dotnet test --blame-hang --blame-crash Exemple : Définissez le délai d'expiration de la série de tests quand un test prend plus de 20 minutes, et collectez les données de vidage sur blocage. dotnet test --blame-hang-timeout 20 min
it: Esegue i test in modalità di segnalazione errore. Questa opzione è utile per isolare test problematici che causano l'arresto anomalo o il blocco dell'host di test, ma non crea un dump della memoria per impostazione predefinita. Quando viene rilevato un arresto anomalo, crea un file sequenziale in TestResults/guid/guid_Sequence.xml che acquisisce l'ordine dei test eseguiti prima dell'arresto anomalo. In base alle impostazioni aggiuntive, può essere acquisito anche un dump di blocco o un dump di arresto anomalo. Esempio: Timeout dell'esecuzione del test quando il test impiega più del timeout predefinito di 1 ora e raccolta del dump di arresto anomalo quando l'host di test esce in maniera imprevista. (I dump di arresto anomalo richiedono una configurazione aggiuntiva; vedi sotto.) dotnet test --blame-hang --blame-crash Esempio: Timeout dell'esecuzione dei test quando un test impiega più di 20 minuti e raccolta del dump di blocco. dotnet test --blame-hang-timeout 20min
ja: 変更履歴モードでテストを実行します。このオプションは、テスト ホストがクラッシュまたはハングする問題のあるテストを分離するのに役立ちますが、既定ではメモリ ダンプは作成されません。 クラッシュが検出されると、クラッシュ前に実行されたテストの順序をキャプチャしたシーケンス ファイルが TestResults/guid/guid_Sequence.xml に作成されます。 追加の設定に基づいて、ハング ダンプまたはクラッシュ ダンプを収集することもできます。 例: テストが既定のタイムアウト時間である 1 時間を超える場合にテストの実行をタイムアウトし、テスト ホストが予期せず終了したときにクラッシュ ダンプを収集します。 (クラッシュ ダンプには追加のセットアップが必要です。以下を参照してください。) dotnet test --blame-hang --blame-crash 例: テストが 20 分を超える場合にテストの実行をタイムアウトし、ハング ダンプを収集します。 dotnet test --blame-hang-timeout 20min
ko: 테스트를 블레임 모드로 실행합니다. 이 옵션은 테스트 호스트의 크래시 또는 중단을 유발하는 문제 있는 테스트를 격리하는 데 유용하지만 기본적으로 메모리 덤프를 생성하지는 않습니다. 크래시가 탐지되면 크래시 전에 실행된 테스트의 순서를 캡처하는 시퀀스 파일이 TestResults/guid/guid_Sequence.xml에 생성됩니다. 추가 설정에 따라 중단 덤프 또는 크래시 덤프가 수집될 수도 있습니다. 예: 테스트에 걸리는 시간이 기본 시간 제한인 1시간보다 길면 테스트 실행이 시간 초과되고, 테스트 호스트가 예기치 않게 종료되면 크래시 덤프를 수집합니다. (크래시 덤프에는 추가 설정이 필요합니다. 아래를 참조하세요.) dotnet test --blame-hang --blame-crash 예: 테스트에 걸리는 시간이 20분보다 길면 테스트 실행이 시간 초과되고 중단 덤프를 수집합니다. dotnet test --blame-hang-timeout 20min
pl: Uruchamia testy w trybie blame. Ta opcja jest pomocna w izolowaniu problematycznych testów, które powodują awarię lub zawieszanie się hosta testowego, ale domyślnie nie tworzy zrzutu pamięci. Gdy zostanie wykryta awaria, tworzy plik sekwencji w lokalizacji TestResults/guid/guid_Sequence.xml, który przechwytuje kolejność testów uruchomionych przed awarią. Na podstawie dodatkowych ustawień może być również zbierany zrzut stanu zawieszenia lub zrzut awaryjny. Przykład: Spowodowanie przekroczenia limitu czasu przebiegu testu, gdy test trwa dłużej niż domyślny limit czasu (1 godzina), i zebranie zrzutu awaryjnego, gdy host testowy nieoczekiwanie zakończy działanie. (Zrzuty awaryjne wymagają dodatkowej konfiguracji; zobacz poniżej). dotnet test --blame-hang --blame-crash Przykład: Spowodowanie przekroczenia limitu czasu przebiegu testu, gdy test trwa dłużej niż 20 minut, i zebranie zrzutu stanu zawieszenia. dotnet test --blame-hang-timeout 20min
pt_br: Executa os testes no modo blame. Essa opção é útil para isolar testes problemáticos que fazem com que o host de teste falhe ou falhe, mas não cria um despejo de memória por padrão. Quando uma falha é detectada, ele cria um arquivo de sequência em TestResults/guid/guid_Sequence.xml que captura a ordem dos testes executados antes da falha. Com base nas configurações adicionais, o despejo de travamento ou despejo de memória também podem ser coletados. Exemplo: Tempo limite da execução do teste quando o teste leva mais do que o tempo limite padrão de 1 hora e coleta o despejo de memória quando o host de teste é encerrado inesperadamente. (Os despejos de memória requerem configuração adicional, veja abaixo.) teste dotnet --blame-hang --blame-crash Exemplo: Tempo limite da execução do teste quando um teste leva mais de 20 minutos e coleta despejo de travamento. teste dotnet --blame-hang-timeout 20min
ru: Запускает тесты в режиме blame. Эту опцию удобно использовать для изоляции проблемных тестов, которые приводят к сбою или зависанию узла тестирования, но при этом по умолчанию не создается дамп памяти. При обнаружении аварийного завершения создается файл последовательности TestResults/guid/guid_Sequence.xml, в котором указан порядок тестов, выполнявшихся перед аварийным завершением. На основе дополнительных настроек можно также выполнить сбор дампа зависания или аварийного дампа. Пример: Прервать выполнение теста из-за истечения времени ожидания, когда время выполнения теста превышает время ожидания по умолчанию, равное 1 часу, и собрать аварийный дамп при неожиданном завершении работы узла тестирования. (Для сбора аварийного дампа необходима дополнительная настройка, см. ниже). dotnet test --blame-hang --blame-crash Пример: Прервать выполнение теста из-за истечения времени ожидания, когда время выполнения теста превышает 20 минут, и собрать дамп зависания. dotnet test --blame-hang-timeout 20min
tr: Testleri blame modunda çalıştırır. Bu seçenek, test ana bilgisayarının kilitlenmesine veya yanıt vermemeye başlamasına neden olan sorunlu testleri yalıtmak için yararlıdır, ancak varsayılan olarak bellek dökümü oluşturmaz. Kilitlenme algılandığında, TestResults/guid/guid_Sequence.xml içinde kilitlenmeden önce çalıştırılan testlerin sırasını yakalayan bir sıra dosyası oluşturur. Ek ayarlara bağlı olarak, yanıt vermemeye başlama veya kilitlenme bilgi dökümü de toplanabilir. Örnek: Test 1 saatlik varsayılan zaman aşımı süresinden uzun sürdüğünde test çalıştırmasını zaman aşımına uğratın ve test ana bilgisayarı beklenmedik bir şekilde çıkış yaptığında kilitlenme dökümünü toplayın. (Kilitlenme bilgi dökümleri için ek kurulum gerekir, aşağıya bakın.) dotnet test --blame-hang --blame-crash Örnek: Test 20 dakikadan uzun sürdüğünde test çalıştırmasını zaman aşımına uğratın ve yanıt vermemeye başlama bilgi dökümünü toplayın. dotnet test --blame-hang-timeout 20min
zh_hans: 在追溯模式下运行测试。此选项有助于隔离导致测试主机发生故障或挂起的有问题测试，但默认情况下不会创建内存转储。 检测到故障后，它会在 TestResults/guid/guid_Sequence.xml 中创建一个序列文件，用于捕获在发生故障之前运行的测试的顺序。 根据其他设置，还可以收集挂起转储或故障转储。 示例: 当测试用时超过默认 1 小时超时后，测试运行将超时，并在测试主机意外退出时收集故障转储。 (故障转储需要其他设置，请参阅下文。) dotnet 测试 --blame-hang --blame-crash 示例: 当测试yongshi 超过 20 分钟后，测试运行将超时并收集挂起转储。 dotnet 测试 --blame-hang-timeout 20 分钟
zh_hant: 以歸責模式執行測試。此選項有助於隔離造成測試主機當機或擱置的問題測試，但預設不會建立記憶體傾印。 偵測到當機時，它會在 TestResults/guid/guid_Sequence.xml 中建立序列檔案，以擷取當機前執行的測試順序。 根據其他設定，也可以收集擱置傾印或損毀傾印。 範例: 當測試所花的時間超過預設的 1 小時時，測試執行會逾時，當測試主機未預期地結束時，會收集損毀傾印。 (損毀傾印需要其他設定，請參閱下文。) dotnet 測試 --blame-hang --blame-crash 範例: 當測試需要超過 20 分鐘並收集擱置傾印時，測試執行會逾時。 dotnet 測試 --blame-hang-timeout 20min

# CmdBlameHangDescription
source: Run the tests in blame mode and enables collecting hang dump when test exceeds the given timeout.
cs: Spustí testy v režimu blame a umožní shromažďování výpisů stavu systému při zablokování, když test překročí stanovený časový limit.
de: Hiermit werden Tests im Modus "Verantwortung zuweisen" ausgeführt, und es wird die Erfassung eines Blockadeabbilds aktiviert, wenn der Test länger als angegeben dauert.
es: Ejecuta las pruebas en el modo de culpa y habilita la recopilación del volcado de bloqueo cuando la prueba supera el tiempo de espera especificado.
fr: Exécutez les tests en mode blame (responsabilité) et activez la collecte des données de vidage sur blocage quand le test dépasse le délai d'expiration spécifié.
it: Esegue i test in modalità di segnalazione errore e abilita la raccolta del dump di blocco quando il test supera il timeout specificato.
ja: 変更履歴モードでテストを実行し、テストが指定されたタイムアウトを超えたときにハング ダンプを収集するのを可能にします。
ko: 테스트를 블레임 모드로 실행하고 테스트가 지정된 시간제한을 초과하는 경우 중단 덤프 수집을 사용하도록 설정합니다.
pl: Uruchamia testy w trybie blame i włącza zbieranie zrzutów w stanie zawieszenia, gdy test przekroczy podany limit czasu.
pt_br: Executar os testes no modo blame e habilitar a coleta de despejo de memória quando o teste exceder o tempo limite determinado.
ru: При превышении заданного времени ожидания для теста запустите тесты в режиме blame и включите сбор дампа зависания.
tr: Testleri blame modunda çalıştırır ve test, verilen zaman aşımını süresini aştığında yanıt vermemeye başlama bilgi dökümünün toplanmasını sağlar.
zh_hans: 在追溯模式下运行测试，并在测试超出给定超时的情况下启用收集挂起转储。
zh_hant: 當測試超過指定的逾時時，請在改動者模式中執行測試，並啟用收集停止回應傾印。

# CmdBlameHangDumpTypeDescription
source: The type of crash dump to be collected. The supported values are full (default), mini, and none. When 'none' is used then test host is terminated on timeout, but no dump is collected. Implies --blame-hang.
cs: Typ výpisu stavu systému, který se má shromáždit. Když se použije možnost Žádný, hostitel testů se po vypršení časového limitu ukončí, ale neshromáždí se žádný výpis. Implikuje --blame-hang.
de: Der Typ des zu erfassenden Absturzabbilds. Die unterstützten Werte sind „vollständig“ (Standard), „minimal“ und „keines“. Wenn „keines“ verwendet wird, wird der Testhost beim Timeout beendet, aber es wird kein Speicherabbild erfasst. Impliziert „--blame-hang“.
es: El tipo de volcado de memoria que se va a recoger. Los valores soportados son completo (valor predeterminado), mini, y ninguno. Si se utiliza "ninguno", el host de prueba termina cuando se agota el tiempo de espera, pero no se recoge ningún volcado. Implica --blame-hang.
fr: Type de vidage sur incident à collecter. Les valeurs prises en charge sont 'Complet' (par défaut), 'Mini' et 'Aucun'. Quand 'Aucun' est utilisé, l’hôte de test se termine à l’expiration du délai d’attente, mais aucune copie de sauvegarde n’est collectée. Implique --blame-hang.
it: Tipo di dump di arresto anomalo da raccogliere. I valori supportati sono completi (impostazione predefinita), mini e nessuno. Quando si usa 'none', l'host di test viene terminato in caso di timeout, ma non viene raccolto alcun dump. Implica --blame-hang.
ja: 収集するクラッシュ ダンプの種類。サポート対象の値はフル (既定)、ミニ、なしです。[なし] を使用した場合、ホストのテストはタイムアウト時に終了しますが、ダンプは収集されません。--blame-hang を暗黙的に指定します。
ko: 수집할 크래시 덤프의 유형입니다. 지원되는 값은 full(기본값), mini, none입니다. 'none'이 사용된 경우 테스트 호스트가 시간 초과될 때 종료되지만 덤프는 수집되지 않습니다. --blame-hang을 의미합니다.
pl: Typ zrzutu awaryjnego do zebrania. Obsługiwane wartości są pełne (domyślne), mini i żadne. Gdy jest używana wartość „none”, host testowy jest przerywany po przekroczeniu limitu czasu, ale nie jest zbierany zrzut. Implikuje --blame-hang.
pt_br: O tipo de despejo de memória a ser coletado. Os valores com suporte são full (padrão), mini e none. Quando “none” é usado, o host de teste é encerrado no tempo limite, mas nenhum despejo é coletado. Implica --blame-hang.
ru: Тип собираемого аварийного дампа. Поддерживаемые значения: "full" (по умолчанию), "mini" и "none". Если задано значение "none", то узел тестирования завершает работу после истечения времени ожидания, но сбор дампа не выполняется. Подразумевается использование параметра --blame-hang.
tr: Toplanacak kilitlenme bilgi dökümünün türü. Desteklenen değerler: full (varsayılan), mini ve none. None kullanıldığında test ana bilgisayarı sonlandırılır ancak bilgi dökümü toplanmaz. --blame-hang gerektirir.
zh_hans: 要收集的故障转储的类型。支持的值为 full (默认值)、mini 和 none。使用“none”时，测试主机将在超时时终止，但不会收集任何转储。表示 --blame-hang。
zh_hant: 要收集之損毀傾印的類型。支援的值為完整的 full (預設值)，mini 和 none。若使用「none」，則測試主機將會在逾時時終止，不會收集任何傾印。表示 --blame-hang。

# CmdBlameHangTimeoutDescription
source: Per-test timeout, after which hang dump is triggered and the testhost process is terminated. Default is 1h. The timeout value is specified in the following format: 1.5h / 90m / 5400s / 5400000ms. When no unit is used (e.g. 5400000), the value is assumed to be in milliseconds. When used together with data driven tests, the timeout behavior depends on the test adapter used. For xUnit, NUnit and MSTest 2.2.4+ the timeout is renewed after every test case, For MSTest before 2.2.4, the timeout is used for all testcases.
cs: Časový limit pro jednotlivé testy, po kterém se aktivuje výpis stavu systému a proces testhost se ukončí. Výchozí hodnota je 1h. Hodnota časového limitu je zadána v následujícím formátu: 1,5 h / 90m / 5400 s / 5400000 ms. Pokud se nepoužije žádná jednotka (např. 5400000), předpokládá se, že hodnota je v milisekundách. Při použití společně s testy řízenými daty závisí chování časového limitu na použitém testovacím adaptéru. Pro xUnit, NUnit a MSTest 2.2.4+ se časový limit prodlouží po každém testovacím případu Pro MSTest před 2.2.4 se časový limit použije pro všechny testovací případy.
de: Timeout pro Test, nach dem das Blockadeabbild ausgelöst und der Testhost-Prozess beendet wird. Der Standardwert ist 1 Std. Der Timeoutwert wird im folgenden Format angegeben: 1.5h. / 90m / 5400s / 5400000ms. Wenn keine Einheit verwendet wird (z. B. 5400000), wird davon ausgegangen, dass der Wert in Millisekunden angegeben ist. Wenn dies zusammen mit datengesteuerten Tests verwendet wird, hängt das Timeoutverhalten vom verwendeten Testadapter ab. Für xUnit, NUnit und MSTest 2.2.4+ wird das Timeout nach jedem Testfall erneuert, für MSTest vor 2.2.4 wird das Timeout für alle Testfälle verwendet.
es: Tiempo de espera por prueba, después del cual se desencadena el volcado de bloqueo de memoria y se termina el proceso testhost. El valor predeterminado es 1 h. El valor de tiempo de espera se especifica en el siguiente formato: 1,5 h / 90 m / 5400 s / 5 400 000 ms. Cuando no se usa ninguna unidad (por ejemplo, 5 400 000), se supone que el valor está en milisegundos. Cuando se usa junto con pruebas basadas en datos, el comportamiento del tiempo de espera depende del adaptador de pruebas utilizado. Para xUnit, NUnit y MSTest 2.2.4+ el tiempo de espera se renueva después de cada caso de prueba, Para MSTest antes de 2.2.4, el tiempo de espera se usa para todos los casos de prueba.
fr: Délai d’expiration par test, après celui-ci, le vidage de blocage est déclenché et le processus hôte de test est terminé. La valeur par défaut est 1h. La valeur du délai d’attente est spécifiée au format suivant : 1,5 h/ 90 m / 5 400 / 54 000 000 ms. Si aucune unité n'est utilisée (par exemple 5 400 000), la valeur est supposée être en millisecondes. Lorsqu’elle est utilisée avec des tests pilotés par les données, le comportement du délai d’attente dépend de l’adaptateur de test utilisé. Pour xUnit, NUnit et MSTest 2.2.4+ le délai d’expiration est renouvelé après chaque cas de test, Pour MSTest avant la version 2.2.4, le délai d’expiration est utilisé pour tous les cas de test.
it: Timeout per test dopo il quale viene attivato il dump di blocco e il processo dell'host di test viene terminato. L'impostazione predefinita è 1 ora. Il valore di timeout viene specificato nel formato seguente: 1,5 ore / 90 m / 5400 s / 5400000 ms. Quando non viene usata alcuna unità (ad es. 5400000), si presuppone che il valore sia in millisecondi. Se viene usato insieme a test basati sui dati, il comportamento del timeout dipende dall'adattatore di test usato. Per xUnit e NUnit e MSTest 2.2.4+, il timeout viene rinnovato dopo ogni test case, Per MSTest anteriore a 2.2.4, il timeout viene usato per tutti i test case.
ja: テストごとのタイムアウト。れを経過すると、ハング ダンプがトリガーされ、testhost プロセスが中止されます。既定値は 1h (1 時間) です。 タイムアウト値は次の形式で指定します: 1.5h / 90m / 5400s / 5400000ms。単位が使用されていない場合 (例: 5400000)、値は ms (ミリ秒) 単位と見なされます。 データ ドリブン テストと共に使用すると、タイムアウトの動作は使用するテスト アダプターによって異なります。xUnit、NUnit、MSTest 2.2.4 以降の場合、タイムアウトはテスト ケースの後に毎回更新されます。 2.2.4 より前の MSTest の場合、タイムアウトはすべてのテストケースで使用されます。
ko: 중단 덤프가 트리거되고 테스트 호스트 프로세스가 종료되는 테스트별 시간 제한입니다. 기본값은 1h입니다. 이 시간 제한 값은 1.5h/90m/5400s/5400000ms 형식으로 지정됩니다. 단위가 사용되지 않는 경우(예: 5400000) 값은 밀리초 단위로 간주됩니다. 데이터 기반 테스트와 함께 사용하는 경우 시간제한 동작은 사용되는 테스트 어댑터에 따라 달라집니다. xUnit, NUnit 및 MSTest 2.2.4 이상의 경우 테스트 사례마다 시간제한이 갱신됩니다. MSTest 2.2.4 이전의 경우 시간 제한은 모든 테스트케이스에 사용됩니다.
pl: Przekroczono limit czasu na test, po którym jest wyzwalany zrzut stanu zawieszenia, a działanie procesu na hoście testowym jest kończone. Wartość domyślna to 1 godz. Wartość limitu czasu jest określana w następującym formacie: 1.5 godz. / 90 min / 5400 sek. / 5 400 000 ms. Jeśli nie jest używana żadna jednostka (np. 5 400 000), przyjmuje się, że wartość jest wyrażona w milisekundach. W przypadku użycia razem z testami opartymi na danych zachowanie limitu czasu zależy od użytego adaptera testowego. W przypadku struktur xUnit, NUnit i MSTest w wersji 2.2.4+ limit czasu jest odnawiany po każdym przypadku testowym, W przypadku platformy MSTest przed wersją 2.2.4 limit czasu jest używany dla wszystkich przypadków testowych.
pt_br: Tempo limite por teste, após o qual o despejo de travamento é disparado e o processo testhost é encerrado. O padrão é 1h. O valor do tempo limite é especificado no seguinte formato: 1.5h / 90m / 5400s / 5400000ms. Quando nenhuma unidade é usada (por exemplo, 5400000), supõe-se que o valor esteja em milissegundos. Quando usado junto com testes controlados por dados, o comportamento do tempo limite depende do adaptador de teste usado. Para xUnit, NUnit e MSTest 2.2.4+, o tempo limite é renovado após cada caso de teste, Para MSTest antes de 2.2.4, o tempo limite é usado para todos os casos de teste.
ru: Время ожидания каждого теста, по истечении которого инициируется сбор дампа зависания и завершается процесс узла тестирования. Значение по умолчанию: 1 час. Значение времени ожидания указывается в следующем формате: 1.5h / 90m / 5400s / 5400000ms. Если единица измерения не указана (например, 5400000), предполагается, что время задано в миллисекундах. При использовании вместе с тестами под управлением данных время ожидания зависит от используемого адаптера теста. Для xUnit, NUnit и MSTest начиная с версии 2.2.4 отсчет времени ожидания начинается заново для каждого тестового случая, В MSTest версии ниже 2.2.4 время ожидания подсчитывается суммарно для всех тестовых случаев.
tr: Test başına zaman aşımı, bundan sonra askıda kalma dökümü tetiklenir ve testhost işlemi sonlandırılır. Varsayılan değer: 1 sa. Zaman aşımı değeri aşağıdaki biçimlerde belirtilir: 1,5 sa / 90 dk / 5400 s / 5400000 ms. Hiçbir birim kullanılmazsa (örn. 5400000), değerin milisaniye cinsinden olduğu varsayılır. Veri odaklı testlerle birlikte kullanıldığında, zaman aşımı davranışı kullanılan test bağdaştırıcısına bağlıdır. xUnit, NUnit ve MSTest 2.2.4+ için zaman aşımı her test durumundan sonra yenilenir, MSTest için 2.2.4'ten önce, zaman aşımı tüm test durumları için kullanılır.
zh_hans: 每测试超时，在该超时后触发挂起转储并终止 testhost 进程。默认为 1h。 超时值指定为以下格式: 1.5h / 90m / 5400s / 5400000ms。如果未使用任何单位(例如 5400000)，则假定该值以毫秒为单位。 在与数据驱动测试一起使用时，超时行为取决于所使用的测试适配器。对于 xUnit、NUnit 和 MSTest 2.2.4+，将在每个测试用例后续订超时， 对于 2.2.4 之前的 MSTest，超时用于所有测试用例。
zh_hant: 每個測試逾時，若超過時間未完成，將觸發擱置傾印，並終止 testhost 流程。預設值為 1 小時。 以下列格式指定逾時值: 1.5 小時 / 90 分鐘 / 5400 秒 / 5400000 毫秒。如果未使用單位 (例如 5400000)，則假設值為毫秒。 與資料驅動測試搭配使用時，逾時行為取決於所使用的測試配接器。針對 xUnit、NUnit 和 MSTest 2.2.4+ ，每次測試案例之後都會更新逾時， 針對 2.2.4 之前的 MSTest，系統會針對所有測試案例使用逾時。
