Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PackageFailedToRestore
source: Package "{0}" failed to restore, due to {1}
cs: Balíček {0} se nepovedlo obnovit. Příčina: {1}
de: Das Paket "{0}" konnte nicht wiederhergestellt werden. Ursache: {1}
es: No se pudo restaurar el paquete "{0}", debido a {1}
fr: Échec de la restauration du package "{0}". Raison : {1}
it: Il ripristino del pacchetto "{0}" non è riuscito a causa di {1}
ja: {1} が原因で、パッケージ "{0}" の復元が失敗しました。
ko: {1}(으)로 인해 "{0}" 패키지를 복원하지 못했습니다.
pl: Nie można przywrócić pakietu „{0}” z powodu {1}
pt_br: Falha na restauração do pacote "{0}" devido a {1}
ru: Не удалось восстановить пакет "{0}" по следующей причине: {1}
tr: "{0}" adlı paket, {1} nedeniyle geri yüklenemedi
zh_hans: 包“{0}”无法还原，因为 {1}
zh_hant: 因為 {1}，所以無法還原套件 "{0}"

source: Package ID
cs: ID balíčku
de: Paket-ID
es: Identificador del paquete
fr: ID du package
it: ID pacchetto
ja: パッケージ ID
ko: 패키지 ID
pl: Identyfikator pakietu
pt_br: ID do Pacote
ru: Идентификатор пакета
tr: Paket Kimliği
zh_hans: 包 ID
zh_hant: 套件識別碼

# PackageListAppFullName
source: List all package references of the project or solution.
cs: Vypíše všechny odkazy na balíčky z projektu nebo řešení.
de: Hiermit listen Sie alle Paketverweise des Projekts oder der Lösung auf.
es: Enumere todas las referencias de paquete del proyecto o la solución.
fr: Listez toutes les références de package du projet ou de la solution.
it: Elenca tutti i riferimenti al pacchetto del progetto o della soluzione.
ja: プロジェクトまたはソリューションのすべてのパッケージ参照を一覧表示します。
ko: 프로젝트 또는 솔루션의 모든 패키지 참조를 나열합니다.
pl: Zwróć listę wszystkich odwołań do pakietów w projekcie lub rozwiązaniu.
pt_br: Listar todas as referências de pacote do projeto ou da solução.
ru: Вывод списка всех ссылок на пакеты для проекта или решения.
tr: Proje veya çözümdeki tüm paket başvurularını listeleyin.
zh_hans: 列出项目或解决方案的所有包引用。
zh_hant: 列出專案或解決方案的所有套件參考。

# PackageListCmdFrameworkDescription
source: Chooses a framework to show its packages. Use the option multiple times for multiple frameworks.
cs: Zvolí architekturu, pro kterou se mají zobrazit balíčky. Pokud chcete určit více architektur, zadejte tento přepínač vícekrát.
de: Wählt ein Framework für die Anzeige der zugehörigen Pakete aus. Für mehrere Frameworks verwenden Sie die Option mehrmals.
es: Elige un marco para mostrar sus paquetes. Utilice la opción varias veces para marcos múltiples.
fr: Choisit un framework pour afficher ses packages. Utilisez l'option plusieurs fois selon le nombre de frameworks.
it: Consente di scegliere un framework per mostrarne i pacchetti. Usare l'opzione più volte in caso di framework multipli.
ja: パッケージを表示するフレームワークを選択します。複数のフレームワークに対してはこのオプションを複数回使用します。
ko: 프레임워크를 선택하여 패키지를 표시합니다. 여러 프레임워크의 경우 옵션을 여러 번 사용합니다.
pl: Wybiera strukturę, aby wyświetlić jej pakiety. W przypadku wielu struktur użyj tej opcji wielokrotnie.
pt_br: Escolhe uma estrutura para mostrar seus pacotes. Use a opção várias vezes para várias estruturas.
ru: Выбирает платформу, список пакетов для которой необходимо отобразить. Для нескольких платформ укажите этот параметр несколько раз.
tr: Paketlerini görüntülemek için bir çerçeve seçin. Birden fazla çerçeve için seçeneği birden fazla kez kullanın.
zh_hans: 选择一个框架来显示其包。对多个框架多次使用该选项。
zh_hant: 選擇架構以顯示其套件。若有多個架構，則重複使用該選項。

# PackageListCmdSource
source: SOURCE
cs: ZDROJ
de: QUELLE
es: ORIGEN
pl: ŹRÓDŁO
pt_br: ORIGEM
tr: KAYNAK
zh_hant: 來源

# PackageListCmdSourceDescription
source: The NuGet sources to use when searching for newer packages. Requires the '--outdated', '--deprecated' or '--vulnerable' option.
cs: Zdroje NuGet, které se mají použít při hledání novějších balíčků. Vyžaduje možnost --outdated, --deprecated nebo --vulnerable.
de: Die bei der Suche nach neueren Paketen zu verwendenden NuGet-Quellen. Erfordert die Option "--outdated", "--deprecated" oder "--vulnerable".
es: Los orígenes de NuGet que se usan al buscar paquetes más recientes. Requiere la opción "--outdated", "--deprecated" o "--vulnerable".
fr: Sources NuGet à utiliser durant la recherche de packages plus récents. Nécessite l'option '--outdated', '--deprecated' ou '--vulnerable'.
it: Origini NuGet da usare quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated', '--deprecated' o '--vulnerable'.
ja: 新しいパッケージを検索するときに使用する NuGet ソース。'--outdated'、'--deprecated'、または '--vulnerable' のオプションが必要です。
ko: 최신 패키지를 검색할 때 사용하는 NuGet 소스입니다. '--outdated', '--deprecated' 또는 '--vulnerable' 옵션이 필요합니다.
pl: Źródła NuGet do użycia podczas wyszukiwania nowszych pakietów. Wymaga opcji „--outdated”, „--deprecated” lub „--vulnerable”.
pt_br: As fontes do NuGet a serem usadas ao procurar pacotes mais recentes. Exige a opção '--outdated', '--deprecated' ou '--vulnerable'.
ru: Источники NuGet, используемые при поиске более новых версий пакетов. Требуется указать параметр "--outdated", "--deprecated" или "--vulnerable".
tr: Daha yeni paketler aranırken kullanılacak NuGet kaynakları. '--outdated', '--deprecated' veya '--vulnerable' seçeneğini gerektirir.
zh_hans: 搜索较新的包时要使用的 NuGet 源。需要 "--outdated"、"--deprecated" 或 "--vulnerable" 选项。
zh_hant: 搜尋較新的套件時，所使用的 NuGet 來源。需要 '--outdated'、'--deprecated' 或 '--vulnerable' 選項。

# PackageListFileNotFound
source: Could not find file or directory '{0}'.
cs: Soubor nebo adresář {0} nešlo najít.
de: Die Datei oder das Verzeichnis "{0}" wurde nicht gefunden.
es: No se pudo encontrar el archivo o directorio "{0}".
fr: Fichier ou répertoire '{0}' introuvable.
it: Non è stato possibile trovare il file o la directory '{0}'.
ja: ファイルまたはディレクトリ '{0}' が見つかりませんでした。
ko: '{0}' 파일 또는 디렉터리를 찾을 수 없습니다.
pl: Nie można odnaleźć pliku lub katalogu „{0}”.
pt_br: Não foi possível encontrar o arquivo ou o diretório '{0}'.
ru: Не удалось найти файл или каталог "{0}".
tr: '{0}' dosyası veya dizini bulunamadı.
zh_hans: 找不到文件或目录“{0}”。
zh_hant: 找不到檔案或目錄 ‘{0}’。

# PackageRemoveAppFullName
source: Remove a NuGet package reference from the project.
cs: Odebrat odkaz na balíček NuGet z projektu
de: Hiermit entfernen Sie einen NuGet-Paketverweis aus dem Projekt.
es: Quita una referencia de paquete de NuGet del proyecto.
fr: Retirez une référence de package NuGet du projet.
it: Rimuove un riferimento al pacchetto NuGet dal progetto.
ja: プロジェクトから NuGet パッケージ参照を削除します。
ko: 프로젝트에서 NuGet 패키지 참조를 제거합니다.
pl: Usuń odwołanie do pakietu NuGet z projektu.
pt_br: Remover uma referência do pacote do NuGet do projeto.
ru: Удаление ссылки на пакет NuGet из проекта.
tr: Bir NuGet paketi başvurusunu projeden kaldırın.
zh_hans: 从项目中删除 NuGet 包引用。
zh_hant: 從專案移除 NuGet 套件參考。

# PackageRemoveAppHelpText
source: The package reference to remove.
cs: Odkaz na balíček, který se má odebrat
de: Der zu entfernende Paketverweis.
es: La referencia de paquete para quitar.
fr: Référence de package à supprimer.
it: Riferimento al pacchetto da rimuovere.
ja: 削除するパッケージ参照。
ko: 제거할 패키지 참조입니다.
pl: Odwołanie do pakietu do usunięcia.
pt_br: A referência do pacote a ser removida.
ru: Удаляемая ссылка на пакет.
tr: Kaldırılacak paket başvurusu.
zh_hans: 要删除的包引用。
zh_hant: 要移除的套件參考。

# PackageRemoveSpecifyExactlyOnePackageReference
source: Specify only one package reference to remove.
cs: Zadejte jen jeden odkaz na balíček, který chcete odebrat.
de: Geben Sie nur einen Paketverweis an, der entfernt werden soll.
es: Especifique solo una referencia de paquete para quitar.
fr: Spécifiez une seule référence de package à supprimer.
it: Specificare un solo riferimento al pacchetto da rimuovere.
ja: 削除するパッケージ参照を 1 つだけ指定してください。
ko: 제거할 패키지 참조를 하나만 지정하세요.
pl: Podaj tylko jedno odwołanie do pakietu, które ma zostać usunięte.
pt_br: Especifique somente uma referência de pacote a ser removida.
ru: Укажите только одну удаляемую ссылку на пакет.
tr: Kaldırmak için yalnızca bir paket başvurusu belirtin.
zh_hans: 请仅指定一个要删除的包引用。
zh_hant: 請只指定一個要移除的套件參考。

# PackageSearchCommandDescription
source: Searches one or more package sources for packages that match a search term. If no sources are specified, all sources defined in the NuGet.Config are used.
cs: Vyhledá v jednom nebo více zdrojích balíčků balíčky, které odpovídají hledanému výrazu. Pokud nejsou zadány žádné zdroje, budou použity všechny zdroje definované v NuGet.Config.
de: Durchsucht mindestens eine Paketquelle nach Paketen, die mit einem Suchbegriff übereinstimmen. Wenn keine Quellen angegeben sind, werden alle in der NuGet.Config definierten Quellen verwendet.
es: Busca en uno o varios orígenes de paquetes los paquetes que coincidan con un término de búsqueda. Si no se especifica ningún origen, se usarán todos los orígenes definidos en NuGet.Config.
fr: Recherche dans une ou plusieurs sources de packages les packages qui correspondent à un terme de recherche. Si aucune source n’est spécifiée, toutes les sources définies dans NuGet.Config sont utilisées.
it: Cerca in una o più origini pacchetti per pacchetti che corrispondono a un termine di ricerca. Se non vengono specificate origini, vengono usate tutte le origini definite in NuGet.Config.
ja: 検索語句に一致するパッケージを 1 つ以上のパッケージ ソースで検索します。ソースが指定されていない場合、NuGet.Config で定義されているすべてのソースが使用されます。
ko: 하나 이상의 패키지 원본에서 검색어와 일치하는 패키지를 검색합니다. 원본을 지정하지 않으면 NuGet.Config에 정의된 모든 원본이 사용됩니다.
pl: Wyszukuje co najmniej jedno źródło pakietów, które są zgodne z wyszukiwanym terminem. Jeśli nie określono żadnego źródła, zostaną użyte wszystkie źródła zdefiniowane w NuGet.Config.
pt_br: Pesquisa uma ou mais fontes de pacote em busca de pacotes que correspondam a um termo de pesquisa. Se nenhuma fonte for especificada, todas as fontes definidas no NuGet.Config serão usadas.
ru: Ищет в одном или нескольких источниках пакетов пакеты, соответствующие поисковому запросу. Если источники не указаны, используются все источники, определенные в NuGet.Config.
tr: Bir arama terimiyle eşleşen paketler için bir veya daha fazla paket kaynağı arar. Kaynak belirtilmezse NuGet.Config’de tanımlanan tüm kaynaklar kullanılır.
zh_hans: 在一个或多个包源中搜索与搜索词匹配的包。如果未指定任何源，则会使用 NuGet.Config 中定义的所有源。
zh_hant: 搜尋一或多個套件來源以尋找符合搜尋字詞的套件。如果未指定來源，則會使用 NuGet.Config 中定義的所有來源。

# PackageSearchPrereleaseDescription
source: Include prerelease packages.
cs: Zahrnout předběžné verze balíčků.
de: Schließen Sie Vorabversionspakete ein.
es: Incluir paquetes de versión preliminar.
fr: Inclure les packages de préversion.
it: Includi pacchetti pre-release.
ja: プレリリース パッケージが含まれます。
ko: 시험판 패키지를 포함합니다.
pl: Uwzględnij pakiety wersji wstępnej.
pt_br: Incluir pacotes de pré-lançamento.
ru: Включить пакеты предварительного выпуска.
tr: Ön sürüm paketlerini dahil et.
zh_hans: 包括预发行包。
zh_hant: 包含發行前版本套件。

# PackageSearchSearchTermDescription
source: Search term to filter package names, descriptions, and tags. Used as a literal value. Example: `dotnet package search some.package`. See also `--exact-match`.
cs: Hledaný termín umožňuje filtrovat názvy balíčků, popisy a značky. Používá se jako hodnota literálu. Příklad: dotnet package search some.package. Nenašla se žádná shoda --exact-match.
de: Suchbegriff zum Filtern von Paketnamen, Beschreibungen und Tags. Wird als Literalwert verwendet. Beispiel: "dotnet package search some.package". Siehe auch "--exact-match".
es: Término de búsqueda para filtrar nombres de paquetes, descripciones y etiquetas. Se usa como un valor literal. Ejemplo: 'dotnet package search some.package'. Vea también '--exact-match'.
fr: Terme de recherche pour filtrer les noms de package, les descriptions et les balises. Utilisé comme valeur littérale. Exemple : « recherche de package dotnet some.package ». Voir aussi « --exact-match ».
it: Termine di ricerca per filtrare i nomi dei pacchetti, le descrizioni e i tag. Usato come valore letterale. Esempio: `dotnet package search some.package`. Vedere anche `--exact-match`.
ja: パッケージ名、説明、タグをフィルター処理する検索用語。リテラル値として使用されます。例: 'dotnet package search some.package'。'--exact-match' も参照してください。
ko: 용어를 검색하여 패키지 이름, 설명 및 태그를 필터링합니다. 리터럴 값으로 사용됩니다. 예: 'dotnet package search some.package'. `--exact-match`도 확인합니다.
pl: Wyszukaj termin, aby filtrować nazwy,opisy i tagi pakietów. Używane jako wartość literału. Przykład: „dotnet package search some.package”. Zobacz też „--exact-match”.
pt_br: Termo de pesquisa para filtrar nomes, descrições e marcas do pacote. Usado como um valor literal. Exemplo: ''dotnet package search some.package''. Consulte também ''--exact-match''.
ru: Поисковый запрос для фильтрации названий, описаний и тегов пакетов. Используется как буквальное значение. Пример: `dotnet package search some.package`. См. также `--exact-match`.
tr: Paket adlarını, açıklamalarını ve etiketlerini filtrelemek için arama terimi. Değişmez değer olarak kullanılır. Örnek: “dotnet paketi araması some.package”. Ayrıca bkz. “--exact-match”.
zh_hans: 搜索词以筛选包名称、说明和标记。用作文本值。示例: `dotnet package search some.package`。另请参阅`--exact-match`。
zh_hant: 搜尋字詞以篩選封裝名稱、描述和標籤。作為常值使用。範例: 'dotnet package search some.package'。另請參閱 `--exact-match`。

# PackageSearchSkipArgumentName
source: Skip
cs: Přeskočit
de: Überspringen
es: Omitir
fr: Ignorer
it: Ignora
ja: スキップ
ko: 건너뛰기
pl: Pomiń
pt_br: Ignorar
ru: Пропустить
tr: Atla
zh_hans: 跳过
zh_hant: 跳過

# PackageSearchSkipDescription
source: Number of results to skip, to allow pagination. Default 0.
cs: Počet výsledků, které se mají přeskočit, aby se povolilo stránkování. Výchozí hodnota 0.
de: Anzahl der zu überspringenden Ergebnisse, um Paginierung zuzulassen. Standard 0.
es: Número de resultados que se van a omitir para permitir la paginación. Predeterminado 0.
fr: Nombre de résultats à ignorer pour autoriser la pagination. Valeur par défaut 0.
it: Numero di risultati da ignorare, per consentire la paginazione. Impostazione predefinita 0.
ja: 改ページ位置の自動修正を許可するためにスキップする結果の数。既定値は 0 です。
ko: 페이지 매김을 허용하기 위해 건너뛸 결과 수입니다. 기본값 0.
pl: Liczba wyników do pominięcia, aby zezwolić na dzielenie na strony. Wartość domyślna to 0.
pt_br: Número de resultados a serem ignorados, para permitir paginação. Padrão 0.
ru: Количество результатов, которые нужно пропустить, чтобы разрешить нумерацию страниц. По умолчанию 0.
tr: Sayfalandırmaya izin vermek için atlanacak sonuç sayısı. Varsayılan: 0.
zh_hans: 要跳过的结果数，以允许进行分页。默认0。
zh_hant: 要略過以允許分頁的結果數目。預設 0。

# PackageSearchTakeArgumentName
source: Take
cs: Převzít
de: Übernehmen
it: Includi
ja: 取得
ko: 가져오기
pl: Pobierz
pt_br: Pegar
ru: Взять
tr: Al
zh_hant: 採用

# PackageSearchTakeDescription
source: Number of results to return. Default 20.
cs: Počet výsledků, které se mají vrátit. Výchozí hodnota je 20.
de: Anzahl der Ergebnisse, die zurückgegeben werden sollen. Standard 20.
es: Número de resultados que se devolverán. Predeterminado 20.
fr: Nombre de résultats à retourner. Valeur par défaut 20.
it: Numero di risultati da restituire. Impostazione predefinita 20.
ja: 返される結果の数。既定値は 20 です。
ko: 반환할 결과 수입니다. 기본값 20.
pl: Liczba wyników do zwrócenia. Wartość domyślna to 20.
pt_br: O número de resultados a serem retornados. Padrão 20.
ru: Количество результатов для возврата. По умолчанию 20.
tr: Döndürülecek sonuç sayısı. Varsayılan: 20.
zh_hans: 要返回的结果数。默认: 20。
zh_hant: 要傳回的結果數。預設 20。

# PackagesCommandNameCollisionConclusion
source: Command names conflict. Command names are case insensitive. {0}
cs: Konflikt názvů příkazů. Názvy příkazů nerozlišují velká a malá písmena. {0}
de: Konflikt mit Befehlsnamen. Bei Befehlsnamen ist die Groß-/Kleinschreibung nicht relevant. {0}
es: Conflicto de nombres de comando. Los nombres de comando distinguen mayúsculas de minúsculas. {0}
fr: Conflit de noms de commandes. Les noms de commandes ne respectent pas la casse. {0}
it: Conflitto di nomi di comando. I nomi dei comandi non fanno distinzione tra maiuscole/minuscole. {0}
ja: コマンド名が競合しています。コマンド名では大文字と小文字は区別されません。 {0}
ko: 명령 이름이 충돌합니다. 명령 이름은 대/소문자를 구분하지 않습니다. {0}
pl: Konflikt nazw poleceń. W nazwach poleceń nie jest rozróżniana wielkość liter. {0}
pt_br: Conflito de nomes de comando. Os nomes de comando não diferenciam maiúsculas de minúsculas. {0}
ru: Конфликт имен команд. В именах команд учитывается регистр. {0}
tr: Komut adları çakışıyor. Komut adları büyük/küçük harfe duyarlı değildir. {0}
zh_hans: 命令名称冲突。命令名称不区分大小写。 {0}
zh_hant: 命令名稱相衝突。命令名稱區分大小寫。 {0}

# PackagesCommandNameCollisionForOnePackage
source: A command "{0}" in package "{1}"
cs: Příkaz {0} v balíčku {1}
de: Ein Befehl "{0}" im Paket "{1}"
es: Un comando "{0}" en el paquete "{1}"
fr: Une commande "{0}" dans le package "{1}"
it: Comando "{0}" nel pacchetto "{1}"
ja: パッケージ "{1}" のコマンド "{0}"
ko: "{1}" 패키지의 "{0}" 명령
pl: Polecenie „{0}” w pakiecie „{1}”
pt_br: Um comando "{0}" no pacote "{1}"
ru: Команда "{0}" в пакете "{1}"
tr: "{1}" paketindeki bir "{0}" komutu
zh_hans: 包“{1}”中的命令“{0}”
zh_hant: 套件 "{1}" 中的命令 "{0}"

source: Passed
cs: Úspěšné
de: Bestanden
es: Correcta
fr: Réussite
it: Superato
ja: 成功
ko: 통과
pl: Powodzenie
pt_br: Aprovado
ru: Пройден
tr: Başarılı
zh_hans: 已通过
zh_hant: 成功

# PassedLowercase
source: passed
cs: úspěch
de: erfolgreich
es: correcto
fr: réussite
it: superato
ja: 合格しました
ko: 통과
pl: zakończone powodzeniem
pt_br: aprovado
ru: пройдено
tr: başarılı
zh_hans: 已通过
zh_hant: 已通過

# PathToApplicationDefinition
source: The path to an application .dll file to execute.
cs: Cesta k souboru .dll aplikace, který se má spustit
de: Der Pfad zur auszuführenden DLL-Datei einer Anwendung.
es: La ruta de acceso al archivo .dll de una aplicación que se ejecutará.
fr: Chemin d'un fichier .dll d'application à exécuter.
it: Percorso di un file DLL dell'applicazione da eseguire.
ja: 実行するアプリケーション .dll ファイルへのパス。
ko: 실행할 애플리케이션 .dll 파일의 경로입니다.
pl: Ścieżka do pliku dll aplikacji do wykonania.
pt_br: O caminho para um arquivo .dll de aplicativo a ser executado.
ru: Путь к DLL-файлу приложения, который необходимо выполнить.
tr: Çalıştırılacak uygulama .dll dosyasının yolu.
zh_hans: 要执行的应用程序 .dll 文件的路径。
zh_hant: 要執行的應用程式 .dll 檔案之路徑。

# PendingReboot
source: The machine has a pending reboot. The workload operation will continue, but you may need to restart.
cs: Počítač čeká na restartování. Operace úlohy bude pokračovat, ale možná budete muset provést restartování.
de: Für den Computer steht ein Neustart aus. Der Workloadvorgang wird fortgesetzt, aber Sie müssen möglicherweise neu starten.
es: La máquina tiene un reinicio pendiente. La operación de carga de trabajo continuará, pero es posible que tenga que reiniciar.
fr: La machine a un redémarrage en attente. L'opération de charge de travail se poursuivra, mais vous devrez peut-être redémarrer.
it: Il computer ha un riavvio in sospeso. L'operazione del carico di lavoro continuerà, ma potrebbe essere necessario un riavvio.
ja: マシンの再起動が保留中です。ワークロード操作は続行されますが、再起動が必要になる場合があります。
ko: 컴퓨터에 보류 중인 재부팅이 있습니다. 워크로드 작업은 계속되지만 다시 시작해야 할 수 있습니다.
pl: Urządzenie oczekuje na ponowne uruchomienie. Operacja obciążenia będzie kontynuowana, ale może być konieczne ponowne uruchomienie.
pt_br: A máquina tem uma reinicialização pendente. A operação de carga de trabalho continuará, mas pode ser necessário reiniciar.
ru: Ожидается перезагрузка компьютера. Операция рабочей нагрузки будет продолжена, но может потребоваться перезагрузить компьютер.
tr: Makinede bekleyen bir yeniden başlatma işlemi var. İş yükü işlemi devam edecek ancak yeniden başlatmanız gerekebilir.
zh_hans: 计算机有挂起的重新启动。安装将继续，但可能需要重新启动。
zh_hant: 機器有擱置中的重新開機。工作負載作業將繼續，但您可能需要重新開機。

# PostAction_AddProjToSln_Error_BothInRootAndSolutionFolderSpecified
source: Add project reference to solution action is not configured correctly in the template. The 'solutionFolder' and 'inRoot' cannot be used together; use only one of the options.
cs: Akce přidání odkazu na projekt do řešení není v šabloně správně nakonfigurovaná. SolutionFolder a inRoot se nedají použít společně; použijte jen jednu z těchto možností.
de: Das Hinzufügen eines Projektverweises zur Projektmappenaktion ist in der Vorlage nicht richtig konfiguriert. "solutionFolder" und "inRoot" können nicht zusammen verwendet werden; verwenden Sie nur eine der Optionen.
es: La acción Agregar referencia del proyecto a la solución no está configurada correctamente en la plantilla. "solutionFolder" e "inRoot" no se pueden usar juntos; use solo una de las opciones.
fr: L’ajout d’une référence de projet à l’action de solution n’est pas configuré correctement dans le modèle. « solutionFolder » et « inRoot » ne peuvent pas être utilisés ensemble; utilisez une seule des options.
it: L'azione di aggiunta del riferimento progetto alla soluzione non è configurata correttamente nel modello. Non è possibile usare contemporaneamente 'solutionFolder' e 'inRoot'. Usa solo una delle opzioni.
ja: テンプレートでソリューションへのプロジェクト参照の追加アクションが正しく構成されていません。 'solutionFolder' と 'inRoot' を同時に使用することはできません。いずれか 1 つのオプションのみを使用してください。
ko: 솔루션 작업에 대한 프로젝트 참조 추가가 템플릿에 올바르게 구성되지 않았습니다. 'solutionFolder' 및 'inRoot'는 함께 사용할 수 없습니다. 옵션 중 하나만 사용하세요.
pl: Odwołanie do dodawania projektu do akcji rozwiązania nie jest poprawnie skonfigurowane w szablonie. Elementów „solutionFolder” i „inRoot” nie można używać razem; użyj tylko jednej z opcji.
pt_br: A adição da referência do projeto à ação da solução não está configurada corretamente no modelo. O "solutionFolder" e o "inRoot" não podem ser usados juntos; use apenas uma das opções.
ru: Добавление ссылки на проект к действию решения неправильно настроено в шаблоне. Невозможно использовать одновременно "solutionFolder" и "inRoot"; используйте только один из этих параметров.
tr: Çözüm eylemine proje başvurusu ekle, şablonda doğru yapılandırılmamış. 'solutionFolder' ve 'inRoot' birlikte kullanılamaz; seçeneklerden yalnızca birini kullanın.
zh_hans: 未在模版中正确配置向解决方案操作添加项目引用。 'solutionFolder' 和 'inRoot' 不能一起使用，请仅使用其中之一。
zh_hant: 未在範本中正確設定新增至解決方案動作中的專案參考。 'solutionFolder' 和 'inRoot' 不能同時使用; 只使用其中一個選項。

# PostAction_AddProjToSln_Error_NoProjectsToAdd
source: Add project reference to solution action is not configured correctly in the template. Unable to determine the project files to add.
cs: Akce Přidat odkaz na projekt do řešení není v šabloně správně nakonfigurovaná. Nedají se určit soubory projektu, které se mají přidat.
de: Die Aktion „Projektverweis zur Projektmappe hinzufügen“ ist in der Vorlage nicht ordnungsgemäß konfiguriert. Die hinzuzufügenden Projektdateien können nicht ermittelt werden.
es: La acción de agregar una referencia de proyecto a la solución no está configurada correctamente en la plantilla. No se pueden determinar los archivos de proyecto que se van a agregar.
fr: L’ajout d’une référence de projet à l’action de solution n’est pas configuré correctement dans le modèle. Impossible de déterminer les fichiers de projet à ajouter.
it: L'aggiunta del riferimento al progetto all'azione della soluzione non è configurata correttamente nel modello. Non è possibile determinare i file di progetto da aggiungere.
ja: ソリューションへのプロジェクト参照追加のアクションがテンプレートで正しく構成されていません。追加するプロジェクトファイルを特定できません。
ko: 솔루션 작업에 프로젝트 참조 추가가 템플릿에서 올바르게 구성되지 않았습니다. 추가할 프로젝트 파일을 확인할 수 없습니다.
pl: Dodawanie odwołania projektu do akcji rozwiązania nie jest poprawnie skonfigurowane w szablonie. Nie można określić plików projektu do dodania.
pt_br: A adição de referência de projeto à ação de solução não está configurada corretamente no modelo. Não é possível determinar os arquivos de projeto a serem adicionados.
ru: Добавить ссылку на проект в решение. Действие в шаблоне настроено неправильно. Не удалось определить файлы проекта для добавления.
tr: Çözüme proje başvurusu ekleme eylemi şablonda doğru şekilde yapılandırılmadı. Eklenecek proje dosyaları belirlenemiyor.
zh_hans: 模板中未正确配置将项目引用添加到解决方案操作。无法确定要添加的项目文件。
zh_hant: 範本中未正確設定將專案參考新增至方案動作。無法判斷要新增的專案檔案。
