Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DeletingWorkloadManifest
source: Uninstalling workload manifest {0} version {1}...
cs: Probíhá odinstalace manifestu úlohy {0} verze {1}...
de: Das Workloadmanifest {0} Version {1} wird deinstalliert...
es: Desinstalando el manifiesto de carga de trabajo {0} versión {1}...
fr: Désinstallation du manifeste de charge de travail {0} version {1}...
it: Disinstallazione del manifesto del carico di lavoro {0} versione {1} in corso...
ja: ワークロード マニフェスト {0} のバージョン {1} をアンインストールしています...
ko: 워크로드 매니페스트 {0} 버전 {1} 제거 중...
pl: Odinstalowanie manifestu obciążenia {0} w wersji {1}...
pt_br: Instalando o manifesto da carga de trabalho {0} versão {1}...
ru: Удаление манифеста рабочей нагрузки {0} версии {1}...
tr: İş yükü bildirimi {0} sürümü {1} yükleniyor...
zh_hans: 正在卸载工作负载清单 {0} 版本 {1}…
zh_hant: 正解除安裝工作負載資訊清單 {0} 版本 {1}...

# DeletingWorkloadPack
source: Uninstalling workload pack {0} version {1}...
cs: Probíhá odinstalace sady funkcí {0} verze {1}...
de: Das Workloadpaket {0}, Version {1}, wird deinstalliert…
es: Desinstalando el paquete de carga de trabajo {0} versión{1}...
fr: Désinstallation de la version {1} du pack {0} de charge de travail...
it: Disinstallazione del pacchetto del carico di lavoro {0} versione {1}in corso...
ja: ワークロード パック {0} バージョン {1} をアンインストールしています...
ko: 워크로드 팩 {0} 버전 {1} 제거 중...
pl: Odinstalowywanie pakietu obciążeń {0} w wersji {1}…
pt_br: Desinstalando o pacote de carga de trabalho {0} versão {1}...
ru: Идет удаление пакета рабочих нагрузок {0} версии {1}...
tr: {0} iş yükü paketi sürüm {1} kaldırılıyor...
zh_hans: 正在卸载工作负载包 {0} 版本 {1}…
zh_hant: 正在解除安裝工作負載套件 {0} 版本 {1}...

# DeletingWorkloadSet
source: Deleting workload version {0}.
cs: Odstraňuje se verze úlohy {0}.
de: Die Workloadversion {0} wird gelöscht.
es: Eliminando la versión de carga de trabajo {0}.
fr: Suppression de la version de la charge de travail {0}.
it: Eliminazione della versione del carico di lavoro {0}.
ja: ワークロード バージョン {0} を削除しています。
ko: 워크로드 버전 {0}을(를) 삭제하는 중입니다.
pl: Usuwanie wersji obciążenia {0}.
pt_br: Excluindo a versão de carga de trabalho {0}.
ru: Удаление версии рабочей нагрузки {0}.
tr: {0} iş yükü sürümü siliniyor.
zh_hans: 正在删除工作负载版本 {0}。
zh_hant: 正在刪除工作負載版本 {0}。

# DepsFileDefinition
source: Path to <application>.deps.json file.
cs: Cesta k souboru <aplikace>.deps.json.
de: Pfad zur Datei "<application>.deps.json".
es: Ruta de acceso al archivo <application>.deps.json.
fr: Chemin du fichier <application>.deps.json.
it: Percorso del file <applicazione>.deps.json.
ja: <application>.deps.json ファイルへのパス。
ko: <application>.deps.json 파일의 경로입니다.
pl: Ścieżka do pliku <aplikacja>.deps.json.
pt_br: Caminho para o arquivo <application>.deps.json.
ru: Путь к файлу <application>.deps.json.
tr: <application>.deps.json dosyasının yolu.
zh_hans: 指向 <application>.deps.json 文件的路径。
zh_hant: <application>.deps.json 檔案的路徑。

source: Description
cs: Popis
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
pl: Opis
pt_br: Descrição
ru: Описание
tr: Açıklama
zh_hans: 说明
zh_hant: 描述

# DescriptionColumnName
source: Description
cs: Popis
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
pl: Opis
pt_br: Descrição
ru: Описание
tr: Açıklama
zh_hans: 说明
zh_hant: 描述

# DeserializationExceptionMessage
source: An error was encountered when reading '{0}': {1}
cs: Při čtení {0} došlo k chybě: {1}
de: Beim Lesen von „{0}“ ist ein Fehler aufgetreten: {1}
es: Error al leer '{0}': {1}
fr: Une erreur est survenue pendant la lecture de « {0} » : {1}
it: Si è verificato un errore durante la lettura di "{0}": {1}
ja: '{0}' の読み取り中にエラーが発生しました: {1}
ko: '{0}'을 읽는 동안 오류가 발생했습니다. {1}
pl: Napotkano błąd podczas odczytywania elementu „{0}”: {1}
pt_br: Ocorreu um erro ao ler '{0}': {1}
ru: Произошла ошибка при чтении "{0}": {1}
tr: ‘{0}’ okunurken bir hata oluştu: {1}
zh_hans: 读取 ‘{0}’ 时遇到错误: {1}
zh_hant: 讀取「{0}」時發生錯誤: {1}

# DetailDescription
source: Show detail result of the query.
cs: Zobrazit podrobné výsledky dotazu
de: Hiermit wird das Ergebnis der Abfrage im Detail angezeigt.
es: Muestra el resultado detallado de la consulta.
fr: Afficher le résultat détaillé de la requête.
it: Mostra il risultato in dettaglio della query.
ja: クエリの詳細な結果を表示します。
ko: 쿼리의 세부 결과를 표시합니다.
pl: Pokaż szczegółowy wynik zapytania.
pt_br: Mostrar o resultado detalhado da consulta.
ru: Отображение подробных сведений о результате запроса.
tr: Sorgunun ayrıntılı sonucunu gösterir.
zh_hans: 显示查询的详细结果。
zh_hant: 顯示查詢的詳細結果。

# DevCertsDefinition
source: Create and manage development certificates.
cs: Vytvoří a spravuje certifikáty pro vývoj.
de: Hiermit erstellen und verwalten Sie Entwicklungszertifikate.
es: Crea y administra certificados de desarrollo.
fr: Créez et gérez des certificats de développement.
it: Consente di creare e gestire i certificati di sviluppo.
ja: 開発証明書を作成し、管理します。
ko: 개발 인증서를 만들고 관리합니다.
pl: Utwórz certyfikaty deweloperskie i zarządzaj nimi.
pt_br: Crie e gerencie certificados de desenvolvimento.
ru: Создание сертификатов разработки и управление ими.
tr: Geliştirme sertifikaları oluşturun ve yönetin.
zh_hans: 创建和管理开发证书。
zh_hant: 建立及管理開發憑證。

# Diagnostics_OptionDescription
source: Enables diagnostic output.
cs: Povolí diagnostický výstup.
de: Aktiviert die Diagnoseausgabe.
es: Permite habilitar la salida de diagnóstico.
fr: Active la sortie des diagnostics.
it: Abilita l'output di diagnostica.
ja: 診断出力を有効にします。
ko: 진단 출력을 사용하도록 설정합니다.
pl: Włącza dane wyjściowe diagnostyki.
pt_br: Habilita a saída de diagnóstico.
ru: Включает диагностические выходные данные.
tr: Tanılama çıkışı sağlar.
zh_hans: 启用诊断输出。
zh_hant: 啟用診斷輸出。

# DirectivesRemoved
source: Removed '{0}' directives ({1}) for '{2}' from: {3}
cs: Odebrány direktivy {0} ({1}) pro {2} z umístění: {3}
de: Die „{0}“-Direktiven ({1}) für „{2}“ wurden aus folgender Datei entfernt: {3}
es: Se eliminaron las directivas '{0}' ({1}) para '{2}' de: {3}
fr: Instructions « {0} » ({1}) supprimées pour « {2} » dans : {3}
it: Sono state rimosse le direttive '{0}' ({1}) per '{2}' da: {3}
ja: '{2}' の '{0}' ディレクティブ ({1}) を次から削除しました: {3}
ko: 다음에서 '{2}'에 대한 '{0}' 지시문({1})을 제거했습니다. {3}
pl: Usunięto dyrektywy „{0}” ({1}) dla „{2}” z pliku: {3}
pt_br: Diretivas "{0}" removidas ({1}) para "{2}" de: {3}
ru: Удалены директивы "{0}" ({1}) для "{2}" из: {3}
tr: ‘{2}’ için ‘{0}’ yönergeleri ({1}) şuradan kaldırıldı: {3}
zh_hans: 已从 {3} 移除“{2}”的“{0}”指令({1})
zh_hant: 已從 {3} 移除 '{2}' 的 '{0}' 指令 ({1})

# DirectoryAlreadyExists
source: The target directory already exists: '{0}'
cs: Cílový adresář již existuje: {0}.
de: Das Zielverzeichnis ist bereits vorhanden: "{0}"
es: El directorio de destino ya existe: "{0}"
fr: Le répertoire cible existe déjà : « {0} »
it: La directory di destinazione esiste già: '{0}'
ja: ターゲット ディレクトリは既に存在します: '{0}'
ko: 대상 디렉터리가 이미 있습니다. '{0}'
pl: Katalog docelowy już istnieje: „{0}”
pt_br: O diretório de destino já existe: "{0}"
ru: Целевой каталог уже существует: "{0}"
tr: Hedef dizin zaten mevcut: '{0}'
zh_hans: 目标目录已存在: '{0}'
zh_hant: 目標目錄已存在: '{0}'

# DisableProjectContextEval_OptionDescription
source: Disables evaluating project context using MSBuild.
cs: Zakáže vyhodnocování kontextu projektu pomocí nástroje MSBuild.
de: Deaktiviert die Auswertung des Projektkontexts mit MSBuilds.
es: Deshabilita la evaluación del contexto del proyecto mediante MSBuild.
fr: Désactive l'évaluation du contexte du projet à l'aide de MSBuild.
it: Disabilita la valutazione del contesto del progetto con MSBuild.
ja: MSBuild を使用してプロジェクト コンテキストの評価を無効にします。
ko: MSBuild를 사용하여 프로젝트 컨텍스트 평가를 사용하지 않도록 설정합니다.
pl: Wyłącza ocenianie kontekstu projektu przy użyciu programu MSBuild.
pt_br: Desabilita a avaliação do contexto do projeto usando o MSBuild.
ru: Отключает оценку контекста проекта с помощью MSBuild.
tr: MSBuild kullanarak proje bağlamının değerlendirilmesini devre dışı bırakır.
zh_hans: 禁用使用 MSBuild 评估项目上下文。
zh_hant: 使用 MSBuild 停用評估專案內容。

# DisableSdkTemplates_OptionDescription
source: If present, prevents templates bundled in the SDK from being presented.
cs: Pokud je k dispozici, zabrání zobrazení šablon, které jsou součástí sady SDK.
de: Falls vorhanden, wird verhindert, dass im SDK gebündelte Vorlagen präsentiert werden.
es: Si está presente, impide que se presenten las plantillas agrupadas en el SDK.
fr: S'il est présent, empêche la présentation des modèles regroupés dans le SDK.
it: Se presente, impedisce la presentazione dei modelli forniti in bundle nell'SDK.
ja: SDK にバンドルされているテンプレートがある場合にそれらが表示されないようにします。
ko: 있는 경우 SDK에 번들로 제공되는 템플릿이 표시되지 않도록 합니다.
pl: Jeśli istnieją, uniemożliwia prezentowanie szablonów dołączonych do zestawu SDK.
pt_br: Se presente, impede que os modelos agrupados no SDK sejam apresentados.
ru: При наличии этого параметра шаблоны, входящие в пакет SDK, не будут представлены.
tr: Varsa, SDK'da paketlenmiş şablonların sunumlarını önler.
zh_hans: 如果存在，则阻止显示捆绑在 SDK 中的模板。
zh_hant: 如果存在，則會防止顯示 SDK 中套件組合的範本。

# DiscoveredTestsInAssembly
source: Discovered {0} tests in assembly
cs: Počet zjištěných testů v sestavení: {0}
de: Ermittelte {0} Tests in Assembly
es: {0} pruebas detectadas en el ensamblado
fr: {0} tests découverts dans l’assembly
it: {0} individuati nell'assembly
ja: アセンブリで {0} つのテストを検出しました。
ko: 어셈블리에서 {0}개의 테스트가 검색됨
pl: Odnaleziono testy ({0}) w zestawach
pt_br: Testes {0} descobertos no assembly
ru: Обнаружены тесты ({0}) в сборке.
tr: Derlemede {0} test bulundu
zh_hans: 在程序集中发现了 {0} 个测试
zh_hant: 已在組件中找到 {0} 個測試

source: Discovering tests from
cs: Zjišťování testů z
de: Tests ermitteln aus
es: Detección de pruebas de
fr: Découverte des tests à partir de
it: Individuazione di test da
ja: からテストを検出しています
ko: 다음에서 테스트 검색하는 중
pl: Odnajdywanie testów w
pt_br: Descobrindo testes de
ru: Обнаружение тестов из
tr: Testler şuradan bulunuyor:
zh_hans: 正在发现以下位置中的测试
zh_hant: 正在以下位置找測試

# DotnetTestCommand
source: .NET Test Command
cs: Testovací příkaz .NET
de: Testbefehl .NET
es: Comando de prueba de .NET
fr: Commande de test .NET
it: Comando di test .NET
ja: .NET Test コマンド
ko: .NET 테스트 명령
pl: Polecenie testowe platformy .NET
pt_br: Comando de Teste do .NET
ru: Команда .NET Test
tr: .NET Test Komutu
zh_hans: .NET 测试命令
zh_hant: .NET 測試命令

# DownloadToCacheOptionArgumentName
source: DIRECTORY
cs: ADRESÁŘ
de: VERZEICHNIS
es: DIRECTORIO
fr: RÉPERTOIRE
ja: ディレクトリ
ko: 디렉터리
pl: KATALOG
pt_br: DIRETÓRIO
ru: КАТАЛОГ
tr: DİZİN
zh_hans: 目录
zh_hant: 目錄

# DownloadToCacheOptionDescription
source: Download packages needed to install a workload to a folder that can be used for offline installation.
cs: Stáhněte si balíčky potřebné pro instalaci úlohy do složky, kterou je možné použít pro offline instalaci.
de: Laden Sie Pakete, die zum Installieren einer Workload erforderlich sind, in einen Ordner herunter, welcher für die Offlineinstallation verwendet werden kann.
es: Descargue los paquetes necesarios para instalar una carga de trabajo en una carpeta que se pueda usar para la instalación sin conexión.
fr: Télécharger les packages nécessaires à l’installation d’une charge de travail dans un dossier utilisable pour une installation hors connexion.
it: Scaricare i pacchetti necessari per installare un carico di lavoro in una cartella che può essere usata per l'installazione offline.
ja: ワークロードのインストールに必要なパッケージをフォルダーにダウンロードし、オフライン インストールに使用できるようにします。
ko: 오프라인 설치에 사용할 수 있는 폴더에 워크로드를 설치하는 데 필요한 패키지를 다운로드합니다.
pl: Pobierz pakiety potrzebne do zainstalowania obciążenia w folderze, którego można użyć do instalacji w trybie offline.
pt_br: Baixe os pacotes necessários para instalar uma carga de trabalho em uma pasta que pode ser usada para instalação offline.
ru: Скачайте пакеты, необходимые для установки рабочей нагрузки в папку, которую можно использовать для автономной установки.
tr: Çevrimdışı yükleme için kullanılabilecek bir klasöre iş yükü yüklemek için gereken paketleri indirin.
zh_hans: 将安装工作负载所需的程序包下载到可用于脱机安装的文件夹中。
zh_hant: 必須下載套件，以將工作負載安裝置至可用於離線安裝的資料夾中。

# DownloadingPackToCacheMessage
source: Downloading pack {0} version {1} to offline cache {2}...
cs: Probíhá stahování balíčku {0} verze {1} do offline mezipaměti {2}…
de: Das Paket "{0}", Version {1}, wird in den Offlinecache "{2}" heruntergeladen...
es: Descargando el paquete {0}, versión {1} a la caché sin conexión {2}...
fr: Téléchargement de la version du pack d' {0} de la {1} sur le cache hors connexion {2}...
it: Download del pacchetto {0}, versione {1}, nella cache offline {2}...
ja: パック {0} のバージョン {1} をオフライン キャッシュ {2} にダウンロードしています...
ko: 오프라인 캐시 {2}(으)로 팩 {0} 버전 {1}(을)를 다운로드하는 중...
pl: Trwa pobieranie paczki {0} w wersji {1} do pamięci podręcznej w trybie offline {2}...
pt_br: Baixando o pacote {0} versão {1} para o cache offline {2}...
ru: Загрузка пакета {0} версии {1} в автономный кэш {2}...
tr: {0} paketi sürüm{1}, {2} çevrimdışı önbelleğine indiriliyor...
zh_hans: 正在将包 {0} 版本 {1} 下载到脱机缓存 {2}...
zh_hant: 正在將套件 {0} 版本 {1} 下載到離線快取 {2}...

source: Downloads
cs: Soubory ke stažení
es: Descargas
fr: Téléchargements
it: Download
ja: ダウンロード
ko: 다운로드
pl: Pliki do pobrania
ru: Скачивания
tr: İndirmeler
zh_hans: 下载
zh_hant: 下載

# DuplicateCaseInsensitiveLaunchProfileNames
source: There are several launch profiles with case-sensitive names, which isn't permitted: {0} Make the profile names distinct.
cs: Existuje několik spouštěcích profilů s názvy rozlišujícími malá a velká písmena, což není povoleno: {0} Nastavte odlišné názvy profilů.
de: Es gibt mehrere Startprofile mit Namen, bei denen die Groß-/Kleinschreibung beachtet wird, was nicht zulässig ist: {0} Erstellen Sie eindeutige Profilnamen.
es: Hay varios perfiles de inicio con nombres que distinguen mayúsculas de minúsculas, lo que no está permitido: {0} Defina nombres de perfiles distintos.
fr: Il existe plusieurs profils de lancement avec des noms sensibles à la casse, ce qui n'est pas autorisé : {0} Faites en sorte que les noms de profil soient distincts.
it: Esistono diversi profili di avvio con nomi con distinzione tra maiuscole e minuscole, che non sono consentiti: {0} Rendi distinti i nomi profilo.
ja: 大文字と小文字が区別される名前の起動プロファイルがいくつかありますが、これは許可されていません: {0} プロファイル名を区別できるようにしてください。
ko: 대/소문자를 구분하는 이름을 가진 여러 시작 프로필이 있으며 이는 허용되지 않습니다. {0} 고유한 프로필 이름을 사용하세요.
pl: Istnieje kilka profilów uruchamiania z nazwami z uwzględnieniem wielkości liter, co jest niedozwolone: {0} Rozróżnij nazwy profilów.
pt_br: Existem vários perfis de inicialização com nomes que diferenciam maiúsculas de minúsculas, o que não é permitido: {0} Diferencie os nomes dos perfis.
ru: Существует несколько профилей, имена которых различаются только регистром, что запрещено: {0} Сделайте имена профилей разными.
tr: Adı büyük/küçük harfe duyarlı olan birkaç başlatma profili var ama bu duruma izin verilmiyor: {0} Lütfen profil adlarını değiştirin.
zh_hans: 存在多个名称区分大小写的启动配置文件，这是不允许的: {0} 将配置文件名称设为可区分的名称。
zh_hant: 數個啟動設定檔具有區分大小寫的名稱，這並不受允許: {0} 請讓設定檔名稱相異。

# DuplicateDirective
source: Duplicate directives are not supported: {0} at {1}
cs: Duplicitní direktivy nejsou podporovány: {0} v {1}
de: Doppelte Direktiven werden nicht unterstützt: {0} bei {1}.
es: No se admiten directivas duplicadas: {0} en {1}
fr: Les directives dupliquées ne sont pas prises en charge : {0} au {1}
it: Direttive duplicate non supportate: {0} in {1}
ja: 重複するディレクティブはサポートされていません: {1} の {0}
ko: 중복된 지시문은 지원되지 않습니다. {1}의 {0}.
pl: Zduplikowane dyrektywy nie są obsługiwane: {0} w lokalizacji {1}
pt_br: Não há suporte para diretivas duplicadas: {0} em {1}
ru: Повторяющиеся директивы не поддерживаются: {0} (файл, строка: {1})
tr: Yinelenen yönergeler desteklenmez: {1} konumunda {0}
zh_hans: 不支持重复指令: {1} 处的 {0}
zh_hant: 不支援重複的指示詞: {0} 位於 {1}

# Error_restore
source: Restore failed. Run `dotnet restore` for more details on the issue.
cs: Obnovení neproběhlo úspěšně. Další podrobnosti o problému získáte spuštěním příkazu dotnet restore.
de: Fehler beim Wiederherstellen. Führen Sie "dotnet restore" aus, um weitere Informationen zum Problem zu erhalten.
es: Error en la restauración. Ejecute "dotnet restore" para obtener más detalles sobre el problema.
fr: Échec de la restauration. Exécutez « dotnet restore » pour plus de détails sur le problème.
it: Ripristino non riuscito. Esegui 'dotnet restore' per altri dettagli sul problema.
ja: 復元に失敗しました。問題の詳細については、'dotnet restore' を実行してください。
ko: 복원하지 못했습니다. 문제에 대한 자세한 내용을 보려면 'dotnet restore'를 실행하세요.
pl: Błąd przywracania. Uruchom polecenie `dotnet restore`, aby uzyskać więcej informacji na temat problemu.
pt_br: Falha na restauração. Execute "dotnet restore" para obter mais detalhes sobre o problema.
ru: Провести восстановление не удалось. Для получения дополнительных сведений о проблеме выполните команду "dotnet restore".
tr: Geri yükleme başarısız oldu. Sorunla ilgili daha fazla bilgi için 'dotnet restore' çalıştırın.
zh_hans: 还原失败。运行 `dotnet restore` 以了解有关问题的更多详细信息。
zh_hant: 還原失敗。如需問題的詳細資料，請執行 'dotnet restore'。

# ExactMatchDescription
source: Require that the search term exactly match the name of the package. Causes `--take` and `--skip` options to be ignored.
cs: Vyžaduje, aby hledaný termín přesně odpovídal názvu balíčku. Způsobí, že se možnosti --take a --skip budou ignorovat.
de: Erfordert, dass der Suchbegriff genau dem Namen des Pakets entspricht. Führt dazu, dass die Optionen "--take" und "--skip" ignoriert werden.
es: Requiere que el término de búsqueda coincida exactamente con el nombre del paquete. Hace que se omitan las opciones '--take' y '--skip'.
fr: Exiger que le terme de recherche corresponde exactement au nom du package. Entraîne l’omission des options « --take » et « --skip ».
it: Richiedere che il termine di ricerca corrisponda esattamente al nome del pacchetto. Consente di ignorare le opzioni `--take` e `--skip`.
ja: 検索語句とパッケージ名の完全一致を要求します。'--take' オプションと '--skip' オプションが無視されます。
ko: 검색 용어가 패키지 이름과 정확히 일치해야 합니다. '--take' 및 '--skip' 옵션을 무시합니다.
pl: Wymagaj, aby wyszukiwany termin dokładnie odpowiadał nazwie pakietu. Powoduje ignorowanie opcji „--take” i „--skip”.
pt_br: Requer que o termo de pesquisa corresponda exatamente ao nome do pacote. Faz com que as opções ''--take'' e ''--skip'' sejam ignoradas.
ru: Запросить, чтобы поисковый запрос точно соответствовал названию пакета. Приводит к игнорированию опций `--take` и `--skip`.
tr: Arama teriminin, paketin adıyla tam olarak eşleşmesini gerektir. “--take” ve “--skip” seçeneklerinin yoksayılmasına neden olur.
zh_hans: 要求搜索词与包的名称完全匹配。导致忽略`--take`和`--skip`选项。
zh_hant: 要求搜尋字詞與套件名稱完全相符。導致忽略 `--take` 和 `--skip` 選項。

# ExecutionUsageDescription
source: Execute a .NET application.
cs: Spustí aplikaci .NET.
de: Hiermit wird eine .NET-Anwendung ausgeführt.
es: Ejecute una aplicación de .NET.
fr: Exécutez une application .NET.
it: Esegue un'applicazione .NET.
ja: .NET アプリケーションを実行します。
ko: .NET 애플리케이션을 실행합니다.
pl: Wykonaj aplikację platformy .NET.
pt_br: Execute um aplicativo do .NET.
ru: Запуск приложения .NET.
tr: .NET uygulaması yürütün.
zh_hans: 执行 .NET 应用程序。
zh_hant: 執行 .NET 應用程式。

source: Exit code
cs: Ukončovací kód
es: Código de salida
fr: Code de sortie
it: Codice di uscita
ja: 終了コード
ko: 종료 코드
pl: Kod zakończenia
pt_br: Código de saída
ru: Код завершения
tr: Çıkış kodu
zh_hans: 退出代码
zh_hant: 結束代碼

source: Expected
cs: Očekáváno
de: Erwartet
es: Se esperaba
fr: Attendu
it: Previsto
ja: 予想
ko: 필요
pl: Oczekiwane
pt_br: Esperado
ru: Ожидалось
tr: Beklenen
zh_hans: 预期
zh_hant: 預期

# ExpectedSingleManifest
source: Expected single manifest feature band and manifest folder in MSI from package {0}
cs: Z balíčku {0} se očekávalo jedno pásmo funkce manifestu a složka manifestu ve službě MSI.
de: Einzelnes Manifestfeatureband und Manifestordner in MSI aus Paket {0} erwartet
es: Se esperaba una banda de características de manifiesto único y una carpeta de manifiesto en MSI desde el paquete {0}
fr: Bande de fonctionnalités de manifeste unique et dossier manifeste attendus dans MSI à partir du package {0}
it: È prevista una singola banda di funzionalità del manifesto e una cartella del manifesto nell'identità del servizio gestito dal pacchetto {0}
ja: パッケージ {0} からの MSI に 1 つのマニフェスト機能バンドとマニフェスト フォルダーが必要です
ko: 패키지 {0}의 MSI에 단일 매니페스트 기능 밴드 및 매니페스트 폴더가 필요합니다.
pl: Oczekiwano pasma funkcji pojedynczego manifestu i folderu manifestu w pliku MSI z pakietu {0}
pt_br: Espera-se a faixa de recurso de manifesto único e a pasta de manifesto no MSI do pacote {0}
ru: Из пакета {0} ожидается один диапазон функций манифеста и папка манифеста в MSI
tr: MSI'da {0} paketinden tek bildirim özellik bandı ve bildirim klasörü bekleniyor
zh_hans: 包 {0} 的 MSI 中应有单个清单功能区段和清单文件夹。
zh_hant: MSI 中的預期單一資訊清單級區和資訊清單資料夾來自套件 {0}

source: Failed
cs: Neúspěšné
de: Fehler
es: Error
fr: Échec
it: Non superato
ja: 失敗
ko: 실패
pl: Niepowodzenie
pt_br: Falhou
ru: Сбой
tr: Başarısız
zh_hans: 失败
zh_hant: 失敗

# FailedAdManifestUpdate
source: Failed to update the advertising manifest {0}: {1}.
cs: Nepovedlo se aktualizovat manifest reklamy {0}: {1}.
de: Fehler beim Aktualisieren des Ankündigungsmanifests "{0}": {1}.
es: No se pudo actualizar el manifiesto publicitario {0}: {1}.
fr: Échec de la mise à jour du manifeste de publicité {0} : {1}.
it: Non è stato possibile scaricare il manifesto di pubblicità {0}: {1}.
ja: 広告マニフェスト {0} を更新できませんでした: {1}。
ko: 광고 매니페스트 {0}: {1}을(를) 업데이트하지 못했습니다.
pl: Nie można zaktualizować manifestu anonsowania {0}: {1}.
pt_br: Falha ao atualizar o manifesto de publicidade {0}: {1}.
ru: Не удалось обновить манифест рекламы {0}: {1}.
tr: Reklam bildirimi {0} güncelleştirilemedi: {1}.
zh_hans: 未能更新广告清单 {0}: {1}。
zh_hant: 無法更新廣告資訊清單 {0}: {1}。

# FailedLowercase
source: failed
cs: selhalo
de: fehlerhaft
es: con errores
fr: échec
it: operazione non riuscita
ja: 失敗
ko: 실패
pl: zakończone niepowodzeniem
pt_br: com falha
ru: сбой
tr: başarısız
zh_hans: 失败
zh_hant: 已失敗

# FailedToCreateToolShim
source: Failed to create shell shim for tool '{0}': {1}
cs: Pro nástroj {0} se nepodařilo vytvořit překrytí prostředí: {1}.
de: Fehler beim Erstellen des Shell-Shims für das Tool "{0}": {1}
es: No se pudieron crear correcciones de compatibilidad (shim) de shell para la herramienta "{0}": {1}
fr: Échec de création d'un shim d'environnement pour l'outil '{0}' : {1}
it: Non è stato possibile creare lo shim della shell per lo strumento '{0}': {1}
ja: ツール '{0}' でシェル shim を作成できませんでした: {1}
ko: '{0}' 도구에 대해 셸 shim을 만들지 못했습니다. {1}
pl: Nie można utworzyć podkładki powłoki dla narzędzia „{0}”: {1}
pt_br: Falha ao criar o shim do shell para a ferramenta '{0}': {1}
ru: Не удалось создать оболочку совместимости для инструмента "{0}": {1}
tr: '{0}' aracı için kabuk dolgusu oluşturulamadı: {1}
zh_hans: 无法为工具“{0}”创建 shell 填充程序: {1}
zh_hant: 無法為工具 '{0}' 建立殼層填充碼: {1}

# FailedToExtractMsi
source: Failed to extract information from MSI: {0}
cs: Nepovedlo se extrahovat informace z MSI: {0}
de: Fehler beim Extrahieren von Informationen aus MSI: {0}
es: No se pudo extraer información de MSI: {0}
fr: Échec de l’extraction des informations de MSI : {0}
it: Impossibile estrarre informazioni dall'identità del servizio gestito: {0}
ja: MSI から情報を抽出できませんでした: {0}
ko: MSI에서 정보를 추출하지 못했습니다. {0}
pl: Nie można wyodrębnić informacji z pliku MSI: {0}
pt_br: Falha ao extrair informações do MSI: {0}
ru: Не удалось извлечь информацию из MSI: {0}
tr: MSI'dan bilgi ayıklanamadı: {0}
zh_hans: 无法从 MSI 中提取信息: {0}
zh_hant: 無法從 MSI 擷取資訊: {0}
