Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CmdInvalidSolutionFileExtensionErrorDescription
source: The provided solution file has an invalid extension: {0}.
cs: Poskytnutý soubor řešení má neplatnou příponu: {0}.
de: Die angegebene Projektmappendatei weist eine ungültige Erweiterung auf: {0}.
es: El archivo de solución proporcionado tiene una extensión no válida: {0}.
fr: Le fichier solution fourni a une extension non valide : {0}.
it: L'estensione del file soluzione fornito non è valida: {0}.
ja: 指定されたソリューション ファイルの拡張子が無効です: {0}。
ko: 제공된 솔루션 파일의 확장명이 잘못되었습니다. {0}.
pl: Podany plik rozwiązania ma nieprawidłowe rozszerzenie: {0}.
pt_br: O arquivo de solução fornecido tem uma extensão inválida: {0}.
ru: Указанный файл решения имеет недопустимое расширение: {0}.
tr: Sağlanan çözüm dosyasının uzantısı geçersiz: {0}.
zh_hans: 提供的解决方案文件具有无效的扩展名: {0}。
zh_hant: 提供的解決方案檔案的副檔名無效: {0}。

# CmdListTestsDescription
source: List the discovered tests instead of running the tests.
cs: Místo spuštění testů vypíše seznam zjištěných testů.
de: Hiermit werden die gefundenen Tests aufgelistet, anstatt sie auszuführen.
es: Enumera las pruebas detectadas en vez de ejecutar las pruebas.
fr: Listez les tests découverts au lieu d'exécuter les tests.
it: Elenca i testi individuati invece di eseguirli.
ja: テストを実行する代わりに、検出されたテストを一覧表示します。
ko: 테스트 실행 대신 검색한 테스트를 나열합니다.
pl: Wyświetl listę odnalezionych testów zamiast uruchamiać testy.
pt_br: Listar os testes detectados em vez de executar os testes.
ru: Вывод списка обнаруженных тестов вместо выполнения тестов.
tr: Testleri çalıştırmak yerine bulunan testleri listeler.
zh_hans: 列出已发现的测试，而不是运行测试。
zh_hant: 列出探索到的測試，而非執行測試。

# CmdLockFilePathOptionDescription
source: Output location where project lock file is written. By default, this is 'PROJECT_ROOT\packages.lock.json'.
cs: Výstupní umístění, kde je zapsán soubor zámku projektu. Ve výchozím nastavení jde o PROJECT_ROOT\packages.lock.json.
de: Das Ausgabeverzeichnis, in das die Projektsperrdatei geschrieben werden soll. Standardmäßig ist dies "PROJECT_ROOT\packages.lock.json".
es: Destino de salida donde se escribe el archivo de bloqueo del proyecto. De forma predeterminada, esto es "PROJECT_ROOT\packages.lock.json".
fr: Emplacement de sortie où le fichier de verrouillage du projet est écrit. Par défaut, le chemin est « PROJECT_ROOT\packages.lock.json ».
it: Percorso di output in cui viene scritto il file di blocco del progetto. Per impostazione predefinita è 'RADICE_PROGETTO\packages.lock.json'.
ja: プロジェクト ロック ファイルの書き込み先の出力場所。既定では、これは 'PROJECT_ROOT\packages.lock.json' です。
ko: 프로젝트 잠금 파일이 작성되는 출력 위치입니다. 기본적으로 'PROJECT_ROOT\packages.lock.json'입니다.
pl: Lokalizacja danych wyjściowych, w której zapisywany jest plik blokady projektu. Domyślnie jest to „PROJECT_ROOT\packages.lock.json”.
pt_br: Local de saída, onde o arquivo de bloqueio projeto é gravado. Por padrão, isso é 'PROJECT_ROOT\packages.lock.json'.
ru: Выходное расположение, в которое записывается файл блокировки проекта. По умолчанию это "PROJECT_ROOT\packages.lock.json".
tr: Proje kilit dosyasının yazıldığı çıkış konumu. Varsayılan değeri 'PROJECT_ROOT\packages.lock.json' şeklindedir.
zh_hans: 写入项目锁定文件的输出位置。默认情况下, 此位置为 "PROJECT_ROOT\packages.lock.json"。
zh_hant: 專案鎖定檔案所寫入的輸出位置。預設為 'PROJECT_ROOT\packages.lock.json'。

# CmdLockedModeOptionDescription
source: Don't allow updating project lock file.
cs: Nepovolí aktualizaci souboru zámku projektu.
de: Lassen Sie keine Aktualisierung der Projektsperrdatei zu.
es: No permite actualizar el archivo de bloqueo del proyecto.
fr: Ne pas autoriser la mise à jour du fichier de verrouillage du projet.
it: Non consentire l'aggiornamento del file di blocco del progetto.
ja: プロジェクト ロック ファイルの更新は許可されません。
ko: 프로젝트 잠금 파일 업데이트를 허용하지 않습니다.
pl: Nie zezwalaj na aktualizowanie pliku blokady projektu.
pt_br: Não permitir atualizar o arquivo de bloqueio do projeto.
ru: Не разрешать обновление файла блокировки проекта.
tr: Proje kilit dosyasının güncelleştirilmesine izin verme.
zh_hans: 不允许更新项目锁定文件。
zh_hant: 不允許更新專案鎖定檔案。

# CmdLoggerDescription
source: The logger to use for test results. Examples: Log in trx format using a unique file name: --logger trx Log in trx format using the specified file name: --logger "trx;LogFileName=<TestResults.trx>" See https://aka.ms/vstest-report for more information on logger arguments.
cs: Protokolovací nástroj, který se má použít pro výsledky testování. Příklady: Protokolování ve formátu trx s jedinečným názvem souboru: --logger trx Protokolování ve formátu trx se zadaným názvem souboru: --logger "trx;LogFileName=<TestResults.trx>" Další informace o argumentech protokolovacího nástroje najdete na adrese https://aka.ms/vstest-report.
de: Die für Testergebnisse zu verwendende Protokollierung. Beispiele: Protokollierung im TRX-Format mit einem eindeutigen Dateinamen: --logger trx Protokollierung im TRX-Format mit dem angegebenen Dateinamen: --logger "trx;LogFileName=<TestResults.trx>" Weitere Informationen zu Protokollierungsargumenten finden Sie unter https://aka.ms/vstest-report.
es: Registrador que se va a usar para los resultados de pruebas. Ejemplos: Registrar en formato trx con un nombre de archivo único: --logger trx Registrar en formato trx con el nombre de archivo especificado: --logger "trx;LogFileName=<ResultadosPruebas.trx>" Consulte https://aka.ms/vstest-report para obtener más información sobre los argumentos del registrador.
fr: Journaliseur à utiliser pour les résultats des tests. Exemples : Journal au format trx avec un nom de fichier unique : --logger trx Journal au format trx avec le nom de fichier spécifié : --logger "trx;LogFileName=<TestResults.trx>" Pour plus d'informations sur les arguments du journaliseur, consultez https://aka.ms/vstest-report.
it: Logger da usare per i risultati dei test. Esempi: Log in formato trx con nome file univoco: --logger trx Log in formato trx con il nome file specificato: --logger "trx;LogFileName=<TestResults.trx>" Per altre informazioni sugli argomenti del logger, vedere https://aka.ms/vstest-report.
ja: テスト結果に使用するロガー。 例: 一意のファイル名を使用する trx 形式のログ: --logger trx 指定されたファイル名を使用する trx 形式のログ: --logger "trx;LogFileName=<TestResults.trx>" ロガーの引数に関する詳細情報は、https://aka.ms/vstest-report を参照してください。
ko: 테스트 결과에 사용할 로거입니다. 예: 고유한 파일 이름을 사용하여 trx 형식으로 기록합니다. --logger trx 지정된 파일 이름을 사용하여 trx 형식으로 기록합니다. --logger "trx;LogFileName=<TestResults.trx>" 로거 인수에 대한 자세한 내용은 https://aka.ms/vstest-report를 참조하세요.
pl: Rejestrator do użycia na potrzeby wyników testów. Przykłady: Rejestruj w formacie trx z użyciem unikatowej nazwy pliku: --logger trx Rejestruj w formacie trx z użyciem podanej nazwy pliku: --logger "trx;LogFileName=<TestResults.trx>" Zobacz https://aka.ms/vstest-report, aby uzyskać więcej informacji na temat argumentów rejestratora.
pt_br: O agente a ser usado para os resultados de teste. Exemplos: Registre em log no formato trx usando um nome de arquivo exclusivo: --logger trx Registre em log no formato trx usando o nome de arquivo especificado: --logger "trx;LogFileName=<TestResults.trx>" Confira https://aka.ms/vstest-report para obter mais informações sobre os argumentos do agente.
ru: Средство ведения журнала для результатов теста. Примеры: Журнал в формате TRX с использованием уникального имени файла: --logger trx Журнал в формате TRX с использованием заданного имени файла: --logger "trx;LogFileName=<TestResults.trx>" Дополнительные сведения об аргументах средства ведения журнала см. в https://aka.ms/vstest-report.
tr: Test sonuçları için kullanılacak günlükçü. Örnekler: Benzersiz bir dosya adı kullanarak trx biçiminde günlüğe kaydedin: --logger trx Belirtilen dosya adını kullanarak trx biçiminde günlüğe kaydedin: --logger "trx;LogFileName=<TestResults.trx>" Günlükçü bağımsız değişkenleri hakkında daha fazla bilgi için bkz. https://aka.ms/vstest-report.
zh_hans: 要用于测试结果的记录器。 示例: 使用唯一的文件名登录 trx 格式: --记录器 trx 使用指定的文件名登录 trx 格式: --记录器 "trx;LogFileName=<TestResults.trx>" 有关记录器参数的详细信息，请参阅 https://aka.ms/vstest-report。
zh_hant: 用於測試結果的記錄器。 範例: 使用獨特的檔案名稱登入 trx 格式: --logger trx 使用指定的檔案名稱登入 trx 格式: --logger "trx;LogFileName=<TestResults.trx>" 如需了解記錄器引數的詳細資訊，請參閱 https://aka.ms/vstest-report。

# CmdMSBuildProjectsPropertiesErrorDescription
source: Get projects properties with MSBuild didn't execute properly with exit code: {0}.
cs: Získání vlastností projektů pomocí nástroje MSBuild nebylo správně spuštěno s ukončovacím kódem: {0}.
de: Das Abrufen von Projekteigenschaften mit MSBuild wurde nicht ordnungsgemäß ausgeführt. Exitcode: {0}.
es: La obtención de propiedades de proyectos con MSBuild no se ejecutó correctamente con el código de salida: {0}.
fr: L’obtention des propriétés des projets avec MSBuild ne s’est pas exécutée correctement avec le code de sortie : {0}.
it: Il recupero delle proprietà dei progetti con MSBuild non è stato eseguito correttamente, con il codice di uscita: {0}.
ja: MSBuild でのプロジェクトプロパティの取得が正しく実行されませんでした。終了コード: {0}。
ko: MSBuild를 사용하여 프로젝트 가져오기 속성이 종료 코드에서 제대로 실행되지 않았습니다. {0}.
pl: Pobieranie właściwości projektów za pomocą programu MSBuild nie zostało poprawnie wykonane z kodem zakończenia: {0}.
pt_br: As propriedades de obtenção de projetos com o MSBuild não foram executadas corretamente com o código de saída: {0}.
ru: Получение свойств проектов с помощью MSBuild сработало не так, как ожидалось, код завершения: {0}.
tr: MSBuild ile proje özelliklerini al işlemi {0} çıkış koduyla çıkarak düzgün şekilde çalışmadı.
zh_hans: 使用 MSBuild 获取项目属性未正确执行，退出代码为: {0}。
zh_hant: 使用 MSBuild 取得專案屬性時未正確執行，結束代碼為: {0}。

# CmdMaxParallelTestModulesDescription
source: The max number of test modules that can run in parallel.
cs: Maximální počet testovacích modulů, které je možné spustit paralelně.
de: Die maximale Anzahl von Testmodulen, die parallel ausgeführt werden können.
es: Número máximo de módulos de prueba que se pueden ejecutar en paralelo.
fr: Nombre maximal de modules de test qui peuvent s’exécuter en parallèle.
it: Numero massimo di moduli di test che possono essere eseguiti in parallelo.
ja: 並列で実行できるテスト モジュールの最大数。
ko: 병렬로 실행할 수 있는 최대 테스트 모듈 수입니다.
pl: Maksymalna liczba modułów testowych, które mogą być uruchamiane równolegle.
pt_br: O número máximo de módulos de teste que podem ser executados em paralelo.
ru: Максимальное число тестовых модулей, которые могут выполняться параллельно.
tr: Paralel olarak çalıştırılabilecek test modüllerinin maksimum sayısı.
zh_hans: 可并行运行的测试模块的最大数目。
zh_hant: 可平行執行的測試模組數目上限。

# CmdMultipleBuildPathOptionsErrorDescription
source: Specify either the project, solution, directory, or test modules option.
cs: Zadejte parametr projektu, řešení, adresáře nebo testovacích modulů.
de: Geben Sie entweder die Option "Projekt", "Projektmappe", "Verzeichnis" oder "Testmodule" an.
es: Especifique la opción de módulos de proyecto, solución, directorio o prueba.
fr: Spécifiez l'option des modules de projet, de solution, de répertoire ou de test.
it: Specifica l'opzione progetto, soluzione, directory o moduli di test.
ja: プロジェクト、ソリューション、ディレクトリ、またはテスト モジュールのオプションを指定してください。
ko: 프로젝트, 솔루션, 디렉터리 또는 테스트 모듈 옵션을 지정하세요.
pl: Określ opcję projektu, rozwiązania, katalogu lub modułów testowych.
pt_br: Especifique a opção de módulos de projeto, solução, diretório ou teste.
ru: Укажите проект, решение, каталог или опцию тестового модуля.
tr: Proje, çözüm, dizin veya test modülleri seçeneklerinden birini seçin.
zh_hans: 指定项目、解决方案、目录或测试模块选项。
zh_hant: 指定專案、解決方案、目錄或測試模組選項。

# CmdMultipleProjectOrSolutionFilesErrorDescription
source: Specify which project or solution file to use because this folder contains more than one project or solution file.
cs: Určete, který soubor projektu nebo řešení se má použít, protože tato složka obsahuje více než jeden soubor projektu nebo řešení.
de: Geben Sie an, welches Projekt oder welche Projektmappendatei verwendet werden soll, da dieser Ordner mehrere Projekt- oder Projektmappendateien enthält.
es: Especifique el archivo de proyecto o solución que se va a usar porque esta carpeta contiene más de un proyecto o archivo de solución.
fr: Spécifiez le fichier projet ou le fichier solution à utiliser, car ce dossier en contient plusieurs.
it: Specificare quale file progetto o soluzione usare perché questa cartella contiene più file progetto o soluzione.
ja: このフォルダーは 2 つ以上のプロジェクト ファイルまたはソリューション ファイルを含んでいるため、使用するプロジェクト ファイルまたはソリューション ファイルを指定してください。
ko: 이 폴더에 프로젝트 또는 솔루션 파일이 두 개 이상 있으므로 사용할 프로젝트 또는 솔루션 파일을 지정하세요.
pl: Określ plik projektu lub rozwiązania do użycia, ponieważ ten folder zawiera więcej niż jeden plik projektu lub rozwiązania.
pt_br: Especifique qual arquivo de projeto ou solução usar porque essa pasta contém mais de um arquivo de projeto ou solução.
ru: Укажите, какой файл проекта или решения необходимо использовать, так как в папке содержится несколько файлов проектов или решений.
tr: Bu klasör birden fazla proje veya çözüm dosyası içerdiğinden, hangi projenin veya çözüm dosyasının kullanılacağını belirtin.
zh_hans: 请指定要使用的项目或解决方案文件，因为此文件夹包含多个项目或解决方案文件。
zh_hant: 指定要使用哪個專案檔或解決方案檔案，因為此資料夾包含一個以上的專案檔或解決方案檔案。

# CmdNoAnsiDescription
source: Disable ANSI output.
cs: Zakáže výstup ANSI.
de: Deaktivieren Sie die ANSI-Ausgabe.
es: Deshabilite la salida ANSI.
fr: Désactivez la sortie ANSI.
it: Disabilita l'output ANSI.
ja: ANSI 出力を無効にします。
ko: ANSI 출력을 비활성화합니다.
pl: Wyłącz dane wyjściowe ANSI.
pt_br: Desabilite a saída ANSI.
ru: Отключить вывод ANSI.
tr: ANSI çıkışını devre dışı bırakın.
zh_hans: 禁用 ANSI 输出。
zh_hant: 停用 ANSI 輸出。

# CmdNoBuildDescription
source: Do not build the project before testing. Implies --no-restore.
cs: Nesestavujte projekt, dokud ho neotestujete. Implikuje možnost --no-restore.
de: Erstellt das Projekt nicht vor dem Testen. Impliziert "--no-restore".
es: No compile el proyecto antes de probarlo. Implica --no-restore.
fr: Ne pas générer le projet avant les tests. Implique --no-restore.
it: Non compila il progetto prima del test. Implica --no-restore.
ja: テストする前にプロジェクトをビルドしないでください。--no-restore を意味します。
ko: 테스트하기 전에 프로젝트를 빌드하지 않습니다. 복원 없음을 의미합니다.
pl: Nie kompiluj tego projektu przed testowaniem. Powoduje przyjęcie, że podano parametr --no-restore.
pt_br: Não compile o projeto antes de testar. Implica em --no-restore.
ru: Сборка проекта перед тестированием не выполняется. Подразумевает --no-restore.
tr: Test etmeden önce projeyi derlemeyin. --no-restore anlamına gelir.
zh_hans: 测试之前不要生成项目。Implies --no-restore.
zh_hant: 請勿在測試之前建置專案。提示：-no-restore。

# CmdNoBuildOptionDescription
source: Do not build the project before packing. Implies --no-restore.
cs: Nesestavujte projekt, dokud ho nezabalíte. Implikuje možnost --no-restore.
de: Erstellt das Projekt nicht vor dem Paketieren. Impliziert "--no-restore".
es: No compile el proyecto antes de empaquetarlo. Implica --no-restore.
fr: Ne pas générer le projet avant la compression. Implique --no-restore.
it: Non compila il progetto prima della creazione del pacchetto. Implica --no-restore.
ja: パックする前にプロジェクトをビルドしないでください。--no-restore を意味します。
ko: 압축하기 전에 프로젝트를 빌드하지 않습니다. 복원 없음을 의미합니다.
pl: Nie kompiluj tego projektu przed pakowaniem. Powoduje przyjęcie, że podano parametr --no-restore.
pt_br: Não compile o projeto antes de empacotar. Implica em --no-restore.
ru: Сборка проекта перед упаковкой не выполняется. Подразумевает --no-restore.
tr: Paketlemeden önce projeyi derlemeyin. --no-restore anlamına gelir.
zh_hans: 打包之前不要生成项目。Implies --no-restore.
zh_hant: 請勿在封裝之前建置專案。提示: -no-restore.

# CmdNoCacheOptionDescription
source: Do not cache packages and http requests.
cs: Neukládat balíčky a požadavky http do mezipaměti
de: Pakete und HTTP-Anforderungen nicht zwischenspeichern.
es: Indica que no se almacenen en caché los paquetes ni las solicitudes HTTP.
fr: Ne mettez pas en cache les packages et les requêtes HTTP.
it: Non memorizza nella cache pacchetti e richieste HTTP.
ja: パッケージと HTTP 要求はキャッシュしません。
ko: 패키지 및 http 요청을 캐시하지 않습니다.
pl: Nie przechowuj w pamięci podręcznej pakietów ani żądań HTTP.
pt_br: Não armazenar pacotes e solicitações HTTP em cache.
ru: Не кэшировать пакеты и HTTP-запросы.
tr: Paketleri ve http isteklerini önbelleğe almayın.
zh_hans: 不要缓存包和 HTTP 请求。
zh_hant: 請勿快取套件和 HTTP 要求。

# CmdNoDependenciesOptionDescription
source: Do not restore project-to-project references and only restore the specified project.
cs: Neobnoví odkazy mezi projekty a obnoví jen konkrétní projekt.
de: Hiermit werden keine Projekt-zu-Projekt-Verweise wiederhergestellt, sondern nur das angegebene Projekt.
es: No restaure referencias de proyecto a proyecto y restaure solo el proyecto especificado.
fr: Ne restaurez pas les références de projet à projet, et restaurez uniquement le projet spécifié.
it: Non ripristina i riferimenti P2P (da progetto a progetto) e ripristina solo il progetto specificato.
ja: プロジェクト間参照を復元せず、指定したプロジェクトだけを復元します。
ko: p2p(프로젝트 간) 참조를 복원하지 않고 지정한 프로젝트만 복원합니다.
pl: Nie przywracaj odwołań między projektami i przywróć tylko określony projekt.
pt_br: Não restaure referências de projeto para projeto e restaure somente o projeto especificado.
ru: Не восстанавливать ссылки между проектами и восстановить только указанный проект.
tr: Projeden projeye başvuruları geri yüklemez ve yalnızca belirtilen projeyi geri yükler.
zh_hans: 请勿还原项目到项目引用，仅还原指定项目。
zh_hant: 請勿還原專案對專案的參考，而只還原指定的專案。

# CmdNoHttpCacheOptionDescription
source: Disable Http Caching for packages.
cs: Zakázat ukládání do mezipaměti HTTP pro balíčky.
de: Deaktivieren die HTTP-Zwischenspeicherung für Pakete.
es: Deshabilitar el almacenamiento en caché HTTP para los paquetes.
fr: Désactiver la mise en cache HTTP pour les packages.
it: Disabilitare la memorizzazione nella cache HTTP per i pacchetti.
ja: パッケージの HTTP キャッシュを無効にします。
ko: 패키지에 대해 HTTP 캐싱을 사용하지 않도록 설정합니다.
pl: Wyłącz buforowanie HTTP dla pakietów.
pt_br: Desabilitar Cache HTTP para pacotes.
ru: Отключить кэширование HTTP для пакетов.
tr: Paketler için Http Önbelleğe Almayı devre dışı bırakın.
zh_hans: 禁用包的 Http 缓存。
zh_hant: 停用套件的 HTTP 快取。

# CmdNoProgressDescription
source: Disable progress reporting.
cs: Umožňuje zakázat hlášení o průběhu.
de: Statusberichte deaktivieren.
es: Deshabilite los informes de progreso.
fr: Désactiver les rapports d'avancement.
it: Disabilita i report sullo stato.
ja: 進行状況レポートを無効にします。
ko: 진행률 보고를 비활성화합니다.
pl: Wyłącz raportowanie postępu.
pt_br: Desabilite o relatório de progresso.
ru: Отключить отчеты о ходе выполнения.
tr: İlerleme raporlamasını devre dışı bırakın.
zh_hans: 禁用进度报告。
zh_hant: 停用進度報告。

# CmdNoProjectOrSolutionFileErrorDescription
source: Specify a project or solution file. The current working directory does not contain a project or solution file.
cs: Určete soubor projektu nebo řešení. Aktuální pracovní adresář neobsahuje soubor projektu ani řešení.
de: Geben Sie eine Projekt- oder Projektmappendatei an. Das aktuelle Arbeitsverzeichnis enthält keine Projekt- oder Projektmappendatei.
es: Especifique un archivo de proyecto o solución. El directorio de trabajo actual no contiene uno de estos archivos.
fr: Spécifiez un fichier projet ou un fichier solution. Le répertoire de travail actuel ne contient aucun fichier projet ou fichier solution.
it: Specifica un file progetto o soluzione. La directory di lavoro corrente non contiene alcun file progetto o soluzione.
ja: プロジェクト ファイルまたはソリューション ファイルを指定してください。現在の作業ディレクトリにはプロジェクト ファイルまたはソリューション ファイルが含まれていません。
ko: 프로젝트 또는 솔루션 파일을 지정하세요. 현재 작업 디렉터리에 프로젝트 또는 솔루션 파일이 없습니다.
pl: Określ plik projektu lub rozwiązania. Bieżący katalog roboczy nie zawiera pliku projektu ani pliku rozwiązania.
pt_br: Especifique um arquivo de solução ou de projeto. O diretório de trabalho atual não contém um arquivo de projeto ou solução.
ru: Укажите файл проекта или решения. Текущий рабочий каталог не содержит ни файла проекта, ни файла решения.
tr: Bir proje veya çözüm dosyası belirtin. Geçerli çalışma dizini, bir proje veya çözüm dosyası içermiyor.
zh_hans: 请指定项目或解决方案文件。当前工作目录不包含任何项目或解决方案文件。
zh_hant: 指定專案或解決方案檔案。目前的工作目錄並未包含專案或解決方案檔案。

# CmdNoRestoreDescription
source: Do not restore before running the command.
cs: Před spuštěním příkazu neprovádějte obnovu.
de: Führen Sie die Wiederherstellung nicht aus, bevor Sie den Befehl ausführen.
es: No restaure antes de ejecutar el comando.
fr: Ne pas restaurer avant d’exécuter la commande.
it: Non ripristinare prima di eseguire il comando.
ja: コマンドを実行する前に復元しないでください。
ko: 명령을 실행하기 전에 복원하지 마세요.
pl: Nie przywracaj przed uruchomieniem polecenia.
pt_br: Não restaure antes de executar o comando.
ru: Не восстанавливать перед выполнением команды.
tr: Komutu çalıştırmadan önce geri yükleme işlemi yapmayın.
zh_hans: 不要在运行命令之前还原。
zh_hant: 執行命令之前請勿還原。

# CmdNoTestModulesErrorDescription
source: No test modules found for the given test module pattern: {0} with root directory: {1}
cs: Pro daný vzor testovacího modulu se nenašly žádné testovací moduly: {0} s kořenovým adresářem: {1}
de: Für das angegebene Testmodulmuster wurden keine Testmodule gefunden: {0} mit Stammverzeichnis: {1}.
es: No se encontraron módulos de prueba para el patrón de módulo de prueba dado: {0} con el directorio raíz: {1}
fr: Modules de test introuvables pour le modèle de module de test donné : {0} avec le répertoire racine : {1}
it: Non sono stati trovati moduli di test per il modello di modulo di test specificato: {0} con directory radice: {1}
ja: ルート ディレクトリが {1} で、指定されたテスト モジュール パターン {0} のテスト モジュールが見つかりませんでした:
ko: 루트 디렉터리: {1}이(가) 있는 지정된 테스트 모듈 패턴 {0}에 대한 테스트 모듈을 찾을 수 없습니다.
pl: Nie znaleziono modułów testowych dla danego wzorca modułu testowego: {0} z katalogiem głównym: {1}
pt_br: Nenhum módulo de teste encontrado para o padrão de módulo de teste fornecido: {0} com diretório raiz: {1}
ru: Не найдены тестовые модули для указанного шаблона тестового модуля: {0} с корневым каталогом: {1}
tr: {1} kök dizininde belirtilen test modülü deseni için herhangi bir test modülü bulunamadı: {0}
zh_hans: 找不到给定测试模块模式的测试模块: {0}，根目录为: {1}
zh_hant: 找不到指定測試模組模式的測試模組: {0}，根目錄為: {1}

# CmdNonExistentDirectoryErrorDescription
source: The provided directory path does not exist: {0}.
cs: Zadaná cesta k adresáři neexistuje: {0}.
de: Der angegebene Verzeichnispfad ist nicht vorhanden: {0}.
es: La ruta de acceso al directorio proporcionada no existe: {0}.
fr: Le chemin d’accès du répertoire fourni n’existe pas : {0}.
it: Il percorso della directory selezionato non esiste: {0}.
ja: 指定されたディレクトリ パスが存在しません: {0}。
ko: 제공된 디렉터리 경로가 없습니다. {0}
pl: Podana ścieżka katalogu nie istnieje: {0}.
pt_br: O caminho de diretório fornecido não existe: {0}.
ru: Указанный путь к каталогу не существует: {0}.
tr: Sağlanan dizin yolu mevcut değil: {0}.
zh_hans: 提供的目录路径不存在: {0}。
zh_hant: 提供的目錄路徑不存在: {0}。

# CmdNonExistentFileErrorDescription
source: The provided file path does not exist: {0}.
cs: Zadaná cesta k souboru neexistuje: {0}.
de: Der angegebene Dateipfad ist nicht vorhanden: {0}.
es: La ruta de acceso al archivo proporcionada no existe: {0}.
fr: Le chemin d’accès au fichier fourni n’existe pas : {0}.
it: Il percorso del file fornito non esiste: {0}.
ja: 指定されたファイル パスが存在しません: {0}。
ko: 제공된 파일 경로가 존재하지 않습니다. {0}.
pl: Podana ścieżka pliku nie istnieje: {0}.
pt_br: O caminho do arquivo fornecido não existe: {0}.
ru: Указанный путь к файлу не существует: {0}.
tr: Sağlanan dosya yolu mevcut değil: {0}.
zh_hans: 提供的文件路径不存在: {0}。
zh_hant: 提供的檔案路徑不存在: {0}。
