Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CmdNonExistentRootDirectoryErrorDescription
source: The provided root directory does not exist: {0}.
cs: Zadaný kořenový adresář neexistuje: {0}.
de: Das angegebene Stammverzeichnis ist nicht vorhanden: {0}.
es: El directorio raíz proporcionado no existe: {0}.
fr: Le répertoire racine fourni n’existe pas : {0}.
it: La directory radice fornita non esiste: {0}.
ja: 指定されたルート ディレクトリが存在しません: {0}。
ko: 제공된 루트 디렉터리가 존재하지 않습니다. {0}.
pl: Podany katalog główny nie istnieje: {0}.
pt_br: O diretório raiz fornecido não existe: {0}.
ru: Указанный корневой каталог не существует: {0}.
tr: Sağlanan kök dizin mevcut değil: {0}.
zh_hans: 提供的根目录不存在: {0}。
zh_hant: 提供的根目錄不存在: {0}。

# CmdNumberName
source: NUMBER
cs: ČÍSLO
de: ZAHL
pl: NUMER
tr: SAYI
zh_hant: 編號

# CmdOptionCannotBeUsedWithTestModulesDescription
source: The options architecture, configuration, framework, operating system, and runtime cannot be used with '--test-modules' option.
cs: Architekturu parametrů, konfiguraci, architekturu, operační systém a modul runtime nejde použít s parametrem --test-modules.
de: Die Optionen "Architektur", "Konfiguration", "Framework", "Betriebssystem" und "Runtime" können nicht mit der Option "--test-modules" verwendet werden.
es: La arquitectura de opciones, la configuración, el marco, el sistema operativo y el tiempo de ejecución no se pueden usar con la opción "--test-modules".
fr: L’architecture, la configuration, le framework, le système d’exploitation et le runtime des options ne peuvent pas être utilisés avec l’option « --test-modules ».
it: Non è possibile usare l'architettura, la configurazione, il framework, il sistema operativo e il runtime delle opzioni con l'opzione '--test-modules'.
ja: オプションのアーキテクチャ、構成、フレームワーク、オペレーティング システム、ランタイムと '--test-modules' オプションは同時に使用できません。
ko: 옵션 아키텍처, 구성, 프레임워크, 운영 체제 및 런타임은 '--test-modules' 옵션과 함께 사용할 수 없습니다.
pl: Nie można używać opcji architektury, konfiguracji, struktury, systemu operacyjnego i środowiska uruchomieniowego z opcją „--test-modules”.
pt_br: A arquitetura, a configuração, a estrutura, o sistema operacional e o runtime de opções não podem ser usados com a opção "--test-modules".
ru: Невозможно использовать архитектуру параметров, конфигурацию, платформу, операционную систему и среду выполнения с параметром "--test-modules".
tr: Mimari, yapılandırma, çerçeve, işletim sistemi ve çalışma zamanı seçenekleri '--test-modules' seçeneğiyle kullanılamaz.
zh_hans: 选项体系结构、配置、框架、操作系统和运行时不能与 '--test-modules' 选项一起使用。
zh_hant: 選項結構、設定、架構、作業系統和執行階段不能與 '--test-modules' 選項一起使用。

# CmdOptionForceDescription
source: Force conversion even if there are malformed directives.
cs: Vynuťte převod i v případě, že existují chybné direktivy.
de: Erzwingen Sie die Konvertierung, auch wenn falsch formatierte Direktiven vorhanden sind.
es: Forzar la conversión incluso si hay directivas con formato incorrecto.
fr: Forcer la conversion même s’il existe des directives incorrectes.
it: Forza la conversione anche in presenza di direttive non valide.
ja: 形式に誤りがあるディレクティブがある場合でも、強制的に変換します。
ko: 잘못된 형식의 지시문이 있는 경우에도 강제로 변환합니다.
pl: Wymuś konwersję, nawet jeśli istnieją źle sformułowane dyrektywy.
pt_br: Forçar conversão mesmo se houver diretivas malformadas.
ru: Принудительно выполнять преобразование, даже если имеются неправильно сформированные директивы.
tr: Hatalı biçimlendirilmiş yönergeler olsa bile dönüştürmeye zorlar.
zh_hans: 即使存在格式不正确的指令，也强制执行转换。
zh_hant: 即使提示詞格式錯誤，仍強制執行轉換。

# CmdOutdatedDescription
source: Lists packages that have newer versions. Cannot be combined with '--deprecated' or '--vulnerable' options.
cs: Vypíše balíčky, které mají novější verze. Nedá se kombinovat s možností --deprecated ani --vulnerable.
de: Listet Pakete mit neueren Versionen auf. Kann nicht mit den Optionen "--deprecated" oder "--vulnerable" kombiniert werden.
es: Muestra los paquetes que tienen versiones más recientes. No se puede combinar con las opciones '--deprecated" o "--vulnerable".
fr: Liste les packages qui ont versions plus récentes. Impossible à combiner avec les options '--deprecated' ou '--vulnerable'.
it: Elenca i pacchetti con versioni più recenti. Non può essere combinato con l'opzione '--deprecated' o '--vulnerable'.
ja: 新しいバージョンのパッケージを一覧表示します。'--deprecated' または '--vulnerable' オプションと組み合わせることはできません。
ko: 최신 버전이 포함된 패키지를 나열합니다. '--deprecated' 또는 '--vulnerable' 옵션과 함께 사용할 수 없습니다.
pl: Wyświetla pakiety, które mają nowszą wersję. Nie można łączyć z opcją „--deprecated” ani „--vulnerable”.
pt_br: Lista os pacotes que têm versões mais recentes. Não pode ser combinado com a opção '--deprecated' nem com a opção '--vulnerable'.
ru: Возвращает список пакетов, у которых есть более новые версии. Не может использоваться с параметрами "--deprecated" или "--vulnerable".
tr: Daha yeni sürümlere sahip paketleri listeler. '--deprecated' veya '--vulnerable' seçenekleriyle birleştirilemez.
zh_hans: 列出具有较新版本的包。不能与 "--deprecated" 或 "--vulnerable" 选项结合使用。
zh_hant: 列出有更新版本的套件。無法與 '--deprecated' 或 '--vulnerable' 選項一併使用。

# CmdOutputDescription
source: The output directory to place built artifacts in.
cs: Výstupní adresář, do kterého se mají umístit sestavené artefakty
de: Das Ausgabeverzeichnis, in dem erstellte Artefakte abgelegt werden.
es: Directorio de salida en el que se ubicarán los artefactos compilados.
fr: Répertoire de sortie dans lequel placer les artefacts générés.
it: Directory di output in cui inserire gli artefatti compilati.
ja: ビルド成果物を配置する出力ディレクトリ。
ko: 빌드된 아티팩트를 배치할 출력 디렉터리입니다.
pl: Katalog wyjściowy, w którym mają zostać umieszczone skompilowane artefakty.
pt_br: O diretório de saída no qual os artefatos do build serão colocados.
ru: Выходной каталог для размещения артефактов сборки.
tr: Derlenen yapıtların yerleştirileceği çıkış dizini.
zh_hans: 要放置生成项目的输出目录。
zh_hant: 放置建置成品的輸出目錄。

# CmdOutputVersionDescription
source: Specifies the version of machine-readable output. Requires the '--format json' option.
cs: Určuje verzi strojově čitelného výstupu. Vyžaduje možnost --format json.
de: Gibt die Version der computerlesbaren Ausgabe an. Erfordert die Option „--format json“.
es: Especifica la versión de la salida legible por máquina. Requiere la opción "--format json".
fr: Spécifie la version de la sortie lisible par l’ordinateur. Nécessite l’option « --format json ».
it: Specifica la versione dell'output leggibile dal computer. Richiede l'opzione '--format json'.
ja: コンピューターが読み取り可能な出力のバージョンを指定します。'--format json' オプションが必要です。
ko: 컴퓨터에서 읽을 수 있는 출력의 버전을 지정합니다. '--format json' 옵션이 필요합니다.
pl: Określa wersję danych wyjściowych z możliwością odczytu przez maszynę. Wymaga opcji „--format json”.
pt_br: Especifica a versão da saída legível pelo computador. Requer a opção '--format json'.
ru: Указывает версию машиночитаемых выходных данных. Требуется параметр "--format json".
tr: Makine tarafından okunabilir çıkışın sürümünü belirtir. '--format json' seçeneğini gerektirir.
zh_hans: 指定计算机可读输出的版本。需要“--format json”选项。
zh_hant: 指定機器可讀取輸出的版本。需要 '--format json' 選項。

# CmdPackageDescription
source: The package reference to add. This can be in the form of just the package identifier, for example 'Newtonsoft.Json', or a package identifier and version separated by '@', for example 'Newtonsoft.Json@13.0.3'
cs: Odkaz na balíček, který se má přidat Může mít podobu buď pouze identifikátoru balíčku, například Newtonsoft.Json, nebo identifikátoru balíčku a verze, které jsou odděleny znakem @, například Newtonsoft.Json@13.0.3.
de: Der hinzuzufügende Paketverweis. Dies kann nur das Format des Paketbezeichners sein, z. B. "Newtonsoft.Json", oder ein Paketbezeichner und eine durch "@" getrennte Version, z. B. "Newtonsoft.Json@13.0.3".
es: La referencia de paquete para agregar. Puede tener el formato del identificador del paquete, por ejemplo, "Newtonsoft.Json", o un identificador de paquete y una versión separados por "@", por ejemplo, "Newtonsoft.Json@13.0.3"
fr: Référence du package à ajouter. Il peut s’agir uniquement de l’identificateur de package, par exemple « Newtonsoft.Json », ou d’un identificateur de package et d’une version séparés par « @ », par exemple « Newtonsoft.Json@13.0.3 »
it: Il riferimento al pacchetto da aggiungere. Questo può essere solo l'identificatore del pacchetto, ad esempio 'Newtonsoft.Json', oppure un identificatore di pacchetto e una versione separati da '@', ad esempio 'Newtonsoft.Json@13.0.3'
ja: 追加するパッケージ参照。これは、パッケージ識別子 (例: 'Newtonsoft.Json') または '@' で区切られたパッケージ識別子とバージョン (例: 'Newtonsoft.Json@13.0.3') の形式にすることができます
ko: 추가할 패키지 참조입니다. 패키지 식별자(예: 'Newtonsoft.Json') 또는 '@'로 구분된 패키지 식별자 및 버전(예: 'Newtonsoft.Json@13.0.3') 형식일 수 있습니다.
pl: Odwołanie do pakietu do dodania. Może to mieć postać tylko identyfikatora pakietu, na przykład „Newtonsoft.Json”, lub identyfikatora pakietu i wersji rozdzielonych znakiem „@”, na przykład „Newtonsoft.Json@13.0.3”
pt_br: A referência do pacote a adicionar. Isso pode estar na forma apenas do identificador de pacote, por exemplo , "Newtonsoft.Json", ou um identificador de pacote e uma versão separados por "@", por exemplo "Newtonsoft.Json@13.0.3"
ru: Ссылка на пакет, которую следует добавить. Это может быть только идентификатор пакета, например "Newtonsoft.Json", или идентификатор пакета и версия, разделенные символом "@", например "Newtonsoft.Json@13.0.3"
tr: Eklenecek paket başvurusu. Bu sadece 'Newtonsoft.Json' gibi paket tanımlayıcısı biçiminde olabilir, veya 'Newtonsoft.Json@13.0.3' gibi '@' ile ayrılmış bir paket tanımlayıcısı ve sürümü şeklinde olabilir
zh_hans: 要添加的包引用。这可以采用仅使用包标识符的形式，例如 'Newtonsoft.Json'，也可以采用以 ‘@’ 分隔的包标识符和版本形式，例如 'Newtonsoft.Json@13.0.3'
zh_hant: 要新增的套件參考。這可以使用套件識別碼的格式，例如 'Newtonsoft.Json'，或是以 '@' 分隔的套件識別碼和版本，例如 'Newtonsoft.Json@13.0.3'

# CmdPackageDirectoryDescription
source: The directory to restore packages to.
cs: Adresář, do kterého se balíčky mají obnovit
de: Das Verzeichnis, in dem Pakete wiederhergestellt werden sollen.
es: El directorio en el que se restauran paquetes.
fr: Répertoire de restauration des packages.
it: Directory in cui ripristinare i pacchetti.
ja: パッケージの復元先のディレクトリ。
ko: 패키지를 복원할 디렉터리입니다.
pl: Katalog, w którym zostaną przywrócone pakiety.
pt_br: O diretório no qual os pacotes serão restaurados.
ru: Каталог, в который будут восстановлены пакеты.
tr: Paketlerin geri yükleneceği dizin.
zh_hans: 要将包还原到其中的目录。
zh_hant: 還原套件的目標目錄。

# CmdPackagesOptionDescription
source: The directory to restore packages to.
cs: Adresář, do kterého se balíčky mají obnovit
de: Das Verzeichnis, in dem Pakete wiederhergestellt werden sollen.
es: El directorio en el que se restauran paquetes.
fr: Répertoire de restauration des packages.
it: Directory in cui ripristinare i pacchetti.
ja: パッケージの復元先のディレクトリ。
ko: 패키지를 복원할 디렉터리입니다.
pl: Katalog, w którym zostaną przywrócone pakiety.
pt_br: O diretório no qual os pacotes serão restaurados.
ru: Каталог, в который будут восстановлены пакеты.
tr: Paketlerin geri yükleneceği dizin.
zh_hans: 要将包还原到其中的目录。
zh_hant: 還原套件的目標目錄。

# CmdPathTologFileDescription
source: Enable verbose logging to the specified file.
cs: Povolí podrobné protokolování do zadaného souboru.
de: Hiermit wird die ausführliche Protokollierung in der angegebenen Datei aktiviert.
es: Habilite el registro detallado para el archivo especificado.
fr: Activez la journalisation détaillée dans le fichier spécifié.
it: Abilita la registrazione dettagliata nel file specificato.
ja: 指定したファイルに対する詳細ロギングを有効にします。
ko: 지정한 파일에 대해 자세한 정보 로깅을 사용합니다.
pl: Włącz pełne rejestrowanie w określonym pliku.
pt_br: Habilitar a criação de log detalhada no arquivo especificado.
ru: Включить подробное ведение журнала в указанном файле.
tr: Belirtilen dosyaya ayrıntılı günlük kaydını etkinleştirir.
zh_hans: 启用对指定文件的详细记录。
zh_hant: 為指定的檔案啟用詳細資訊記錄。

# CmdPrereleaseDescription
source: Consider packages with prerelease versions when searching for newer packages. Requires the '--outdated' option.
cs: Při hledání novějších balíčků se budou brát v úvahu i balíčky v předběžných verzích. Vyžaduje přepínač --outdated.
de: Hiermit werden bei der Suche nach neueren Pakete auch Pakete mit Vorabversionen berücksichtigt. Hierfür ist die Option "--outdated" erforderlich.
es: Considere la posibilidad de usar paquetes con versiones previas al buscar nuevos paquetes. Requiere la opción "--outdated".
fr: Prenez en compte les packages avec des préversions quand vous recherchez des packages plus récents. Nécessite l'option '--outdated'.
it: Prende in considerazione i pacchetti con versioni preliminari quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated'.
ja: 新しいパッケージを検索するときにプレリリース バージョンのパッケージを検討します。'--outdated' オプションが必要です。
ko: 최신 패키지를 검색할 때 시험판 버전이 있는 패키지를 고려합니다. '--outdated' 옵션이 필요합니다.
pl: Podczas wyszukiwania nowszych pakietów uwzględniaj pakiety z wersjami wstępnymi. Wymaga opcji „--outdated”.
pt_br: Ao procurar pacotes mais novos, considere pacotes com versões de pré-lançamento. Requer a opção '--outdated'.
ru: Учитывает пакеты с версиями предварительных выпусков при поиске более новых версий пакетов. Требуется указать параметр '--outdated'.
tr: Daha yeni paketleri ararken yayın öncesi sürümlere sahip olan paketleri göz önünde bulundurun. '--outdated' seçeneğini gerektirir.
zh_hans: 在搜索较新的包时，请考虑使用具有预发行版本的包。需要 "--outdated" 选项。
zh_hant: 在搜尋較新套件時，建議搜尋具有發行前版本的套件。需要使用 '--outdated' 選項。

# CmdProjectDescription
source: Defines the path of the project file to run (folder name or full path). If not specified, it defaults to the current directory.
cs: Definuje cestu k souboru projektu, který se má spustit (název složky nebo úplná cesta). Pokud se nezadá, použije se výchozí nastavení aktuálního adresáře.
de: Definiert den Pfad der auszuführenden Projektdatei (Ordnername oder vollständiger Pfad). Wenn keine Angabe erfolgt, wird standardmäßig das aktuelle Verzeichnis verwendet.
es: Define la ruta de acceso del archivo de proyecto que se va a ejecutar (nombre de carpeta o ruta de acceso completa). Si no se especifica, el valor predeterminado es el directorio actual.
fr: Définit le chemin d’accès du fichier projet à exécuter (nom de dossier ou chemin d’accès complet). Si rien n’est spécifié, la valeur par défaut est le répertoire actif.
it: Definisce il percorso del file progetto da eseguire (nome cartella o percorso completo). Se non specificato, per impostazione predefinita viene usata la directory corrente.
ja: 実行するプロジェクト ファイルのパス (フォルダー名または完全パス) を定義します。指定しない場合は、既定で現在のディレクトリに設定されます。
ko: 실행할 프로젝트 파일의 경로(폴더 이름 또는 전체 경로)를 정의합니다. 지정하지 않으면 기본적으로 현재 디렉터리가 사용됩니다.
pl: Definiuje ścieżkę pliku projektu do uruchomienia (nazwę folderu lub pełną ścieżkę). Jeśli nie zostanie określony, domyślnie będzie to bieżący katalog.
pt_br: Define o caminho do arquivo de projeto a ser executado (nome da pasta ou caminho completo). Se não for especificado, o padrão será o diretório atual.
ru: Определяет путь к файлу проекта для выполнения (имя папки или полный путь). Если не указано, по умолчанию используется текущий каталог.
tr: Çalıştırılacak proje dosyasının yolunu (klasör adı veya tam yol) belirtir. Belirtilmezse, varsayılan olarak geçerli dizine ayarlar.
zh_hans: 定义要运行的项目文件的路径(文件夹名称或完整路径)。如果未指定，则默认为当前目录。
zh_hant: 定義要執行的專案檔案路徑 (資料夾名稱或完整路徑)。如果未指定，則預設為目前目錄。

# CmdReevaluateOptionDescription
source: Forces restore to reevaluate all dependencies even if a lock file already exists.
cs: Vynutí obnovení při přehodnocení všech závislostí i v případě, že už existuje soubor zámku.
de: Erzwingt die Neubewertung aller Abhängigkeiten bei der Wiederherstellung, selbst wenn bereits eine Sperrdatei vorhanden ist.
es: Fuerza la restauración para volver a evaluar todas las dependencias aunque ya exista un archivo de bloqueo.
fr: Force la restauration à réévaluer toutes les dépendances, même s'il existe déjà un fichier de verrouillage.
it: Forza restore a valutare di nuovo tutte le dipendenze anche se esiste già un file di blocco.
ja: ロック ファイルが既に存在する場合でも、すべての依存関係を再評価するように強制的に復元します。
ko: 잠금 파일이 이미 존재하는 경우에도 모든 종속성을 다시 평가하기 위해 복원합니다.
pl: Wymusza przywrócenie w celu ponownego obliczenia wszystkich zależności, nawet jeśli plik blokady już istnieje.
pt_br: Força a restauração para reavaliar todas as dependências, mesmo se já existir um arquivo de bloqueio.
ru: Принудительно применяет восстановление, чтобы повторно рассчитать все зависимости, если файл блокировки уже существует.
tr: Bir kilit dosyası mevcut olsa bile geri yüklemenin tüm bağımlılıkları yeniden değerlendirmesini zorlar.
zh_hans: 即使锁定文件已存在，也强制还原以重新评估所有依赖项。
zh_hant: 強制還原以重新評估所有相依性，即使已經存在鎖定檔案也一樣。

# CmdResultsDirectoryDescription
source: The directory where the test results will be placed. The specified directory will be created if it does not exist.
cs: Adresář, do kterého se umístí výsledky testu. Pokud zadaný adresář neexistuje, bude vytvořen.
de: Das Verzeichnis, in dem die Testergebnisse abgelegt werden. Das angegebene Verzeichnis wird erstellt, wenn es nicht vorhanden ist.
es: El directorio donde se colocarán los resultados de prueba. Si no existe, se creará el directorio especificado.
fr: Répertoire où les résultats des tests vont être placés. Le répertoire spécifié est créé, s'il n'existe pas déjà.
it: Directory in cui verranno inseriti i risultati del test. Se non esiste, la directory specificata verrà creata.
ja: テスト結果が配置されるディレクトリ。 指定したディレクトリが存在しない場合は、作成されます。
ko: 테스트 결과를 배치할 디렉터리입니다. 지정한 디렉터리가 존재하지 않는 경우 생성됩니다.
pl: Katalog, w którym będą umieszczane wyniki testów. Jeśli określony katalog nie istnieje, zostanie utworzony.
pt_br: O diretório no qual os resultados do teste serão colocados. O diretório especificado será criado se ele ainda não existir.
ru: Каталог, в котором будут размещены результаты тестов. Если указанного каталога не существует, он будет создан.
tr: Test sonuçlarının yerleştirileceği dizin. Belirtilen dizin yoksa oluşturulur.
zh_hans: 要放置测试结果的目录。 若不存在，将创建指定目录。
zh_hant: 將放置測試結果的目錄。 若指定的目錄不存在，則會建立該目錄。

# CmdRuntimeOptionDescription
source: The target runtime to restore packages for.
cs: Cílový modul runtime pro obnovení balíčků
de: Die Zielruntime für die Wiederherstellung von Paketen.
es: El tiempo de ejecución de destino para el que se restauran los paquetes.
fr: Runtime cible pour lequel la restauration des packages est effectuée.
it: Runtime di destinazione per cui ripristinare i pacchetti.
ja: パッケージを復元するターゲット ランタイム。
ko: 패키지를 복원할 대상 런타임입니다.
pl: Docelowe środowisko uruchomieniowe, dla którego mają zostać przywrócone pakiety.
pt_br: O runtime de destino no qual os pacotes serão restaurados.
ru: Целевая среда выполнения для восстановления пакетов.
tr: Paketlerin geri yükleneceği hedef çalışma zamanı.
zh_hans: 要还原包的目标运行时。
zh_hant: 要對其還原套件的目標執行階段。

# CmdServiceableDescription
source: Set the serviceable flag in the package. See https://aka.ms/nupkgservicing for more information.
cs: Nastaví v balíčku příznak obsluhovatelnosti. Další informace najdete na adrese https://aka.ms/nupkgservicing.
de: Hiermit wird das Verarbeitungsflag im Paket festgelegt. Weitere Informationen finden Sie unter https://aka.ms/nupkgservicing.
es: Establece la marca serviceable en el paquete. Para obtener más información, consulte https://aka.ms/nupkgservicing.
fr: Définissez l'indicateur de maintenance dans le package. Pour plus d'informations, consultez https://aka.ms/nupkgservicing.
it: Imposta il flag serviceable nel pacchetto. Per altre informazioni, vedere https://aka.ms/nupkgservicing.
ja: パッケージに処理可能なフラグを設定します。詳細については、https://aka.ms/nupkgservicing をご覧ください。
ko: 패키지에서 서비스 가능 플래그를 설정합니다. 자세한 내용은 https://aka.ms/nupkgservicing을 참조하세요.
pl: Ustaw w pakiecie flagę oznaczającą możliwość serwisowania. Aby uzyskać więcej informacji, zobacz https://aka.ms/nupkgservicing.
pt_br: Definir o sinalizador operacional no pacote. Para obter mais informações, confira https://aka.ms/nupkgservicing.
ru: Задание для пакета флага "подлежит обслуживанию". Дополнительные сведения: https://aka.ms/nupkgservicing.
tr: Pakette serviceable bayrağını ayarlar. Daha fazla bilgi için bkz. https://aka.ms/nupkgservicing.
zh_hans: 在包中设置可用标志。有关详细信息，请参阅 https://aka.ms/nupkgservicing。
zh_hant: 設定套件中的服務旗標。如需詳細資訊，請參閱 https://aka.ms/nupkgservicing。

# CmdSettingsDescription
source: The settings file to use when running tests.
cs: Soubor nastavení, který se má použít při spouštění testů
de: Die beim Ausführen von Tests zu verwendende Einstellungsdatei.
es: Archivo de configuración que debe usarse al ejecutar las pruebas.
fr: Fichier de paramètres à utiliser durant l'exécution des tests.
it: File di impostazioni da usare durante l'esecuzione dei test.
ja: テスト実行時に使用する設定ファイル。
ko: 테스트를 실행할 때 사용할 설정 파일입니다.
pl: Plik ustawień, który ma zostać użyty podczas uruchamiania testów.
pt_br: O arquivo de configurações a ser usado ao executar os testes.
ru: Файл параметров, используемый при выполнении тестов.
tr: Testleri çalıştırırken kullanılacak ayarlar dosyası.
zh_hans: 运行测试时要使用的设置文件。
zh_hant: 執行測試時要使用的設定檔。

# CmdSolutionDescription
source: Defines the path of the solution file to run. If not specified, it defaults to the current directory.
cs: Definuje cestu k souboru řešení, který se má spustit. Pokud se nezadá, použije se výchozí nastavení aktuálního adresáře.
de: Definiert den Pfad der auszuführenden Projektmappendatei. Wenn keine Angabe erfolgt, wird standardmäßig das aktuelle Verzeichnis verwendet.
es: Define la ruta de acceso del archivo de solución que se va a ejecutar. Si no se especifica, el valor predeterminado es el directorio actual.
fr: Définit le chemin d’accès du fichier solution à exécuter. Si rien n’est spécifié, la valeur par défaut est le répertoire actif.
it: Definisce il percorso del file soluzione da eseguire. Se non specificato, per impostazione predefinita viene usata la directory corrente.
ja: 実行するソリューション ファイルのパスを定義します。指定しない場合は、既定で現在のディレクトリに設定されます。
ko: 실행할 솔루션 파일의 경로를 정의합니다. 지정하지 않으면 기본적으로 현재 디렉터리가 사용됩니다.
pl: Definiuje ścieżkę pliku rozwiązania do uruchomienia. Jeśli nie zostanie określony, domyślnie będzie to bieżący katalog.
pt_br: Define o caminho do arquivo de solução a ser executado. Se não for especificado, o padrão será o diretório atual.
ru: Определяет путь к файлу решения, который следует запустить. Если не указано, по умолчанию используется текущий каталог.
tr: Çalıştırılacak çözüm dosyasının yolunu belirtir. Belirtilmezse, varsayılan olarak geçerli dizine ayarlar.
zh_hans: 定义要运行的解决方案文件的路径。如果未指定，则默认为当前目录。
zh_hant: 定義要執行的解決方案檔案的路徑。如果未指定，則預設為目前目錄。

# CmdSourceOptionDescription
source: The NuGet package source to use for the restore.
cs: Zdroj balíčku NuGet, který se má použít k obnovení
de: Die für die Wiederherstellung zu verwendende NuGet-Paketquelle.
es: El origen de un paquete de NuGet para usarlo para la restauración.
fr: Source de package NuGet à utiliser pour la restauration.
it: Origine pacchetto NuGet da usare per il ripristino.
ja: 復元のために使用する NuGet パッケージ ソース。
ko: 복원에 사용할 NuGet 패키지 소스입니다.
pl: Źródło pakietów NuGet do użycia na potrzeby przywracania.
pt_br: A origem do pacote do NuGet a ser usada para a restauração.
ru: Источник пакетов NuGet, используемый для восстановления.
tr: Geri yükleme için kullanılacak NuGet paket kaynağı.
zh_hans: 用于还原的 NuGet 包源。
zh_hant: 用於還原的 NuGet 套件來源。
