Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CmdBlameCrashDescription
source: Runs the tests in blame mode and collects a crash dump when the test host exits unexpectedly. This option depends on the version of .NET used, the type of error, and the operating system. For exceptions in managed code, a dump will be automatically collected on .NET 5.0 and later versions. It will generate a dump for testhost or any child process that also ran on .NET 5.0 and crashed. Crashes in native code will not generate a dump. This option works on Windows, macOS, and Linux. Crash dumps in native code, or when targetting .NET Framework, or .NET Core 3.1 and earlier versions, can only be collected on Windows, by using Procdump. A directory that contains procdump.exe and procdump64.exe must be in the PATH or PROCDUMP_PATH environment variable. The tools can be downloaded here: https://docs.microsoft.com/sysinternals/downloads/procdump To collect a crash dump from a native application running on .NET 5.0 or later, the usage of Procdump can be forced by setting the VSTEST_DUMP_FORCEPROCDUMP environment variable to 1. Implies --blame.
cs: Spustí testy v režimu blame a shromáždí výpis stavu systému, když se hostitel testů neočekávaně ukončí. Tento parametr závisí na verzi použitého rozhraní .NET, typu chyby a operačním systému. Pro výjimky ve spravovaném kódu se výpis automaticky shromáždí v rozhraní .NET 5.0 a novějších verzích. Vygeneruje výpis pro hostitele testu nebo jakýkoli podřízený proces, který také běžel v rozhraní .NET 5.0 a došlo k chybovému ukončení. Chybová ukončení v nativním kódu nevygenerují výpis paměti. Tento parametr funguje ve Windows, macOS a Linuxu. Výpisy stavu systému v nativním kódu nebo při cílení na .NET Framework nebo .NET Core 3.1 a starší verze se dají shromažďovat jenom ve Windows pomocí Procdumpu. Adresář obsahující procdump.exe a procdump64.exe musí být v proměnné prostředí PATH nebo PROCDUMP_PATH. Nástroje si můžete stáhnout odsud: https://docs.microsoft.com/sysinternals/downloads/procdump Pokud chcete shromáždit výpis stavu systému z nativní aplikace spuštěné na rozhraní .NET 5.0 nebo novějším, je možné použití procdumpu vynutit nastavením proměnné prostředí VSTEST_DUMP_FORCEPROCDUMP na hodnotu 1. Implikuje --blame.
de: Führt die Tests im Modus "Verantwortung zuweisen" aus und erfasst ein Absturzabbild, wenn der Testhost unerwartet beendet wird. Diese Option hängt von der verwendeten .NET-Version ab, dem Fehlertyp und dem Betriebssystem. Bei Ausnahmen im verwalteten Code wird in .NET 5.0 und höheren Versionen automatisch ein Speicherabbild erfasst. Es wird ein Speicherabbild für den Testhost oder einen beliebigen untergeordneten Prozess generiert, der ebenfalls unter .NET 5.0 ausgeführt wurde und abstürzte. Bei Abstürzen im nativen Code wird kein Speicherabbild generiert. Diese Option funktioniert unter Windows, macOS und Linux. Absturzabbilder in nativem Code, oder wenn Sie .NET Framework oder .NET Core 3.1 und frühere Versionen als Ziel verwenden, können nur unter Windows mit Procdump gesammelt werden. Ein Verzeichnis, das procdump.exe und procdump64.exe enthält, muss sich in der Umgebungsvariable PATH oder PROCDUMP_PATH befinden. Die Tools können hier heruntergeladen werden: https://docs.microsoft.com/sysinternals/downloads/procdump Um ein Absturzabbild von einer nativen Anwendung zu sammeln, die unter .NET 5.0 oder höher ausgeführt wird, kann die Verwendung von Procdump erzwungen werden, indem die Umgebungsvariable VSTEST_DUMP_FORCEPROCDUMP auf 1 festgelegt wird. Impliziert --blame.
es: Ejecuta las pruebas en modo de culpa y recopila un volcado de memoria cuando el host de prueba se cierra inesperadamente. Esta opción depende de la versión de .NET usada, el tipo de error y el sistema operativo. Para las excepciones en código administrado, se recopilará automáticamente un volcado en .NET 5.0 y versiones posteriores. Se generará un volcado para testhost o cualquier proceso secundario que también se ejecutó en .NET 5.0 y se bloqueó. Los bloqueos en código nativo no generarán un volcado. Esta opción funciona en Windows, macOS y Linux. Los volcados de memoria en código nativo, o al establecer como destino .NET Framework, o .NET Core 3.1 y versiones anteriores, solo se pueden recopilar en Windows, mediante Procdump. Un directorio que contenga procdump.exe y procdump64.exe debe estar en la variable de entorno PATH o PROCDUMP_PATH. Las herramientas se pueden descargar aquí: https://docs.microsoft.com/sysinternals/downloads/procdump Para recopilar un volcado de memoria de una aplicación nativa que se ejecuta en .NET 5.0 o posterior, se puede forzar el uso de Procdump estableciendo la variable de entorno VSTEST_DUMP_FORCEPROCDUMP en 1. Implica --blame.
fr: Exécute les tests en mode blame (responsabilité) et collecte un vidage sur incident lorsque l’hôte de test se ferme de manière inattendue. Cette option dépend de la version de .NET utilisée, du type d’erreur et du système d’exploitation. Pour les exceptions dans le code managé, une copie de sauvegarde est automatiquement collectée sur .NET 5.0 et versions ultérieures. Cela génère une sauvegarde pour l’hôte de test ou tout processus enfant qui s’est également exécuté sur .NET 5.0 et s’est arrêté. Les blocages dans le code natif ne génèrent pas de vidage. Cette option fonctionne sur Windows, macOS et Linux. Les vidages sur incident dans du code natif, ou lors du ciblage de .NET Framework, ou .NET Core 3.1 et versions antérieures, peuvent uniquement être collectés sur Windows, à l’aide de Procdump. Un répertoire qui contient procdump.exe et procdump64.exe doit se trouver dans la variable d’environnement PATH ou PROCDUMP_PATH. Les outils peuvent être téléchargés ici : https://docs.microsoft.com/sysinternals/downloads/procdump Pour collecter un vidage sur incident à partir d’une application native exécutée sur .NET 5.0 ou version ultérieure, l’utilisation de Procdump peut être forcée en définissant la variable d’environnement VSTEST_DUMP_FORCEPROCDUMP sur 1. Implique --blame.
it: Esegue i test in modalità di segnalazione errore e raccoglie un dump di arresto anomalo quando l'host di test si chiude in modo imprevisto. Questa opzione dipende dalla versione di .NET usata, dal tipo di errore e dal sistema operativo. Per le eccezioni nel codice gestito, un dump verrà raccolto automaticamente in .NET 5.0 e versioni successive. Verrà generato un dump per host di test o qualsiasi processo figlio eseguito in .NET 5.0 e che si è arrestato in modo anomalo. Gli arresti anomali nel codice nativo non genereranno un dump. Questa opzione funziona in Windows, macOS e Linux. Dump di arresto anomalo nel codice nativo o durante la destinazione a .NET Framework, o .NET Core 3.1 e versioni precedenti, possono essere raccolti solo in Windows usando Procdump. Una directory che contiene procdump.exe e procdump64.exe deve trovarsi nella variabile di ambiente PATH o PROCDUMP_PATH. Gli strumenti possono essere scaricati qui: https://docs.microsoft.com/sysinternals/downloads/procdump Per raccogliere un dump di arresto anomalo da un'applicazione nativa in esecuzione in .NET 5.0 o versioni successive, è possibile forzare l'uso di Procdump impostando la variabile di ambiente VSTEST_DUMP_FORCEPROCDUMP su 1. Implies --blame.
ja: テスト ホストが予期せず終了したときに、変更履歴モードでテストを実行し、クラッシュ ダンプを収集します。このオプションは、使用されている .NET のバージョン、エラーの種類、オペレーティング システムによって異なります。 マネージド コードの例外の場合、ダンプは .NET 5.0 以降のバージョンで自動的に収集されます。testhost または同じく .NET 5.0 で実行されクラッシュした任意の子プロセスのダンプが生成されます。ネイティブ コードのクラッシュではダンプは生成されません。このオプションは、Windows、macOS、Linux で動作します。 ネイティブ コードのクラッシュ ダンプ、または .NET Framework または .NET Core 3.1 以前のバージョンを対象とするクラッシュ ダンプの場合は、Procdump を使用して Windows でのみ収集できます。procdump.exe と procdump64.exe を含むディレクトリは、PATH または PROCDUMP_PATH 環境変数に存在する必要があります。 ツールは次の場所からダウンロードできます: https://docs.microsoft.com/sysinternals/downloads/procdump .NET 5.0 以降で実行中のネイティブ アプリケーションからクラッシュ ダンプを収集するには、VSTEST_DUMP_FORCEPROCDUMP 環境変数を 1 に設定して Procdump の使用を強制できます。 --blame が暗黙的に指定されます。
ko: 테스트를 블레임 모드로 실행하고 테스트 호스트가 예기치 않게 종료되면 크래시 덤프를 수집합니다. 이 옵션은 사용된 .NET 버전, 오류 유형 및 운영 체제에 따라 달라집니다. 관리 코드 예외의 경우 .NET 5.0 이상 버전에서 덤프가 자동으로 수집됩니다. 역시 .NET 5.0에서 실행되어 작동이 중단된 testhost 또는 자식 프로세스에 대한 덤프를 생성합니다. 네이티브 코드의 크래시는 덤프를 생성하지 않습니다. 이 옵션은 Windows, macOS 및 Linux에서 작동합니다. 네이티브 코드의 크래시 덤프나 .NET Framework 또는 .NET Core 3.1 이하 버전을 대상으로 하는 경우 Procdump를 사용하여 Windows에서만 수집할 수 있습니다. procdump.exe 및 procdump64.exe가 포함된 디렉터리는 PATH 또는 PROCDUMP_PATH 환경 변수에 있어야 합니다. 도구는 다음 페이지에서 다운로드할 수 있습니다. https://docs.microsoft.com/sysinternals/downloads/procdump .NET 5.0 이상에서 실행되는 네이티브 애플리케이션에서 크래시 덤프를 수집하려면 VSTEST_DUMP_FORCEPROCDUMP 환경 변수를 1로 설정하여 Procdump를 강제로 사용할 수 있습니다. --blame을 의미합니다.
pl: Uruchamia testy w trybie blame i zbiera zrzut awaryjny, gdy host testowy nieoczekiwanie kończy działanie. Ta opcja zależy od używanej wersji platformy .NET, typu błędu, i systemu operacyjnego. W przypadku wyjątków w kodzie zarządzanym zrzut zostanie automatycznie zebrany na platformie .NET 5.0 i nowszych wersjach. Spowoduje to wygenerowanie zrzutu dla hosta testowego lub dowolnego procesu podrzędnego, który również został uruchomiony na platformie .NET 5.0 i uległ awarii. Awarie w kodzie natywnym nie wygenerują zrzutu. Ta opcja działa w systemach Windows, macOS, i Linux. Zrzuty awaryjne w kodzie natywnym, lub w przypadku platformy .NET Framework lub .NET Core 3.1 i starszych wersji, mogą być zbierane tylko w systemie Windows przy użyciu narzędzia Procdump. Katalog zawierający pliki procdump.exe i procdump64.exe musi znajdować się w zmiennej środowiskowej PATH lub PROCDUMP_PATH. Przykłady można pobrać tutaj: https://docs.microsoft.com/sysinternals/downloads/procdump Aby zebrać zrzut awaryjny z aplikacji natywnej działającej na platformie .NET 5.0 lub nowszej, użycie elementu Procdump można wymusić, ustawiając zmienną środowiskową VSTEST_DUMP_FORCEPROCDUMP na wartość 1. Implies --blame.
pt_br: Executa os testes no modo blame e coleta um despejo de memória quando o host de teste sai inesperadamente. Esta opção depende da versão do .NET utilizada, do tipo de erro e do sistema operacional. Para exceções no código gerenciado, um despejo será coletado automaticamente no .NET 5.0 e versões posteriores. Ele gerará um despejo para testhost ou qualquer processo filho que também foi executado no .NET 5.0 e travou. Falhas no código nativo não gerarão um despejo. Esta opção funciona no Windows, macOS e Linux. Os despejos de falha no código nativo ou ao direcionar o .NET Framework ou o .NET Core 3.1 e versões anteriores só podem ser coletados no Windows, usando o Procdump. Um diretório que contém procdump.exe e procdump64.exe deve estar na variável de ambiente PATH ou PROCDUMP_PATH. As ferramentas podem ser baixadas aqui: https://docs.microsoft.com/sysinternals/downloads/procdump Para coletar um despejo de memória de um aplicativo nativo em execução no .NET 5.0 ou posterior, o uso de Procdump pode ser forçado definindo a variável de ambiente VSTEST_DUMP_FORCEPROCDUMP como 1. Implica --blame.
ru: Если узел тестирования неожиданно завершает работу, эта команда запускает тесты в режиме blame и собирает аварийный дамп. Эта опция зависит от используемой версии .NET, типа ошибки и операционной системы. Для исключений в управляемом коде в .NET начиная с версии 5.0 дамп будет собираться автоматически. Будет создан дамп для testhost или любого дочернего процесса, который также был запущен на .NET 5.0 и завершился аварийно. При сбое в собственном программном коде дамп не генерируется. Эта опция работает в Windows, macOS и Linux. Дампы аварийного завершения в собственном программном коде или для целевых платформ .NET Framework и .NET Core версии 3.1 и ранее можно собирать только в Windows с помощью Procdump. Каталог, содержащий procdump.exe и procdump64.exe, должен быть указан в одной из двух переменных среды: PATH или PROCDUMP_PATH. Средства можно скачать здесь: https://docs.microsoft.com/sysinternals/downloads/procdump Для сбора аварийного дампа из собственного приложения, запущенного на .NET 5.0 или более поздней версии, можно обеспечить принудительное использование Procdump, задав значение 1 для переменной среды VSTEST_DUMP_FORCEPROCDUMP. Подразумевается использование параметра --blame.
tr: Testleri blame modunda çalıştırır ve test ana bilgisayarı beklenmedik şekilde çıktığında kilitlenme bilgi dökümlerini toplar. Bu seçenek kullanılan .NET sürümüne, hata türüne ve işletim sistemine bağlıdır. Yönetilen koddaki özel durumlar için .NET 5.0 ve sonraki sürümler üzerinde otomatik olarak bir döküm toplanır. Testhost veya .NET 5.0 üzerinde çalışan ve kilitlenen herhangi bir alt işlem için döküm oluşturur. Yerel koddaki kilitlenmeler döküm oluşturmaz. Bu seçenek Windows, macOS ve Linux'ta çalışır. Yerel kodda bulunan veya .NET Framework ya da .NET Core 3.1 ve önceki sürümler hedeflendiğinde kilitlenme dökümleri, yalnızca Procdump kullanılarak Windows'ta toplanabilir. Procdump.exe ve procdump64.exe içeren dizin PATH veya PROCDUMP_PATH değişkende olmalıdır. Araçlar https://docs.microsoft.com/sysinternals/downloads/procdump adresinden indirilebilir .NET 5.0 veya sonraki bir sürümde çalışan yerel bir uygulamadaki kilitlenme bilgi dökümlerini toplamak için Procdump kullanılması, VSTEST_DUMP_FORCEPROCDUMP ortam değişkeni 1 olarak ayarlanarak zorlanabilir. --blame gerektirir.
zh_hans: 在追溯模式下运行测试，并在测试主机意外退出时收集故障转储。此选项取决于所使用的 .NET 版本、错误类型和操作系统。 对于托管代码中的异常，将在 .NET 5.0 及更高版本上自动收集转储。它将为 testhost 或同样在 .NET 5.0 上运行并出现故障的任何子进程生成转储。本机代码中的故障不会生成转储。此选项适用于 Windows、macOS 和 Linux。 只能使用 Procdump 在 Windows 上收集本机代码中的故障转储或针对 .NET Framework 或 .NET Core 3.1 及更早版本的故障转储。包含 procdump.exe 和 procdump64.exe 的目录必须位于 PATH 或 PROCDUMP_PATH 环境变量中。 可在此处下载工具: https://docs.microsoft.com/sysinternals/downloads/procdump 要从在 .NET 5.0 或更高版本上运行的本机应用程序收集故障转储，可以通过将 VSTEST_DUMP_FORCEPROCDUMP 环境变量设置为 1 来强制使用 Procdump。 表示 --blame。
zh_hant: 以歸責模式執行測試，並在測試主機未預期地結束時收集損毀傾印。此選項取決於使用的 .NET 版本、錯誤類型和作業系統。 對於受控程式碼中的例外狀況，系統將自動在 .NET 5.0 及更新版本上收集傾印。其會為 testhost 或任何也在 .NET 5.0 上執行且毀損的子程序產生傾印。原生程式碼中的損毀將不會產生傾印。此選項適用於 Windows、macOS、和 Linux。 原生程式碼中的損毀傾印，或以 .NET Framework 或 .NET Core 3.1 和先前版本為目標時，則只能在 Windows 上使用 Procdump 進行收集。包含 procdump.exe 和 procdump64.exe 的目錄必須位在 PATH 或 PROCDUMP_PATH 環境變數中。 您可以在這裡下載工具: https://docs.microsoft.com/sysinternals/downloads/procdump 若要從執行 .NET 5.0 或更新版本的原生應用程式收集損毀傾印，您可透過將 VSTEST_DUMP_FORCEPROCDUMP 環境變數設定為 1，以強制使用 Procdump。 隱含 --blame。

# CmdBlameCrashDumpTypeDescription
source: The type of crash dump to be collected. Supported values are full (default) and mini. Implies --blame-crash.
cs: Typ výpisu stavu systému, který se má shromáždit. Podporované hodnoty jsou úplné (výchozí) a mini. Implikuje --blame-crash.
de: Der Typ des zu erfassenden Absturzabbilds. Unterstützte Werte sind „vollständig“ (Standard) und „minimal“. Impliziert „--blame-crash“.
es: Tipo de volcado de memoria que se va a recopilar. Los valores admitidos son completo (valor predeterminado) y mini. Implica --blame-crash.
fr: Type de vidage sur incident à collecter. Les valeurs prises en charge sont 'Complet' (par défaut) et 'Mini'. Implique --blame-crash.
it: Tipo di dump di arresto anomalo da raccogliere. I valori supportati sono completi (impostazione predefinita) e mini. Implica --blame-crash.
ja: 収集されるクラッシュ ダンプの種類。サポート対象の値はフル (既定) とミニです。--blame-crash を示します。
ko: 수집할 크래시 덤프의 유형입니다. 지원되는 값은 full(기본값) 및 mini입니다. --blame-crash를 의미합니다.
pl: Typ zrzutu awaryjnego do zebrania. Obsługiwane wartości są pełne (domyślne) i mini. Implikuje --blame-crash.
pt_br: O tipo de despejo de memória a ser coletado. Os valores com suporte são full (padrão) e mini. Implica --blame-crash.
ru: Тип собираемого аварийного дампа. Поддерживаемые значения: "full" (по умолчанию) и "mini". Подразумевается использование параметра --blame-crash.
tr: Toplanacak kilitlenme bilgi dökümü türü. Desteklenen değerler: full (varsayılan) ve mini. --blame-crash gerektirir.
zh_hans: 要收集的故障转储的类型。支持的值为 full (默认)和 mini。表示 --blame-crash。
zh_hant: 要收集的損毀傾印類型。支援的值為 full (預設值) 和 mini。表示 --blame-crash。
