Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CmdTestAdapterPathDescription
source: The path to the custom adapters to use for the test run.
cs: Cesta k vlastním adaptérům, které se mají použít pro testovací běh
de: Der Pfad zu den benutzerdefinierten Adaptern, die für den Testlauf verwendet werden sollen.
es: La ruta de acceso a los adaptadores personalizados que se usarán en la serie de pruebas.
fr: Chemin des adaptateurs personnalisés à utiliser pour la série de tests.
it: Percorso degli adattatori personalizzati da usare per l'esecuzione dei test.
ja: テストの実行に使用するカスタム アダプターへのパス。
ko: 테스트 실행에 사용할 사용자 지정 어댑터의 경로입니다.
pl: Ścieżka do niestandardowych adapterów, które mają być używane na potrzeby przebiegu testu.
pt_br: O caminho para os adaptadores personalizados a serem usados para a execução de teste.
ru: Путь к пользовательским адаптерам, используемым для выполнения тестов.
tr: Test çalıştırması için kullanılacak özel bağdaştırıcıların yolu.
zh_hans: 自定义适配器用于测试运行的路径。
zh_hant: 到達用於測試執行的自訂配接器路徑。

# CmdTestCaseFilterDescription
source: Run tests that match the given expression. Examples: Run tests with priority set to 1: --filter "Priority = 1" Run a test with the specified full name: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Run tests that contain the specified name: --filter "FullyQualifiedName~Namespace.Class" See https://aka.ms/vstest-filtering for more information on filtering support.
cs: Spustí testy, které odpovídají danému výrazu. Příklady: Spustí testy s prioritou nastavenou na 1: --filter "Priority = 1" Spustí test se zadaným úplným názvem: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Spustí testy, které obsahují zadaný název: --filter "FullyQualifiedName~007E;Namespace.Class" Další informace o podpoře filtrování: https://aka.ms/vstest-filtering
de: Hiermit werden Tests ausgeführt, die dem angegebenen Ausdruck entsprechen. Beispiele: Hiermit werden Tests ausgeführt, bei denen die Priorität auf 1 festgelegt ist: --filter "Priority = 1" Hiermit wird ein Test mit dem angegebenen vollständigen Namen ausgeführt: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Hiermit werden Tests ausgeführt, die den angegebenen Namen enthalten: --filter "FullyQualifiedName~007E;Namespace.Class" Weitere Informationen zur Unterstützung der Filterung finden Sie unter https://aka.ms/vstest-filtering.
es: Ejecuta las pruebas que coinciden con una expresión dada. Ejemplos: Ejecuta las pruebas con una prioridad establecida en 1: --filter "Priority = 1" Ejecuta una prueba con el nombre completo especificado: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Ejecuta las pruebas que contienen el nombre especificado: --filter "FullyQualifiedName~Namespace.Class" Consulte https://aka.ms/vstest-filtering para obtener más información sobre la compatibilidad con el filtrado.
fr: Permet d'exécuter les tests qui correspondent à l'expression indiquée. Exemples : Exécuter les tests de priorité 1 : --filter "Priority = 1" Exécuter un test avec le nom complet spécifié : --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Exécuter les tests qui contiennent le nom spécifié : --ffilter "FullyQualifiedName~Namespace.Class" Pour plus d'informations sur la prise en charge du filtrage, consultez https://aka.ms/vstest-filtering.
it: Esegui i test corrispondenti all'espressione specificata. Esempi: Esegui i test con priorità impostata su 1: --filter "Priority = 1" Esegui un test con il nome completo specificato: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Esegui i test che contengono il nome specificato: --filter "FullyQualifiedName~Namespace.Class" Per altre informazioni sul supporto dei filtri, veid https://aka.ms/vstest-filtering.
ja: 指定された式に一致するテストを実行します。 例: 優先度を 1 に設定してテストを実行します: --filter "Priority = 1" 指定したフル ネームでテストを実行する: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" 指定した名前を含むテストを実行する: --filter "FullyQualifiedName~Namespace.Class" フィルター処理のサポートの詳細については、https://aka.ms/vstest-filtering をご覧ください。
ko: 지정된 식과 일치하는 테스트를 실행합니다. 예: 우선순위가 1로 설정된 테스트 실행: --filter "Priority = 1" 지정된 전체 이름이 있는 테스트 실행: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" 지정된 이름을 포함하는 테스트 실행: --filter "FullyQualifiedName~Namespace.Class" 필터링 지원에 대한 자세한 내용은 https://aka.ms/vstest-filtering을 참조하세요.
pl: Uruchom testy odpowiadające danemu wyrażeniu. Przykłady: Uruchom testy z priorytetem ustawionym na wartość 1: --filter "Priority = 1" Uruchom test o określonej pełnej nazwie: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Uruchom testy zawierające określoną nazwę: --filter "FullyQualifiedName~Namespace.Class" Aby uzyskać więcej informacji o obsłudze filtrowania, zobacz https://aka.ms/vstest-filtering.
pt_br: Executar os testes que correspondem à expressão fornecida. Exemplos: Executar testes com a prioridade configurada para 1: --filter "Priority = 1" Executar um teste com o nome completo especificado: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Executar testes que contêm o nome especificado: --filter "FullyQualifiedName~Namespace.Class" Confira https://aka.ms/vstest-filtering para obter mais informações sobre o suporte para filtragem.
ru: Запускает тесты, соответствующие данному выражению. Примеры: Запускает тесты с приоритетом 1: --filter "Priority = 1" Запускает тест с указанным полным именем: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Запускает тесты, содержащие указанное имя: --filter "FullyQualifiedName~Namespace.Class" Подробнее о поддержке фильтрации см. https://aka.ms/vstest-filtering.
tr: Belirtilen ifadeyle eşleşen testleri çalıştırır. Örnekler: Önceliği 1: --filter "Priority = 1" olarak ayarlanmış testleri çalıştırır Belirtilen tam ada sahip bir test çalıştırır: --filter "TamAd=AdAlanı.SınıfAdı.MetotAdı" Belirtilen adı içeren testleri çalıştırır: --filter "FullyQualifiedName~Namespace.Class" Filtreleme desteği hakkında daha fazla bilgi için bkz. https://aka.ms/vstest-filtering.
zh_hans: 运行与给定表达式匹配的测试。 示例: 运行优先级设置为 1 的测试: --filter "Priority = 1" 运行具有指定全名的测试: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" 运行包含指定名称的测试: --filter "FullyQualifiedName~Namespace.Class" 有关筛选支持的详细信息，请参阅 https://aka.ms/vstest-filtering。
zh_hant: 執行符合指定運算式的測試。 範例: 執行測試，而優先順序設為 1: --filter "Priority = 1" 使用指定的全名執行測試: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" 執行內含指定名稱的測試: --filter "FullyQualifiedName~Namespace.Class" 如需篩選支援的詳細資訊，請參閱 https://aka.ms/vstest-filtering。

# CmdTestModulesDescription
source: Run tests for the specified test modules.
cs: Spusťte testy pro zadané testovací moduly.
de: Führen Sie Tests für die angegebenen Testmodule aus.
es: Ejecute pruebas para los módulos de prueba especificados.
fr: Exécutez les tests pour les modules de test spécifiés.
it: Esegui i test per i moduli di test specificati.
ja: 指定されたテスト モジュールのテストを実行します。
ko: 지정된 테스트 모듈에 대한 테스트를 실행합니다.
pl: Uruchom testy dla określonych modułów testowych.
pt_br: Execute testes para os módulos de teste especificados.
ru: Запускает тесты для указанных модулей.
tr: Belirtilen test modülleri için testleri çalıştırın.
zh_hans: 对指定的测试模块运行测试。
zh_hant: 為指定的測試模組執行測試。

# CmdTestModulesRootDirectoryDescription
source: The test modules have the specified root directory.
cs: Testovací moduly mají zadaný kořenový adresář.
de: Die Testmodule weisen das angegebene Stammverzeichnis auf.
es: Los módulos de prueba tienen el directorio raíz especificado.
fr: Les modules de test ont le répertoire racine spécifié.
it: I moduli di test hanno la directory radice specificata.
ja: テスト モジュールには、ルート ディレクトリが指定されています。
ko: 테스트 모듈에 지정된 루트 디렉터리가 있습니다.
pl: Moduły testowe mają określony katalog główny.
pt_br: Os módulos de teste têm o diretório raiz especificado.
ru: Модули тестирования имеют указанный корневой каталог.
tr: Test modülleri belirtilen kök dizine sahip.
zh_hans: 测试模块具有指定的根目录。
zh_hant: 測試模組具有指定的根目錄。

# CmdTestOutputDescription
source: Verbosity of test output.
cs: Podrobnosti výstupu testu
de: Ausführlichkeit der Testausgabe.
es: Nivel de detalle de la salida de la prueba.
fr: Verbosité de la sortie de test.
it: Dettaglio dell'output di test.
ja: テスト出力の詳細。
ko: 테스트 출력의 세부 정보 표시입니다.
pl: Szczegółowość danych wyjściowych testu.
pt_br: Detalhamento da saída do teste.
ru: Уровень детализации вывода тестов.
tr: Test çıkışının ayrıntı düzeyi.
zh_hans: 测试输出的详细程度。
zh_hant: 測試輸出的詳細程度。

# CmdTransitiveDescription
source: Lists transitive and top-level packages.
cs: Vypíše seznam přenosných balíčků a balíčků nejvyšší úrovně.
de: Listet transitive Pakete und Pakete der obersten Ebene auf.
es: Contiene paquetes de transitivos y de nivel superior.
fr: Liste les packages transitifs et de niveau supérieur.
it: Elenca i pacchetti transitivi e di primo livello.
ja: 推移的なパッケージと最上位レベルのパッケージを一覧表示します。
ko: 전이적 패키지 및 최상위 패키지를 나열합니다.
pl: Zwraca listę pakietów przejściowych i pakietów najwyższego poziomu.
pt_br: Lista os pacotes de nível superior e transitivos.
ru: Список транзитивных пакетов и пакетов верхнего уровня.
tr: Geçişli ve üst düzey paketleri listeler.
zh_hans: 列出可传递的包和顶级包。
zh_hant: 列出可轉移和頂層套件。

# CmdUnsupportedMessageRequestTypeException
source: Message Request type '{0}' is unsupported.
cs: Typ žádosti o zprávu {0} není podporovaný.
de: Der Nachrichtenanforderungstyp "{0}" wird nicht unterstützt.
es: No se admite el tipo de solicitud de mensaje "{0}".
fr: Le type de requête de message « {0} » n’est pas pris en charge.
it: Il tipo di richiesta di messaggio '{0}' non è supportato.
ja: メッセージ要求の種類 '{0}' はサポートされていません。
ko: 메시지 요청 유형 '{0}'은(는) 지원되지 않습니다.
pl: Typ żądania komunikatu „{0}” nie jest obsługiwany.
pt_br: Tipo de Solicitação de Mensagem "{0}" sem suporte.
ru: Тип запроса "{0}" не поддерживается.
tr: '{0}' İleti İsteği türü desteklenmiyor.
zh_hans: 消息请求类型“{0}”不受支持。
zh_hant: 不支援 '{0}' 訊息要求類型。

# CmdUnsupportedTestRunnerDescription
source: Test runner '{0}' is not supported.
cs: Spouštěč testů {0} není podporován.
de: Der Test Runner "{0}" wird nicht unterstützt.
es: No se admite el ejecutor de pruebas "{0}".
fr: Le test runner « {0} » n’est pas pris en charge.
it: Il Test Runner '{0}' non è supportato.
ja: テスト ランナー '{0}' はサポートされていません。
ko: Test Runner '{0}'은(는) 지원되지 않습니다.
pl: Moduł uruchamiający testy „{0}” nie jest obsługiwany.
pt_br: Não há suporte para o executor de teste "{0}".
ru: Средство тестирования "{0}" не поддерживается.
tr: '{0}' test çalıştırıcısı desteklenmiyor.
zh_hans: 不支持测试运行器“{0}”。
zh_hant: 不支援測試執行器 '{0}'。

# CmdUnsupportedVSTestTestApplicationsDescription
source: dotnet.config defines test runner to be Microsoft.Testing.Platform. All projects must use that test runner. The following test projects are using VSTest test runner: {0} See https://aka.ms/dotnet-test/mtp for more information.
cs: Soubor dotnet.config definuje, že spouštěč testů bude Microsoft.Testing.Platform. Tento spouštěč testů musí používat všechny projekty. Následující testovací projekty používají spouštěč testů VSTest: {0} Další informace najdete na https://aka.ms/dotnet-test/mtp.
de: dotnet.config definiert den Test Runner als Microsoft.Testing.Platform. Alle Projekte müssen diesen Test Runner verwenden. Die folgenden Testprojekte verwenden den VSTest-Test Runner: {0} Weitere Informationen finden Sie unter https://aka.ms/dotnet-test/mtp.
es: dotnet.config define que el ejecutor de pruebas sea Microsoft.Testing.Platform. Todos los proyectos deben usar ese ejecutor de pruebas. Los siguientes proyectos de prueba usan el ejecutor de pruebas de VSTest: {0} Consulte https://aka.ms/dotnet-test/mtp para obtener más información.
fr: dotnet.config définit le test runner comme Microsoft.Testing.Platform. Tous les projets doivent utiliser ce test runner. Les projets de test suivants utilisent le test runner VSTest : {0} Pour plus d’informations, consultez https://aka.ms/dotnet-test/mtp.
it: dotnet.config definisce il Test Runner come Microsoft.Testing.Platform. Tutti i progetti devono usare tale Test Runner. I progetti di test seguenti usano il Test Runner VSTest: {0} Per altre informazioni, vedi https://aka.ms/dotnet-test/mtp.
ja: dotnet.config では、テスト ランナーを Microsoft.Testing.Platform と定義します。すべてのプロジェクトで、そのテスト ランナーを使用する必要があります。 次のテスト プロジェクトでは、VSTest テスト ランナーを使用しています: {0} 詳細については、https://aka.ms/dotnet-test/mtp を参照してください。
ko: dotnet.config는 Test Runner를 Microsoft.Testing.Platform으로 정의합니다. 모든 프로젝트는 해당 Test Runner를 사용해야 합니다. 다음 테스트 프로젝트에서 VSTest Test Runner를 사용하고 있습니다. {0} 자세한 내용은 https://aka.ms/dotnet-test/mtp를 참조하세요.
pl: Plik dotnet.config definiuje moduł uruchamiający testy jako Microsoft.Testing.Platform. Wszystkie projekty muszą używać tego modułu uruchamiającego testy. Następujące projekty testowe używają modułu uruchamiającego testy VSTest: {0} Aby uzyskać więcej informacji, zobacz https://aka.ms/dotnet-test/mtp.
pt_br: dotnet.config define o executor de teste como Microsoft.Testing.Platform. Todos os projetos devem usar esse executor de teste. Os seguintes projetos de teste estão usando o executor de teste do VSTest: {0} Consulte https://aka.ms/dotnet-test/mtp para obter mais informações.
ru: В dotnet.config в качестве средства выполнения тестов указана Microsoft.Testing.Platform. Все проекты должны использовать это средство выполнения тестов. Следующие тестовые проекты используют средство выполнения тестов VSTest: {0} Подробнее см. https://aka.ms/dotnet-test/mtp.
tr: dotnet.config, test çalıştırıcısını Microsoft.Testing.Platform olarak tanımlar. Tüm projelerin bu test çalıştırıcısını kullanması gereklidir. Aşağıdaki test projeleri VSTest test çalıştırıcısını kullanıyor: {0} Daha fazla bilgi için https://aka.ms/dotnet-test/mtp adresine bakın.
zh_hans: dotnet.config 将测试运行器定义为 Microsoft.Testing.Platform。所有项目必须使用该测试运行器。 以下测试项目正在使用 VSTest 测试运行器: {0} 有关详细信息，请参阅 https://aka.ms/dotnet-test/mtp。
zh_hant: dotnet.config 定義測試執行器為 Microsoft.Testing.Platform。所有專案必須使用該測試執行器。 以下測試專案正在使用 VSTest 測試執行器: {0} 如需詳細資訊，請參閱 https://aka.ms/dotnet-test/mtp。

# CmdUseLockFileOptionDescription
source: Enables project lock file to be generated and used with restore.
cs: Povolí vygenerování souboru zámku projektu a jeho použití s obnovením.
de: Ermöglicht das Generieren und Verwenden einer Projektsperrdatei bei der Wiederherstellung.
es: Habilita la generación del archivo de bloqueo del proyecto y su uso con la restauración.
fr: Permet au fichier de verrouillage du projet d'être généré et utilisé avec la restauration.
it: Abilita il file di blocco del progetto da generare e usare con restore.
ja: プロジェクト ロック ファイルを生成して復元で使用できるようにします。
ko: 복원에 사용되고 생성될 프로젝트 잠금 파일을 사용합니다.
pl: Umożliwia generowanie pliku blokady projektu i używanie go przy przywracaniu.
pt_br: Permite que o arquivo de bloqueio do projeto seja gerado e usado com a restauração.
ru: Включает создание файла блокировки проекта и использование этого файла при восстановлении.
tr: Proje kilit dosyasının oluşturulmasını ve geri yükleme ile kullanılmasını etkinleştirir.
zh_hans: 允许生成项目锁定文件并与还原一起使用。
zh_hant: 讓專案鎖定檔案可透過還原來產生和使用。

# CmdVersionDescription
source: The version of the package to add.
cs: Verze balíčku, který se má přidat
de: Die Version des hinzuzufügenden Pakets.
es: La versión del paquete para agregar.
fr: Version du package à ajouter.
it: Versione del pacchetto da aggiungere.
ja: 追加するパッケージのバージョン。
ko: 추가할 패키지의 버전입니다.
pl: Wersja pakietu do dodania.
pt_br: A versão do pacote a ser adicionada.
ru: Версия добавляемого пакета.
tr: Eklenecek paketin sürümü.
zh_hans: 要添加的包版本。
zh_hant: 要新增的套件版本。

# CmdVulnerableDescription
source: Lists packages that have known vulnerabilities. Cannot be combined with '--deprecated' or '--outdated' options.
cs: Vypíše balíčky, které mají známá ohrožení zabezpečení. Nedá se kombinovat s možností --deprecated ani --outdated.
de: Listet Pakete auf, die bekannte Sicherheitsrisiken aufweisen. Kann nicht mit den Optionen "--deprecated" oder "--outdated" kombiniert werden.
es: Muestra los paquetes que tienen vulnerabilidades conocidas. No se puede combinar con las opciones "--outdated" o "--deprecated".
fr: Liste les packages qui ont vulnérabilités. Impossible à combiner avec les options '--deprecated' ou '--outdated'.
it: Elenca i pacchetti che presentano vulnerabilità note. Non può essere combinato con l'opzione '--deprecated' o '--outdated'.
ja: 既知の脆弱性を持つパッケージを一覧表示します。'--deprecated' または '--outdated' オプションと組み合わせることはできません。
ko: 알려진 취약성이 있는 패키지를 나열합니다. '--deprecated' 또는 '--outdated' 옵션과 함께 사용할 수 없습니다.
pl: Wyświetla pakiety ze znanymi lukami w zabezpieczeniach. Nie można łączyć z opcją „--deprecated” ani „--outdated”.
pt_br: Lista os pacotes que têm vulnerabilidades conhecidas. Não pode ser combinado com a opção '--deprecated' nem com a opção '--outdated'.
ru: Возвращает список пакетов, у которых есть известные уязвимости. Не может использоваться с параметрами "--deprecated" или "--outdated".
tr: Bilinen güvenlik açıklarına sahip paketleri listeler. '--deprecated' veya '--outdated' seçenekleriyle birleştirilemez.
zh_hans: 列出具有已知漏洞的包。不能与 "--deprecated" 或 "--outdated" 选项结合使用。
zh_hant: 列出有已知弱點的套件。無法與 '--deprecated' 或 '--outdated' 選項一併使用。

source: Command
cs: Příkaz
de: Befehl
es: Comando
fr: Commande
it: Comando
ja: コマンド
ko: 명령
pl: Polecenie
pt_br: Comando
ru: Команда
tr: Komut
zh_hans: 命令
zh_hant: 命令

# CommandArgumentDescription
source: The SDK command to launch online help for.
cs: Příkaz sady SDK, pro který se má spustit online nápověda
de: Der SDK-Befehl zum Starten der Onlinehilfe.
es: El comando de SDK para el que iniciar la ayuda en línea.
fr: Commande de kit SDK pour laquelle l'aide en ligne est lancée.
it: Comando dell'SDK per cui avviare la Guida.
ja: オンライン ヘルプを起動する SDK コマンド。
ko: 온라인 도움말을 시작하는 SDK 명령입니다.
pl: Polecenie zestawu SDK, dla którego ma zostać uruchomiona pomoc online.
pt_br: O comando do SDK para o qual a ajuda online será iniciada.
ru: Команда пакета SDK, по которой нужно запустить интернет-справку.
tr: Çevrimiçi yardımı başlatılacak SDK komutu.
zh_hans: 要启动联机帮助的 SDK 命令。
zh_hant: 啟動其線上說明的 SDK 命令。

# CommandDoesNotExist
source: Specified command '{0}' is not a valid SDK command. Specify a valid SDK command. For more information, run dotnet help.
cs: Zadaný příkaz {0} není platným příkazem sady SDK. Zadejte platný příkaz sady SDK. Další informace získáte spuštěním příkazu dotnet help.
de: Der angegebene Befehl "{0}" ist kein gültiger SDK-Befehl. Geben Sie einen gültigen SDK-Befehl an. Führen Sie "dotnet help" aus, um weitere Informationen zu erhalten.
es: El comando especificado "{0}" no es un comando de SDK válido. Especifique un comando de SDK válido. Para más información, ejecute la ayuda de dotnet.
fr: La commande spécifiée '{0}' n'est pas une commande SDK valide. Spécifiez une commande SDK valide. Pour plus d'informations, exécutez dotnet help.
it: Il comando specificato '{0}' non è un comando valido dell'SDK. Specificare un comando valido dell'SDK. Per altre informazioni, eseguire dotnet help.
ja: 指定されたコマンド '{0}' は、有効な SDK コマンドではありません。有効な SDK コマンドを指定してください。詳細については、dotnet のヘルプを実行してください。
ko: 지정된 명령 '{0}'은(는) 유효한 SDK 명령이 아닙니다. 유효한 SDK 명령을 지정하세요. 자세한 내용은 dotnet 도움말을 실행하세요.
pl: Określone polecenie („{0}”) nie jest prawidłowym poleceniem zestawu SDK. Określ prawidłowe polecenie zestawu SDK. Aby uzyskać więcej informacji, uruchom polecenie dotnet help.
pt_br: O comando especificado '{0}' não é um comando do SDK válido. Especifique um comando do SDK válido. Para obter mais informações, execute a ajuda do dotnet.
ru: Указанная команда "{0}" не является допустимой командой пакета SDK. Укажите допустимую. Для получения дополнительных сведений выполните команду "dotnet help".
tr: Belirtilen '{0}' komutu geçerli bir SDK komutu değil. Geçerli bir SDK komutu belirtin. Daha fazla bilgi için dotnet help komutunu çalıştırın.
zh_hans: 指定的命令“{0}”不是有效的 SDK 命令。请指定有效的 SDK 命令。有关详细信息，请运行 dotnet help。
zh_hant: 指定的命令 '{0}' 並非有效的 SDK 命令。請指定有效的 SDK 命令。如需詳細資訊，請執行 dotnet help。

# CommandFooter
source: The latest versions of .NET can be installed from https://aka.ms/dotnet-core-download. For more information about .NET lifecycles, see https://aka.ms/dotnet-core-support.
cs: Nejnovější verze rozhraní .NET se dají nainstalovat z adresy https://aka.ms/dotnet-core-download. Další informace o životních cyklech rozhraní .NET najdete na adrese https://aka.ms/dotnet-core-support.
de: Die neuesten Versionen von .NET können über https://aka.ms/dotnet-core-download installiert werden. Weitere Informationen zu den .NET-Lebenszyklen finden Sie unter https://aka.ms/dotnet-core-support.
es: Las últimas versiones de .NET pueden instalarse desde https://aka.ms/dotnet-core-download. Para obtener más información sobre los ciclos de vida de .NET, consulte https://aka.ms/dotnet-core-support.
fr: Les dernières versions de .NET peuvent être installées à partir de https://aka.ms/dotnet-core-download. Pour plus d'informations sur les cycles de vie de .NET, consultez https://aka.ms/dotnet-core-support.
it: È possibile installare le versioni più recenti di .NET da https://aka.ms/dotnet-core-download. Per altre informazioni sui cicli di vita di .NET, vedere https://aka.ms/dotnet-core-support.
ja: .Net の最新バージョンは https://aka.ms/dotnet-core-download からインストールできます。.NET ライフサイクルの詳細については、https://aka.ms/dotnet-core-support を参照してください。
ko: 최신 .Net 버전은 https://aka.ms/dotnet-core-download에서 설치할 수 있습니다. .NET 수명 주기에 대한 자세한 내용은 https://aka.ms/dotnet-core-support를 참조하세요.
pl: Najnowsze wersje platformy .NET można zainstalować ze strony https://aka.ms/dotnet-core-download. Więcej informacji o cyklach życia platformy .NET można znaleźć na stronie https://aka.ms/dotnet-core-support.
pt_br: As últimas versões do .NET podem ser instaladas de https://aka.ms/dotnet-core-download. Para obter mais informações sobre os ciclos de vida do .NET, confira https://aka.ms/dotnet-core-support.
ru: Последние версии .NET можно установить по адресу https://aka.ms/dotnet-core-download. Дополнительные сведения о жизненных циклах .NET см. на странице https://aka.ms/dotnet-core-support.
tr: En son .NET sürümlerini https://aka.ms/dotnet-core-download adresinden yükleyebilirsiniz. .NET yaşam döngüleri hakkında daha fazla bilgi için bkz. https://aka.ms/dotnet-core-support.
zh_hans: 可从 https://aka.ms/dotnet-core-download 安装最新版本的 .NET。有关 .NET 生命周期的详细信息，请参阅 https://aka.ms/dotnet-core-support。
zh_hant: 最新的 .NET 版本可前往 https://aka.ms/dotnet-core-download. 安裝。如需 .NET 生命週期的詳細資訊，請參閱 https://aka.ms/dotnet-core-support。

# CommandNameArgumentDescription
source: The command name of the tool to run.
cs: Název příkazu nástroje, který se má spustit
de: Der Befehlsname des auszuführenden Tools.
es: El nombre de comando de la herramienta que se va a ejecutar.
fr: Nom de commande de l'outil à exécuter.
it: Nome del comando dello strumento da eseguire.
ja: 実行するツールのコマンド名。
ko: 실행할 도구의 명령 이름입니다.
pl: Nazwa polecenia narzędzia do uruchomienia.
pt_br: O nome de comando da ferramenta a ser executada.
ru: Имя выполняемой команды в средстве.
tr: Çalıştırılacak aracın komut adı.
zh_hans: 要运行的工具的命令名称。
zh_hant: 要執行的工具命令名稱。
