Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Aborted
cs: Přerušeno
de: Abgebrochen
es: Anulado
fr: Abandonné
it: Operazione interrotta
ja: 中止されました
ko: 중단됨
pl: Przerwano
pt_br: Anulado
ru: Прервано
tr: İptal edildi
zh_hans: 已中止
zh_hant: 已中止

# ActiveTestsRunning_FullTestsCount
source: {0} tests running
cs: Spuštěné testy: {0}
de: {0} Tests werden ausgeführt
es: {0} pruebas en ejecución
fr: {0} tests en cours d’exécution
it: {0} test in esecuzione
ja: {0} 個のテストが実行中
ko: 실행 중인 테스트 {0}개
pl: Liczb uruchomionych testów: {0}
pt_br: {0} testes em execução
ru: Выполняется тестов: {0}
tr: {0} test çalıştırılıyor
zh_hans: {0} 个测试正在运行
zh_hant: 正在執行 {0} 個測試

# ActiveTestsRunning_MoreTestsCount
source: and {0} more
cs: a ještě {0}
de: und {0} weitere
es: y {0} más
fr: et {0} de plus
it: e altri {0}
ja: その他 {0} 件
ko: 외 {0}개
pl: i {0} więcej
pt_br: e mais {0}
ru: и еще {0}
tr: ve {0} tane daha
zh_hans: 和其他 {0} 项
zh_hant: 和其他 {0} 個

source: Actual
cs: Skutečnost
de: Aktuell
es: Real
fr: Réel
it: Effettivi
ja: 実際
ko: 실제
pl: Rzeczywiste
pt_br: Real
ru: Фактические
tr: Fiili
zh_hans: 实际
zh_hant: 實際

# AdManifestOnlyOptionDescription
source: Only update advertising manifests.
cs: Aktualizujte jenom manifesty reklamy.
de: Aktualisieren Sie nur Werbemanifeste.
es: Actualizar solo los manifiestos de publicidad.
fr: Mettre à jour uniquement les manifestes de publicité
it: Aggiornare solo i manifesti pubblicitari.
ja: 広告マニフェストのみを更新します。
ko: 광고 매니페스트만 업데이트합니다.
pl: Aktualizuj tylko manifesty reklam.
pt_br: Atualizar somente manifestos de anúncio.
ru: Обновляются только манифесты рекламы.
tr: Yalnızca reklam bildirimlerini güncelleştirin.
zh_hans: 仅更新广告清单。
zh_hant: 只更新廣告資訊清單。

# AdManifestPackageDoesNotExist
source: Advertising manifest not updated. Manifest package for {0} doesn't exist.
cs: Manifest reklamy není aktualizován. Balíček manifestu pro {0} neexistuje.
de: Das Werbemanifest wurde nicht aktualisiert. Das Manifestpaket für {0} ist nicht vorhanden.
es: Manifiesto de publicidad no actualizado. El paquete de manifiesto para {0} no existe.
fr: Manifeste de publicité non mis à jour. Le package de manifeste pour {0} n’existe pas.
it: Manifesto della pubblicità non aggiornato. Il pacchetto del manifesto per {0} non esiste.
ja: 広告マニフェストが更新されません。{0} 向けマニフェスト パッケージが存在しません。
ko: 광고 매니페스트가 업데이트되지 않았습니다. {0}에 대한 매니페스트 패키지가 없습니다.
pl: Manifest treści reklamowych nie został zaktualizowany. Pakiet manifestu dla {0} nie istnieje.
pt_br: Manifesto de publicidade não atualizado. O pacote de {0} não existe.
ru: Манифест рекламы не обновлен. Не существует пакета манифеста для следующего: {0}.
tr: Reklam bildirimi güncelleştirilmedi. {0} için bildirim paketi yok.
zh_hans: 广告清单未更新。{0} 的清单包不存在。
zh_hant: 未更新廣告資訊清單。{0} 的資訊清單封裝並不存在。

# AdManifestUpdated
source: Updated advertising manifest {0}.
cs: Aktualizoval se manifest reklamy {0}.
de: Das Ankündigungsmanifest "{0}" wurde aktualisiert.
es: Manifiesto publicitario actualizado {0}
fr: {0} manifeste de publicité mis à jour.
it: Manifesto di pubblicità aggiornato {0}.
ja: 広告マニフェスト {0} を更新しました。
ko: 광고 매니페스트 {0}(을)를 업데이트했습니다.
pl: Zaktualizowano manifest anonsowania {0}.
pt_br: Manifesto de publicidade atualizado {0}.
ru: Обновлен манифест рекламы {0}.
tr: Reklam bildirimi {0} güncelleştirildi.
zh_hans: 已更新广告清单 {0}。
zh_hant: 已更新廣告資訊清單 {0}。

# AddAppFullName
source: Add one or more projects to a solution file.
cs: Přidá do souboru řešení jeden nebo více projektů.
de: Fügt einer Projektmappendatei ein oder mehrere Projekte hinzu.
es: Agrega uno o varios proyectos a un archivo de solución.
fr: Ajoutez un ou plusieurs projets à un fichier solution.
it: Consente di aggiungere uno o più progetti a un file di soluzione.
ja: 1 つ以上のプロジェクトをソリューション ファイルに追加します。
ko: 솔루션 파일에 하나 이상의 프로젝트를 추가합니다.
pl: Dodaj co najmniej jeden projekt do pliku rozwiązania.
pt_br: Adicionar um ou mais projetos em um arquivo de solução.
ru: Добавление проектов в файл решения.
tr: Bir çözüm dosyasına bir veya daha fazla proje ekler.
zh_hans: 将一个或多个项目添加到解决方案文件。
zh_hant: 為解決方案檔新增一或多個專案。

# AddProjectPathArgumentDescription
source: The paths to the projects to add to the solution.
cs: Cesty k projektům, které se mají přidat do řešení
de: Die Pfade zu den Projekten, die zur Projektmappe hinzugefügt werden sollen.
es: Las rutas a los proyectos para agregar la solución.
fr: Chemins des projets à ajouter à la solution.
it: Percorsi dei progetti da aggiungere alla soluzione.
ja: ソリューションに追加するプロジェクトへのパス。
ko: 솔루션에 추가할 프로젝트의 경로입니다.
pl: Ścieżki do projektów, które mają zostać dodane do rozwiązania.
pt_br: Os caminhos para os projetos a serem adicionados na solução.
ru: Пути к проектам, которые необходимо добавить в решение.
tr: Çözüme eklenecek projelerin yolları.
zh_hans: 要添加到解决方案的项目路径。
zh_hant: 到達要新增至解決方案之專案的路徑。

# AddProjectSolutionFolderArgumentDescription
source: The destination solution folder path to add the projects to.
cs: Cílová cesta složky řešení, do které chcete přidat projekty
de: Der Zielpfad des Projektmappenordners, dem die Projekte hinzugefügt werden sollen.
es: Ruta de acceso de la carpeta de la solución de destino a la que agregar los proyectos.
fr: Chemin de dossier solution de destination où les projets doivent être ajoutés.
it: Percorso della cartella della soluzione di destinazione in cui aggiungere i progetti.
ja: プロジェクトの追加先のソリューション フォルダー パス。
ko: 프로젝트를 추가하려는 대상 솔루션 폴더 경로입니다.
pl: Ścieżka folderu rozwiązania docelowego określająca lokalizację dodawanych projektów.
pt_br: O caminho da pasta de solução de destino ao qual adicionar os projetos.
ru: Путь к папке назначения решения, в которую будут добавлены проекты.
tr: Projelerin ekleneceği hedef çözüm klasör yolu.
zh_hans: 要添加项目的目标解决方案文件夹路径。
zh_hant: 要新增專案的目標目的地解決方案資料夾路徑。

# AdditionalDeps
source: Path to additional deps.json file.
cs: Cesta k dodatečnému souboru deps.json.
de: Pfad zur zusätzlichen Datei "deps.json".
es: Ruta de acceso al archivo deps.json adicional.
fr: Chemin du fichier deps.json supplémentaire.
it: Percorso del file deps.json aggiuntivo.
ja: 追加の deps.json ファイルへのパス。
ko: 추가 deps.json 파일의 경로입니다.
pl: Ścieżka do dodatkowego pliku deps.json.
pt_br: Caminho para o arquivo deps.json adicional.
ru: Путь к дополнительному файлу deps.json.
tr: Ek deps.json dosyasının yolu.
zh_hans: 指向其他 deps.json 文件的路径。
zh_hant: 其他 deps.json 檔案的路徑。

# AdditionalProbingPathDefinition
source: Path containing probing policy and assemblies to probe for.
cs: Cesta obsahující testovací zásady a sestavení, která se mají testovat
de: Pfad, der die Suchrichtlinie und die zu suchenden Assemblys enthält.
es: Ruta de acceso que contiene la directiva de sondeo y los ensamblados para los que realizar el sondeo.
fr: Chemin contenant la stratégie de collecte et les assemblys à collecter.
it: Percorso che contiene i criteri di esecuzione probe e gli assembly per cui eseguire il probe.
ja: 調査ポリシーと調査対象アセンブリを含むパス。
ko: 프로브할 프로빙 정책 및 어셈블리를 포함하는 경로입니다.
pl: Ścieżka zawierająca zasady sondowania i zestawy do sondowania.
pt_br: Caminho contendo a política de investigação e os assemblies a investigar.
ru: Путь к политике проверки и проверяемым сборкам.
tr: Yoklama ilkesini ve yoklanacak bütünleştirilmiş kodları içeren yol.
zh_hans: 要探测的包含探测策略和程序集的路径。
zh_hant: 包含探查原則及要探查之組件的路徑。

# AdditionalTools
source: Additional commands from bundled tools:
cs: Další příkazy z nástrojů v balíčku:
de: Zusätzliche Befehle von Toolpaketen:
es: Comandos adicionales para herramientas incluidas:
fr: Commandes supplémentaires d'outils groupés :
it: Comandi aggiuntivi degli strumenti in bundle:
ja: バンドルされたツールからの追加コマンド:
ko: 번들 도구의 추가 명령:
pl: Dodatkowe polecenia z narzędzi w pakiecie:
pt_br: Comandos adicionais de ferramentas em pacote:
ru: Дополнительные команды из входящих в пакет инструментов:
tr: Paket grubu oluşturulmuş araçlardaki ek komutlar:
zh_hans: 捆绑工具中的其他命令:
zh_hant: 來自配套工具的其他命令:

# AllowPackageDowngradeOptionDescription
source: Allow package downgrade when installing a .NET tool package.
cs: Při instalaci balíčku nástroje .NET povolte downgrade balíčku.
de: Paketdowngrade beim Installieren eines .NET-Toolpakets zulassen.
es: Permitir la degradación del paquete al instalar un paquete de herramientas de .NET.
fr: Autoriser le passage à une version antérieure du package lors de l’installation d’un package d’outils .NET.
it: Consente il downgrade del pacchetto durante l'installazione di un pacchetto di strumenti .NET.
ja: .NET ツール パッケージのインストール時にパッケージのダウングレードを許可します。
ko: .NET 도구 패키지를 설치할 때 패키지 다운그레이드를 허용합니다.
pl: Zezwalaj na obniżanie wersji pakietu podczas instalowania pakietu narzędzi .NET.
pt_br: Permitir downgrade de pacote ao instalar um pacote de ferramentas do .NET.
ru: Разрешить переход на использование более ранней версии пакета при установке пакета инструментов .NET.
tr: Bir .NET araç paketini yüklerken paketi eski sürüme düşürmeye izin verin.
zh_hans: 安装 .NET 工具包时允许包降级。
zh_hant: 安裝 .NET 工具套件時允許套件降級。

# AspireWorkloadDeprecated
source: The Aspire workload is deprecated and no longer necessary. Aspire is now available as NuGet packages that you can add directly to your projects. For more information, see https://aka.ms/aspire/support-policy
cs: Úloha Aspire je zastaralá a už není potřeba. Aspire je nyní k dispozici v podobě balíčků NuGet, které můžete přidat přímo do svých projektů. Další informace najdete na https://aka.ms/aspire/support-policy
de: Die Workload „Aspire“ ist veraltet und nicht mehr erforderlich. Aspire ist jetzt als NuGet-Pakete verfügbar, die Sie direkt Ihren Projekten hinzufügen können. Weitere Informationen finden Sie unter https://aka.ms/aspire/support-policy
es: La carga de trabajo Aspire está en desuso y ya no es necesaria. Ahora Aspire está disponible como paquetes NuGet que puedes añadir directamente a tus proyectos. Para obtener más información, consulta https://aka.ms/aspire/support-policy
fr: La charge de travail Aspire est dépréciée et n’est plus nécessaire. Aspire est désormais disponible sous forme de packages NuGet que vous pouvez ajouter directement à vos projets. Pour plus d’informations, consultez https://aka.ms/aspire/support-policy
it: Il carico di lavoro Aspire è deprecato e non è più necessario. Aspire ora è disponibile come pacchetti NuGet che puoi aggiungere direttamente ai tuoi progetti. Per altre informazioni, visita https://aka.ms/aspire/support-policy
ja: Aspire ワークロードは非推奨となり、不要になりました。Aspire は現在、プロジェクトに直接追加できる NuGet パッケージとして利用可能です。詳細情報については、https://aka.ms/aspire/support-policy をご覧ください
ko: Aspire 워크로드는 더 이상 사용되지 않으며 필요하지 않습니다. Aspire는 이제 NuGet 패키지로 제공되어 프로젝트에 직접 추가할 수 있습니다. 자세한 내용은 https://aka.ms/aspire/support-policy를 참조하세요.
pl: Obciążenie Aspire jest przestarzałe i nie jest już konieczne. Usługa Aspire jest teraz dostępna jako pakiety NuGet, które można dodawać bezpośrednio do projektów. Więcej informacji znajdziesz na stronie https://aka.ms/aspire/support-policy
pt_br: A carga de trabalho Aspire está obsoleta e não é mais necessária. O Aspire agora está disponível como pacotes NuGet que você pode adicionar diretamente aos seus projetos. Para mais informações, consulte https://aka.ms/aspire/support-policy
ru: Рабочая нагрузка Aspire является нерекомендуемой и больше не требуется. Теперь нагрузка Aspire доступна в виде пакетов NuGet, которые можно добавлять непосредственно в проекты. Дополнительные сведения см. на странице https://aka.ms/aspire/support-policy
tr: Aspire iş yükü kullanım dışı bırakıldı ve artık gerekli değil. Aspire, projelerinize doğrudan ekleyebileceğiniz NuGet paketleri olarak kullanılabilir. Daha fazla bilgi için bkz. https://aka.ms/aspire/support-policy
zh_hans: Aspire 工作负载已弃用，并且不再是必需项。Aspire 现在以 NuGet 包的形式提供，可以直接将其添加到项目中。有关详细信息，请参阅 https://aka.ms/aspire/support-policy
zh_hant: Aspire 工作負載已棄用，不再需要。Aspire 現已作為 NuGet 套件提供，您可以將它直接新增至專案。如需詳細資訊，請參閱 https://aka.ms/aspire/support-policy

source: Authors
cs: Autoři
de: Autoren
es: Autores
fr: Auteurs
it: Autori
ja: 作成者
ko: 작성자
pl: Autorzy
pt_br: Autores
ru: Авторы
tr: Yazarlar
zh_hans: 作者
zh_hant: 作者

# BuildAppFullName
source: .NET Builder
de: .NET-Generator
es: Generador para .NET
fr: Générateur .NET
it: Generatore .NET
ja: .NET ビルダー
ko: .NET 작성기
pl: Konstruktor platformy .NET
pt_br: Construtor do .NET
ru: Построитель .NET
tr: .NET Oluşturucusu
zh_hans: .NET 生成器
zh_hant: .NET 產生器

# BuildCmdNoLogo
source: Do not display the startup banner or the copyright message.
cs: Nezobrazovat úvodní nápis ani zprávu o autorských právech
de: Zeigt kein Startbanner und keine Copyrightmeldung an.
es: No mostrar la pancarta de inicio ni el mensaje de copyright.
fr: N'affiche pas la bannière de démarrage ni le message de copyright.
it: Evita la visualizzazione del messaggio di avvio o di copyright.
ja: 著作権情報を表示しません。
ko: 시작 배너 또는 저작권 메시지를 표시하지 않습니다.
pl: Nie wyświetlaj baneru początkowego ani komunikatu o prawach autorskich.
pt_br: Não exibe a faixa de inicialização ou a mensagem de direitos autorais.
ru: Не отображать начальный баннер или сообщение об авторских правах.
tr: Başlangıç bandını veya telif hakkı iletisini görüntüleme.
zh_hans: 不显示启动版权标志或版权消息。
zh_hant: 不顯示啟始資訊或著作權訊息。

# BuildConfigurationOptionDescription
source: The configuration to use for building the project. The default for most projects is 'Debug'.
cs: Konfigurace použitá k sestavení projektu. Výchozí možností pro většinu projektů je Debug.
de: Die für die Projekterstellung zu verwendende Konfiguration. Standard für die meisten Projekte ist "Debug".
es: La configuración que se usará para compilar el proyecto. El valor predeterminado para la mayoría de los proyectos es "Debug".
fr: Configuration à utiliser pour la génération du projet. La valeur par défaut pour la plupart des projets est 'Debug'.
it: Configurazione da usare per compilare il progetto. L'impostazione predefinita per la maggior parte dei progetti è 'Debug'.
ja: プロジェクトのビルドに使用する構成。ほとんどのプロジェクトで、既定値は 'Debug' です。
ko: 프로젝트 빌드에 사용할 구성입니다. 대부분의 프로젝트에서 기본값은 'Debug'입니다.
pl: Konfiguracja do użycia na potrzeby kompilacji projektu. W przypadku większości projektów ustawienie domyślne to „Debugowanie”.
pt_br: A configuração a ser usada para compilar o projeto. O padrão para a maioria dos projetos é "Debug".
ru: Конфигурация, используемая при сборке проекта. По умолчанию для большинства проектов используется "Debug".
tr: Projeyi derlemek için kullanılacak yapılandırma. Çoğu proje için varsayılan, ‘Hata Ayıklama’ seçeneğidir.
zh_hans: 用于生成项目的配置。大多数项目的默认值是 "Debug"。
zh_hant: 要用於建置專案的組態。大部分的專案預設為「偵錯」。

# BuildDefinition
source: Build a .NET project.
cs: Sestaví projekt .NET.
de: Hiermit wird ein .NET-Projekt erstellt.
es: Compila un proyecto de .NET.
fr: Générez un projet .NET.
it: Compila un progetto .NET.
ja: .NET プロジェクトをビルドします。
ko: .NET 프로젝트를 빌드합니다.
pl: Kompiluj projekt platformy .NET.
pt_br: Criar um projeto do .NET.
ru: Сборка проекта .NET.
tr: Bir .NET projesi derler.
zh_hans: 生成 .NET 项目。
zh_hant: 建置 .NET 專案。

# BuildFrameworkOptionDescription
source: The target framework to build for. The target framework must also be specified in the project file.
cs: Cílová architektura pro sestavení. Cílová architektura musí být určená také v souboru projektu.
de: Das Zielframework für die Erstellung. Das Zielframework muss auch in der Projektdatei angegeben werden.
es: La plataforma de destino para la que se compila. La plataforma de destino se debe especificar en el archivo de proyecto.
fr: Framework cible pour lequel la génération est effectuée. Le framework cible doit également être spécifié dans le fichier projet.
it: Framework di destinazione per cui eseguire la compilazione. Il framework di destinazione deve essere specificato anche nel file di progetto.
ja: ビルドする対象のターゲット フレームワーク。ターゲット フレームワークはプロジェクト ファイルでも指定する必要があります。
ko: 빌드할 대상 프레임워크입니다. 대상 프레임워크는 프로젝트 파일에도 지정되어야 합니다.
pl: Platforma docelowa kompilacji. Platforma docelowa musi być również określona w pliku projektu.
pt_br: A estrutura de destino na qual o build ocorrerá. A estrutura de destino também deve ser especificada no arquivo de projeto.
ru: Целевая платформа для сборки. Целевая платформа также должна быть указана в файле проекта.
tr: Derlemenin yapılacağı hedef çerçeve. Hedef çerçevenin proje dosyasında da belirtilmesi gerekir.
zh_hans: 要生成的目标框架。必须在项目文件中指定目标框架。
zh_hant: 要為其進行建置的目標架構。該目標架構必須在專案檔中指定。

# BuildOutputOptionDescription
source: The output directory to place built artifacts in.
cs: Výstupní adresář, do kterého se mají umístit sestavené artefakty
de: Das Ausgabeverzeichnis, in dem erstellte Artefakte abgelegt werden.
es: Directorio de salida en el que se ubicarán los artefactos compilados.
fr: Répertoire de sortie dans lequel placer les artefacts générés.
it: Directory di output in cui inserire gli artefatti compilati.
ja: ビルド成果物を配置する出力ディレクトリ。
ko: 빌드된 아티팩트를 배치할 출력 디렉터리입니다.
pl: Katalog wyjściowy, w którym mają zostać umieszczone skompilowane artefakty.
pt_br: O diretório de saída no qual os artefatos do build serão colocados.
ru: Выходной каталог для размещения артефактов сборки.
tr: Derlenen yapıtların yerleştirileceği çıkış dizini.
zh_hans: 要放置生成项目的输出目录。
zh_hant: 放置建置成品的輸出目錄。

# BuildRuntimeOptionDescription
source: The target runtime to build for.
cs: Cílový modul runtime pro sestavení.
de: Die Zielruntime für die Erstellung.
es: El entorno de tiempo de ejecución para el que se compila.
fr: Runtime cible pour lequel la génération est effectuée.
it: Runtime di destinazione per cui eseguire la compilazione.
ja: ビルドする対象のターゲット ランタイム。
ko: 빌드할 대상 런타임입니다.
pl: Docelowe środowisko uruchomieniowe kompilacji.
pt_br: O runtime de destino no qual o build ocorrerá.
ru: Целевая среда выполнения для сборки.
tr: Derlemenin yapılacağı hedef çalışma zamanı.
zh_hans: 要生成的目标运行时。
zh_hant: 要為其進行建置的目標執行階段。

# BuildServerCommandDescription
source: Interact with servers started from a build.
cs: Interakce se servery spuštěnými z buildu
de: Interaktion mit Servern, die aus einem Build gestartet werden.
es: Interactúe con los servidores que se inician desde una compilación.
fr: Interagissez avec les serveurs démarrés à partir d'une build.
it: Interagisce con server avviati da una compilazione.
ja: ビルドから開始されたサーバーとやり取りします。
ko: 서버와 상호 작용이 빌드에서 시작되었습니다.
pl: Interakcja z serwerami uruchomionymi z poziomu kompilacji.
pt_br: Interagir com servidores iniciados de um build.
ru: Взаимодействие с серверами, запущенными в ходе сборки.
tr: Bir derlemeden başlatılan sunucularla etkileşimde bulunun.
zh_hans: 与从生成版本启动的服务器进行交互。
zh_hant: 與組建啟動的伺服器互動。

# BuildServerDefinition
source: Interact with servers started by a build.
cs: Interakce se servery spuštěnými buildem
de: Interaktion mit Servern, die durch einen Build gestartet werden.
es: Interactúe con los servidores que inicia una compilación.
fr: Interagissez avec les serveurs démarrés par une build.
it: Interagisce con server avviati da una compilazione.
ja: ビルドによって開始されたサーバーとやり取りします。
ko: 빌드에 의해 서버와 상호 작용이 시작되었습니다.
pl: Interakcja z serwerami uruchomionymi przez kompilację.
pt_br: Interagir com servidores iniciados por um build.
ru: Взаимодействие с серверами, запущенными в ходе сборки.
tr: Bir derleme tarafından başlatılan sunucularla etkileşimde bulunun.
zh_hans: 与由生成版本启动的服务器进行交互。
zh_hant: 與組建啟動的伺服器互動。

# BuildServerShutdownCommandDescription
source: Shuts down build servers that are started from dotnet. By default, all servers are shut down.
cs: Vypne buildovací servery spuštěné z dotnetu. Ve výchozím nastavení jsou vypnuté všechny servery.
de: Fährt Buildserver herunter, die aus .NET gestartet werden. Standardmäßig werden alle Server heruntergefahren.
es: Apaga los servidores de compilación que se inician desde dotnet. De forma predeterminada, se apagan todos los servidores.
fr: Arrête les serveurs de builds démarrés à partir de dotnet. Par défaut, tous les serveurs sont arrêtés.
it: Arresta i server di compilazione avviati da dotnet. Per impostazione predefinita, vengono arrestati tutti i server.
ja: dotnet から起動されたビルド サーバーをシャットダウンします。既定では、すべてのサーバーがシャットダウンされます。
ko: dotnet에서 시작한 빌드 서버를 종료합니다. 기본적으로 모든 서버가 종료됩니다.
pl: Zamyka serwery kompilacji, które zostały uruchomione z poziomu polecenia dotnet. Domyślnie zamykane są wszystkie serwery.
pt_br: Desliga os servidores de build que são iniciados do dotnet. Por padrão, todos os servidores são desligados.
ru: Завершает работу серверов сборки, запущенных из среды dotnet. По умолчанию завершается работа всех серверов.
tr: Dotnet’ten başlatılan derleme sunucularını kapatır. Varsayılan olarak tüm sunucular kapalıdır.
zh_hans: 关闭从 dotnet 启动的生成服务器。默认情况下，所有服务器都将关闭。
zh_hant: 關閉 dotnet 啟動的組建伺服器。根據預設會關閉所有伺服器。

# BundleUpToDateMessage
source: Up to date.
cs: Aktuální
de: Auf dem neuesten Stand.
es: Está actualizado.
fr: À jour.
it: Aggiornato.
ja: 最新。
ko: 최신 상태입니다.
pl: Aktualne.
pt_br: Atualizado.
ru: Актуальное состояние.
tr: Güncel.
zh_hans: 最新。
zh_hant: 最新資訊。

# CacheMissingPackage
source: Package {0} version {1} doesn't exist in offline cache {2}.
cs: Balíček {0} verze {1} v offline mezipaměti {2} neexistuje.
de: Das Paket {0}, Version {1}, ist im Offlinecache {2} nicht vorhanden.
es: El paquete {0}, versión {1} no existe en la caché sin conexión {2}.
fr: La version du {0} de package {1} n’existe pas dans le cache hors connexion {2}.
it: Il pacchetto {0}, versione {1}, non esiste nella cache offline {2}.
ja: パッケージ {0} バージョン {1} がオフラインキャッシュ {2} に存在しません。
ko: 패키지 {0} 버전 {1}은(는) 오프라인 캐시 {2}에 존재하지 않습니다.
pl: Pakiet {0} w wersji {1} nie istnieje w pamięci podręcznej trybu offline {2}.
pt_br: O pacote {0} versão {1} não existe no cache offline {2}.
ru: Пакет {0} версии {1} не существует в автономном кэше {2}.
tr: {0} paketi sürüm {1}, çevrimdışı {2} önbelleğinde yok.
zh_hans: 脱机缓存 {0} 中不存在程序包 {1} 版本 {2}。
zh_hant: 離線快取 {2} 中並沒有套件 {0} 版本 {1}。

# CancelledLowercase
source: canceled
cs: zrušeno
de: Abgebrochen
es: cancelada
fr: annulé
it: operazione annullata
ja: キャンセルされました
ko: 취소됨
pl: anulowane
pt_br: cancelado
ru: отменено
tr: iptal edildi
zh_hans: 已取消
zh_hant: 已取消

# CancellingTestSession
source: Canceling the test session...
cs: Ruší se testovací relace...
de: Die Testsitzung wird abgebrochen...
es: Cancelando la sesión de prueba...
fr: Annulation en cours de la session de test... Merci de patienter.
it: Annullamento della sessione di test in corso...
ja: テスト セッションを取り消しています...
ko: 테스트 세션을 취소하는 중...
pl: Trwa anulowanie sesji testowej...
pt_br: Cancelamento da sessão de testes...
ru: Отмена тестового сеанса...
tr: Test oturumu iptal ediliyor...
zh_hans: 正在取消测试会话...
zh_hant: 正在取消測試工作階段...
