Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ToolDownloadConfirmationPrompt
source: Tool package {0}@{1} will be downloaded from source {2}. Proceed?
cs: Balíček nástroje {0}@{1} bude stažen ze zdroje {2}. Chcete pokračovat?
de: Das Toolpaket {0}@{1} wird aus der Quelle "{2}" heruntergeladen. Vorgang fortsetzen?
es: El paquete de herramientas {0}@{1} se descargará desde el origen {2}. ¿Quiere continuar?
fr: Le package d’outils {0}@{1} sera téléchargé à partir de la source {2}. Voulez-vous continuer ?
it: Il pacchetto dello strumento {0}@{1} verrà scaricato da {2}. Procedere?
ja: ツール パッケージ {0}@{1} がソース {2} からダウンロードされます。 続行しますか?
ko: 도구 패키지 {0}@{1}이(가) 원본 {2}에서 다운로드됩니다. 계속하시겠습니까?
pl: Pakiet narzędzi {0}@{1} zostanie pobrany ze źródła {2}. Kontynuować?
pt_br: O pacote de ferramentas {0}@{1} será baixado da fonte {2}. Continuar?
ru: Пакет инструмента {0}@{1} будет скачан из источника {2}. Продолжить?
tr: Araç paketi {0}@{1} {2} kaynağından indirilecektir. Devam edilsin mi?
zh_hans: 将从源 {2} 下载工具包 {0}@{1}。 是否继续?
zh_hant: 將從來源 {2}下載工具套件 {0}@{1}。 要繼續嗎?

# ToolDownloadNeedsConfirmation
source: Tool package download needs confirmation. Run in interactive mode or use the "--yes" command-line option to confirm.
cs: Stažení balíčku nástroje vyžaduje potvrzení. Spusťte v interaktivním režimu nebo potvrďte akci pomocí možnosti příkazového řádku --yes.
de: Der Download des Toolpakets muss bestätigt werden. Führen Sie den Vorgang im interaktiven Modus aus oder verwenden Sie zur Bestätigung die Befehlszeilenoption "--yes".
es: La descarga del paquete de herramientas necesita confirmación. Ejecute en modo interactivo o use la opción de línea de comandos "--yes" para confirmar.
fr: Le téléchargement du package d’outils doit être confirmé. Exécutez en mode interactif ou utilisez l’option de ligne de commande « --yes » pour confirmer.
it: Il download del pacchetto dello strumento richiede conferma. Esegui in modalità interattiva o usa l'opzione della riga di comando "--yes" per confermare.
ja: ツール パッケージのダウンロードには確認が必要です。対話モードで実行するか、"--yes" コマンド ライン オプションを使用して確認してください。
ko: 도구 패키지 다운로드를 확인해야 합니다. 대화형 모드에서 실행하거나 "--yes" 명령줄 옵션을 사용하여 확인하세요.
pl: Pobieranie pakietu narzędzi wymaga potwierdzenia. Uruchom w trybie interakcyjnym lub użyj opcji wiersza polecenia „--yes”, aby potwierdzić.
pt_br: O download do pacote de ferramentas precisa de confirmação. Execute no modo interativo ou use a opção de linha de comando "--yes" para confirmar.
ru: Для скачивания пакета инструмента требуется подтверждение. Запустите в интерактивном режиме или используйте параметр командной строки "--yes" для подтверждения.
tr: Araç paketinin indirilmesi için onay gerekiyor. Etkileşimli modda çalıştırın veya onaylamak için "--yes" komut satırı seçeneğini kullanın.
zh_hans: 工具包下载需要确认。在交互模式下运行，或使用 “--yes” 命令行选项进行确认。
zh_hant: 工具套件下載需要確認。請以互動模式執行，或使用 "--yes" 命令列選項來確認。

# ToolExecuteCommandDescription
source: Executes a tool from source without permanently installing it.
cs: Spustí nástroj ze zdroje bez trvalé instalace.
de: Führt ein Tool aus der Quelle aus, ohne es dauerhaft zu installieren.
es: Ejecuta una herramienta desde el origen sin instalarla permanentemente.
fr: Exécute un outil à partir de la source sans l’installer définitivement.
it: Esegue uno strumento dall'origine senza installarlo permanentemente.
ja: ツールを永続的にインストールすることなく、ソースから実行します。
ko: 영구적으로 설치하지 않고 원본에서 도구를 실행합니다.
pl: Wykonuje narzędzie ze źródła bez trwałego instalowania go.
pt_br: Executa uma ferramenta da origem sem instalá-la permanentemente.
ru: Выполняет инструмент из источника без его постоянной установки.
tr: Aracı kalıcı olarak yüklemeden kaynaktan yürütür.
zh_hans: 从源执行工具，而无需永久安装它。
zh_hant: 從來源執行工具，但不永久性地安裝。

# ToolInstallAddSourceOptionDescription
source: Add an additional NuGet package source to use during installation.
cs: Přidá další zdroj balíčku NuGet, který se použije při instalaci.
de: Hiermit wird eine weitere NuGet-Paketquelle zur Verwendung während der Installation hinzugefügt.
es: Agrega un origen de paquetes de NuGet para utilizar durante la instalación.
fr: Ajoutez une source de package NuGet supplémentaire à utiliser durant l'installation.
it: Aggiunge un'altra origine pacchetto NuGet da usare durante l'installazione.
ja: インストール中に使用する他の NuGet パッケージ ソースを追加します。
ko: 설치 중 사용할 추가 NuGet 패키지 소스를 추가합니다.
pl: Dodaj dodatkowe źródło pakietu NuGet do użycia podczas instalacji.
pt_br: Adicionar uma origem adicional do pacote do NuGet a ser usada durante a instalação.
ru: Добавление дополнительного источника пакетов NuGet для использования при установке.
tr: Yükleme sırasında kullanılacak ek bir NuGet paket kaynağı ekler.
zh_hans: 添加其他要在安装期间使用的 NuGet 包源。
zh_hant: 新增於安裝期間要使用的額外 NuGet 套件來源。

# ToolInstallCommandDescription
source: Install global or local tool. Local tools are added to manifest and restored.
cs: Nainstaluje globální nebo místní nástroj. Místní nástroje se přidávají do manifestu a obnovují.
de: Hiermit installieren Sie das globale oder lokale Tool. Lokale Tools werden dem Manifest hinzugefügt und wiederhergestellt.
es: Instalar herramienta global o local. Las herramientas locales se agregan al manifiesto y se restauran.
fr: Installe un outil global ou local. Les outils locaux sont ajoutés au manifeste, puis restaurés.
it: Installa lo strumento globale o locale. Gli strumenti locali vengono aggiunti al manifesto e ripristinati.
ja: グローバルまたはローカルのツールをインストールします。ローカル ツールはマニフェストに追加され、復元されます。
ko: 전역 또는 로컬 도구를 설치합니다. 로컬 도구는 매니페스트에 추가되고 복원됩니다.
pl: Zainstaluj narzędzie globalne lub lokalne. Narzędzia lokalne są dodawane do manifestu i przywracane.
pt_br: Instale a ferramentas local ou global. Ferramentas locais são adicionadas ao manifesto e restauradas.
ru: Установка глобального или локального средства. Локальные средства добавляются в манифест и восстанавливаются.
tr: Genel veya yerel araç yükleyin. Yerel araçlar bildirime eklenir ve geri yüklenir.
zh_hans: 安装全局或本地工具。本地工具将被添加到清单并还原。
zh_hant: 安裝全域或本機工具。本機工具會新增至資訊清單，並會還原。

# ToolInstallConfigFileOptionDescription
source: The NuGet configuration file to use.
cs: Konfigurační soubor NuGet, který se použije.
de: Die zu verwendende NuGet-Konfigurationsdatei.
es: Archivo de configuración de NuGet que debe usarse.
fr: Fichier de configuration NuGet à utiliser.
it: File di configurazione NuGet da usare.
ja: 使用する NuGet 構成ファイル。
ko: 사용할 NuGet 구성 파일입니다.
pl: Plik konfiguracji programu NuGet do użycia.
pt_br: O arquivo de configuração do NuGet a ser usado.
ru: Используемый файл конфигурации NuGet.
tr: Kullanılacak NuGet yapılandırma dosyası.
zh_hans: 要使用的 NuGet 配置文件。
zh_hant: 要使用的 NuGet 組態檔。

# ToolInstallConfigFileOptionName
source: FILE
cs: SOUBOR
de: DATEI
es: ARCHIVO
fr: FICHIER
ja: ファイル
pl: PLIK
pt_br: ARQUIVO
tr: DOSYA
zh_hant: 檔案

# ToolInstallFrameworkOptionDescription
source: The target framework to install the tool for.
cs: Cílová architektura, pro kterou se má nástroj nainstalovat
de: Das Zielframework, für das das Tool installiert wird.
es: La plataforma de destino para la que se instala la herramienta.
fr: Framework cible pour lequel l'outil doit être installé.
it: Framework di destinazione per cui installare lo strumento.
ja: ツールをインストールするターゲット フレームワーク。
ko: 도구를 설치할 대상 프레임워크입니다.
pl: Docelowa platforma, dla której ma zostać zainstalowane narzędzie.
pt_br: A estrutura de destino para a qual instalar a ferramenta.
ru: Целевая платформа для установки инструмента.
tr: Aracın yükleneceği hedef çerçeve.
zh_hans: 要安装工具的目标框架。
zh_hant: 要為工具安裝的目標 Framework。

# ToolInstallGlobalOptionDescription
source: Install the tool for the current user.
cs: Nainstaluje nástroj pro aktuálního uživatele.
de: Hiermit installieren Sie das Tool für den aktuellen Benutzer.
es: Instalar la herramienta para el usuario actual.
fr: Installe l'outil pour l'utilisateur actuel.
it: Installa lo strumento per l'utente corrente.
ja: 現在のユーザーに対してツールをインストールします。
ko: 현재 사용자에 대해 도구를 설치합니다.
pl: Zainstaluj narzędzie dla bieżącego użytkownika.
pt_br: Instale a ferramenta para o usuário atual.
ru: Установка средства для текущего пользователя.
tr: Aracı geçerli kullanıcı için yükle.
zh_hans: 为当前用户安装工具。
zh_hant: 為目前的使用者安裝工具。

# ToolInstallInstallationSucceeded
source: You can invoke the tool using the following command: {0} Tool '{1}' (version '{2}') was successfully installed.
cs: Tento nástroj lze vyvolat pomocí následujícího příkazu: {0} Nástroj {1} (verze {2}) byl úspěšně nainstalován.
de: Sie können das Tool über den folgenden Befehl aufrufen: {0} Das Tool "{1}" (Version {2}) wurde erfolgreich installiert.
es: Puede invocar la herramienta con el comando siguiente: {0} La herramienta "{1}" (versión '{2}') se instaló correctamente.
fr: Vous pouvez appeler l'outil à l'aide de la commande suivante : {0} L'outil '{1}' (version '{2}') a été installé correctement.
it: Per richiamare lo strumento, è possibile usare il comando seguente: {0} Lo strumento '{1}' (versione '{2}') è stato installato.
ja: 次のコマンドを使用してツールを呼び出せます。{0} ツール '{1}' (バージョン '{2}') が正常にインストールされました。
ko: 다음 명령을 사용하여 도구를 호출할 수 있습니다. {0} '{1}' 도구('{2}' 버전)가 설치되었습니다.
pl: Możesz wywołać narzędzie za pomocą następującego polecenia: {0} Pomyślnie zainstalowano narzędzie „{1}” (wersja: „{2}”).
pt_br: Você pode invocar a ferramenta usando o comando a seguir: {0} A ferramenta '{1}' (versão '{2}') foi instalada com êxito.
ru: Вы можете вызвать это средство с помощью следующей команды: {0} Средство "{1}" (версии "{2}") успешно установлено.
tr: Şu komutu kullanarak aracı çağırabilirsiniz: {0} '{1}' aracı (sürüm '{2}') başarıyla yüklendi.
zh_hans: 可使用以下命令调用工具: {0} 已成功安装工具“{1}”(版本“{2}”)。
zh_hant: 您可以使用下列命令來叫用工具: {0} 已成功安裝工具 '{1}' ('{2}' 版)。

# ToolInstallInvalidNuGetVersionRange
source: Specified version '{0}' is not a valid NuGet version range.
cs: Zadaná verze {0} není platným rozsahem verzí NuGet.
de: Die angegebene Version "{0}" ist kein gültiger NuGet-Versionsbereich.
es: La versión especificada "{0}" no es una gama de versiones de NuGet válida.
fr: La version spécifiée '{0}' n'est pas une plage de versions NuGet valide.
it: La versione specificata '{0}' non è un intervallo di versioni NuGet valido.
ja: 指定されたバージョン '{0}' は、有効な NuGet バージョン範囲ではありません。
ko: 지정된 버전 '{0}'이(가) 유효한 NuGet 버전 범위가 아닙니다.
pl: Określona wersja „{0}” nie należy do prawidłowego zakresu wersji pakietu NuGet.
pt_br: A versão '{0}' especificada não é um intervalo de versão do NuGet válido.
ru: Указанная версия "{0}" не входит в допустимый диапазон версий NuGet.
tr: Belirtilen '{0}' sürümü geçerli bir NuGet sürüm aralığı değil.
zh_hans: 指定的版本“{0}”是无效的 NuGet 版本范围。
zh_hant: 指定的版本 '{0}' 不是有效的 NuGet 版本範圍。

# ToolInstallLocalOptionDescription
source: Install the tool and add to the local tool manifest (default).
cs: Nainstaluje nástroj a přidá ho do manifestu místního nástroje (výchozí).
de: Hiermit installieren Sie das Tool und fügen es dem lokalen Toolmanifest (Standard) hinzu.
es: Instalar la herramienta y agregar al manifiesto de la herramienta local (predeterminado).
fr: Installe l'outil et l'ajoute au manifeste d'outils locaux (par défaut).
it: Installa lo strumento e lo aggiunge al manifesto degli strumenti locale (impostazione predefinita).
ja: ツールをインストールし、ローカル ツール マニフェスト (既定値) に追加します。
ko: 도구를 설치하고 로컬 도구 매니페스트에 추가합니다(기본값).
pl: Zainstaluj narzędzie, a następnie dodaj je do manifestu narzędzi lokalnych (ustawienie domyślne).
pt_br: Instale a ferramenta e adicione o manifesto de ferramenta local (padrão).
ru: Установка средства и добавление его в манифест локального средства (по умолчанию).
tr: Aracı yükle ve yerel araç bildirimine ekle (varsayılan).
zh_hans: 安装工具并将其添加到本地工具清单(默认)。
zh_hant: 安裝工具，並將其新增至本機工具資訊清單 (預設)。

# ToolInstallManifestPathOptionDescription
source: Path to the manifest file.
cs: Cesta k souboru manifestu
de: Pfad zur Manifestdatei.
es: Ruta de acceso al archivo de manifiesto.
fr: Chemin du fichier manifeste.
it: Percorso del file manifesto.
ja: マニフェスト ファイルへのパス。
ko: 매니페스트 파일 경로입니다.
pl: Ścieżka do pliku manifestu.
pt_br: Caminho para o arquivo de manifesto.
ru: Путь к файлу манифеста.
tr: Bildirim dosyasının yolu.
zh_hans: 清单文件的路径。
zh_hant: 資訊清單檔的路徑。

# ToolInstallManifestPathOptionName
source: PATH
fr: CHEMIN
pl: ŚCIEŻKA
pt_br: CAMINHO
tr: YOL
zh_hant: 路徑

# ToolInstallNuGetConfigurationFileDoesNotExist
source: NuGet configuration file '{0}' does not exist.
cs: Konfigurační soubor NuGet {0} neexistuje.
de: Die NuGet-Konfigurationsdatei "{0}" ist nicht vorhanden.
es: El archivo de configuración de NuGet "{0}" no existe.
fr: Le fichier config NuGet '{0}' n'existe pas.
it: Il file di configurazione NuGet '{0}' non esiste.
ja: NuGet 構成ファイル '{0}' は存在しません。
ko: NuGet 구성 파일 '{0}'이(가) 없습니다.
pl: Plik konfiguracji pakietu NuGet „{0}” nie istnieje.
pt_br: O arquivo de configuração '{0}' do NuGet não existe.
ru: Файл конфигурации NuGet "{0}" не существует.
tr: NuGet yapılandırma dosyası '{0}' yok.
zh_hans: NuGet 配置文件“{0}”不存在。
zh_hant: NuGet 組態檔 '{0}' 不存在。

# ToolInstallPackageIdArgumentDescription
source: The NuGet Package Id of the tool to install.
cs: ID balíčku NuGet nástroje, který se má nainstalovat
de: Die NuGet-Paket-ID des zu installierenden Tools.
es: El id. del paquete de NuGet de la herramienta que se instalará.
fr: ID de package NuGet de l'outil à installer.
it: ID pacchetto NuGet dello strumento da installare.
ja: インストールするツールの NuGet パッケージ ID。
ko: 설치할 도구의 NuGet 패키지 ID입니다.
pl: Identyfikator pakietu NuGet narzędzia do zainstalowania.
pt_br: A ID do pacote do NuGet da ferramenta a ser instalada.
ru: Идентификатор пакета NuGet устанавливаемого инструмента.
tr: Yüklenecek aracın NuGet Paket Kimliği.
zh_hans: 要安装的工具的 NuGet 包 ID。
zh_hant: 要安裝之工具的 NuGet 套件識別碼。

# ToolInstallSourceOptionDescription
source: Replace all NuGet package sources to use during installation with these.
cs: Nahradit všechny zdroje balíčků NuGet, které se mají použít při instalaci, těmito zdroji.
de: Ersetzen alle NuGet-Paketquellen für die Nutzung während der Installation durch diese.
es: Reemplazar todos los orígenes de paquetes NuGet que se usarán durante la instalación por estos.
fr: Remplacer toutes les sources de package NuGet à utiliser pendant l’installation par celles-ci.
it: Sostituire tutte le origini del pacchetto NuGet da usare durante l'installazione con queste.
ja: インストール中に使用するすべての NuGet パッケージ ソースをこれらに置き換えます。
ko: 설치 중에 사용할 모든 NuGet 패키지 원본을 이러한 패키지 원본으로 바꿉니다.
pl: Zastąp je wszystkimi źródłami pakietów NuGet, które mają być używane podczas instalacji.
pt_br: Substitua todas as fontes de pacote NuGet a serem usadas durante a instalação por estas.
ru: Замените ими все источники пакетов NuGet, которые будут использоваться при установке.
tr: Yükleme sırasında kullanılacak tüm NuGet paket kaynaklarını bu kaynaklarla değiştirin.
zh_hans: 将安装期间要使用的所有 NuGet 包源替换为这些源。
zh_hant: 以這些套件取代安裝期間使用的所有 NuGet 套件來源。

# ToolInstallSourceOptionName
source: SOURCE
cs: ZDROJ
de: QUELLE
es: ORIGEN
it: ORIGINE
ja: ソース
pl: ŹRÓDŁO
pt_br: ORIGEM
tr: KAYNAK
zh_hant: 資料來源

# ToolInstallToolPathOptionDescription
source: The directory where the tool will be installed. The directory will be created if it does not exist.
cs: Adresář, do kterého se nástroj nainstaluje. Pokud tento adresář neexistuje, bude vytvořen.
de: Das Verzeichnis, in dem das Tool installiert wird. Das Verzeichnis wird erstellt, wenn es nicht vorhanden ist.
es: El directorio donde se instalará la herramienta. Si no existe, se creará el directorio.
fr: Répertoire où l'outil va être installé. Ce répertoire est créé, s'il n'existe pas déjà.
it: Directory in cui verrà installato lo strumento. Se non esiste già, verrà creata.
ja: ツールがインストールされるディレクトリ。このディレクトリが存在しない場合は、作成されます。
ko: 도구를 설치할 디렉터리입니다. 디렉터리가 존재하지 않는 경우 생성됩니다.
pl: Katalog, w którym zostanie zainstalowane narzędzie. Jeśli katalog nie istnieje, zostanie utworzony.
pt_br: O diretório no qual a ferramenta será instalada. O diretório será criado se ele ainda não existir.
ru: Каталог, в который будет установлен инструмент. Если каталога не существует, он будет создан.
tr: Aracın yükleneceği dizin. Dizin yoksa oluşturulur.
zh_hans: 将安装工具的目录。如果目录不要放置测试结果的目录。若不存在，将创建指定目录。存在，将创建该目录。
zh_hant: 安裝工具所在的目錄。若該目錄不存在，則會建立該目錄。

# ToolInstallToolPathOptionName
source: PATH
fr: CHEMIN
pl: ŚCIEŻKA
pt_br: CAMINHO
tr: YOL
zh_hant: 路徑

# ToolInstallVersionOptionDescription
source: The version of the tool package to install.
cs: Verze balíčku nástroje, který se má nainstalovat
de: Die Version des zu installierenden Toolpakets.
es: La versión del paquete de herramientas para instalar.
fr: Version du package d'outils à installer.
it: Versione del pacchetto dello strumento da installare.
ja: インストールするツール パッケージのバージョン。
ko: 설치할 도구 패키지 버전입니다.
pl: Wersja pakietu narzędzia do zainstalowania.
pt_br: A versão do pacote da ferramenta a ser instalada.
ru: Версия устанавливаемого пакета инструмента.
tr: Yüklenecek araç paketinin sürümü.
zh_hans: 要安装的工具包版本。
zh_hant: 要安裝之工具套件的版本。

# ToolInstallVersionOptionName
source: VERSION
cs: VERZE
es: VERSIÓN
it: VERSIONE
ja: バージョン
pl: WERSJA
pt_br: VERSÃO
tr: SÜRÜM
zh_hant: 版本

# ToolInstallationFailed
source: Tool '{0}' failed to install.
cs: Nástroj {0} se nepodařilo nainstalovat.
de: Fehler bei der Installation des Tools "{0}".
es: No se pudo instalar la herramienta "{0}".
fr: Impossible d'installer l'outil '{0}'.
it: Non è stato possibile installare lo strumento '{0}'.
ja: ツール '{0}' をインストールできませんでした。
ko: '{0}' 도구를 설치하지 못했습니다.
pl: Zainstalowanie narzędzia „{0}” nie powiodło się.
pt_br: Não foi possível instalar a ferramenta '{0}'.
ru: Не удалось установить инструмент "{0}".
tr: '{0}' aracı yüklenemedi.
zh_hans: 工具“{0}”安装失败。
zh_hant: 工具 '{0}' 無法安裝。

# ToolInstallationFailedContactAuthor
source: Tool '{0}' failed to install. Contact the tool author for assistance.
cs: Nástroj {0} se nepodařilo nainstalovat. Obraťte se s žádostí o pomoc na autora nástroje.
de: Fehler beim Installieren des Tools "{0}". Wenden Sie sich an den Autor des Tools, um Unterstützung zu erhalten.
es: No se pudo instalar la herramienta "{0}". Póngase en contacto con su creador para obtener asistencia.
fr: Impossible d'installer l'outil '{0}'. Contactez le créateur de l'outil pour obtenir de l'aide.
it: Non è stato possibile installare lo strumento '{0}'. Per assistenza, contattare l'autore dello strumento.
ja: ツール '{0}' をインストールできませんでした。ツールの作成者にお問い合わせください。
ko: '{0}' 도구를 설치하지 못했습니다. 도구 작성자에게 문의하세요.
pl: Instalowanie narzędzia „{0}” nie powiodło się. Skontaktuj się z autorem narzędzia w celu uzyskania pomocy.
pt_br: Não foi possível instalar a ferramenta '{0}'. Entre em contato com o autor para obter assistência.
ru: Не удалось установить инструмент "{0}". Обратитесь за помощью к его разработчику.
tr: '{0}' aracı yüklenemedi. Yardım için araç yazarına başvurun.
zh_hans: 工具“{0}”安装失败。请联系工具作者获取帮助。
zh_hant: 無法安裝工具 '{0}'。請連絡工具作者尋求協助。

# ToolInstallationRestoreFailed
source: The tool package could not be restored.
cs: Balíček nástroje nebylo možné obnovit.
de: Das Toolpaket konnte nicht wiederhergestellt werden.
es: No se puede restaurar el paquete de la herramienta.
fr: Impossible de restaurer le package de l'outil.
it: Non è stato possibile ripristinare il pacchetto dello strumento.
ja: ツール パッケージを復元できませんでした。
ko: 도구 패키지를 복원할 수 없습니다.
pl: Nie można przywrócić pakietu narzędzia.
pt_br: O pacote da ferramenta não pôde ser restaurado.
ru: Не удалось восстановить пакет инструмента.
tr: Araç paketi geri yüklenemedi.
zh_hans: 无法还原工具包。
zh_hant: 此工具套件無法還原。

# ToolListCommandDescription
source: List tools installed globally or locally.
cs: Vypíše globálně nebo místně nainstalované nástroje.
de: Hiermit listen Sie die global oder lokal installierten Tools auf.
es: Mostrar las herramientas instaladas local o globalmente.
fr: Liste les outils installés globalement ou localement.
it: Elenca gli strumenti installati a livello globale o locale.
ja: グローバルまたはローカルにインストールされているツールを一覧表示します。
ko: 전역으로 또는 로컬로 설치된 도구를 나열합니다.
pl: Wyświetl listę narzędzi zainstalowanych globalnie lub lokalnie.
pt_br: Ferramentas de lista instaladas de forma global ou local.
ru: Перечисление средств, установленных глобально или локально.
tr: Genel veya yerel olarak yüklü araçları listeleyin.
zh_hans: 列出全局或本地安装的工具。
zh_hant: 列出已安裝在全域或本機的工具。

# ToolListCommandsColumn
source: Commands
cs: Příkazy
de: Befehle
es: Comandos
fr: Commandes
it: Comandi
ja: コマンド
ko: 명령
pl: Polecenia
pt_br: Comandos
ru: Команды
tr: Komutlar
zh_hans: 命令
zh_hant: 命令

# ToolListFormatOptionDescription
source: The output format for the list of tools.
cs: Výstupní formát seznamu nástrojů.
de: Das Ausgabeformat für die Liste der Tools.
es: Formato de salida de la lista de herramientas.
fr: Format de sortie de la liste des outils.
it: Formato di output per l'elenco di strumenti.
ja: ツールの一覧の出力形式。
ko: 도구 목록의 출력 형식입니다.
pl: Format wyjściowy listy narzędzi.
pt_br: O formato de saída da lista de ferramentas.
ru: Формат выхода для списка инструментов.
tr: Araç listesi için çıkış biçimi.
zh_hans: 工具列表的输出格式。
zh_hant: 工具清單的輸出格式。

# ToolListGlobalOptionDescription
source: List tools installed for the current user.
cs: Vypíše nástroje nainstalované pro aktuálního uživatele.
de: Hiermit listen Sie die für den aktuellen Benutzer installierten Tools auf.
es: Mostrar las herramientas instaladas para el usuario actual.
fr: Liste les outils installés pour l'utilisateur actuel.
it: Elenca gli strumenti installati per l'utente corrente.
ja: 現在のユーザーに対してインストールされているツールを一覧表示します。
ko: 현재 사용자에 대해 설치된 도구를 나열합니다.
pl: Wyświetl listę narzędzi zainstalowanych dla bieżącego użytkownika.
pt_br: Ferramentas de lista instaladas para o usuário atual.
ru: Перечисление средств, установленных для текущего пользователя.
tr: Geçerli kullanıcı için yüklenmiş araçları listeleyin.
zh_hans: 列出为当前用户安装的工具。
zh_hant: 列出已為目前使用者安裝的工具。

# ToolListInvalidPackageWarning
source: Warning: tool package '{0}' is invalid, contact tool author: {1}
cs: Upozornění: Balíček nástroje {0} je neplatný, obraťte se na autora nástroje: {1}
de: Warnung: Das Toolpaket "{0}" ist ungültig. Wenden Sie sich an den Autor des Tools: {1}
es: Advertencia: El paquete de herramienta "{0}" no es válido, póngase en contacto con el autor de la herramienta: {1}
fr: Avertissement : Le package d'outils '{0}' n'est pas valide. Contactez l'auteur de l'outil : {1}
it: Avviso: il pacchetto strumenti '{0}' non è valido. Contattare l'autore dello strumento: {1}
ja: 警告: ツール パッケージ '{0}' が無効です。ツールの作成者にお問い合わせください: {1}
ko: 경고: 도구 패키지 '{0}'이(가) 잘못되었습니다. 도구 작성자에게 문의하세요. {1}
pl: Ostrzeżenie: pakiet narzędzia „{0}” jest nieprawidłowy. Skontaktuj się z autorem narzędzia: {1}
pt_br: Aviso: o pacote de ferramentas '{0}' é inválido. Entre em contato com o autor da ferramenta: {1}
ru: Внимание! Недопустимый пакет средства "{0}". Обратитесь к автору средства: {1}
tr: Uyarı: '{0}' araç paketi geçersiz, araç yazarına başvurun: {1}
zh_hans: 警告: 工具包“{0}”无效。请联系工具作者: {1}
zh_hant: 警告: 工具套件 '{0}' 無效，請連絡工具作者: {1}

# ToolListInvalidToolPathOption
source: Tool path '{0}' does not exist.
cs: Cesta k nástroji {0} neexistuje.
de: Der Toolpfad "{0}" ist nicht vorhanden.
es: La ruta de acceso de la herramienta "{0}" no existe.
fr: Le chemin d'outil '{0}' n'existe pas.
it: Il percorso '{0}' dello strumento non esiste.
ja: ツール パス '{0}' は存在しません。
ko: '{0}' 도구 경로가 없습니다.
pl: Ścieżka narzędzia „{0}” nie istnieje.
pt_br: O caminho da ferramenta '{0}' não existe.
ru: Путь к средству "{0}" не существует.
tr: '{0}' araç yolu yok.
zh_hans: 工具路径“{0}”不存在。
zh_hant: 工具路徑 {0} 不存在。
