Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WorkloadConfigCommandDescription
source: Modify or display workload configuration values. To display a value, specify the corresponding command-line option without providing a value. For example: "dotnet workload config --update-mode"
cs: Upraví nebo zobrazí hodnoty konfigurace úlohy. Pokud chcete zobrazit hodnotu, zadejte odpovídající volbu příkazového řádku bez zadání hodnoty. Například: dotnet workload config --update-mode
de: Workloadkonfigurationswerte ändern oder anzeigen. Um einen Wert anzuzeigen, geben Sie die entsprechende Befehlszeilenoption an, ohne einen Wert anzugeben. Beispiel: "dotnet workload config --update-mode"
es: Modificar o mostrar los valores de configuración de la carga de trabajo. Para mostrar un valor, especifique la opción de línea de comandos correspondiente sin proporcionar un valor. Por ejemplo: "dotnet workload config --update-mode"
fr: Modifiez ou affichez les valeurs de configuration de la charge de travail. Pour afficher une valeur, spécifiez l’option de ligne de commande correspondante sans fournir de valeur. Par exemple : « dotnet workload config --update-mode »
it: Modifica o visualizza i valori di configurazione del carico di lavoro. Per visualizzare un valore, specifica l'opzione della riga di comando corrispondente senza fornire un valore. Ad esempio: "dotnet workload config --update-mode"
ja: ワークロード構成値を変更または表示します。 値を表示するには、値を指定せずに対応するコマンド ライン オプションを指定します。 例: "dotnet workload config --update-mode"
ko: 워크로드 구성 값을 수정하거나 표시합니다. 값을 표시하려면 값을 제공하지 않고 해당 명령줄 옵션을 지정합니다. 예: "dotnet workload config --update-mode"
pl: Modyfikuj lub wyświetlaj wartości konfiguracji obciążenia. Aby wyświetlić wartość, należy podać odpowiednią opcję wiersza poleceń bez podawania wartości. Na przykład: „dotnet workload config --update-mode”
pt_br: Modifique ou exiba valores de configuração de carga de trabalho. Para exibir um valor, especifique a opção de linha de comando correspondente sem fornecer um valor. Por exemplo: "dotnet workload config --update-mode"
ru: Изменение или отображение значений конфигурации рабочей нагрузки. Чтобы отобразить значение, укажите соответствующий параметр командной строки без значения. Например: "dotnet workload config --update-mode"
tr: İş yükü yapılandırması değerlerini değiştirin veya görüntüleyin. Bir değeri görüntülemek için, bir değer sağlamadan ilgili komut satırı seçeneğini belirtin. Örnek: "dotnet workload config --update-mode"
zh_hans: 修改或显示工作负载配置值。 要显示值，请指定相应的命令行选项，而无需提供值。 例如，"dotnet workload config --update-mode"
zh_hant: 修改或顯示工作負載設定值。 若要顯示值，請指定對應的命令列選項而不提供值。 例如: "dotnet workload config --update-mode"

# WorkloadDefinition
source: Manage optional workloads.
cs: Spravujte volitelné úlohy.
de: Verwalten Sie optionale Workloads.
es: Administrar cargas de trabajo opcionales.
fr: Gérez les charges de travail facultatives.
it: Gestire i carichi di lavoro facoltativi.
ja: オプションのワークロードを管理します。
ko: 선택적 워크로드를 관리합니다.
pl: Zarządzaj opcjonalnymi obciążeniami.
pt_br: Gerenciar as cargas de trabalho opcionais.
ru: Управление необязательными рабочими нагрузками.
tr: İsteğe bağlı iş yüklerini yönetin.
zh_hans: 管理可选工作负荷。
zh_hant: 管理選擇性工作負載。

# WorkloadElevateCommandDescription
source: Start the elevated server process to facilitate MSI based installations.
cs: Spuštěním serverového procesu se zvýšenými oprávněními umožněte používat instalace založené na instalační službě MSI.
de: Starten Sie den Serverprozess mit erhöhten Rechten, um MSI-basierte Installationen zu unterstützen.
es: Inicie el proceso de servidor elevado para facilitar las instalaciones basadas en MSI.
fr: Démarrez le processus du serveur avec élévation de privilèges pour faciliter les installations basées sur MSI.
it: Avviare il processo server con privilegi elevati per semplificare le installazioni basate su MSI.
ja: 昇格された特権のサーバー プロセスを開始して、MSI ベースのインストールを促進します。
ko: MSI 기반 설치를 용이하게 하도록 관리자 권한 서버 프로세스를 시작합니다.
pl: Rozpocznij proces podwyższonego poziomu serwera, aby ułatwić instalacje oparte na funkcjach MSI.
pt_br: Inicie o processo de servidor com privilégios elevados para facilitar instalações baseadas em MSI.
ru: Запустите серверный процесс с повышенными правами для упрощения установки на основе MSI.
tr: Windows Installer tabanlı yüklemeleri kolaylaştırmak için yükseltilmiş sunucu işlemini başlatın.
zh_hans: 启动提升的服务器进程以方便基于 MSI 的安装。
zh_hant: 啟動提升權限的伺服器處理序，以輔助 MSI 型安裝。

# WorkloadHistoryCommandDescription
source: Shows a history of workload installation actions.
cs: Zobrazí historii akcí instalace úlohy.
de: Zeigt einen Verlauf der Workloadinstallationsaktionen an.
es: Muestra un historial de acciones de instalación de cargas de trabajo.
fr: Affiche un historique des actions d’installation de charge de travail.
it: Mostra una cronologia delle azioni di installazione del carico di lavoro.
ja: ワークロードのインストール操作の履歴を表示します。
ko: 워크로드 설치 작업의 기록을 표시합니다.
pl: Pokazuje historię akcji instalacji obciążenia.
pt_br: Mostra um histórico de ações de instalação de carga de trabalho.
ru: Показывает журнал действий по установке рабочей нагрузки.
tr: İş yükü yükleme eylemlerinin geçmişini gösterir.
zh_hans: 显示工作负载安装操作的历史记录。
zh_hant: 顯示工作負載安裝動作的歷程記錄。

# WorkloadHistoryRecordInvalidIdValue
source: The ID of a workload history record should be between 1 and the number of workload history records, inclusive.
cs: ID záznamu historie úlohy by mělo být mezi 1 a počtem záznamů historie úlohy včetně.
de: Die ID eines Workloadverlaufsdatensatzes muss zwischen 1 und der Anzahl der Workloadverlaufsdatensätze einschließlich dieser liegen.
es: El id. de un registro de historial de cargas de trabajo debe estar comprendido entre 1 y el número de registros del historial de cargas de trabajo, ambos inclusive.
fr: L’ID d’un enregistrement d’historique de charge de travail doit être compris entre 1 et le nombre d’enregistrements d’historique de charge de travail, inclus.
it: L'ID di un record di cronologia del carico di lavoro deve essere compreso tra 1 e il numero di record della cronologia del carico di lavoro inclusi.
ja: ワークロード履歴レコードの ID は、1 からワークロード履歴レコードの数までの範囲にする必要があります。
ko: 워크로드 기록 레코드의 ID는 1에서 워크로드 기록 레코드 수(포함) 사이여야 합니다.
pl: Identyfikator rekordu historii obciążenia powinien należeć do zakresu od 1 do liczby rekordów historii obciążenia włącznie.
pt_br: A ID de um registro de histórico de carga de trabalho deve estar entre 1 e o número de registros de histórico de carga de trabalho, inclusive.
ru: Идентификатор записи журнала рабочей нагрузки должен находиться в диапазоне от 1 до числа записей в журнале рабочей нагрузки включительно.
tr: İş yükü geçmişi kaydının kimliği 1 ile iş yükü geçmişi kayıtlarının (dahil) sayısı arasında olmalıdır.
zh_hans: 工作负载历史记录的 ID 应介于 1 和工作负载历史记录数(含)之间。
zh_hant: 工作負載歷程記錄的識別碼應介於 1 到工作負載歷程記錄數目 (含) 之間。

# WorkloadHistoryWorkloadSetVersion
source: Workload Version
cs: Verze úlohy
es: Versión de carga de trabajo
fr: Version de la charge de travail
it: Versione del carico di lavoro
ja: ワークロードのバージョン
ko: 워크로드 버전
pl: Wersja obciążenia
pt_br: Versão da Carga de Trabalho
ru: Версия рабочей нагрузки
tr: İş Yükü Sürümü
zh_hans: 工作负载版本
zh_hant: 工作負載版本

# WorkloadIdArgumentDescription
source: The NuGet package ID of the workload to install.
cs: ID balíčku NuGet úlohy, která se má nainstalovat.
de: Die NuGet-Paket-ID der zu installierenden Workload.
es: El identificador del paquete NuGet de la carga de trabajo que se va a instalar.
fr: ID de package NuGet de la charge de travail à installer.
it: ID pacchetto NuGet del carico di lavoro da installare.
ja: インストールするワークロードの NuGet パッケージ ID。
ko: 설치할 워크로드의 NuGet 패키지 ID입니다.
pl: Identyfikator pakietu NuGet obciążenia do zainstalowania.
pt_br: A ID do pacote NuGet da carga de trabalho a ser instalada.
ru: Идентификатор пакета NuGet устанавливаемой рабочей нагрузки.
tr: Yüklenecek iş yükünün NuGet paket kimliği.
zh_hans: 要安装的工作负载的 NuGet 包 ID。
zh_hant: 要安裝工作負載的 NuGet 套件識別碼。

# WorkloadIdColumn
source: Installed Workload Id
cs: ID nainstalované úlohy
de: Installierte Workload-ID
es: Id. de carga de trabajo instalada
fr: ID de la charge de travail installée
it: ID carico di lavoro installato
ja: インストール済みワークロードの ID
ko: 설치된 워크로드 ID
pl: Identyfikator zainstalowanego obciążenia
pt_br: ID da carga de trabalho instalada
ru: Идентификатор установленной рабочей нагрузки
tr: Yüklü İş Yükü Kimliği
zh_hans: 已安装的工作负载 ID
zh_hant: 已安裝的工作負載識別碼

# WorkloadIdColumnName
source: Workload ID
cs: ID úlohy
es: Id. de carga de trabajo
fr: ID de charge de travail
it: ID del carico di lavoro
ja: ワークロード ID
ko: 워크로드 ID
pl: Identyfikator pakietu roboczego
pt_br: ID de Carga de trabalho
ru: ИД рабочей нагрузки
tr: İş yükü kimliği
zh_hans: 工作负载 ID
zh_hant: 工作負載識別碼

# WorkloadIdStubArgumentDescription
source: The text to search for in the IDs and descriptions of available workloads.
cs: Text, který se má vyhledávat v ID a popisech dostupných úloh.
de: Der Text, nach dem in den IDs und Beschreibungen der verfügbaren Workloads gesucht werden soll.
es: Texto que se buscará en los id. y las descripciones de las cargas de trabajo disponibles.
fr: Texte à rechercher dans les ID et descriptions des charges de travail disponibles.
it: Testo da cercare negli ID e nelle descrizioni dei carichi di lavoro disponibili.
ja: 使用可能なワークロードの ID と説明で検索するテキスト。
ko: ID에서 검색할 텍스트 및 사용 가능한 워크로드에 대한 설명입니다.
pl: Tekst do wyszukania w identyfikatorach i opisach dostępnych obciążeń.
pt_br: O texto a ser pesquisado nas IDs e descrições das cargas de trabalho disponíveis.
ru: Текст для поиска в идентификаторах и описаниях доступных рабочих нагрузок.
tr: Kullanılabilir iş yüklerinin kimliklerinde ve açıklamalarında aranacak metin.
zh_hans: 要在可用工作负载的 ID 和说明中搜索的文本。
zh_hant: 要在可用工作負載的識別碼和描述中搜尋的文字。

# WorkloadInfoDescription
source: Display information about installed workloads.
cs: Zobrazí informace o nainstalovaných úlohách.
de: Zeigt Informationen zu installierten Workloads an.
es: Mostrar información sobre las cargas de trabajo instaladas.
fr: Affichez des informations sur les charges de travail installées.
it: Visualizzare informazioni sui carichi di lavoro installati.
ja: インストールされているワークロードに関する情報を表示します。
ko: 설치된 워크로드에 대한 정보를 표시합니다.
pl: Wyświetl informacje o zainstalowanych obciążeniach.
pt_br: Exiba informações sobre cargas de trabalho instaladas.
ru: Отображение сведений об установленных рабочих нагрузках.
tr: Yüklü iş yükleriyle ilgili bilgileri görüntüleyin.
zh_hans: 显示有关已安装工作负载的信息。
zh_hant: 顯示已安裝工作負載的相關資訊。

# WorkloadInfoProvider_Message_AddWorkloads
source: Run 'dotnet workload search' to search workloads available to be installed on your SDK.
cs: Spuštěním příkazu dotnet workload search vyhledejte úlohy, které jsou k dispozici pro instalaci ve vaší sadě SDK.
de: Führen Sie „dotnet workload search“ aus, um Workloads zu suchen, die zur Installation in Ihrem SDK verfügbar sind.
es: Ejecute "dotnet workload search" para buscar las cargas de trabajo disponibles para instalarse en el SDK.
fr: Exécutez 'dotnet workload search' pour rechercher les charges de travail disponibles à installer sur votre SDK.
it: Eseguire 'dotnet workload search' per cercare i carichi di lavoro disponibili per l'installazione nell'SDK.
ja: SDK にインストールできるワークロードを検索するには、'dotnet workload search' を実行します。
ko: 'dotnet workload search'을 실행하여 SDK에 설치할 수 있는 워크로드를 검색합니다.
pl: Uruchom 'dotnet workload search', aby wyszukać obciążenia dostępne do zainstalowania w twoim zestawie SDK.
pt_br: Execute 'dotnet workload search' para pesquisar cargas de trabalho disponíveis para serem instaladas em seu SDK.
ru: Выполните команду "dotnet workload search", чтобы выполнить поиск среди рабочих нагрузок, доступных для установки в пакете SDK.
tr: SDK'nıza yüklenebilecek iş yüklerini aramak için 'dotnet workload search' komutunu çalıştırın.
zh_hans: 运行'dotnet workload search' 以搜索可用于安装在 SDK 上的工作负载。
zh_hant: 執行 'dotnet workload search' 以搜尋可安裝在 SDK 上的工作負載。

# WorkloadInstallCommandDescription
source: Install one or more workloads.
cs: Nainstalujte jednu nebo více úloh.
de: Installieren Sie mindestens eine Workload.
es: Instale una o varias cargas de trabajo.
fr: Installez une ou plusieurs charges de travail.
it: Installare uno o più carichi di lavoro.
ja: 1 つ以上のワークロードをインストールします。
ko: 하나 이상의 워크로드를 설치합니다.
pl: Zainstaluj co najmniej jedno obciążenie.
pt_br: Instale uma ou mais cargas de trabalho.
ru: Установите одну или несколько рабочих нагрузок.
tr: Bir veya daha fazla iş yükünü yükleyin.
zh_hans: 安装一个或多个工作负载。
zh_hant: 安裝一或多個工作負載。

# WorkloadInstallConfigFileOptionDescription
source: The NuGet configuration file to use.
cs: Konfigurační soubor NuGet, který se použije.
de: Die zu verwendende NuGet-Konfigurationsdatei.
es: Archivo de configuración de NuGet que debe usarse.
fr: Fichier de configuration NuGet à utiliser.
it: File di configurazione NuGet da usare.
ja: 使用する NuGet 構成ファイル。
ko: 사용할 NuGet 구성 파일입니다.
pl: Plik konfiguracji programu NuGet do użycia.
pt_br: O arquivo de configuração do NuGet a ser usado.
ru: Используемый файл конфигурации NuGet.
tr: Kullanılacak NuGet yapılandırma dosyası.
zh_hans: 要使用的 NuGet 配置文件。
zh_hant: 要使用的 NuGet 組態檔。

# WorkloadInstallConfigFileOptionName
source: FILE
cs: SOUBOR
de: DATEI
es: ARCHIVO
fr: FICHIER
ja: ファイル
pl: PLIK
pt_br: ARQUIVO
tr: DOSYA
zh_hant: 檔案

# WorkloadInstallInstallationSucceeded
source: Successfully installed workload(s) {0}.
cs: Úlohy {0} se úspěšně nainstalovaly.
de: Workload(s) {0} wurde(n) erfolgreich installiert.
es: Se ha(n) instalado correctamente la(s) carga(s) de trabajo {0}.
fr: Installation réussie de la ou des charges de travail {0}.
it: Carico di lavoro installati correttamente {0}.
ja: ワークロード {0} が正常にインストールされました。
ko: 워크로드 {0}을(를) 설치했습니다.
pl: Pomyślnie zainstalowano pakiety robocze {0}.
pt_br: Carga(s) de trabalho(s) instalada(s) com êxito {0}.
ru: Рабочие нагрузки {0} установлены.
tr: İş yükleri başarıyla yüklendi {0}.
zh_hans: 已成功安装的工作负载 {0}。
zh_hant: 已成功安裝工作負載 (s) {0}。

# WorkloadInstallRollBackFailedMessage
source: Installation rollback failed: {0}
cs: Vrácení instalace se nepovedlo: {0}
de: Fehler beim Installationsrollback: {0}
es: Error en la reversión de la instalación: {0}
fr: Échec de la restauration de l'installation : {0}
it: Impossibile eseguire il rollback dell'installazione: {0}
ja: インストールのロールバックに失敗しました: {0}
ko: 설치 롤백 실패: {0}
pl: Wycofywanie instalacji nie powiodło się: {0}
pt_br: Falha na reversão da instalação: {0}
ru: Сбой отката установки: {0}
tr: Yükleme geri alınamadı: {0}
zh_hans: 安装回滚失败: {0}
zh_hant: 安裝復原失敗: {0}

# WorkloadInstallRollingBackInstall
source: Workload installation failed. Rolling back installed packs...
cs: Instalace úlohy se nepovedla. Vrací se zpět nainstalované balíčky…
de: Fehler bei der Workloadinstallation. Für die installierten Pakete wird ein Rollback ausgeführt...
es: Error en la instalación de carga de trabajo. Revirtiendo a los paquetes instalados...
fr: Échec de l’installation de la charge de travail, restauration des packs installés...
it: L'installazione del carico di lavoro non è riuscita, eseguire il rollback dei pacchetti installati...
ja: ワークロードをインストールできませんでした。インストール パックをロールバックしています...
ko: 워크로드를 설치하지 못했습니다. 설치된 팩을 롤백하는 중...
pl: Instalacja obciążenia nie powiodła się. Trwa wycofywanie zainstalowanych pakietów...
pt_br: A instalação da carga de trabalho falhou, revertendo os pacotes instalados...
ru: Сбой установки рабочей нагрузки. Выполняется откат установленных пакетов...
tr: İş yükü yüklenemedi. Yüklü paketler geri alınıyor...
zh_hans: 工作负载安装失败。正在回滚已安装的包...
zh_hant: 工作負載安裝失敗。正在復原已安裝的套件...

# WorkloadInstallSourceOptionDescription
source: The NuGet package source to use during the restore. To specify multiple sources, repeat the option.
cs: Zdroj balíčku NuGet, který se má použít při obnovení. Chcete-li zadat více zdrojů, opakujte tuto možnost.
de: Die NuGet-Paketquelle, die während der Wiederherstellung verwendet werden soll. Wiederholen Sie die Option, um mehrere Quellen anzugeben.
es: Origen del paquete NuGet que se va a usar durante la restauración. Para especificar varios orígenes, repita la opción.
fr: Source de package NuGet à utiliser pendant la restauration. Pour spécifier plusieurs sources, répétez l’option.
it: Origine del pacchetto NuGet da usare durante il ripristino. Per specificare più origini, ripetere l'opzione.
ja: 復元中に使用する NuGet パッケージ ソース。複数のソースを指定するには、オプションを繰り返します。
ko: 복원 중에 사용할 NuGet 패키지 원본입니다. 여러 원본을 지정하려면 옵션을 반복합니다.
pl: Źródło pakietu NuGet do użycia podczas przywracania. Aby określić wiele źródeł, powtórz tę opcję.
pt_br: A origem do pacote NuGet a ser usada durante a restauração. Para especificar várias fontes, repita a opção.
ru: Источник пакетов NuGet, используемый во время восстановления. Чтобы указать несколько источников, повторите этот параметр.
tr: Geri yükleme sırasında kullanılacak NuGet paket kaynağı. Birden çok kaynak belirtmek için seçeneği tekrarlayın.
zh_hans: 要在还原过程中使用的 NuGet 包源。若要指定多个源，请重复该选项。
zh_hant: 還原期間要使用的 NuGet 套件資料來源。若要指定多個來源，請重複選項。

# WorkloadInstallSourceOptionName
source: SOURCE
cs: ZDROJ
de: QUELLE
es: ORIGEN
it: ORIGINE
ja: ソース
pl: ŹRÓDŁO
pt_br: ORIGEM
tr: KAYNAK
zh_hant: 資料來源

# WorkloadInstallTypeColumn
source: Install Type
cs: Typ instalace
de: Installationstyp
es: Tipo de instalación
fr: Type d'installation
it: Tipo di installazione
ja: インストールの種類
ko: 설치 유형
pl: Typ instalacji
pt_br: Tipo de Instalação
ru: Тип установки
tr: Yükleme Türü
zh_hans: 安装类型
zh_hant: 安裝類型

# WorkloadInstallVersionOptionDescription
source: The version of the SDK.
cs: Verze sady SDK
de: Die Version des SDK.
es: Versión del SDK.
fr: Version du kit SDK.
it: Versione dell'SDK.
ja: SDK のバージョンです。
ko: SDK의 버전입니다.
pl: Wersja zestawu SDK.
pt_br: A versão do SDK.
ru: Версия пакета SDK.
tr: SDK sürümü.
zh_hans: SDK 的版本。
zh_hant: SDK 的版本。

# WorkloadInstallVersionOptionName
source: VERSION
cs: VERZE
es: VERSIÓN
it: VERSIONE
ja: バージョン
pl: WERSJA
pt_br: VERSÃO
tr: SÜRÜM
zh_hant: 版本

# WorkloadInstallWorkloadCacheDownloadFailed
source: Download of workload packs to offline cache failed: {0}
cs: Stažení balíčků úloh do offline mezipaměti se nepovedlo: {0}.
de: Fehler beim Herunterladen von Workloadpaketen in den Offlinecache: {0}
es: No se pudo descargar los paquetes de carga de trabajo en la memoria caché sin conexión: {0}
fr: Échec du téléchargement des packs de charge de travail dans le cache hors connexion : {0}
it: Non è stato possibile scaricare i pacchetti del carico di lavoro nella cache offline: {0}
ja: オフライン キャッシュへのワークロード パックのダウンロードに失敗しました: {0}
ko: 오프라인 캐시에 워크로드 팩을 다운로드하지 못했습니다. {0}
pl: Pobieranie pakietów obciążeń do pamięci podręcznej trybu offline nie powiodło się: {0}
pt_br: Falha no download de pacotes de carga de trabalho para cache offline: {0}
ru: Сбой загрузки пакетов рабочей нагрузки в автономный кэш: {0}
tr: İş yükü paketleri çevrimdışı önbelleğe indirilemedi: {0}
zh_hans: 将工作负载包下载到脱机缓存失败: {0}
zh_hant: 將工作負載套件下載到離線快取失敗: {0}

# WorkloadInstallWorkloadUpdatesAvailable
source: Workload updates are available. Run `dotnet workload list` for more information.
cs: Jsou k dispozici aktualizace úloh. Pokud chcete získat další informace, spusťte `dotnet workload list`.
de: Es sind Workloadupdates verfügbar. Um weitere Informationen zu erhalten, führen Sie `dotnet workload list` aus.
es: Hay actualizaciones de carga de trabajo disponibles. Ejecute "dotnet workload list" para obtener más información.
fr: Des mises à jour de la charge de travail sont disponibles. Exécutez `dotnet workload list` pour plus d’informations.
it: Sono disponibili aggiornamenti del carico di lavoro. Per altre informazioni, eseguire `dotnet workload list`.
ja: ワークロードの更新が利用可能です。詳細については、`dotnet workload list` を実行してください。
ko: 워크로드 업데이트를 사용할 수 있습니다. 자세한 내용을 보려면 `dotnet workload list`을 실행하세요.
pl: Dostępne są aktualizacje obciążenia. Uruchom polecenie `dotnet workload list`, aby uzyskać więcej informacji.
pt_br: As atualizações de carga de trabalho estão disponíveis. Execute `dotnet workload list` para obter mais informações.
ru: Доступны обновления рабочей нагрузки. Для получения дополнительных сведений запустите `dotnet workload list`.
tr: İş yükü güncelleştirmeleri var. Daha fazla bilgi için `dotnet workload list` çalıştırın.
zh_hans: 有可用的工作负载更新。有关详细信息，请运行 `dotnet workload list`。
zh_hant: 有可用的工作負載更新。如需詳細資訊，請執行 `dotnet workload list`。

# WorkloadInstallationFailed
source: Workload installation failed: {0}
cs: Instalace úlohy se nezdařila: {0}
de: Fehler bei der Workloadinstallation: {0}
es: No se pudo instalar la carga de trabajo: {0}
fr: Échec de l’installation de la charge de travail : {0}
it: Installazione del carico di lavoro non riuscita: {0}
ja: ワークロード {0} をインストールできませんでした
ko: 워크로드 설치 실패: {0}
pl: Instalacja pakietu roboczego nie powiodła się: {0}
pt_br: Falha na instalação da carga de trabalho: {0}
ru: Сбой установки рабочей нагрузки: {0}
tr: İş yükü yüklenemedi: {0}
zh_hans: 工作负载安装失败: {0}
zh_hant: 工作負載安裝失敗: {0}

# WorkloadIntegrityCheck
source: Checking the state of installed workloads...
cs: Kontroluje se stav nainstalovaných úloh...
de: Status der installierten Workloads wird überprüft...
es: Comprobando el estado de las cargas de trabajo instaladas...
fr: Vérification de l’état des charges de travail installées...
it: Controllo dello stato dei carichi di lavoro installati...
ja: インストールされているワークロードの状態を確認しています...
ko: 설치된 워크로드의 상태를 확인하는 중...
pl: Trwa sprawdzanie stanu zainstalowanych obciążeń...
pt_br: Verificando o estado das cargas de trabalho instaladas...
ru: Проверка состояния установленных рабочих нагрузок...
tr: Yüklü iş yüklerinin durumu denetleniyor...
zh_hans: 正在检查已安装的工作负载的状态...
zh_hant: 正在檢查已安裝工作負載的狀態...

# WorkloadListCommandDescription
source: List workloads available.
cs: Jsou k dispozici seznamy úloh.
de: Hiermit werden die verfügbaren Workloads aufgelistet.
es: Enumera las cargas de trabajo disponibles.
fr: Lister les charges de travail disponibles.
it: Elenca i carichi di lavoro disponibili.
ja: 使用可能なワークロードを一覧表示します。
ko: 사용 가능한 워크로드를 나열합니다.
pl: Wyświetl listę dostępnych obciążeń.
pt_br: Listar as cargas de trabalho disponíveis.
ru: Список доступных рабочих нагрузок.
tr: Mevcut iş yüklerini listeleyin.
zh_hans: 列出可用的工作负载。
zh_hant: 列出可用的工作負載。

# WorkloadListFooter
source: Use `dotnet workload search` to find additional workloads to install.
cs: Pokud chcete najít další úlohy, které se mají nainstalovat, použijte `dotnet workload search`.
de: Verwenden Sie „dotnet workload search“, um zusätzliche zu installierende Workloads zu finden.
es: Use "dotnet workload search" para buscar cargas de trabajo adicionales para instalar.
fr: Utilisez `dotnet workload search` pour rechercher d’autres charges de travail à installer.
it: Utilizzare la `dotnet workload search` per trovare i carichi di lavoro aggiuntivi da installare.
ja: `dotnet workload search` を使用して追加ワークロードを検出し、インストールします。
ko: `dotnet workload search`을 사용하여 설치할 추가 워크로드를 찾습니다.
pl: Użyj polecenia „dotnet workload search”, aby znaleźć dodatkowe obciążenia do zainstalowania.
pt_br: Use `dotnet workload search` para encontrar cargas de trabalho adicionais a serem instaladas.
ru: Используйте `dotnet workload search`, чтобы найти дополнительные рабочие нагрузки для установки.
tr: Yüklenecek ek iş yüklerini bulmak için `dotnet workload search` kullanın.
zh_hans: 使用`dotnet workload search`查找要安装的其他工作负载。
zh_hant: 使用 `dotnet workload search` 尋找其他要安裝的工作負載。

# WorkloadListWorkloadSetVersion
source: Workload version: {0}
cs: Verze úlohy: {0}
es: Versión de carga de trabajo: {0}
fr: Version de la charge de travail : {0}
it: Versione carico di lavoro: {0}
ja: ワークロードのバージョン: {0}
ko: 워크로드 버전: {0}
pl: Wersja obciążenia: {0}
pt_br: Versão da carga de trabalho: {0}
ru: Версия рабочей нагрузки: {0}
tr: İş yükü sürümü: {0}
zh_hans: 工作负载版本: {0}
zh_hant: 工作負載版本: {0}
