Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PostAction_AddProjToSln_Error_NoSolutionFile
source: Unable to determine which solution file to add the reference to.
cs: Nedá se určit, do kterého souboru řešení se má odkaz přidat.
de: Es konnte nicht bestimmt werden, welcher Projektmappendatei der Verweis hinzugefügt werden soll.
es: No se puede determinar a qué archivo de solución debe agregarse la referencia.
fr: Impossible de déterminer le fichier solution auquel ajouter la référence.
it: Non è possibile determinare il file di soluzione a cui aggiungere il riferimento.
ja: 参照の追加先となるソリューション ファイルを特定できませんでした。
ko: 참조를 추가할 솔루션 파일을 확인할 수 없습니다.
pl: Nie można ustalić, do którego pliku projektu należy dodać odwołanie.
pt_br: Não foi possível determinar o arquivo de projeto ao qual adicionar a referência.
ru: Не удается определить файл решения для добавления ссылки.
tr: Başvurunun hangi çözüm dosyasına ekleneceği belirlenemiyor.
zh_hans: 无法确定向哪一个解决方案文件添加引用。
zh_hant: 無法判斷要將參考新增到哪一個解決方案檔。

# PostAction_AddProjToSln_Failed
source: Failed to add project(s) to the solution: {0}
cs: Do řešení se nepovedlo přidat projekty: {0}
de: Fehler beim Hinzufügen von Projekten zur Lösung: {0}
es: No se han podido agregar proyectos a la solución: {0}
fr: Échec de l'ajout de projet(s) à la solution : {0}
it: Non è stato possibile aggiungere progetti alla soluzione: {0}
ja: ソリューションにプロジェクトを追加できませんでした: {0}
ko: 솔루션에 프로젝트 추가 실패: {0}
pl: Nie można dodać projektów do rozwiązania: {0}
pt_br: Falha ao adicionar projeto(s) à solução: {0}
ru: Не удалось добавить проект(ы) в решение: {0}.
tr: Bir çözüme proje(ler) eklenemedi: {0}
zh_hans: 无法将项目添加到解决方案: {0}
zh_hant: 無法將專案新增至解決方案: {0}

# PostAction_AddProjToSln_Failed_NoReason
source: Failed to add project(s) to a solution file.
cs: Přidání projektu/ů do souboru řešení se nezdařilo.
de: Projekt(e) konnten nicht zu einer Lösungsdatei hinzugefügt werden.
es: No se pudieron agregar proyectos a un archivo de solución.
fr: Échec de l’ajout du ou des projets à un fichier solution.
it: Non è stato possibile aggiungere il/i progetto/i a un file di soluzione.
ja: プロジェクトをソリューション ファイルに追加できませんでした。
ko: 솔루션 파일에 프로젝트를 추가하지 못했습니다.
pl: Nie można dodać projektów do pliku rozwiązania.
pt_br: Falha ao adicionar projeto(s) a um arquivo de solução.
ru: Не удалось добавить проект (ы) в файл решения.
tr: Bir çözüm dosyasına proje(ler) eklenemedi.
zh_hans: 无法将项目添加到解决方案文件。
zh_hant: 無法將專案新增至方案檔。

# PostAction_AddProjToSln_InRoot_Running
source: Adding project(s): {0} in the root of solution file: {1}
cs: Přidávání projektu/ů: {0} do kořenového adresáře souboru řešení: {1}
de: Projekte hinzufügen: {0} im Stammverzeichnis der Projektmappendatei: {1}
es: Agregando proyecto(s): {0} en la raíz del archivo de solución: {1}
fr: Ajout de un ou des projets :{0} à la racine du fichier solution : {1}
it: Aggiunta di progetti: {0} nella radice del file soluzione: {1}
ja: 以下を追加しています プロジェクト: {0} 追加先のソリューション ファイルのルート: {1}
ko: 추가 프로젝트: {0} 솔루션 파일의 루트에서: {1}
pl: Dodawanie projekty: {0} w katalogu głównym pliku rozwiązania: {1}
pt_br: Adicionando projeto(s): {0} na raiz do arquivo da solução: {1}
ru: Производится добавление одного или нескольких проектов: {0} в корень файла решения: {1}
tr: Ekleniyor projeler: {0} çözüm dosyasının kökünde: {1}
zh_hans: 添加 项目: {0} 在解决方案文件根目录 {1} 中
zh_hant: 正在新增 專案: {0} 在解決方案檔案的根目錄中: {1}

# PostAction_AddProjToSln_Running
source: Adding project(s): {0} to solution file: {1} solution folder: {2}
cs: Přidávání projektu/ů: {0} do souboru řešení: {1} složka řešení: {2}
de: Projekte hinzufügen: {0} zur Projektmappendatei: {1} Projektmappenordner: {2}
es: Agregando proyecto(s): {0} al archivo de solución: {1} carpeta de la solución: {2}
fr: Ajout de un ou des projets :{0} au fichier de solution : {1} Dossier de solution :{2}
it: Aggiunta di progetti: {0} al file soluzione: {1} cartella soluzione: {2}
ja: 以下を追加しています プロジェクト: {0} 追加先のソリューション ファイル: {1} ソリューション フォルダー: {2}
ko: 추가 프로젝트: {0} 대상 솔루션 파일: {1} 솔루션 폴더: {2}
pl: Dodawanie projekty: {0} do pliku rozwiązania: {1} folder rozwiązania: {2}
pt_br: Adicionando projeto(s): {0} ao arquivo de solução: {1} pasta de solução: {2}
ru: Производится добавление одного или нескольких проектов: {0} в файл решения: {1} папка решения: {2}
tr: Ekleniyor projeler: {0} şu çözüm dosyasına: {1} şu çözüm klasörüne: {2}
zh_hans: 添加 项目: {0} 到解决方案文件: {1} 解决方案文件夹: {2}
zh_hant: 正在新增 專案: {0} 至解決方案檔案: {1} 解決方案資料夾: {2}

# PostAction_AddProjToSln_Succeeded
source: Successfully added project(s) to a solution file.
cs: Projekt(y) se úspěšně přidal(y) do souboru řešení.
de: Projekt(e) erfolgreich zu einer Projektmappendatei hinzugefügt.
es: Los proyectos se agregaron correctamente a un archivo de solución.
fr: Projet(s) ajouté(s) à un fichier solution.
it: I progetti sono stati aggiunti a un file di soluzione.
ja: プロジェクトがソリューション ファイルに正常に追加されました。
ko: 솔루션 파일에 프로젝트를 추가했습니다.
pl: Pomyślnie dodano projekty do pliku rozwiązania.
pt_br: Projeto(s) adicionado(s) com sucesso a um arquivo de solução.
ru: Проект успешно добавлен в файл решения.
tr: Proje(ler) bir çözüm dosyasına başarıyla eklendi.
zh_hans: 已成功将项目添加到解决方案文件。
zh_hant: 成功將專案新增至方案檔。

# PostAction_AddReference_AddPackageReference
source: Adding a package reference {0} to project file {1}:
cs: Přidávání reference balíčku {0} do souboru projektu {1}:
de: Hinzufügen einer Paketreferenz {0} zur Projektdatei {1}:
es: Agregando un paquete de referencia {0} al archivo de proyecto {1}:
fr: Ajout d’une référence de package {0} au fichier projet {1} :
it: Aggiunta di un riferimento al pacchetto {0} al file di progetto {1}:
ja: パッケージ参照 {0} をプロジェクト ファイル {1} に追加しています:
ko: {1} 프로젝트 파일에 {0} 패키지 참조를 추가하는 중:
pl: Dodawanie odwołania do pakietu {0} do pliku projektu {1}:
pt_br: Adicionando uma referência de pacote {0} ao arquivo de projeto {1}:
ru: Добавление ссылки на пакет {0} в файл проекта {1}:
tr: {0} paket başvurusu {1} proje dosyasına ekleniyor:
zh_hans: 将包引用 {0} 添加到项目文件 {1}:
zh_hant: 正在將套件參考 {0} 新增至專案檔 {1}:

# PostAction_AddReference_AddPackageReference_Failed
source: Failed to add package reference: {0}
cs: Nepovedlo se přidat odkaz na balíček: {0}
de: Fehler beim Hinzufügen des Paketverweises: {0}
es: No se ha podido agregar la referencia de paquete: {0}
fr: Échec de l'ajout de la référence du package : {0}
it: Non è stato possibile aggiungere il riferimento al pacchetto: {0}
ja: パッケージ参照を追加できませんでした: {0}
ko: 패키지 참조 추가 실패: {0}
pl: Nie można dodać odwołania do pakietu: {0}
pt_br: Falha ao adicionar referência de pacote: {0}
ru: Не удалось добавить ссылки на пакет: {0}
tr: Paket başvurusu eklenemedi: {0}
zh_hans: 无法添加包引用: {0}
zh_hant: 無法新增套件參考: {0}

# PostAction_AddReference_AddPackageReference_WithVersion
source: Adding a package reference {0} (version: {1}) to project file {2}:
cs: Přidávání reference balíčku {0} (verze: {1}) do souboru projektu {2}:
de: Hinzufügen einer Paketreferenz {0} (Version: {1}) zur Projektdatei {2}:
es: Agregando una referencia de paquete {0} (versión: {1}) al archivo de proyecto {2}:
fr: Ajout d’une référence de package {0} (version : {1}) au fichier projet {2} :
it: Aggiunta di un riferimento al pacchetto {0} (versione: {1}) al file di progetto {2}:
ja: パッケージ参照 {0} (バージョン: {1}) をプロジェクト ファイル {2} に追加しています:
ko: {2} 프로젝트 파일에 {0} 패키지 참조(버전: {1})를 추가하는 중:
pl: Dodawanie odwołania do pakietu {0} (wersja: {1}) do pliku projektu {2}:
pt_br: Adicionando uma referência de pacote {0} (versão: {1}) ao arquivo de projeto {2}:
ru: Добавление ссылки на пакет {0} (версия: {1}) в файл проекта {2}:
tr: {2} proje dosyasına, {0} paket başvurusu (sürüm: {1}) ekleniyor:
zh_hans: 将包引用 {0}(版本: {1})添加到项目文件 {2}:
zh_hant: 正在將套件參考 {0} (版本: {1}) 新增至專案檔 {2}:

# PostAction_AddReference_AddProjectReference
source: Adding a project reference {0} to project file {1}:
cs: Přidávání reference projektu {0} do souboru projektu {1}:
de: Hinzufügen einer Projektreferenz {0} zur Projektdatei {1}:
es: Agregando un proyecto de referencia {0} al archivo de proyecto {1}:
fr: Ajout d’une référence de projet {0} au fichier projet {1} :
it: Aggiunta di un riferimento al progetto {0} al file di progetto {1}:
ja: プロジェクト参照 {0} をプロジェクト ファイル {1} に追加しています:
ko: {1} 프로젝트 파일에 {0} 프로젝트 참조를 추가하는 중:
pl: Dodawanie odwołania do projektu {0} do pliku projektu {1}:
pt_br: Adicionando uma referência de projeto {0} ao arquivo de projeto {1}:
ru: Добавление ссылки на проект{0} в файл проекта {1}:
tr: {0} proje başvurusu {1} proje dosyasına ekleniyor:
zh_hans: 将项目引用 {0} 添加到项目文件 {1}:
zh_hant: 正在將專案參考 {0} 新增至專案檔 {1}:

# PostAction_AddReference_AddProjectReference_Failed
source: Failed to add project reference: {0}
cs: Nepovedlo se přidat odkaz na projekt: {0}
de: Fehler beim Hinzufügen des Projektverweises: {0}
es: No se ha podido agregar la referencia del proyecto: {0}
fr: Échec de l'ajout de la référence du projet : {0}
it: Non è stato possibile aggiungere il riferimento al progetto: {0}
ja: プロジェクト参照を追加できませんでした: {0}
ko: 프로젝트 참조 추가 실패: {0}
pl: Nie można dodać odwołania do projektu: {0}
pt_br: Falha ao adicionar referência do projeto: {0}
ru: Не удалось добавить ссылки на проект: {0}
tr: Proje başvurusu eklenemedi: {0}
zh_hans: 无法添加项目引用: {0}
zh_hant: 無法新增專案參考: {0}

# PostAction_AddReference_Error_ActionMisconfigured
source: Add reference action is not configured correctly in the template.
cs: V šabloně není správně nakonfigurovaná akce pro přidání odkazu.
de: Die Aktion zum Hinzufügen von Verweisen ist in der Vorlage nicht korrekt konfiguriert.
es: La acción Agregar referencia no está bien configurada en la plantilla.
fr: L'action d'ajout d'une référence n'est pas configurée correctement dans le modèle.
it: L'azione di aggiunta del riferimento non è configurata correttamente nel modello.
ja: 参照の追加アクションがテンプレートに正しく構成されていません。
ko: 템플릿에서 참조 추가 작업이 올바르게 구성되지 않았습니다.
pl: Akcja dodania odwołania nie jest poprawnie skonfigurowana w tym szablonie.
pt_br: A ação de referência Adicionar não está configurada corretamente no modelo.
ru: Действие добавления ссылки неправильно настроено в шаблоне.
tr: Add reference eylemi şablonda doğru yapılandırılmamış.
zh_hans: 模板中未正确配置添加引用操作。
zh_hant: 範本中的新增參考動作設定不正確。

# PostAction_AddReference_Error_FrameworkNotSupported
source: Unable to automatically add the framework reference {0} to the project. Manually edit the project file to add it.
cs: Do projektu se nedá automaticky přidat odkaz na rozhraní {0}. Pokud ho chcete přidat, upravte soubor projektu ručně.
de: Der Framework-Verweis \"{0}\" konnte dem Projekt nicht automatisch hinzugefügt werden. Bearbeiten Sie die Projektdatei manuell, um sie hinzuzufügen.
es: No se puede agregar automáticamente la referencia de marco {0} al proyecto. Edite manualmente el archivo del proyecto para agregarla.
fr: Impossible d’ajouter automatiquement la référence d’infrastructure {0} au projet. Modifiez manuellement le fichier projet pour l’ajouter.
it: Non è possibile aggiungere automaticamente il riferimento framework {0} al progetto. Modificare manualmente il file di progetto per aggiungerlo.
ja: フレームワーク参照 {0} をプロジェクトに自動的に追加できません。プロジェクト ファイルを手動で編集して追加します。
ko: 프레임워크 참조 {0}을(를) 프로젝트에 자동으로 추가할 수 없습니다. 프로젝트 파일을 수동으로 편집하여 추가하세요.
pl: Nie można automatycznie dodać odwołania platformy {0} do projektu. Edytuj ręcznie plik projektu, aby go dodać.
pt_br: Não é possível adicionar automaticamente a referência de estrutura {0} ao projeto. Edite manualmente o arquivo de projeto para adicioná-lo.
ru: Не удалось автоматически добавить ссылку на платформу {0} в проект. Измените вручную файл проекта, чтобы добавить его.
tr: {0} çerçeve başvurusu projeye otomatik olarak eklenemiyor. Proje dosyasını el ile düzenleyerek ekleyin.
zh_hans: 无法将框架引用 {0} 自动添加到项目中。请手动编辑项目文件以添加它。
zh_hant: 無法將架構參考 {0} 自動新增到專案。手動編輯專案檔案以新增。

# PostAction_AddReference_Error_ProjFileListHeader
source: Project files found:
cs: Nalezené soubory projektu:
de: Gefundene Projektdateien:
es: Archivos de proyecto encontrados:
fr: Fichiers projet trouvés :
it: File di progetto trovati:
ja: 見つかったプロジェクト ファイル:
ko: 찾은 프로젝트 파일 :
pl: Znaleziono pliki projektu:
pt_br: Arquivos de projeto encontrados:
ru: Найдено файлов проекта:
tr: Bulunan proje dosyaları:
zh_hans: 已找到项目文件:
zh_hant: 找到的專案檔:

# PostAction_AddReference_Error_UnresolvedProjFile
source: Unable to determine which project file to add the reference to.
cs: Nepovedlo se určit, do kterého souboru projektu se má odkaz přidat.
de: Es konnte nicht bestimmt werden, welcher Projektdatei der Verweis hinzugefügt werden soll.
es: No se puede determinar a qué archivo de proyecto debe agregarse la referencia.
fr: Impossible de déterminer le fichier projet auquel ajouter la référence.
it: Non è possibile determinare il file di progetto a cui aggiungere il riferimento.
ja: 参照の追加先となるプロジェクト ファイルを特定できませんでした。
ko: 참조를 추가할 프로젝트 파일을 확인할 수 없습니다.
pl: Nie można ustalić, do którego pliku projektu należy dodać odwołanie.
pt_br: Não foi possível determinar o arquivo de projeto ao qual adicionar a referência.
ru: Не удается определить файл проекта для добавления ссылки.
tr: Başvurunun hangi proje dosyasına ekleneceği belirlenemiyor.
zh_hans: 无法确定哪一个项目文件要添加引用。
zh_hant: 無法判斷要將參考新增到哪一個專案檔。

# PostAction_AddReference_Error_UnsupportedRefType
source: Adding reference type {0} is not supported.
cs: Přidávání typu odkazu {0} se nepodporuje.
de: Das Hinzufügen des Verweistyps {0} wird nicht unterstützt.
es: No se puede agregar el tipo de referencia {0}.
fr: L'ajout du type de référence {0} n'est pas pris en charge.
it: L'aggiunta del tipo riferimento {0} non è supportata.
ja: 参照型 {0} の追加はサポートされていません。
ko: 참조 형식 {0} 추가는 지원되지 않습니다.
pl: Dodawanie odwołania typu {0} nie jest obsługiwane.
pt_br: Não há suporte para adicionar o tipo de referência {0}.
ru: Добавление ссылки типа {0} не поддерживается.
tr: {0} başvuru türünün eklenmesi desteklenmiyor.
zh_hans: 不支持添加引用类型 {0}。
zh_hant: 不支援要新增的專案類型 {0}。

# PostAction_AddReference_Failed
source: Failed to add a reference to the project file.
cs: Přidání reference do souboru projektu se nezdařilo.
de: Fehler beim Hinzufügen einer Referenz zur Projektdatei.
es: No se pudo agregar una referencia al archivo de proyecto.
fr: Échec de l’ajout d’une référence au fichier projet.
it: Non è stato possibile aggiungere un riferimento al file di progetto.
ja: 参照をプロジェクト ファイルに追加できませんでした。
ko: 프로젝트 파일에 참조를 추가하지 못했습니다.
pl: Nie można dodać odwołania do pliku projektu.
pt_br: Falha ao adicionar uma referência ao arquivo de projeto.
ru: Не удалось добавить ссылку на файл проекта.
tr: Proje dosyasına başvuru eklenemedi.
zh_hans: 无法添加对项目文件的引用。
zh_hant: 無法將參考新增至專案檔。

# PostAction_AddReference_Succeeded
source: Successfully added a reference to the project file.
cs: Reference se úspěšně přidala do souboru projektu.
de: Der Projektdatei wurde erfolgreich ein Verweis hinzugefügt.
es: Se agregó correctamente una referencia al archivo de proyecto.
fr: Une référence au fichier projet a été ajoutée.
it: Aggiunta di un riferimento al file di progetto completata.
ja: 参照がプロジェクトファイルに正常に追加されました。
ko: 프로젝트 파일에 참조를 추가했습니다.
pl: Pomyślnie dodano odwołanie do pliku projektu.
pt_br: Adicionada com sucesso uma referência ao arquivo de projeto.
ru: Ссылка на файл проекта успешно добавлена.
tr: Proje dosyasına bir referans başarıyla eklendi.
zh_hans: 已成功添加对项目文件的引用。
zh_hant: 成功將參考新增至專案檔。

# PostAction_Restore_Error_FailedToDetermineProjectToRestore
source: Couldn't determine files to restore.
cs: Soubory k obnovení se nepodařilo určit.
de: Für die Wiederherstellung konnten keine Dateien ermittelt werden.
es: No se pudieron determinar los archivos que se van a restaurar.
fr: Impossible de déterminer les fichiers à restaurer.
it: Non è stato possibile determinare i file da ripristinare.
ja: 復元するファイルを特定できませんでした。
ko: 복원할 파일을 확인할 수 없습니다.
pl: Nie można ustalić plików do przywrócenia.
pt_br: Não foi possível determinar os arquivos a serem restaurados.
ru: Не удалось определить файлы для восстановления.
tr: Geri yüklenecek dosyalar belirlenemedi.
zh_hans: 无法确定要还原的文件。
zh_hant: 無法判斷要還原的檔案。

# PostAction_Restore_Error_NoProjectsToRestore
source: No projects are configured to restore. Check primary outputs configuration in template.json.
cs: Nejsou nakonfigurovány žádné projekty k obnovení. Ověřte konfiguraci primárních výstupů v template.json.
de: Es sind keine Projekte für die Wiederherstellung konfiguriert. Überprüfen Sie die primäre Ausgabekonfiguration in template.json.
es: No hay ningún proyecto configurado para restaurar. Compruebe la configuración de las salidas principales en template.json.
fr: Aucun projet n’est configuré pour la restauration. Vérifiez la configuration des sorties principales dans template.json.
it: Nessun progetto configurato per il ripristino. Controllare la configurazione degli output in template.json.
ja: 復元するように構成されているプロジェクトはありません。template.json のプライマリ出力構成を確認してください。
ko: 복원하도록 구성된 프로젝트가 없습니다. template.json에서 기본 출력 구성을 확인하세요.
pl: Żadne projekty nie są skonfigurowane do przywracania. Sprawdź konfigurację podstawowych danych wyjściowych w pliku template.json.
pt_br: Nenhum projeto está configurado para restauração. Verifique a configuração das saídas primárias em template.json.
ru: Нет проектов, настроенных для восстановления. Проверьте конфигурацию основных выходных данных в template.json.
tr: Geri yüklenecek hiçbir proje yapılandırılmadı. Template.json'da birincil çıktı yapılandırmasını kontrol edin.
zh_hans: 未将任何项目配置为还原。检查 template.json 中的主输出配置。
zh_hant: 未設定要還原的專案。請檢查 template.json 中的主要輸出設定。

# PostAction_Restore_Failed
source: Restore failed.
cs: Obnovení neproběhlo úspěšně.
de: Fehler beim Wiederherstellen.
es: Error en la restauración.
fr: Échec de la restauration.
it: Il ripristino non è riuscito.
ja: 復元に失敗しました。
ko: 복원하지 못했습니다.
pl: Błąd przywracania.
pt_br: Falha na restauração.
ru: Сбой восстановления.
tr: Geri yükleme başarısız oldu.
zh_hans: 还原失败。
zh_hant: 還原失敗。

# PostAction_Restore_RestoreFailed
source: Failed to perform restore: {0}
cs: Nepovedlo se provést obnovení: {0}
de: Fehler beim Ausführen der Wiederherstellung: {0}
es: No se ha podido realizar la restauración: {0}
fr: Échec de la restauration : {0}
it: Non è stato possibile eseguire il ripristino: {0}
ja: 復元を実行できませんでした: {0}
ko: 복원 수행 실패: {0}
pl: Nie można wykonać przywracania: {0}
pt_br: Falha ao executar a restauração: {0}
ru: Не удалось выполнить восстановление: {0}
tr: Geri yükleme gerçekleştirilemedi: {0}
zh_hans: 无法执行还原: {0}
zh_hant: 無法執行還原: {0}

# PostAction_Restore_Running
source: Restoring {0}:
cs: Obnovování {0}:
de: Wiederherstellung {0}:
es: Restaurando {0}:
fr: Restauration de {0} :
it: Ripristino di {0}:
ja: {0} を復元しています:
ko: {0} 복원 중:
pl: Przywracanie pakietu {0}:
pt_br: Restaurando {0}:
ru: Восстановление {0}:
tr: {0} geri yükleniyor:
zh_hans: 正在还原 {0}:
zh_hant: 正在還原 {0}:

# PostAction_Restore_Succeeded
source: Restore succeeded.
cs: Obnovení proběhlo úspěšně.
de: Wiederherstellung erfolgreich.
es: Restauración realizada correctamente.
fr: Restauration réussie.
it: Ripristino riuscito.
ja: 正常に復元されました。
ko: 복원에 성공했습니다.
pl: Przywracanie powiodło się.
pt_br: A restauração foi bem-sucedida.
ru: Восстановление выполнено.
tr: Geri yükleme başarılı oldu.
zh_hans: 已成功还原。
zh_hant: 還原成功。

# PrereleaseAndVersionAreNotSupportedAtTheSameTime
source: The --prerelease and --version options are not supported in the same command
cs: Možnosti --prerelease a --version v jednom příkazu se nepodporují.
de: Die Optionen „--prerelease“ und „--version“ werden im gleichen Befehl nicht unterstützt.
es: No se admiten las opciones --prerelease y --version en el mismo comando.
fr: Les options --prerelease et --version ne sont pas prises en charge dans la même commande.
it: Le opzioni --prerelease e --version non sono supportate nello stesso comando
ja: --prerelease および --version オプションは同じコマンド内ではサポートされません
ko: --prerelease 및 --version 옵션은 같은 명령에서 지원되지 않습니다
pl: Opcje --prerelease i --version nie są obsługiwane w tym samym poleceniu
pt_br: Não há suporte para as opções --prerelease e --version no mesmo comando.
ru: Параметры --prerelease и --version не поддерживаются в одной и той же команде
tr: --prerelease ve --version seçenekleri aynı komutta desteklenmiyor
zh_hans: 不支持在同一命令中同时使用 --prerelease 和 --version 选项
zh_hant: 同一個命令中不支援 --prerelease 與 --version 選項

# PrintDownloadLinkOnlyDescription
source: Only print the list of links to download without downloading.
cs: Vytiskne pouze seznam odkazů, které se mají stáhnout, aniž by se tento seznam stahoval.
de: Drucken Sie nur die Liste der Links zum Herunterladen, ohne sie herunterzuladen.
es: Imprima solo la lista de vínculos para descargar, sin descargarla.
fr: Imprimer uniquement la liste des liens à télécharger sans télécharger.
it: Stampa solo l'elenco dei collegamenti da scaricare senza scaricarlo.
ja: ダウンロードするリンクの一覧をダウンロードせず、印刷だけを行います。
ko: 다운로드할 링크 목록을 다운로드하지 않고 인쇄만 합니다.
pl: Drukuj tylko listę linków do pobrania bez ich pobierania.
pt_br: Somente imprimir a lista de links para download sem baixá-la.
ru: Печатать только список ссылок для скачивания, не выполняя загрузку.
tr: İndirmeden, yalnızca indirilecek bağlantıların listesini yazdırın.
zh_hans: 仅打印要下载的链接的列表，而不下载列表。
zh_hant: 只列印要下載的連結清單，而不下載。
