Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UpdateToolCommandInvalidGlobalAndLocalAndToolPath
source: The local option (--local), the global option (--global), and the tool path option (--tool-path) cannot be used together. Specify only one of the options: {0}.
cs: Parametry místní (--local), globální (--global) a cesta nástroje (--tool-path) nejdou použít společně. Zadejte jenom jeden z nich: {0}.
de: Die lokale Option (--local), die globale Option (--global) und die Toolpfadoption (--tool-path) können nicht zusammen verwendet werden. Geben Sie nur eine der Optionen an: {0}.
es: La opción local (--local), la opción global (--global) y la opción tool path (--tool-path) no se pueden usar juntas. Especifique solo una de ellas: {0}.
fr: N'utilisez pas en même temps l'option locale (--local), l'option globale (--global) et l'option de chemin d'outil (--tool-path). Spécifiez uniquement l'une de ces options : {0}.
it: Non è possibile usare contemporaneamente le opzioni local (--local), global (--global) e tool-path (--tool-path). Specificare una sola di queste opzioni: {0}.
ja: ローカル オプション (--local)、グローバル オプション (--global)、ツール パス オプション (--tool-path) は一緒に使用できません。いずれかのオプションだけを指定します: {0}。
ko: 로컬 옵션(--local), 전역 옵션(--global), 도구 경로 옵션(--tool-path)을 함께 사용할 수 없습니다. 옵션 {0}에 대해 하나만 지정하세요.
pl: Opcji lokalnej (--local), globalnej (--global) i ścieżki narzędzia (--tool-path) nie można używać razem. Określ tylko jedną z opcji: {0}.
pt_br: A opção local (--local), a opção global (--global) e a opção de caminho da ferramenta (--tool-path) não podem ser usadas juntas. Especifique somente uma das opções: {0}.
ru: Параметры --local, --global и --tool-path не могут использоваться совместно. Укажите только один из этих параметров: {0}.
tr: Yerel seçenek (--local), genel seçenek (--global) ve aracı yolu seçeneği (--tool-path) birlikte kullanılamaz. Seçeneklerden yalnızca birini belirtin: {0}.
zh_hans: 本地选项(--local)、全局选项(--global)和工具路径选项(--tool-path)不能一起使用。请仅指定其中一个选项: {0}。
zh_hant: 不可同時使用本機選項 (--local)、全域選項 (--global) 和工具路徑選項 (--tool-path)。請只指定其中一個選項: {0}。

# UpdateToolFailed
source: Tool '{0}' failed to update due to the following:
cs: Aktualizace nástroje {0} se nezdařila z následujícího důvodu:
de: Fehler beim Update des Tools "{0}". Ursache:
es: La herramienta "{0}" no se pudo actualizar debido a lo siguiente:
fr: Échec de la mise à jour de l'outil '{0}' pour la ou les raisons suivantes :
it: L'aggiornamento dello strumento '{0}' non è riuscito. Motivi:
ja: ツール '{0}' を更新できませんでした。原因:
ko: 다음으로 인해 '{0}' 도구를 업데이트하지 못했습니다.
pl: Aktualizacja narzędzia „{0}” nie powiodła się z następującego powodu:
pt_br: Falha ao atualizar a ferramenta '{0}' devido ao seguinte motivo:
ru: Не удалось обновить инструмент "{0}" по следующей причине:
tr: Aşağıdaki nedenlerle '{0}' aracı güncelleştirilemedi:
zh_hans: 工具“{0}”因以下原因而未能更新:
zh_hant: 由於下列原因，因此工具 '{0}' 無法更新:

# UpdatedWorkloadMode
source: Successfully updated workload install mode to use {0}.
cs: Režim instalace úlohy se úspěšně aktualizoval na {0}.
de: Der Installationsmodus der Workload wurde erfolgreich aktualisiert, um {0} zu verwenden.
es: El modo de instalación de la carga de trabajo se actualizó correctamente para usar {0}.
fr: Le mode d’installation de la charge de travail a été mis à jour pour utiliser {0}.
it: La modalità di installazione del carico di lavoro è stata aggiornata per l'uso di {0}.
ja: {0} を使用するようにワークロード インストール モードが正常に更新されました。
ko: {0}을(를) 사용하도록 워크로드 설치 모드를 업데이트했습니다.
pl: Pomyślnie zaktualizowano tryb instalacji obciążenia w celu użycia {0}.
pt_br: Modo de instalação da carga de trabalho atualizado com êxito para usar {0}.
ru: Режим установки рабочей нагрузки изменен на {0}.
tr: İş yükü yükleme modu {0} kullanacak şekilde başarıyla güncelleştirildi.
zh_hans: 已成功更新工作负载安装模式以使用 {0}。
zh_hant: 已成功更新工作負載安裝模式以使用 {0}。

# UsableLaunchProfileCannotBeLocated
source: A usable launch profile could not be located.
cs: Nenašel se použitelný profil spuštění.
de: Es wurde kein verwendbares Startprofil gefunden.
es: No se ha podido encontrar un perfil de inicio que se pueda usar.
fr: Impossible de localiser un profil de lancement utilisable.
it: Non è stato trovato alcun profilo di avvio utilizzabile.
ja: 使用可能な起動プロファイルが見つかりませんでした。
ko: 사용할 수 있는 시작 프로필을 찾을 수 없습니다.
pl: Nie można odnaleźć nadającego się do użytku profilu uruchamiania.
pt_br: Um perfil de inicialização utilizável não pôde ser localizado.
ru: Не удалось найти подходящий для использования профиль запуска.
tr: Kullanılabilir bir başlatma profili bulunamadı.
zh_hans: 找不到可用的启动配置文件。
zh_hant: 找不到可用的啟動設定檔。

source: Usage
cs: Použití
de: Syntax
es: Uso
fr: Utilisation
it: Sintassi
ja: 使用法
ko: 사용법
pl: Użycie
pt_br: Uso
ru: Использование
tr: Kullanım
zh_hans: 使用情况
zh_hant: 使用方式

# UserJwtsDefinition
source: Manage JSON Web Tokens in development.
cs: Spravujte webové tokeny JSON ve vývoji.
de: Verwalten sie JSON-Webtoken in der Entwicklung.
es: Administre los tokens web JSON en el desarrollo.
fr: Gérer les jetons Web JSON en développement.
it: Consente di gestire i token JSON Web nello sviluppo.
ja: 開発中の JSON Web トークンを管理します。
ko: 개발 중인 JSON 웹 토큰을 관리합니다.
pl: Zarządzaj tokenami internetowymi JSON w trakcie opracowywania.
pt_br: Gerenciar tokens da Web JSON em desenvolvimento.
ru: Управлять JSON Web Token в разработке.
tr: Geliştirme aşamasındaki JSON Web Belirteçlerini yönetme.
zh_hans: 在开发中管理 JSON Web 令牌。
zh_hant: 在開發中管理 JSON Web 權杖。

# UserSecretsDefinition
source: Manage development user secrets.
cs: Spravuje tajné kódy uživatelů pro vývoj.
de: Hiermit verwalten Sie Benutzergeheimnisse zur Entwicklung.
es: Administra secretos de usuario de desarrollo.
fr: Gérez les secrets d'utilisateur de développement.
it: Consente di gestire i segreti degli utenti di sviluppo.
ja: 開発ユーザーのシークレットを管理します。
ko: 개발 사용자 비밀을 관리합니다.
pl: Zarządzaj wpisami tajnymi użytkowników dotyczącymi czynności deweloperskich.
pt_br: Gerencie segredos do usuário de desenvolvimento.
ru: Управление развертыванием секретов пользователей.
tr: Kullanıcı gizli dizilerini yönetin.
zh_hans: 管理开发用户密码。
zh_hant: 管理開發使用者祕密。

# UsingCacheForPackInstall
source: Installing package {0} version {1} from offline cache {2}.
cs: Instaluje se balíček {0} verze {1} z offline mezipaměti {2}.
de: Das Paket "{0}", Version {1}, aus dem Offlinecache "{2}" wird installiert.
es: Instalando el paquete {0}, versión {1} desde la caché sin conexión {2}.
fr: Installation du {0} de {1} la version du package à partir du {2} de cache hors connexion.
it: Installazione del pacchetto {0}, versione {1}, dalla cache offline {2}.
ja: オフライン キャッシュ {2} でパッケージ {0} のバージョン {1} をインストールしています。
ko: 오프라인 캐시 {2}에서 패키지 {0} 버전 {1}(을)를 설치하는 중입니다.
pl: Instalowanie pakietu {0} w wersji {1} z pamięci podręcznej w trybie offline {2}.
pt_br: Instalando o pacote {0} versão {1} do cache offline {2}.
ru: Установка пакета {0} версии {1} из автономного кэша {2}.
tr: {0} paketi sürüm {1}, {2} çevrimdışı önbelleğinden yükleniyor.
zh_hans: 正在从脱机缓存 {2} 安装程序包 {0} 版本 {1}。
zh_hant: 正在從離線快取 {2} 安裝套件 {0} 版本 {1}。

# UsingLaunchSettingsFromMessage
source: Using launch settings from {0}...
cs: Použití nastavení spuštění z {0}...
de: Die Starteinstellungen von {0} werden verwendet…
es: Usando la configuración de inicio de {0}...
fr: Utilisation des paramètres de lancement à partir de {0}...
it: Uso delle impostazioni di avvio di {0}...
ja: {0} からの起動設定を使用中...
ko: {0}의 시작 설정을 사용하는 중...
pl: Używanie ustawień uruchamiania z profilu {0}...
pt_br: Usando as configurações de inicialização de {0}...
ru: Используются параметры запуска из {0}...
tr: {0} içindeki başlatma ayarları kullanılıyor...
zh_hans: 从 {0} 使用启动设置...
zh_hant: 使用來自 {0} 的啟動設定...

# VBCSCompilerOptionDescription
source: Shut down the VB/C# compiler build server.
cs: Vypne buildovací server kompilátoru VB/C#.
de: Hiermit wird der VB/C#-Compilerbuildserver heruntergefahren.
es: Apaga el servidor de compilación del compilador de VB o C#.
fr: Arrêtez le serveur de builds du compilateur VB/C#.
it: Arresta il server di compilazione del compilatore VB/C#.
ja: VB/C# コンパイラ ビルド サーバーをシャットダウンします。
ko: VB/C# 컴파일러 빌드 서버를 종료합니다.
pl: Zamknij serwer kompilacji kompilatora VB/C#.
pt_br: Desligar o servidor de build do compilador VB/C#.
ru: Завершает работу сервера сборки компилятора VB или C#.
tr: VB/C# derleyicisi derleme sunucusunu kapatır.
zh_hans: 关闭 VB/C# 编译器生成服务器。
zh_hant: 關閉 VB/C# 編譯器組建伺服器。

# VSWorkloadNotRemoved
source: Workload '{0}' was not removed because it is installed and managed by Visual Studio: '{1}'. Please uninstall this workload using the Visual Studio Installer to fully remove it.
cs: Úloha „{0}“ se neodebrala, protože je nainstalovaná a spravovaná Visual Studio: „{1}“. Pokud chcete tuto úlohu úplně odebrat, odinstalujte ji pomocí Instalační program pro Visual Studio.
de: Die Workload "{0}" wurde nicht entfernt, da sie von Visual Studio installiert und verwaltet wird: "{1}". Deinstallieren Sie diese Workload mithilfe des Visual Studio-Installer, um sie vollständig zu entfernen.
es: La carga de trabajo '{0}' no se quitó porque está instalada y administrada por Visual Studio: '{1}'. Desinstale esta carga de trabajo mediante el Instalador de Visual Studio para quitarla por completo.
fr: La charge de travail «{0}» n’a pas été supprimée, car elle est installée et gérée par Visual Studio : «{1}». Désinstallez cette charge de travail à l’aide de Visual Studio Installer pour la supprimer complètement.
it: Il carico di lavoro '{0}' non è stato rimosso perché è installato e gestito da Visual Studio: '{1}'. Disinstallare questo carico di lavoro usando il Programma di installazione di Visual Studio per rimuoverlo completamente.
ja: ワークロード '{0}' は、Visual Studio '{1}' によってインストールおよび管理されているため、削除されませんでした。このワークロードを完全に削除するには、Visual Studio インストーラーを使用してこのワークロードをアンインストールしてください。
ko: '{0}' 워크로드는 '{1}' Visual Studio 설치 관리자에서 설치하고 관리하므로 제거되지 않았습니다. Visual Studio 설치 관리자를 사용하여 이 워크로드를 제거하여 완전히 제거하세요.
pl: Obciążenie „{0}” nie zostało usunięte, ponieważ jest zainstalowane i zarządzane przez program Visual Studio: „{1}”. Odinstaluj to obciążenie przy użyciu Instalatora programu Visual Studio, aby w pełni je usunąć.
pt_br: Workload '{0}' não foi removido porque é instalado e gerenciado pelo Visual Studio: '{1}'. Desinstale esta carga de trabalho usando o Instalador do Visual Studio para removê-la completamente.
ru: Рабочая нагрузка "{0}" не удалена, так как она установлена и управляется Visual Studio: "{1}". Удалите эту рабочую нагрузку с помощью Visual Studio Installer, чтобы полностью удалить ее.
tr: Visual Studio: '{1}' tarafından yüklendiği ve yönetildiği için '{0}' iş yükü kaldırılmadı. Bu iş yükünü tamamen kaldırmak için Visual Studio Yükleyicisini kullanarak kaldırın.
zh_hans: 未删除工作负载“{0}”，因为它由 Visual Studio“{1}”安装和管理。请使用 Visual Studio 安装程序卸载此工作负载以将其完全删除。
zh_hant: 未移除工作負載 '{0}'，因為它已安裝並由 Visual Studio管理: '{1}'。請使用 Visual Studio 安裝程式解除安裝此工作負載，以將其完全移除。

# ValidationFailedDuplicateVersion
source: Cannot specify --version when the package argument already contains a version.
cs: Nejde zadat --version, pokud argument balíčku již obsahuje verzi.
de: --version kann nicht angegeben werden, wenn das Paketargument bereits eine Version enthält.
es: No se puede especificar --version cuando el argumento del paquete ya contiene una versión.
fr: Impossible de spécifier --version lorsque l’argument de package contient déjà une version.
it: Non è possibile specificare --version se l'argomento del pacchetto contiene già una versione.
ja: パッケージ引数が既にバージョンを含んでいる場合は、--version を指定できません。
ko: 패키지 인수에 이미 버전이 포함되어 있을 때는 --version을 지정할 수 없습니다.
pl: Nie można określić parametru --version, jeśli argument pakietu zawiera już wersję.
pt_br: Não é possível especificar --version quando o argumento do pacote já contém uma versão.
ru: Невозможно указать --version, если аргумент пакета уже содержит версию.
tr: Paket bağımsız değişkeni zaten bir sürüm içeriyorsa --version belirtilemez.
zh_hans: 当包参数已包含版本时，无法指定 --version。
zh_hant: 當套件引數已包含版本時，無法指定 --version。

# ValueMustBeAnObject
source: The property '{0}' must be an object if it is specified.
cs: Vlastnost {0} musí být objektem, pokud je zadána.
de: Die Eigenschaft "{0}" muss ein Objekt sein, sofern angegeben.
es: La propiedad "{0}" debe ser un objeto si se especifica.
fr: La propriété '{0}' doit être un objet, si elle est spécifiée.
it: Se è specificata, la proprietà '{0}' deve essere un oggetto.
ja: プロパティ ' {0} ' は、指定されている場合はオブジェクトである必要があります。
ko: '{0}' 속성이 지정된 경우 개체여야 합니다.
pl: Właściwość „{0}” musi być obiektem, jeśli jest określona.
pt_br: Se especificado, a propriedade '{0}' deve ser um objeto.
ru: Если свойство "{0}" задано, оно должно быть объектом.
tr: '{0}' özelliği belirtilmişse bir nesne olmalıdır.
zh_hans: 如果指定，则属性“{0}”必须是一个对象。
zh_hant: 如果屬性 '{0}' 受到指定，則其必須為物件。

# VerbosityArgumentName
source: Verbosity
cs: Podrobnosti
de: Ausführlichkeit
es: Nivel de detalle
fr: Verbosité
it: Livello di dettaglio
ja: 詳細
ko: 세부 정보 표시
pl: Szczegółowość
pt_br: Detalhamento
ru: Уровень детализации
tr: Ayrıntı düzeyi
zh_hans: 详细程度
zh_hant: 詳細程度

# VerbosityDescription
source: Display this amount of details in the output: `normal`, `minimal`, `detailed`. The default is `normal`
cs: Ve výstupu se zobrazí následující množství podrobností: normální, minimální, podrobné. Výchozí hodnota je normal.
de: Zeigen Sie die entsprechende Menge von Details in der Ausgabe an: „Normal“, „Minimal“, „Detailliert“. Der Standardwert ist „Normal“
es: Muestra esta cantidad de detalles en la salida: 'normal', 'mínimo', 'detallado'. El valor predeterminado es "normal"
fr: Afficher cette quantité de détails dans la sortie : `normal`, `minimal`, `détaillé`. La valeur par défaut est `normal`
it: Visualizzare la quantità di dettagli nell'output: `normale`, `minimo`, `dettagliato`. L'impostazione predefinita è `normale`
ja: 以下の詳細の量を出力に表示します: 'normal'、'minimal'、'detailed'。既定値は 'normal' です
ko: 출력에 'normal', 'minimal', 'detailed'의 세부 정보 정도를 표시합니다. 기본값은 'normal'입니다.
pl: Wyświetl tę ilość szczegółów w danych wyjściowych: „normalne”, „minimalne”, „szczegółowe”. Wartość domyślna to „normalne”.
pt_br: Exiba essa quantidade de detalhes na saída: "normal", "mínimo", "detalhado". O padrão é ''normal''
ru: Отобразить это количество деталей в выводе: "нормальный", "минимальный", "подробный". Значение по умолчанию: "нормальный".
tr: Çıkışta şu miktarda ayrıntı görüntüle: `normal`, `minimal`, `ayrıntılı`. Varsayılan: `normal`
zh_hans: 在输出中显示此详细信息量: `normal`、`minimal`、`detailed`。默认值为 `normal`
zh_hant: 在輸出中顯示此詳細資料量: `normal`、`minimal`、`detailed`。預設為 `normal`

# Verbosity_OptionDescription
source: Sets the verbosity level. Allowed values are q[uiet], m[inimal], n[ormal], and diag[nostic].
cs: Nastaví úroveň podrobností. Povolené hodnoty jsou: q[uiet], m[inimal], n[ormal] a diag[nostic].
de: Legt den Ausführlichkeitsgrad fest. Zulässige Werte sind q[uiet], m[inimal], n[ormal] und diag[nostic].
es: Permite establecer el nivel de detalle. Los valores permitidos son q[uiet], m[inimal], n[ormal] y diag[nostic].
fr: Définit le niveau de détail. Les valeurs autorisées sont q[uiet], m[inimal], n[ormal] et diag[nostic].
it: Consente di impostare il livello di dettaglio. I valori consentiti sono q[uiet], m[inimal], n[ormal] e diag[nostic].
ja: 詳細レベルを設定します。許可されている値: q[uiet]、m[inimal]、n[ormal]、diag[nostic]。
ko: 세부 정보 표시 수준을 설정합니다. 허용되는 값은 q[uiet], m[inimal], n[ormal] 및 diag[nostic]입니다.
pl: Ustawia poziom szczegółowości. Dozwolone wartości to q[uiet], m[inimal], n[ormal] i diag[nostic].
pt_br: Define o nível de detalhamento. Os valores permitidos são q[uiet], m[inimal], n[ormal] e diag[nostic].
ru: Задает уровень детализации. Допустимые значения: q (без вывода подробных сведений), m (минимальный), n (нормальный) и diag (диагностический).
tr: Ayrıntı düzeyini ayarlayın. İzin verilen değerler şunlardır: q[uiet], m[inimal], n[ormal] ve diag[nostic].
zh_hans: 设置详细级别。允许的值为 q[uiet]、m[inimal]、n[ormal]、diag[nostic]。
zh_hant: 設定詳細資訊層級。允許的值為 q[uiet]、m[inimal]、n[ormal] 和 diag[nostic]。

source: Verified
cs: Ověřeno
de: Überprüft
es: Comprobado
fr: Vérifié
it: Verificata
ja: 確認済み
ko: 확인됨
pl: Zweryfikowane
pt_br: Verificado
ru: Проверено
tr: Doğrulandı
zh_hans: 已验证
zh_hant: 已驗證

source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
pl: Wersja
pt_br: Versão
ru: Версия
tr: SÜRÜM
zh_hans: 版本
zh_hant: 版本

# VersionCheckFailure
source: No version found to check if this is up to date. Please check for updates manually.
cs: Nenašla se žádná verze, díky níž by se ověřilo, jestli je aktuální. Vyhledejte aktualizace ručně.
de: Es wurde keine Version gefunden, um zu überprüfen, ob diese auf dem neuesten Stand ist. Bitte prüfen Sie manuell auf Updates.
es: No se encontró ninguna versión para comprobar si está actualizada. Compruebe si hay actualizaciones manualmente.
fr: Version introuvable pour vérifier si elle est à jour. Recherchez les mises à jour manuellement.
it: Nessuna versione trovata per verificarne l’aggiornamento. Controllare manualmente la disponibilità di aggiornamenti.
ja: バージョンが見つからず、これが最新のものかを確認できませんでした。更新プログラムを手動で確認してください。
ko: 최신 버전인지 확인할 버전이 없습니다. 업데이트를 수동으로 확인하세요.
pl: Nie znaleziono wersji do sprawdzenia, czy jest ona aktualna. Sprawdź aktualizacje ręcznie.
pt_br: Nenhuma versão encontrada para verificar se isso está atualizado. Verifique se há atualizações manualmente.
ru: Не найдена версия для проверки ее актуальности. Проверьте наличие обновлений вручную.
tr: Bunun güncel olup olmadığını denetlemek için sürüm bulunamadı. Lütfen güncelleştirmeleri el ile denetleyin.
zh_hans: 找不到任何版本来检查此是否为最新。请手动检查更新。
zh_hant: 找不到版本可檢查其是否為最新版。請手動檢查更新。

# VersionColumnHeader
source: Version
cs: Verze
es: Versión
it: Versione
ja: バージョン
ko: 버전
pl: Wersja
pt_br: Versão
ru: Версия
tr: Sürüm
zh_hans: 版本
zh_hant: 版本

source: Versions
cs: Verze
de: Versionen
es: Versiones
it: Versioni
ja: バージョン
ko: 버전
pl: Wersje
pt_br: Versões
ru: Версии
tr: Sürümler
zh_hans: 版本
zh_hant: 版本

# VsTestDefinition
source: Run Microsoft Test Engine (VSTest) commands.
cs: Spustí příkazy VSTest (Microsoft Test Engine).
de: Hiermit werden Befehle der Microsoft-Test-Engine (VSTest) ausgeführt.
es: Ejecuta comandos de Microsoft Test Engine (VSTest).
fr: Exécutez des commandes VSTest (Microsoft Test Engine).
it: Esegue i comandi di Microsoft Test Engine (VSTest).
ja: Microsoft Test Engine (VSTest) コマンドを実行します。
ko: Microsoft Test Engine(VSTest) 명령을 실행합니다.
pl: Uruchom polecenia aparatu Microsoft Test Engine (VSTest).
pt_br: Executar comandos do VSTest (Microsoft Test Engine).
ru: Выполнение команд Microsoft Test Engine (VSTest).
tr: Microsoft Test Engine (VSTest) komutlarını çalıştırır.
zh_hans: 运行 Microsoft 测试引擎(VSTest)命令。
zh_hant: 執行 Microsoft Test Engine (VSTest) 命令。

# WatchDefinition
source: Start a file watcher that runs a command when files change.
cs: Spustí sledovací proces souborů, který při změnách souborů spustí příkaz.
de: Hiermit starten Sie einen Datei-Watcher, der einen Befehl ausführt, sobald Dateien geändert werden.
es: Inicia un monitor de archivo que ejecuta un comando cuando los archivos cambian.
fr: Démarrez un observateur de fichier qui exécute une commande quand les fichiers changent.
it: Avvia un controllo file che esegue un comando in caso di modifica dei file.
ja: ファイルが変更されたときにコマンドを実行するファイル ウォッチャーを起動します。
ko: 파일이 변경되면 명령을 실행하는 파일 감시자를 시작합니다.
pl: Rozpocznij pracę obserwatora plików służącego do uruchamiania polecenia po wprowadzeniu zmian w plikach.
pt_br: Inicie um observador de arquivo que executa um comando quando os arquivos são alterados.
ru: Запуск наблюдателя за файлами, который выполняет команду при изменении файлов.
tr: Dosyalar değiştiğinde bir komut çalıştıran bir dosya izleyici başlatın.
zh_hans: 启动文件观察程序，它会在文件发生更改时运行命令。
zh_hant: 啟動會在檔案變更時執行命令的檔案監看員。

# WorkloadAlreadyInstalled
source: Workload(s) '{0}' are already installed.
cs: {0} úlohy jsou už nainstalované.
de: Workloads '{0}' sind bereits installiert.
es: Las cargas de trabajo "{0}" ya están instaladas.
fr: La ou les charges de travail '{0}' sont déjà installées.
it: I carichi di lavoro '{0}' sono già installati.
ja: ワークロード '{0}' は既にインストールされています。
ko: '{0}' 워크로드가 이미 설치되어 있습니다.
pl: Pakiety robocze „{0}” są już zainstalowane.
pt_br: A(s) carga(s) de trabalho '{0}' já está(ão) instalada(s).
ru: Рабочие нагрузки "{0}" уже установлены.
tr: '{0}' iş yükleri zaten yüklü.
zh_hans: 已安装工作负载“{0}”。
zh_hant: 已安裝工作負載 '{0}'。

# WorkloadCleanCommandDescription
source: Removes workload components that may have been left behind from previous updates and uninstallations.
cs: Odebere součásti úloh, které mohly být pozůstatky z předchozích aktualizací a odinstalací.
de: Entfernt Workloadkomponenten, die möglicherweise von vorherigen Updates und Deinstallationen zurückgelassen wurden.
es: Quita los componentes de carga de trabajo que pueden haberse dejado de las actualizaciones y desinstalaciones anteriores.
fr: Supprime les composants de charge de travail qui ont peut-être été laissés en arrière des mises à jour et désinstallations précédentes.
it: Rimuove i componenti del carico di lavoro che potrebbero essere stati lasciati indietro da aggiornamenti e disinstallazioni precedenti.
ja: 以前の更新プログラムとアンインストールで取り残された可能性のあるワークロード コンポーネントを削除します。
ko: 이전 업데이트 및 제거에서 남아 있을 수 있는 워크로드 구성 요소를 제거합니다.
pl: Usuwa składniki obciążenia, które mogły zostać pominięte w poprzednich aktualizacjach i dezinstalacjach.
pt_br: Remove componentes de carga de trabalho que podem ter sido deixados para trás em atualizações e desinstalações anteriores.
ru: Удаляет компоненты рабочей нагрузки, которые могли остаться после предыдущих обновлений и удалений.
tr: Önceki güncelleştirme ve kaldırma işlemlerinden kalmış olabilecek iş yükü bileşenlerini kaldırır.
zh_hans: 删除可能已从之前的更新和卸载中保留的工作负载组件。
zh_hant: 移除先前更新和解除安裝中可能遺漏的工作負載元件。

# WorkloadCommandDescription
source: Install or work with workloads that extend the .NET experience.
cs: Nainstalujte úlohy, které rozšiřují prostředí .NET, nebo s nimi pracujte.
de: Installation oder Arbeit mit Workloads zum Erweitern der .NET-Benutzeroberfläche.
es: Instale o trabaje con cargas de trabajo que mejoran la experiencia de uso de .NET.
fr: Installez ou utilisez des charges de travail qui étendent l'expérience .NET.
it: Consente di installare o usare carichi di lavoro che estendono l'esperienza .NET.
ja: .NET のエクスペリエンスを向上するワークロードをインストールするか、使用します。
ko: .NET 환경을 확장하는 워크로드를 설치하거나 워크로드로 작업합니다.
pl: Zainstaluj lub pracuj z obciążeniami, które rozszerzają środowisko .NET.
pt_br: Instalar ou trabalhar com as cargas de trabalho que estendem a experiência do .NET.
ru: Установка и использование рабочих нагрузок, расширяющих возможности .NET.
tr: .NET deneyiminizi genişleten iş yüklerini yükleyin veya bu iş yükleriyle çalışın.
zh_hans: 安装或使用用于扩展 .NET 体验的工作负载。
zh_hant: 安裝或使用可提升 .NET 體驗的工作負載。
