Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NeedNuGetInConfig
source: The 'dotnet tool search' command unconditionally accesses nuget.org to find tools, but it is not present in your nuget.config. Add it to run this command. This can be done with this command: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
cs: Příkaz dotnet tool search nepodmíněně přistupuje k nuget.org k vyhledání nástrojů, ale ve vašem souboru nuget.config se nenachází. Pokud chcete tento příkaz spustit, přidejte ho. Můžete to provést pomocí tohoto příkazu: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
de: Der Befehl "dotnet tool search" greift ohne Bedingungen auf nuget.org zu, um Tools zu finden, ist jedoch in Ihrer nuget.config nicht vorhanden. Fügen Sie ihn hinzu, um diesen Befehl auszuführen. Dies kann mit diesem Befehl erfolgen: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
es: El comando “dotnet tool search” accede incondicionalmente a nuget.org para encontrar herramientas, pero no está presente en su nuget.config. Agréguelo para ejecutar este comando. Esto se puede hacer con este comando: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
fr: La commande « dotnet tool search » accède de manière inconditionnelle à nuget.org pour trouver des outils, mais il n'est pas présent dans votre nuget.config. Ajoutez-le pour exécuter cette commande. Cette opération peut être effectuée avec cette commande : dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
it: Il comando 'dotnet tool search' accede in modo incondizionato a nuget.org per trovare strumenti, ma non è presente in nuget.config. Aggiungilo per eseguire questo comando. Questa operazione può essere eseguita con questo comando: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
ja: 'dotnet tool search' コマンドは、nuget.org に無条件でアクセスしてツールを検索しますが、nuget.config に存在していません。このコマンドを実行するには、追加してください。 これは、次のコマンドで実行できます: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
ko: 'dotnet tool search' 명령은 도구를 찾기 위해 nuget.org에 무조건 액세스하지만, nuget.config에 없습니다. 이 명령을 실행하려면 추가하세요. 이 작업은 다음 명령으로 수행할 수 있습니다. dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
pl: Polecenie „dotnet tool search” bezwarunkowo uzyskuje dostęp do nuget.org w celu znalezienia narzędzi, ale nie jest obecne w pliku nuget.config. Dodaj je, aby uruchomić to polecenie. Można to zrobić za pomocą tego polecenia: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
pt_br: O comando "dotnet tool search" acessa incondicionalmente nuget.org para localizar ferramentas, mas não está presente em seu nuget.config. Adicione-o para executar este comando. Isso pode ser feito com este comando: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
ru: Команда "dotnet tool search" обращается без условий к nuget.org для поиска инструментов, но он отсутствует в nuget.config. Добавьте его, чтобы выполнить эту команду. Это можно сделать с помощью следующей команды: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
tr: 'dotnet tool search' komutu araçları bulmak için nuget.org'a koşulsuz olarak erişir, ancak bu nuget.config dosyanızın içinde mevcut değildir. Bu komutu çalıştırmak için ekleyin. Bu işlem, şu komutla yapılabilir: dotnet nuget add source https://api.nuget.org/v3/index.json -n nuget.org
zh_hans: 'dotnet tool search' 命令可无条件访问 nuget.org 以查找工具，但它在 nuget.config 中不存在。添加它以运行此命令。 可以使用以下命令完成此操作: dotnet nuget 添加源 https://api.nuget.org/v3/index.json -n nuget.org
zh_hant: 'dotnet tool search' 命令可無條件存取 nuget.org 以尋找工具，但該命令不在您的 nuget.config 中。請新增它以執行此命令。 這可以使用此命令來完成: dotnet nuget 新增來源 https://api.nuget.org/v3/index.json -n nuget.org

source: .NET Add Command
cs: Příkaz rozhraní .NET pro přidání
de: .NET-Befehl "Add"
es: Comando Add de .NET
fr: Commande d'ajout .NET
it: Comando Aggiungi .NET
ja: .NET Add コマンド
ko: .NET 추가 명령
pl: Polecenie add platformy .NET
pt_br: Comando Add do .NET
ru: Команда .NET "Добавить"
tr: .NET Add Komutu
zh_hans: .NET 添加命令
zh_hant: .NET 新增命令

# NetListCommand
source: List references or packages of a .NET project.
cs: Vypíše seznam odkazů nebo balíčků projektu .NET.
de: Verweise oder Pakete eines .NET-Projekts auflisten
es: Enumerar referencias o paquetes de un proyecto .NET.
fr: Listez les références ou les packages d'un projet .NET.
it: Elenca i riferimenti o i pacchetti di un progetto .NET.
ja: .NET プロジェクトの参照またはパッケージを一覧表示します。
ko: .NET 프로젝트의 참조 또는 패키지를 나열합니다.
pl: Lista odwołań lub pakietów projektu .NET.
pt_br: Listar referências ou pacotes de um projeto .NET.
ru: Выводит список ссылок или пакетов для проекта .NET.
tr: Bir .NET projesinin başvurularını veya paketlerini listeleyin.
zh_hans: 列出 .NET 项目的引用或包。
zh_hant: 列出 .NET 專案的參考或套件。

source: .NET Remove Command
cs: Příkaz rozhraní .NET pro odebrání
de: .NET-Befehl "Remove"
es: Comando Remove de .NET
fr: Commande de suppression .NET
it: Comando Rimuovi .NET
ja: .NET Remove コマンド
ko: .NET 제거 명령
pl: Polecenie remove platformy .NET
pt_br: Comando Remover do .NET
ru: Команда .NET "Удалить"
tr: .NET Remove Komutu
zh_hans: .NET 删除命令
zh_hant: .NET 移除命令

# NewDefinition
source: Create a new .NET project or file.
cs: Vytvoří nový projekt nebo soubor .NET.
de: Hiermit wird ein neues .NET-Projekt oder eine neue Datei erstellt.
es: Crea un nuevo archivo o proyecto de .NET.
fr: Créez un fichier ou projet .NET.
it: Crea un nuovo file o progetto .NET.
ja: 新しい .NET プロジェクトまたはファイルを作成します。
ko: 새 .NET 프로젝트 또는 파일을 만듭니다.
pl: Utwórz nowy projekt lub plik platformy .NET.
pt_br: Criar um novo projeto ou arquivo do .NET.
ru: Создание нового файла или проекта .NET.
tr: Yeni bir .NET projesi veya dosyası oluşturur.
zh_hans: 创建新的 .NET 项目或文件。
zh_hant: 建立新的 .NET 專案或檔案。

# NewFeatureBandMessage
source: Try out the newest .NET SDK features with .NET {0}.
cs: V rozhraní .NET {0} si můžete vyzkoušet nejnovější funkce sady .NET SDK.
de: Testen Sie die neuesten .NET SDK-Features mit .NET {0}.
es: Pruebe las últimas características del SDK de .NET con .NET {0}.
fr: Essayez les dernières fonctionnalités du kit SDK .NET avec .NET {0}.
it: Per provare le funzionalità più recenti di .NET SDK, usare .NET {0}.
ja: .NET {0} を使用して、.NET SDK の最新機能をお試しください。
ko: .NET {0}에서 최신 .NET SDK 기능을 사용해 보세요.
pl: Wypróbuj najnowsze funkcje zestawu .NET SDK, używając platformy .NET {0}.
pt_br: Experimente os novos recursos do SDK do .NET com o .NET {0}.
ru: Ознакомьтесь с новейшими компонентами пакета SDK для .NET в среде .NET {0}.
tr: .NET {0} ile en yeni .NET SDK özelliklerini deneyin.
zh_hans: 使用 .NET {0} 试用最新的 .NET SDK 功能。
zh_hant: 使用 .NET {0} 試用最新的 .NET SDK 功能。

# NewPatchAvailableMessage
source: Patch {0} is available.
cs: Je k dispozici oprava {0}.
de: Patch {0} ist verfügbar.
es: La revisión {0} está disponible.
fr: Le patch {0} est disponible.
it: È disponibile la patch {0}.
ja: パッチ {0} が利用可能です。
ko: 패치 {0}을(를) 사용할 수 있습니다.
pl: Poprawka {0} jest dostępna.
pt_br: O patch {0} está disponível.
ru: Доступно исправление {0}.
tr: {0} düzeltme eki kullanılabilir.
zh_hans: 修补程序 {0} 可用。
zh_hant: 有可用的修補程式 {0}。

# NewWorkloadSet
source: Installing workload version {0}.
cs: Probíhá instalace verze úlohy {0}.
de: Die Workloadversion {0} wird installiert.
es: Instalando la versión de carga de trabajo {0}.
fr: Installation de la charge de travail {0}.
it: Installazione del carico di lavoro {0}.
ja: ワークロードのバージョン {0} をインストールしています。
ko: 작업 버전 {0}을(를) 설치하는 중입니다.
pl: Instalowanie wersji obciążenia {0}.
pt_br: Instalando a versão da carga de trabalho {0}.
ru: Установка версии рабочей нагрузки {0}.
tr: {0} iş yükü sürümü yükleniyor.
zh_hans: 正在安装工作负载版本 {0}。
zh_hant: 正在安裝工作負載版本 {0}。

# NoBinaryLogBecauseRunningJustCsc
source: Warning: Binary log option was specified but MSBuild will be skipped because running just csc is enough. Specify '--no-cache' to force full build.
cs: Upozornění: Byl zadán parametr binárního protokolu, ale MSBuild bude přeskočen, protože stačí spustit pouze csc. Chcete-li vynutit úplné sestavení, zadejte --no-cache.
de: Warnung: Die Binärprotokolloption wurde angegeben, aber MSBuild wird übersprungen, da die Ausführung von csc ausreichend ist. Geben Sie „--no-cache“ an, um den vollständigen Buildvorgang zu erzwingen.
es: Advertencia: se especificó la opción de registro binario, pero se omitirá MSBuild porque ejecutar solo csc es suficiente. Especifique "--no-cache" para forzar la compilación.
fr: Avertissement : l’option de journal binaire a été spécifiée, mais MSBuild sera ignoré, car l’exécution de csc est suffisante. Spécifiez « --no-cache » pour forcer le build complet.
it: Avviso: è stata specificata l'opzione registro binario, ma MSBuild verrà ignorato perché è sufficiente l'esecuzione di csc. Specificare "--no-cache" per forzare la compilazione completa.
ja: 警告: バイナリ ログ オプションが指定されましたが、csc の実行だけで十分であるため、MSBuild はスキップされます。完全なビルドを強制するには、'--no-cache' を指定してください。
ko: 경고: 이진 로그 옵션이 지정되었지만 csc만 실행하면 충분하므로 MSBuild는 건너뜁니다. 전체 빌드를 강제 적용하려면 '--no-cache'를 지정하세요.
pl: Ostrzeżenie: określono opcję dziennika binarnego, ale program MSBuild zostanie pominięty, ponieważ wystarczy tylko plik csc. Określ wartość „--no-cache”, aby wymusić pełną kompilację.
pt_br: Aviso: A opção de log binário foi especificada, mas o MSBuild será ignorado porque executar apenas o csc é suficiente. Especifique '--no-cache' para forçar uma compilação completa.
ru: Внимание! Указан параметр двоичного журнала, но MSBuild будет пропущен, так как достаточно запуска только csc. Укажите "--no-cache", чтобы выполнить полную сборку принудительно.
tr: Uyarı: İkili günlük seçeneği belirtildi, ancak yalnızca csc çalıştırmak yeterli olduğundan MSBuild atlanacaktır. Tam derlemeyi zorlamak için ‘--no-cache’ belirtin.
zh_hans: 警告: 指定了二进制日志选项，但将跳过 MSBuild，因为仅运行 csc 已足够。指定 ‘--no-cache’ 以强制完全生成。
zh_hant: 警告: 已指定二進位記錄檔選項，但將略過 MSBuild，因為僅執行 csc 就足夠了。請指定 '--no-cache' 以強制完整建置。

# NoBinaryLogBecauseUpToDate
source: Warning: Binary log option was specified but build will be skipped because output is up to date. Specify '--no-cache' to force build.
cs: Upozornění: Byl zadán parametr binárního protokolu, ale sestavení bude přeskočeno, protože výstup je aktuální. Chcete-li vynutit sestavení, zadejte --no-cache.
de: Warnung: Die Binärprotokolloption wurde angegeben, aber der Build wird übersprungen, da die Ausgabe aktuell ist. Geben Sie „--no-cache“ an, um den Buildvorgang zu erzwingen.
es: Advertencia: Se especificó la opción de registro binario, pero se omitirá la compilación porque la salida está actualizada. Especifique "--no-cache" para forzar la compilación.
fr: Avertissement : l’option de journal binaire a été spécifiée, mais le build sera ignoré, car la sortie est à jour. Spécifiez « --no-cache » pour forcer le build.
it: Avviso: è stata specificata l'opzione registro binario, ma la compilazione verrà ignorata perché l'output è aggiornato. Specificare "--no-cache" per forzare la compilazione.
ja: 警告: バイナリ ログ オプションが指定されましたが、出力が最新であるため、ビルドはスキップされます。ビルドを強制するには '--no-cache' を指定してください。
ko: 경고: 이진 로그 옵션이 지정되었지만 출력이 최신 상태이므로 빌드를 건너뜁니다. 빌드를 강제로 진행하려면 '--no-cache'를 지정하세요.
pl: Ostrzeżenie: określono opcję dziennika binarnego, ale kompilacja zostanie pominięta, ponieważ dane wyjściowe są aktualne. Określ wartość „--no-cache”, aby wymusić kompilację.
pt_br: Aviso: A opção de log binário foi especificada, mas a compilação será ignorada porque a saída está atualizada. Especifique '--no-cache' para forçar a compilação.
ru: Внимание! Указан параметр двоичного журнала, но сборка будет пропущена, так как выход находится в актуальном состоянии. Укажите "--no-cache", чтобы выполнить сборку принудительно.
tr: Uyarı: İkili günlük seçeneği belirtildi, ancak çıktı güncel olduğu için derleme atlanacak. Derlemeyi zorlamak için ‘--no-cache’ belirtin.
zh_hans: 警告: 指定了二进制日志选项，但将跳过生成，因为输出是最新的。指定 ‘--no-cache’ 以强制生成。
zh_hant: 警告: 已指定二進位記錄選項，但將會略過建置，因為輸出為最新內容。請指定 '--no-cache' 以強制建置。

# NoBuildOptionDescription
source: Do not build the project before publishing. Implies --no-restore.
cs: Nesestavujte projekt, dokud ho nepublikujete. Implikuje možnost --no-restore.
de: Erstellt das Projekt nicht vor dem Veröffentlichen. Impliziert "--no-restore".
es: No compile el proyecto antes de publicarlo. Implica --no-restore.
fr: Ne pas générer le projet avant la publication. Implique --no-restore.
it: Non compila il progetto prima della pubblicazione. Implica --no-restore.
ja: 公開する前にプロジェクトをビルドしないでください。--no-restore を意味します。
ko: 게시하기 전에 프로젝트를 빌드하지 않습니다. 복원 없음을 의미합니다.
pl: Nie kompiluj tego projektu przed opublikowaniem. Powoduje przyjęcie, że podano parametr --no-restore.
pt_br: Não compile o projeto antes de publicar. Implica em --no-restore.
ru: Сборка проекта перед публикацией не выполняется. Подразумевает --no-restore.
tr: Yayımlamadan önce projeyi derlemeyin. --no-restore anlamına gelir.
zh_hans: 发布之前不要生成项目。Implies --no-restore.
zh_hant: 請勿在發佈之前建置專案。提示: -no-restore.

# NoDependenciesOptionDescription
source: Do not build project-to-project references and only build the specified project.
cs: Nesestaví odkazy mezi projekty a sestaví jen určený projekt.
de: Hiermit werden keine Projekt-zu-Projekt-Verweise erstellt, sondern nur das angegebene Projekt wird erstellt.
es: No compile referencias de proyecto a proyecto y compile solo el proyecto especificado.
fr: Ne générez pas les références de projet à projet, et générez uniquement le projet spécifié.
it: Non compila i riferimenti P2P (da progetto a progetto) e compila solo il progetto specificato.
ja: プロジェクト間参照をビルドせず、指定したプロジェクトだけをビルドします。
ko: p2p(프로젝트 간) 참조를 빌드하지 않고 지정한 프로젝트만 빌드합니다.
pl: Nie kompiluj odwołań między projektami i kompiluj tylko określony projekt.
pt_br: Não criar referências de projeto para projeto e criar somente o projeto especificado.
ru: Не выполнять сборку для ссылок между проектами и выполнить сборку только для указанного проекта.
tr: Projeden projeye başvuruları derlemez ve yalnızca belirtilen projeyi derler.
zh_hans: 请勿生成项目到项目引用，仅生成指定项目。
zh_hant: 請勿建置專案對專案的參考，而只建置指定的專案。

# NoHistoryFound
source: No workload history found
cs: Nenašla se žádná historie úlohy.
de: Kein Workloadverlauf gefunden
es: No se encontró ningún historial de cargas de trabajo
fr: Aucun historique de charge de travail trouvé
it: Non è stata trovata alcuna cronologia del carico di lavoro
ja: ワークロード履歴が見つかりません
ko: 워크로드 기록을 찾을 수 없음
pl: Nie znaleziono historii obciążenia
pt_br: Nenhum histórico de carga de trabalho encontrado
ru: Журнал рабочих нагрузок не найден
tr: İş yükü geçmişi bulunamadı
zh_hans: 找不到工作负载历史记录
zh_hant: 找不到工作負載歷程記錄

# NoIncrementalOptionDescription
source: Do not use incremental building.
cs: Nepoužije se přírůstkové sestavení.
de: Hiermit wird keine inkrementelle Erstellung durchgeführt.
es: No utilice la compilación incremental.
fr: N'utilisez pas de génération incrémentielle.
it: Non usa la compilazione incrementale.
ja: インクリメンタル ビルドを使用しません。
ko: 증분 빌드를 사용하지 않습니다.
pl: Nie używaj kompilowania przyrostowego.
pt_br: Não usar build incremental.
ru: Не использовать инкрементную сборку.
tr: Artımlı derleme kullanmaz.
zh_hans: 请勿使用增量生成。
zh_hant: 請勿使用累加建置。

# NoManifestFileContainPackageId
source: Cannot find a manifest file that contains package id '{0}'.
cs: Nedaří se najít soubor manifestu s ID balíčku {0}.
de: Eine Manifestdatei mit der Paket-ID "{0}" wurde nicht gefunden.
es: No se puede encontrar un archivo de manifiesto que contiene el id. de paquete "{0}".
fr: Fichier manifeste contenant l'ID de package « {0} » introuvable.
it: Non è possibile trovare un file manifesto che contiene l'ID pacchetto '{0}'.
ja: パッケージ ID '{0}' が含まれているマニフェスト ファイルが見つかりません。
ko: 패키지 ID '{0}'을(를) 포함하는 매니페스트 파일을 찾을 수 없습니다.
pl: Nie można odnaleźć pliku manifestu, który zawiera identyfikator pakietu „{0}”.
pt_br: Não é possível localizar um arquivo de manifesto que contém a ID de pacote '{0}'.
ru: Не удается найти файл манифеста, содержащий идентификатор пакета "{0}".
tr: '{0}' paket kimliğini içeren bildirim dosyası bulunamıyor.
zh_hans: 找不到包含包 ID {0} 的清单文件。
zh_hant: 找不到包含套件識別碼 '{0}' 的資訊清單檔案。

# NoProjectsOrSolutions
source: A project or solution file could not be found in {0}. Specify a project or solution file to use.
cs: {0} neobsahuje žádný soubor projektu nebo řešení. Zadejte soubor projektu nebo řešení, který chcete použít.
de: In "{0}" wurde keine Projekt- oder Projektmappendatei gefunden. Geben Sie eine Projekt- oder Projektmappendatei an, die Sie verwenden möchten.
es: No se encontró un archivo de proyecto o solución en {0}. Especifique un archivo de proyecto o solución para utilizar.
fr: Fichier projet ou solution introuvable dans {0}. Spécifiez un fichier projet ou solution à utiliser.
it: Non è stato possibile trovare un file di progetto o di soluzione in {0}. Specificare un file di progetto o di soluzione da usare.
ja: {0} でプロジェクトまたはソリューション ファイルが見つかりませんでした。使用するプロジェクトまたはソリューション ファイルを指定します。
ko: {0}에서 프로젝트 또는 솔루션 파일을 찾을 수 없습니다. 사용할 프로젝트 또는 솔루션 파일을 지정하세요.
pl: W lokalizacji {0} nie można odnaleźć pliku projektu lub rozwiązania. Podaj plik projektu lub rozwiązania do użycia.
pt_br: Um arquivo de projeto ou de solução não pôde ser encontrado em {0}. Especifique um arquivo de projeto ou de solução a ser usado.
ru: Не удалось найти файл проекта или решения в {0}. Укажите используемый файл проекта или решения.
tr: {0} içinde bir proje veya çözüm dosyası bulunamadı. Kullanmak için bir proje veya çözüm dosyası belirtin.
zh_hans: 在 {0} 中找不到项目或解决方案文件。指定要使用的项目或解决方案文件。
zh_hant: 在 {0} 中找不到專案或解決方案檔案。請指定要使用的專案或解決方案檔案。

# NoResult
source: Could not find any results.
cs: Nenašly se žádné výsledky.
de: Es wurden keine Ergebnisse gefunden.
es: No se encontró ningún resultado.
fr: Résultats introuvables.
it: Non è stato possibile trovare risultati.
ja: 結果が見つかりませんでした。
ko: 결과를 찾을 수 없습니다.
pl: Nie można znaleźć żadnych wyników.
pt_br: Não foi possível localizar nenhum resultado.
ru: Ничего не найдено.
tr: Sonuç bulunamadı.
zh_hans: 找不到任何结果。
zh_hant: 找不到任何結果。

# NoSerializerRegisteredWithIdErrorMessage
source: No serializer registered with ID '{0}'
cs: Není zaregistrovaný žádný serializátor s ID {0}.
de: Es ist kein Serialisierungsmodul mit der ID "{0}" registriert
es: No hay ningún serializador registrado con el id. '{0}'
fr: Aucun sérialiseur inscrit avec l’ID « {0} »
it: Nessun serializzatore registrato con ID '{0}'
ja: ID '{0}' で登録されたシリアライザーがありません
ko: ID '{0}'(으)로 등록된 직렬 변환기가 없습니다.
pl: Nie zarejestrowano serializatora z identyfikatorem „{0}”
pt_br: Nenhum serializador registrado com a ID '{0}'
ru: Не зарегистрирован сериализатор с ИД "{0}"
tr: '{0}' kimliğiyle kayıtlı seri hale getirici yok
zh_hans: 没有使用 ID“{0}”注册序列化程序
zh_hant: 沒有使用識別碼 '{0}' 註冊的序列化程式

# NoSerializerRegisteredWithTypeErrorMessage
source: No serializer registered with type '{0}'
cs: Není zaregistrovaný žádný serializátor s typem {0}.
de: Es ist kein Serialisierungsmodul mit dem Typ "{0}" registriert
es: No hay ningún serializador registrado con el tipo '{0}'
fr: Aucun sérialiseur inscrit avec le type « {0} »
it: Nessun serializzatore registrato con tipo '{0}'
ja: 型 '{0}' で登録されたシリアライザーがありません
ko: '{0}' 형식으로 등록된 직렬 변환기가 없습니다.
pl: Nie zarejestrowano serializatora z typem „{0}”
pt_br: Nenhum serializador registrado com o tipo '{0}'
ru: Не зарегистрирован сериализатор с типом "{0}"
tr: '{0}' türüyle kayıtlı seri hale getirici yok
zh_hans: 没有使用类型“{0}”注册序列化程序
zh_hant: 沒有使用類型 '{0}' 註冊的序列化程式

# NoServersToShutdown
source: No build servers are running.
cs: Nejsou spuštěné žádné buildovací servery.
de: Es werden zurzeit keine Buildserver ausgeführt.
es: No se está ejecutando ningún servidor de compilación.
fr: Aucun serveur de builds n'est en cours d'exécution.
it: Non ci sono server di compilazione in esecuzione.
ja: 実行中のビルド サーバーはありません。
ko: 빌드 서버가 실행되지 않습니다.
pl: Nie są uruchomione żadne serwery kompilacji.
pt_br: Não há nenhum servidor de build em execução.
ru: Нет запущенных серверов сборки.
tr: Hiçbir derleme sunucusu çalışmıyor.
zh_hans: 未运行生成服务器。
zh_hant: 未執行任何組建伺服器。

source: No tools were restored.
cs: Neobnovily se žádné nástroje.
de: Es wurden keine Tools wiederhergestellt.
es: No se restauró ninguna herramienta.
fr: Aucun outil n'a été restauré.
it: Non è stato ripristinato alcuno strumento.
ja: 復元されたツールはありません。
ko: 복원된 도구가 없습니다.
pl: Nie przywrócono żadnych narzędzi.
pt_br: Nenhuma ferramenta foi restaurada.
ru: Не были восстановлены никакие средства.
tr: Hiçbir araç geri yüklenmedi.
zh_hans: 未还原任何工具。
zh_hant: 未還原任何工具。

# NoTrustWithParentPID
source: Failed to establish a trust relationship with parent process ({0}).
cs: Nepovedlo se navázat vztah důvěryhodnosti s nadřazeným procesem ({0}).
de: Fehler beim Einrichten einer Vertrauensbeziehung mit dem übergeordneten Prozess ({0}).
es: No se ha podido establecer una relación de confianza con el proceso primario ({0}).
fr: Impossible d’établir une relation de confiance avec le processus parent ({0}).
it: Impossibile stabilire una relazione di attendibilità con il processo padre ({0}).
ja: 親プロセス ({0}) との信頼関係を確立できませんでした。
ko: 부모 프로세스({0})와 신뢰 관계를 설정하지 못했습니다.
pl: Nie można ustanowić relacji zaufania z procesem nadrzędnym ({0}).
pt_br: Falha ao estabelecer uma relação de confiança com o processo pai ({0}).
ru: Не удалось установить отношение доверия с родительским процессом ({0}).
tr: Üst işlemle ({0}) bir güven ilişkisi kurulamadı.
zh_hans: 未能建立与父进程({0})之间的信任关系。
zh_hant: 無法與父處理序 ({0}) 建立信任關係。
