Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PrintSetVersionsDescription
source: 'dotnet workload search version' has three functions depending on its argument: 1. If no argument is specified, it outputs a list of the latest released workload versions from this feature band. Takes the --take option to specify how many to provide and --format to alter the format. Example: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. If a workload version is provided as an argument, it outputs a table of various workloads and their versions for the specified workload version. Takes the --format option to alter the output format. Example: dotnet workload search version 9.0.201 Workload manifest ID Manifest feature band Manifest Version ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. If one or more workloads are provided along with their versions (by joining them with the '@' character), it outputs workload versions that match the provided versions. Takes the --take option to specify how many to provide and --format to alter the format. Example: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
cs: dotnet workload search version má tři funkce v závislosti na argumentu: 1. Pokud není zadán žádný argument, vypíše seznam nejnovějších vydaných verzí úloh z tohoto pásma funkcí. Pomocí parametru --take určíte, kolik jich má být poskytnuto, a pomocí parametru --format změníte formát. Příklad: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Pokud je jako argument zadána verze úlohy, je výstupem tabulka různých úloh a jejich verzí pro zadanou verzi úlohy. Provede změnu výstupního formátu pomocí parametru --format. Příklad: dotnet workload search version 9.0.201 ID manifestu úlohy Pásmo funkcí manifestu Verze manifestu ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Pokud jsou zadány úlohy spolu s jejich verzemi (spojených znakem @), budou výstupem verze úloh, které odpovídají zadaným verzím. Pomocí parametru --take určíte, kolik jich má být poskytnuto, a pomocí parametru --format změníte formát. Příklad: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
de: „dotnet workload search version“ hat je nach Argument drei Funktionen: 1. Wird kein Argument angegeben, dann wird eine Liste der zuletzt veröffentlichten Workloadversionen aus diesem Featureband ausgegeben. Akzeptiert die Option „--take“, um anzugeben, wie viele angegeben werden sollen, und „--format“, um das Format zu ändern. Beispiel: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Wenn eine Workloadversion als Argument angegeben wird, dann werden eine Tabelle mit verschiedenen Workloads und deren Versionen für die angegebene Workloadversion ausgegeben. Akzeptiert die Option „--format“, um das Ausgabeformat zu ändern. Beispiel: dotnet workload search version 9.0.201 Workloadmanifest-ID Manifest-Featureband Manifestversion ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Wenn eine oder mehrere Workloads zusammen mit ihren Versionen bereitgestellt werden (indem sie mit dem @-Zeichen verbunden werden), werden die Workloadversionen, die mit den angegebenen Versionen übereinstimmen, ausgegebenen. Akzeptiert die Option „--take“, um anzugeben, wie viele angegeben werden sollen, und „--format“, um das Format zu ändern. Beispiel: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
es: "dotnet workload search version" tiene tres funciones en función de su argumento: 1. Si no se especifica ningún argumento, genera una lista de las últimas versiones de carga de trabajo publicadas de esta banda de características. Toma la opción --take para especificar cuántos proporcionar y --format para modificar el formato. Ejemplo: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Si se proporciona una versión de carga de trabajo como argumento, genera una tabla de varias cargas de trabajo y sus versiones para la versión de carga de trabajo especificada. Toma la opción --format para modificar el formato de salida. Ejemplo: dotnet workload search version 9.0.201 Id. del manifiesto de carga de trabajo Banda de características del manifiesto Versión del manifiesto ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Si se proporcionan una o más cargas de trabajo junto con sus versiones (uniéndolas con el carácter "@"), se obtienen las versiones de las cargas de trabajo que coinciden con las versiones proporcionadas. Toma la opción --take para especificar cuántos proporcionar y --format para modificar el formato. Ejemplo: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
fr: « dotnet workload search version » a trois fonctions en fonction de son argument : 1. Si aucun argument n’est spécifié, il génère une liste des dernières versions de charge de travail publiées à partir de cette bande de fonctionnalités. Prend l’option --take pour spécifier le nombre à fournir et --format pour modifier le format. Exemple : dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Si une version de charge de travail est fournie en tant qu’argument, elle génère une table de différentes charges de travail et de leurs versions pour la version de charge de travail spécifiée. Prend l’option --format pour modifier le format de sortie. Exemple : dotnet workload search version 9.0.201 ID du manifeste de la charge de travail Manifeste de la bande de caractéristiques Version du manifeste ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Si une ou plusieurs charges de travail sont fournies avec leurs versions (en les joignant avec le caractère « @ »), elle génère des versions de charge de travail qui correspondent aux versions fournies. Prend l’option --take pour spécifier le nombre à fournir et --format pour modifier le format. Exemple : dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
it: 'dotnet workload search version' ha tre funzioni a seconda dal relativo argomento: 1. Se non viene specificato alcun argomento, restituisce un elenco delle versioni di carico di lavoro più recenti rilasciate da questa banda di funzionalità. Accetta l'opzione --take per specificare quanti fornirne e --format per modificare il formato. Esempio: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Se viene fornita una versione di carico di lavoro come argomento, restituisce una tabella di vari carichi di lavoro e le relative versioni per la versione di carico di lavoro specificata. Accetta l'opzione --format per modificare il formato di output. Esempio: dotnet workload search version 9.0.201 ID manifesto carico di lavoro Banda funzionalità manifesto Versione manifesto ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Se vengono forniti uno o più carichi di lavoro insieme alle relative versioni (unendoli con il carattere '@'), restituisce le versioni di carico di lavoro che corrispondono alle versioni fornite. Accetta l'opzione --take per specificare quanti fornirne e --format per modificare il formato. Esempio: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
ja: 'dotnet workload search version' には、引数に応じて次の 3 つの機能があります。 1. 引数が指定されていない場合は、この機能バンドからリリースされた最新のワークロード バージョンの一覧が出力されます。--take オプションを指定して提供する数を指定し、--format を指定して形式を変更します。 例: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. 引数としてワークロード バージョンを指定すると、指定されたワークロード バージョンのさまざまなワークロードとそのバージョンの表が出力されます。--format オプションを指定して出力形式を変更します。 例: dotnet workload search version 9.0.201 ワークロード マニフェスト ID マニフェスト機能バンド マニフェスト バージョン ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. 1 つ以上のワークロードをバージョンと共に ('@' 文字で結合して) 指定すると、指定されたバージョンに一致するワークロード バージョンが出力されます。--take オプションを指定して提供する数を指定し、--format を指定して形式を変更します。 例: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
ko: 'dotnet workload search version'에는 인수에 따라 세 가지 기능이 있습니다. 1. 인수를 지정하지 않으면 이 기능 밴드에서 릴리스된 최신 워크로드 버전 목록을 출력합니다. --take 옵션을 사용하여 얼마나 제공할지 지정하고 --format을 사용하여 형식을 변경합니다. 예: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. 특정 워크로드 버전이 인수로 제공되는 경우 지정된 워크로드 버전에 대한 다양한 워크로드 및 해당 버전의 테이블을 출력합니다. --format 옵션을 사용하여 출력 형식을 변경합니다. 예: dotnet workload search version 9.0.201 워크로드 매니페스트 ID 매니페스트 기능 밴드 매니페스트 버전 ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. 하나 이상의 워크로드가 해당 버전과 함께 제공되는 경우('@' 문자와 조인하여) 제공된 버전과 일치하는 워크로드 버전을 출력합니다. --take 옵션을 사용하여 얼마나 제공할지 지정하고 --format을 사용하여 형식을 변경합니다. 예: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
pl: Polecenie „dotnet workload search version” ma trzy funkcje w zależności od argumentu: 1. Jeśli nie zostanie określony żaden argument, wyświetla listę najnowszych wydanych wersji obciążenia z tego pasma funkcji. Przyjmuje opcję --take, aby określić, ile elementów należy podać, i polecenie --format, aby zmienić format. Przykład: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Jeśli wersja obciążenia jest podana jako argument, generuje tabelę różnych obciążeń i ich wersje dla określonej wersji obciążenia. Przyjmuje opcję --format, aby zmienić format danych wyjściowych. Przykład: dotnet workload search version 9.0.201 Identyfikator manifestu obciążenia Pasmo funkcji manifestu Wersja manifestu ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Jeśli co najmniej jedno obciążenie jest podane wraz z jego wersją (przez połączenie jej za pomocą znaku „@”), generuje wersje obciążeń zgodne z podanymi wersjami. Przyjmuje opcję --take, aby określić, ile elementów należy podać, i polecenie --format, aby zmienić format. Przykład: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
pt_br: 'dotnet workload search version' tem três funções dependendo de seu argumento: 1. Se nenhum argumento for especificado, ele exibe uma lista das versões mais recentes das cargas de trabalho lançadas para esta faixa de recursos. Aceita a opção --take para especificar quantos fornecer e --format para alterar o formato. Exemplo: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Se uma versão de carga de trabalho for fornecida como argumento, ele exibe uma tabela com diversos cargas de trabalho e suas versões para a versão de carga de trabalho especificada. Aceita a opção --format para alterar o formato de saída. Exemplo: dotnet workload search version 9.0.201 ID do manifesto de carga de trabalho Faixa de recursos do manifesto Versão do manifesto ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Se um ou mais cargas de trabalho forem fornecidos juntamente com suas versões (unidos pelo caractere '@'), ele exibe as versões de cargas de trabalho que correspondem às versões fornecidas. Aceita a opção --take para especificar quantos fornecer e --format para alterar o formato. Exemplo: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
ru: "dotnet workload search version" имеет три функции в зависимости от переданного аргумента: 1. Если аргумент не указан, команда выводит список последних выпущенных версий рабочих нагрузок из данного диапазона функций. Принимает параметр --take для указания нужного количества и --format для изменения формата. Пример: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Если в качестве аргумента указана версия рабочей нагрузки, команда выводит таблицу различных рабочих нагрузок и их версий для указанной версии рабочей нагрузки. Может принимать параметр --format для изменения формата выхода. Пример: dotnet workload search version 9.0.201 ИД манифеста рабочей нагрузки Диапазон функций манифеста Версия манифеста ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Если одна или несколько рабочих нагрузок указаны вместе с версиями (разделенные символом "@"), команда выводит версии рабочих нагрузок, соответствующие указанным версиям. Принимает параметр --take для указания нужного количества и --format для изменения формата. Пример: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
tr: 'dotnet workload search version', şu bağımsız değişkene bağlı olarak üç işleve sahiptir: 1. Eğer bağımsız değişken belirtilmezse, bu özellik bandındaki en son yayınlanan iş yükü sürümlerinin bir listesini döndürür. Sağlanacak sayıyı belirtmek için --take seçeneğini, biçimi değiştirmek için ise --format seçeneğini alır. Örnek: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. Bağımsız değişken olarak bir iş yükü sürümü verilirse, belirtilen iş yükü sürümü için çeşitli iş yüklerinin ve sürümlerinin bir tablosunu çıkarır. Çıktı biçimini değiştirmek için --format seçeneğini alır. Örnek: dotnet workload search version 9.0.201 İş yükü bildirimi kimliği Bildirim özellik bandı Bildirim Sürümü ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. Eğer bir veya daha fazla iş yükü ve bunların sürümleri ('@' karakteri ile birleştirilerek) sağlanırsa, sağlanan sürümlerle eşleşen iş yükü sürümlerini döndürür. Sağlanacak sayıyı belirtmek için --take seçeneğini, biçimi değiştirmek için ise --format seçeneğini alır. Örnek: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
zh_hans: ‘dotnet workload search version’ 包含三个函数，具体取决于其参数: 1. 如果未指定参数，它将输出此功能区段中最新发布的工作负载版本的列表。使用 --take 选项指定要提供的数量，使用 --format 来更改格式。 示例: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. 如果将工作负载版本作为参数提供，则会输出指定工作负载版本的各种工作负载及其版本的表。使用 --format 选项更改输出格式。 示例: dotnet workload search version 9.0.201 工作负载清单 ID 清单功能区段 清单版本 ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. 如果提供了一个或多个工作负载及其版本(通过使用 ‘@’ 字符联接它们)，则会输出与提供的版本匹配的工作负载版本。使用 --take 选项指定要提供的数量，使用 --format 来更改格式。 示例: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
zh_hant: 根據其引數，'dotnet workload search version' 有三個函式: 1. 如果未指定引數，它會從此功能帶輸出最新發行工作負載版本的清單。使用 --take 選項來指定要提供多少個，以及使用 --format 來變更格式。 範例: dotnet workload search version --take 2 --format json [{"workloadVersion":"9.0.201"},{"workloadVersion":"9.0.200.1"}] 2. 如果提供工作負載版本做為引數，它會針對指定的工作負載版本輸出各種工作負載及其版本的表格。使用 --format 選項來變更輸出格式。 範例: dotnet workload search version 9.0.201 工作負載資訊清單識別碼 資訊清單功能帶 資訊清單版本 ------------------------------------------------------------------------------------------------ microsoft.net.workload.emscripten.current 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net6 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net7 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.workload.emscripten.net8 9.0.100-rc.1 9.0.0-rc.1.24430.3 microsoft.net.sdk.android 9.0.100-rc.1 35.0.0-rc.1.80 microsoft.net.sdk.ios 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.maccatalyst 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.sdk.macos 9.0.100-rc.1 14.5.9270-net9-rc1 microsoft.net.sdk.maui 9.0.100-rc.1 9.0.0-rc.1.24453.9 microsoft.net.sdk.tvos 9.0.100-rc.1 17.5.9270-net9-rc1 microsoft.net.workload.mono.toolchain.current 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net6 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net7 9.0.100-rc.1 9.0.0-rc.1.24431.7 microsoft.net.workload.mono.toolchain.net8 9.0.100-rc.1 9.0.0-rc.1.24431.7 3. 如果提供一或多個工作負載及其版本 (使用 '@' 字元聯結它們)，它會輸出符合所提供版本的工作負載版本。使用 --take 選項來指定要提供多少個，以及使用 --format 來變更格式。 範例: dotnet workload search version maui@9.0.0-rc.1.24453.9 ios@17.5.9270-net9-rc1 9.0.201
