Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RollbackDefinitionContainsExtraneousManifestIds
source: Invalid rollback definition. The manifest IDs in rollback definition {0} do not match installed manifest IDs {1}.
cs: Neplatná definice vrácení zpět. ID manifestu v definici vrácení zpět {0} neodpovídají nainstalovaným ID manifestu {1}.
de: Ungültige Rollbackdefinition. Die Manifest-IDs in der Rollbackdefinition {0} stimmen nicht mit den installierten Manifest-IDs {1} überein.
es: Definición de reversión no válida. Los id. de manifiesto de la definición de reversión {0} no coinciden con los id. de manifiesto instalados {1}.
fr: Définition de restauration non valide. Les ID de manifeste dans la définition de restauration {0} ne correspondent pas aux ID de manifeste installés {1}.
it: Definizione di ripristino dello stato precedente non valida. Gli ID manifesto nella definizione di ripristino dello stato precedente {0} non corrispondono agli ID manifesto installati {1}.
ja: 無効なロールバック定義。ロールバック定義 {0} のマニフェスト ID が、インストール済みのマニフェスト ID {1} と一致しません。
ko: 롤백 정의가 잘못되었습니다. 롤백 정의 {0}의 매니페스트 ID {1}와(과) 일치하지 않습니다.
pl: Nieprawidłowa definicja wycofania. Identyfikatory manifestów w definicji wycofania {0} nie są zgodne z zainstalowanymi identyfikatorami manifestów {1}.
pt_br: Definição de reversão inválida. Os IDs de manifesto na definição de reversão {0} não correspondem aos IDs de manifesto instalados {1}.
ru: Недопустимое определение отката. Идентификаторы манифеста в определении отката {0} не совпадают с установленными идентификаторами манифеста {1}.
tr: Geri alma tanımı geçersiz. {0} geri alma tanımındaki bildirim kimlikleri yüklü bildirim kimlikleriyle ({1}) eşleşmiyor.
zh_hans: 无效的回滚定义。回滚定义 {0} 中的清单 ID 与安装的清单 ID {1} 不匹配。
zh_hant: 無效的復原定義。復原定義 {0} 中的資訊清單識別碼不符合已安裝的資訊清單識別碼 {1}。

# RollbackDefinitionFileDoesNotExist
source: Provided rollback definition file {0} doesn't exist.
cs: Zadaný soubor definice vrácení zpět {0} neexistuje.
de: Die bereitgestellte Rollbackdefinitionsdatei {0} ist nicht vorhanden.
es: El archivo de definición de reversión proporcionado {0}no existe.
fr: Le {0} du fichier de définition de restauration fourni n’existe pas.
it: Il file di definizione di ripristino dello stato precedente specificato {0} non esiste.
ja: 指定されたロールバック定義ファイル {0} が存在しません。
ko: 제공된 롤백 정의 파일 {0}이(가) 없습니다.
pl: Podany plik definicji wycofywania {0} nie istnieje.
pt_br: O arquivo de definição de reversão {0} fornecido não existe.
ru: Указанный файл определения отката {0} не существует.
tr: Sağlanan geri alma tanımı dosyası ({0}) yok.
zh_hans: 提供的回滚定义文件 {0} 不存在。
zh_hant: 提供的復原定義檔案 {0} 不存在。

# RollingBackPackInstall
source: Rolling back pack {0} installation...
cs: Vrací se zpět instalace balíčku {0}…
de: Für die Installation von {0} wird ein Rollback ausgeführt...
es: Revirtiendo el paquete {0} de la instalación...
fr: Annulation de l'installation {0}...
it: Rollback dell'installazione del pacchetto {0} in corso...
ja: パック {0} のインストールをロールバックしています...
ko: 팩 {0} 설치를 롤백 중...
pl: Trwa wycofywanie instalacji paczki {0}.
pt_br: Revertendo o pacote {0} instalação...
ru: Откат установки пакета {0}...
tr: {0} paketi için yükleme geri alınıyor...
zh_hans: 正在回滚包 {0} 的安装...
zh_hant: 正在回復套件 {0} 安裝...

# RunAppFullName
source: .NET Run Command
cs: Příkaz rozhraní .NET pro spuštění
de: .NET-Befehl "Run"
es: Ejecutar comando de .NET
fr: Commande d'exécution .NET
it: Comando esecuzione .NET
ja: .NET Run コマンド
ko: .NET 실행 명령
pl: Uruchamianie polecenia platformy .NET
pt_br: Comando Run do .NET
ru: Команда .NET Run
tr: .NET Run Komutu
zh_hans: .NET 运行命令
zh_hant: .NET 執行命令

# RunCommandBuilding
source: Building...
cs: Sestavování...
de: Buildvorgang wird ausgeführt...
es: Compilando...
fr: Génération...
it: Compilazione...
ja: ビルドしています...
ko: 빌드하는 중...
pl: Trwa kompilowanie...
pt_br: Compilando...
ru: Сборка…
tr: Derleniyor...
zh_hans: 正在生成...
zh_hant: 正在建置...

# RunCommandEvaluationExceptionBuildFailed
source: Running the {0} target to discover run commands failed for this project. Fix the errors and warnings and run again.
cs: Spuštění cíle {0} ke zjištění příkazů spuštění pro tento projekt se nezdařilo. Opravte chyby a upozornění a spusťte je znovu.
de: Das {0} Ziel ausführen, um zu ermitteln, dass ein Fehler bei den Ausführungsbefehlen für dieses Projekt aufgetreten ist. Beheben Sie die Fehler und Warnungen, und führen Sie dies erneut aus.
es: Error al ejecutar el destino {0} para detectar comandos de ejecución para este proyecto. Corrija los errores y advertencias y vuelva a ejecutarlo.
fr: L’exécution de la {0} cible pour découvrir les commandes d’exécution a échoué pour ce projet. Corrigez les erreurs et les avertissements, puis réexécutez.
it: L'esecuzione della destinazione {0} per individuare i comandi di esecuzione non è riuscita per questo progetto. Correggere gli errori e gli avvisi ed eseguire di nuovo.
ja: このプロジェクトで実行コマンドを検出するための {0} ターゲットの実行に失敗しました。エラーと警告を修正して、もう一度実行してください。
ko: 이 프로젝트에 대해 실행 명령을 검색하기 위해 {0} 대상을 실행하지 못했습니다. 오류 및 경고를 수정하고 다시 실행합니다.
pl: Uruchomienie obiektu docelowego {0} w celu odnalezienia poleceń przebiegu dla tego projektu nie powiodło się. Usuń błędy i ostrzeżenia, a następnie uruchom ponownie.
pt_br: Falha na execução do destino {0} para descobrir comandos de execução para este projeto. Corrija os erros e avisos e execute novamente.
ru: Не удалось запустить цель {0} для обнаружения команд выполнения для этого проекта. Исправьте ошибки и предупреждения и повторите попытку.
tr: Çalıştırma komutlarını bulmak için {0} hedefini çalıştırma bu proje için başarısız oldu. Hataları ve uyarıları düzeltip yeniden çalıştırın.
zh_hans: 为此项目运行 {0} 目标以发现运行命令失败。请修复错误和警告，然后再次运行。
zh_hant: 執行 {0} 目標以探索對此專案的執行命令失敗。修正錯誤和警告，然後重新執行。

# RunCommandException
source: The build failed. Fix the build errors and run again.
cs: Sestavení se nepovedlo. Opravte v sestavení chyby a spusťte ho znovu.
de: Fehler beim Buildvorgang. Beheben Sie die Buildfehler, und versuchen Sie es anschließend noch mal.
es: No se pudo llevar a cabo la compilación. Corrija los errores de compilación y vuelva a ejecutar el proyecto.
fr: La build a échoué. Corrigez les erreurs de la build et réexécutez-la.
it: La compilazione non è riuscita. Correggere gli errori di compilazione e ripetere l'esecuzione.
ja: ビルドに失敗しました。ビルド エラーを修正して、もう一度実行してください。
ko: 빌드하지 못했습니다. 빌드 오류를 수정하고 다시 실행하세요.
pl: Kompilacja nie powiodła się. Napraw błędy kompilacji i uruchom ją ponownie.
pt_br: Ocorreu uma falha no build. Corrija os erros de build e execute novamente.
ru: Ошибка сборки. Устраните ошибки сборки и повторите попытку.
tr: Derleme başarısız oldu. Derleme hatalarını düzeltip yeniden çalıştırın.
zh_hans: 生成失败。请修复生成错误并重新运行。
zh_hant: 建置失敗。請修正建置錯誤後，再執行一次。

# RunCommandExceptionCouldNotApplyLaunchSettings
source: The launch profile "{0}" could not be applied. {1}
cs: Profil spuštění {0} se nedá použít. {1}
de: Das Startprofil "{0}" konnte nicht angewendet werden. {1}
es: No se ha podido aplicar el perfil de inicio "{0}". {1}
fr: Impossible d'appliquer le profil de lancement "{0}". {1}
it: Non è stato possibile applicare il profilo di avvio "{0}". {1}
ja: 起動プロファイル "{0}" を適用できませんでした。 {1}
ko: 시작 프로필 "{0}"을(를) 적용할 수 없습니다. {1}
pl: Nie można zastosować profilu uruchamiania „{0}”. {1}
pt_br: O perfil de inicialização "{0}" não pôde ser aplicado. {1}
ru: Не удалось применить профиль запуска "{0}". {1}
tr: "{0}" başlatma profili uygulanamadı. {1}
zh_hans: 无法应用启动配置文件“{0}”。 {1}
zh_hant: 無法套用啟動設定檔 "{0}"。 {1}

# RunCommandExceptionCouldNotLocateALaunchSettingsFile
source: Cannot use launch profile '{0}' because the launch settings file could not be located. Locations tried: {1}
cs: Nelze použít profil spouštění {0}, protože soubor nastavení spouštění nebyl nalezen. Vyzkoušená umístění: {1}
de: Das Startprofil „{0}“ kann nicht verwendet werden, da die Datei mit den Starteinstellungen nicht gefunden wurde. Versuchte Standorte: {1}
es: No se puede usar el perfil de inicio '{0}' porque no se pudo localizar el archivo de configuración de inicio. Ubicaciones probadas: {1}
fr: Impossible d’utiliser le profil de lancement « {0} », car le fichier de paramètres de lancement est introuvable. Emplacements essayés : {1}
it: Non è possibile usare il profilo di avvio "{0}" perché il file delle impostazioni di avvio non è stato trovato. Posizioni tentate: {1}
ja: 起動設定ファイルが見つからないため、起動プロファイル '{0}' を使用できません。試行された場所: {1}
ko: 시작 설정 파일을 찾을 수 없으므로 시작 프로필 '{0}'을(를) 사용할 수 없습니다. 시도한 위치: {1}
pl: Nie można użyć profilu uruchamiania „{0}”, ponieważ nie można zlokalizować pliku ustawień uruchamiania. Wypróbowane lokalizacje: {1}
pt_br: Não é possível usar o perfil de inicialização '{0}' porque o arquivo de configurações de inicialização não pôde ser localizado. Localizações tentadas: {1}
ru: Не удается использовать профиль запуска "{0}", так как не удалось найти файл параметров запуска. Попробованные расположения: {1}
tr: Başlatma ayarları dosyası bulunamadığı için ‘{0}’ başlatma profilini kullanılamıyor. Denenen konumlar: {1}
zh_hans: 无法使用启动配置文件 ‘{0}’，因为找不到启动设置文件。已尝试的位置: {1}
zh_hant: 無法使用啟動設定檔 '{0}'，因為找不到啟動設定檔檔案。嘗試的位置: {1}

# RunCommandExceptionMultipleProjects
source: Specify which project file to use because {0} contains more than one project file.
cs: Určete, který soubor projektu se má použít, protože {0} obsahuje více než jeden soubor projektu.
de: Geben Sie die zu verwendende Projektdatei an, da {0} mehrere Projektdateien enthält.
es: {0} contiene más de un archivo de proyecto. Especifique cuál desea usar.
fr: Spécifiez le fichier projet à utiliser, car {0} contient plusieurs fichiers projet.
it: Specificare il file di progetto da usare perché l'elemento {0} contiene più file di progetto.
ja: {0} に複数のプロジェクト ファイルが含まれているため、使用するプロジェクト ファイルを指定してください。
ko: {0}에 둘 이상의 프로젝트 파일이 포함되어 있으므로 사용할 프로젝트 파일을 지정하세요.
pl: Określ, który plik projektu ma zostać użyty, ponieważ element {0} zawiera więcej niż jeden plik projektu.
pt_br: Especifique que arquivo de projeto usar, pois {0} contém mais de um arquivo de projeto.
ru: Укажите используемый файл проекта, так как {0} содержит несколько таких файлов.
tr: {0} birden fazla proje dosyası içerdiğinden, kullanılacak proje dosyasını belirtin.
zh_hans: 执行要使用的项目文件，因为 {0} 包含多个项目文件。
zh_hant: 因為 {0} 包含多個專案檔，所以請指定要使用的專案檔。

# RunCommandExceptionNoProjects
source: Couldn't find a project to run. Ensure a project exists in {0}, or pass the path to the project using {1}.
cs: Projekt, který se má spustit, se nenašel. Ověřte, že projekt existuje v {0}, nebo pomocí parametru {1} předejte cestu k projektu.
de: Es wurde kein ausführbares Projekt gefunden. Vergewissern Sie sich, dass unter {0} ein Projekt vorhanden ist, oder übergeben Sie den Pfad zum Projekt mithilfe von {1}.
es: No se ha podido encontrar un proyecto para ejecutar. Asegúrese de que exista uno en {0} o pase la ruta de acceso al proyecto mediante {1}.
fr: Il n'existe aucun projet à exécuter. Vérifiez qu'il existe un projet dans {0} ou passez le chemin au projet via {1}.
it: Non è stato trovato alcun progetto da eseguire. Assicurarsi che sia presente un progetto in {0} oppure passare il percorso al progetto con {1}.
ja: 実行するプロジェクトが見つかりませんでした。プロジェクトが {0} に存在することを確認するか、{1} を使用してパスをプロジェクトに渡してください。
ko: 실행할 프로젝트를 찾을 수 없습니다. 프로젝트가 {0}에 존재하는지 확인하거나 {1}을(를) 사용하여 프로젝트에 경로를 전달하세요.
pl: Nie można odnaleźć projektu do uruchomienia. Upewnij się, że projekt istnieje w lokalizacji {0}, przekaż ścieżkę do projektu przy użyciu elementu {1}.
pt_br: Não foi possível localizar um projeto para executar. Verifique se existe um projeto em {0} ou passe o caminho para o projeto usando {1}.
ru: Не удалось найти выполняемый проект. Убедитесь в том, что проект существует в {0}, или передайте путь к проекту с помощью {1}.
tr: Çalıştırılacak bir proje bulunamadı. {0} içinde bir projenin bulunduğundan emin olun veya {1} kullanarak yolu projeye geçirin.
zh_hans: 找不到要运行的项目。请确保 {0} 中存在项目，或使用 {1} 传递项目路径。
zh_hant: 找不到要執行的專案。請確認專案存在於 {0} 中，或使用 {1} 將該路徑傳送至專案。

# RunCommandExceptionUnableToRun
source: Unable to proceed with project '{0}'. Ensure you have a runnable project type. A runnable project should target a runnable TFM (for instance, net{1}) and have OutputType 'Exe'. The current OutputType is '{2}'.
cs: Projekt se nedá spustit. Ověřte prosím, že máte spustitelný typ projektu, a zajistěte, aby tento projekt podporoval {0}. Cílem spustitelného projektu by mělo být TFM (například net5.0) a jeho OutputType by měl být Exe. Aktuální {1} je {2}.
de: Ihr Projekt kann nicht ausgeführt werden. Stellen Sie sicher, dass der Projekttyp ausführbar ist und "{0}" dieses Projekt unterstützt. Ein ausführbares Projekt muss ein ausführbares TFM (z. B. net5.0) und den OutputType "Exe" verwenden. {1} lautet aktuell "{2}".
es: No se puede ejecutar el proyecto. Asegúrese de tener un tipo de proyecto ejecutable y asegúrese de que "{0}" admita este proyecto. Un proyecto ejecutable debe tener como destino un TFM ejecutable (por ejemplo, net5.0) y tener como OutputType "Exe". El valor actual de {1} es "{2}".
fr: Impossible d'exécuter votre projet. Vérifiez que vous avez un type de projet exécutable et que '{0}' prend en charge ce projet. Un projet exécutable doit cibler un TFM exécutable (par exemple, net5.0) et avoir OutputType 'Exe'. Le {1} actuel est '{2}'.
it: Non è possibile eseguire il progetto. Assicurarsi che sia presente un tipo di progetto eseguibile e che '{0}' supporti tale progetto. Un progetto eseguibile deve essere destinato a un TFM eseguibile, ad esempio net5.0, inoltre OutputType deve essere impostato su 'Exe'. Il valore corrente di {1} è '{2}'.
ja: プロジェクトを実行できません。 プロジェクト タイプが実行可能であること、このプロジェクトが '{0}' でサポートされていることを確認してください。 実行可能なプロジェクトは実行可能な TFM (たとえば、net5.0) を対象としている必要があり、OutputType 'Exe' が必要です。 現在の {1} は '{2}' です。
ko: 프로젝트를 실행할 수 없습니다. 실행 가능한 프로젝트 형식이 있고 '{0}'에서 이 프로젝트를 지원하는지 확인하세요. 실행 가능한 프로젝트는 실행 가능한 TFM(예: net5.0)을 대상으로 하고 OutputType 'Exe'가 있어야 합니다. 현재 {1}은(는) '{2}'입니다.
pl: Nie można uruchomić projektu. Upewnij się, że używany typ projektu umożliwia uruchamianie oraz że element „{0}” obsługuje ten projekt. Projekt z możliwością uruchamiania musi mieć moniker TFM z możliwością uruchomienia (np. net5.0) i typ OutputType „Exe”. Bieżący element {1}: „{2}”.
pt_br: Não é possível executar o projeto. Verifique se você tem um tipo de projeto executável e se '{0}' dá suporte a esse projeto. Um projeto executável deve ter como destino um TFM executável (por exemplo, o net5.0) e ter o OutputType 'Exe'. O {1} atual é '{2}'.
ru: Не удалось запустить проект. Убедитесь, что тип проекта поддерживает запуск и что "{0}" поддерживает этот проект. Запускаемый проект должен быть предназначен для TFM с поддержкой запуска (например, net5.0) и иметь тип выходных данных "EXE". Текущий {1} — "{2}".
tr: Projeniz çalıştırılamıyor. Çalıştırılabilir bir proje türüne sahip olduğunuzdan ve bu projenin '{0}' tarafından desteklendiğinden emin olun. Çalıştırılabilir proje, çalıştırılabilir bir TFM’yi (örneğin, net5.0) hedeflemeli ve OutputType değeri 'Exe' olmalıdır. Geçerli {1}: '{2}'.
zh_hans: 无法运行项目。 请确保你具有可运行的项目类型且“{0}”支持此项目。 可运行的项目应面向可运行的 TFM (例如 net5.0)且其 OutputType 为 "Exe"。 当前的 {1} 为“{2}”。
zh_hant: 無法執行您的專案。 請確定您有可執行的專案類型，並確定 '{0}' 支援此專案。 可執行的專案應以可執行的 TFM (例如 net5.0) 為目標，且 OutputType 應為 'Exe'。 目前的 {1} 為 '{2}'。

# RunCommandExceptionUnableToRunSpecifyFramework
source: Unable to run your project Your project targets multiple frameworks. Specify which framework to run using '{0}'.
cs: Projekt nelze spustit. Cílem projektu je více architektur. Pomocí parametru {0} určete, která architektura se má spustit.
de: Ihr Projekt kann nicht ausgeführt werden. Ihr Projekt verwendet mehrere Zielframeworks. Geben Sie über "{0}" an, welches Framework ausgeführt werden soll.
es: No se puede ejecutar el proyecto Su proyecto tiene como destino varias plataformas. Especifique la que quiere usar mediante "{0}".
fr: Impossible d'exécuter votre projet Votre projet cible plusieurs frameworks. Spécifiez le framework à exécuter à l'aide de '{0}'.
it: Non è possibile eseguire il progetto Il progetto è destinato a più framework. Specificare il framework da eseguire con '{0}'.
ja: プロジェクトを実行できません プロジェクトは複数のフレームワークを対象としています。'{0}' を使用して、実行するフレームワークを指定してください。
ko: 프로젝트를 실행할 수 없습니다. 프로젝트에서 여러 프레임워크를 대상으로 합니다. '{0}'을(를) 사용하여 실행할 프레임워크를 지정하세요.
pl: Nie można uruchomić projektu Projekt ma wiele platform docelowych. Określ platformę do uruchomienia przy użyciu elementu „{0}”.
pt_br: Não é possível executar o seu projeto Ele tem diversas estruturas como destino. Especifique que estrutura executar usando '{0}'.
ru: Не удается запустить проект Проект предназначен для нескольких платформ. Укажите платформу, для которой следует запустить проект, с помощью "{0}".
tr: Projeniz çalıştırılamıyor Projeniz birden fazla Framework'ü hedefliyor. '{0}' kullanarak hangi Framework'ün çalıştırılacağını belirtin.
zh_hans: 无法运行项目 你的项目面向多个框架。请指定要使用“{0}”运行的框架。
zh_hant: 無法執行您的專案 您的專案以多重架構為目標。請使用 '{0}' 指定要執行的架構。

# RunCommandProjectAbbreviationDeprecated
source: Warning NETSDK1174: The abbreviation of -p for --project is deprecated. Please use --project.
cs: Upozornění NETSDK1174: Zkratka -p pro --project je zastaralá. Použijte prosím --project.
de: Warnung NETSDK1174: Die Abkürzung von „-p“ für „--project“ ist veraltet. Verwenden Sie „--project“.
es: Advertencia NETSDK1174: La abreviatura de -p para --project está en desuso. Use --project.
fr: AVERTISSEMENT NETSDK1174 : l’abréviation de-p pour--project est déconseillée. Veuillez utiliser--project.
it: Avviso NETSDK1174: l'abbreviazione di -p per --project è deprecata. Usare --project.
ja: 警告 NETSDK1174: --project の省略形である -p は推奨されていません。--project を使用してください。
ko: 경고 NETSDK1174: --project에 대한 약어 -p는 더 이상 사용되지 않습니다. --project를 사용하세요.
pl: Ostrzeżenie NETSDK1174: Skrót -p dla polecenia --project jest przestarzały. Użyj polecenia --project.
pt_br: Aviso NETSDK1174: a abreviação de-p para--project é preterida. Use --project.
ru: Предупреждение NETSDK1174: сокращение "-p" для "--project" не рекомендуется. Используйте "--project".
tr: Uyarı NETSDK1174: --project için -p kısaltması kullanımdan kaldırıldı. Lütfen --project kullanın.
zh_hans: 警告 NETSDK1174: 已弃用使用缩写“-p”来代表“--project”。请使用“--project”。
zh_hant: 警告 NETSDK1174: --project 已取代縮寫 -p。請使用 --project。

# RunCommandSpecifiedFileIsNotAValidProject
source: '{0}' is not a valid project file.
cs: {0} není platný soubor projektu.
de: "{0}" ist keine gültige Projektdatei.
es: "{0}" no es un archivo de proyecto válido.
fr: '{0}' n'est pas un fichier projet valide.
it: '{0}' non è un file di progetto valido.
ja: '{0}' は有効なプロジェクト ファイルではありません。
ko: '{0}'은(는) 유효한 프로젝트 파일이 아닙니다.
pl: „{0}” nie jest prawidłowym plikiem projektu.
pt_br: '{0}' não é um arquivo de projeto válido.
ru: "{0}" не является допустимым файлом проекта.
tr: '{0}' geçerli bir proje dosyası değil.
zh_hans: “{0}”不是有效的项目文件。
zh_hant: '{0}' 並非有效的專案名稱。

# RunCommandWarningRunJsonNotUsed
source: Warning: Settings from '{0}' are not used because '{1}' has precedence.
cs: Upozornění: Nastavení z {0} nejsou použita, protože {1} má přednost.
de: Warnung: Einstellungen von „{0}“ werden nicht verwendet, weil „{1}“ Vorrang hat.
es: Advertencia: la configuración de '{0}' no se utiliza porque '{1}' tiene prioridad.
fr: Avertissement : les paramètres de « {0} » ne sont pas utilisés, car « {1} » a la priorité.
it: Avviso: le impostazioni di "{0}" non vengono usate perché "{1}" ha la precedenza.
ja: 警告: '{1}' が優先されるため、'{0}' の設定は使用されません。
ko: 경고: '{0}'의 설정은 '{1}'이(가) 우선하므로 사용되지 않습니다.
pl: Ostrzeżenie: ustawienia z „{0}” nie są używane, ponieważ element „{1}” ma pierwszeństwo.
pt_br: Aviso: As configurações de '{0}' não são utilizadas porque '{1}' tem precedência.
ru: Внимание! Параметры из "{0}" не используются, так как "{1}" обладает приоритетом.
tr: Uyarı: ‘{1}’ öncelikli olduğu için ‘{0}’ ayarları kullanılmaz.
zh_hans: 警告: 不使用 ‘{0}’ 中的设置，因为 ‘{1}’ 具有优先级。
zh_hant: 警告: 來自 '{0}' 的設定未被使用，因為 '{1}' 具有優先順序。

# RunConfigurationOptionDescription
source: The configuration to run for. The default for most projects is 'Debug'.
cs: Konfigurace pro spuštění. Výchozí možností pro většinu projektů je Debug.
de: Die Konfiguration für die Ausführung. Der Standardwert für die meisten Projekte ist "Debug".
es: La configuración para la que se ejecuta. El valor predeterminado para la mayoría de los proyectos es "Debug".
fr: Configuration pour laquelle l'exécution est effectuée. La valeur par défaut pour la plupart des projets est 'Debug'.
it: Configurazione da usare per l'esecuzione. L'impostazione predefinita per la maggior parte dei progetti è 'Debug'.
ja: 実行する対象の構成。大部分のプロジェクトで、既定値は 'Debug' です。
ko: 실행할 구성입니다. 대부분의 프로젝트에서 기본값은 'Debug'입니다.
pl: Konfiguracja, którą należy uruchomić. W przypadku większości projektów ustawienie domyślne to „Debugowanie”.
pt_br: A configuração para a qual a execução ocorrerá. O padrão para a maioria dos projetos é 'Debug'.
ru: Конфигурация для запуска. По умолчанию для большинства проектов используется "Debug".
tr: Çalıştırılacak yapılandırma. Çoğu proje için varsayılan, ‘Hata Ayıklama’ seçeneğidir.
zh_hans: 要运行的配置。大多数项目的默认值是 "Debug"。
zh_hant: 要為其執行的組態。大部分的專案預設為「偵錯」。

# RunDefinition
source: Build and run a .NET project output.
cs: Sestaví a spustí výstup projektu .NET.
de: Hiermit wird eine .NET-Projektausgabe erstellt und ausgeführt.
es: Compila y ejecuta la salida de un proyecto de .NET.
fr: Générez et exécutez une sortie de projet .NET.
it: Compila ed esegue l'output di un progetto .NET.
ja: .NET プロジェクトの出力をビルドして実行します。
ko: .NET 프로젝트 출력을 빌드하고 실행합니다.
pl: Kompiluj i uruchom dane wyjściowe projektu platformy .NET.
pt_br: Criar e executar uma saída de projeto do .NET.
ru: Сборка и запуск проекта .NET.
tr: Bir .NET projesi çıktısı derler ve çalıştırır.
zh_hans: 生成并运行 .NET 项目输出。
zh_hant: 建置並執行 .NET 專案輸出。

# RunDotnetCommandHelpForMore
source: Run 'dotnet [command] --help' for more information on a command.
cs: Další informace o příkazu získáte spuštěním příkazu dotnet [příkaz] --help.
de: Führen Sie "dotnet [command] --help" aus, um weitere Informationen zu einem Befehl zu erhalten.
es: Ejecute "dotnet [comando] --help" para más información sobre un comando.
fr: Pour plus d'informations sur une commande, exécutez 'dotnet [commande] --help'.
it: Per altre informazioni su un comando, eseguire 'dotnet [comando] --help'.
ja: コマンドに関する詳細情報については、'dotnet [command] --help' を実行します。
ko: 명령에 대한 자세한 정보를 보려면 'dotnet [명령] --help'를 실행합니다.
pl: Uruchom polecenie „dotnet [polecenie] --help”, aby uzyskać więcej informacji o danym poleceniu.
pt_br: Execute 'dotnet [command] --help' para obter mais informações sobre um comando.
ru: Для получения дополнительных сведений о команде выполните команду "dotnet [команда] --help".
tr: Bir komut hakkında daha fazla bilgi için 'dotnet [komut] --help' komutunu çalıştırın.
zh_hans: 运行 "dotnet [command] --help"，获取有关命令的详细信息。
zh_hant: 如需命令的詳細資訊，請執行 'dotnet [command] --help'。
