Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UninstallLocalToolSucceeded
source: Tool '{0}' was successfully uninstalled and removed from manifest file {1}.
cs: Nástroj {0} se úspěšně odinstaloval a odebral ze souboru manifestu {1}.
de: Das Tool "{0}" wurde erfolgreich deinstalliert und aus der Manifestdatei "{1}" entfernt.
es: La herramienta "{0}" se desinstaló y quitó correctamente del archivo de manifiesto {1}.
fr: L'outil '{0}' a été désinstallé et supprimé correctement du fichier manifeste {1}.
it: Lo strumento '{0}' è stato disinstallato e rimosso dal file manifesto {1}.
ja: ツール '{0}' が正常にアンインストールされ、マニフェスト ファイル {1} から削除されました。
ko: '{0}' 도구가 제거되었으며 매니페스트 파일 {1}에서 제거되었습니다.
pl: Narzędzie „{0}” zostało pomyślnie odinstalowane i usunięte z pliku manifestu {1}.
pt_br: A ferramenta '{0}' foi desinstalada com êxito e removida do arquivo de manifesto {1}.
ru: Средство "{0}" успешно удалено и исключено из файла манифеста {1}.
tr: '{0}' aracı başarıyla kaldırıldı ve {1} bildirim dosyasından çıkarıldı.
zh_hans: 工具“{0}”已成功卸载并从清单文件 {1} 中移除。
zh_hant: 已成功解除安裝工具 '{0}'，且已將其從資訊清單檔 {1} 中移除。

# UninstallToolCommandInvalidGlobalAndLocalAndToolPath
source: The local option(--local), the global option (--global), the tool path option (--tool-path), can only have one at a time. Specify only one of the options: {0}.
cs: Možnost local (--local), možnost global (--global), možnost tool path (--tool-path), v jednu chvíli je možné mít jen jednu. Zadejte jen jednu z možností: {0}
de: Die lokale Option (--local), die globale Option (--global) und die Toolpfadoption (--tool-path) können nicht zusammen angegeben werden. Geben Sie nur eine der Optionen an: {0}.
es: La opción local (--local), la opción global (--global) y la opción de ruta de acceso de herramienta (--tool-path), solo pueden estar una cada vez. Especifique solo una de las opciones: {0}.
fr: L'option locale (--local), l'option globale (--global) et l'option de chemin d'outil (--tool-path) ne peuvent pas être utilisées simultanément. Spécifiez une seule des options : {0}.
it: Le opzioni locale (--local), globale (--global) e del percorso dello strumento (--tool-path) non possono essere specificate contemporaneamente. Specificare una sola di queste opzioni: {0}.
ja: ローカル オプション (--local)、グローバル オプション (--global)、ツール パス オプション (--tool-path) は、一度に 1 つだけ指定できます。オプションを 1 つだけ指定します: {0}。
ko: 로컬 옵션(--local), 전역 옵션(--global), 도구 경로 옵션(--tool-path)은 한 번에 하나씩만 사용할 수 있습니다. {0} 옵션 중에서 하나만 지정하세요.
pl: Można określić tylko jedną opcję jednocześnie: opcję lokalną (--local), opcję globalną (--global) lub opcję ścieżki do narzędzia (--tool-path). Podaj tylko jedną z opcji: {0}.
pt_br: As opções local (--local), global (--global) e do caminho da ferramenta (--tool-path) só podem ocorrer uma por vez. Especifique apenas uma das opções: {0}.
ru: Локальный параметр (--local), глобальный параметр (--global) и параметр пути к средству (--tool-path) можно использовать только отдельно друг от друга. Укажите только один из этих параметров: {0}.
tr: Yerel seçeneği (--local), genel seçeneği (--global), araç yolu seçeneği (--tool-path) arasından yalnızca biri seçilebilir. Seçeneklerden yalnızca birini belirtin: {0}.
zh_hans: 本地选项(--local)、全局选项(--global)和工具路径选项(--tool-path)一次只能有一个。请仅指定其中一个选项: {0}。
zh_hant: 一次只能有一個本機選項 (--local)、全域選項 (--global)、工具路徑選項 (--tool-path)。請僅指定其中一個選項: {0}。

# UnknownRecordsInformationalMessage
source: Rows with Unlogged changes represent changes from actions other than .NET CLI workload commands. Usually this represents an update to the .NET SDK or to Visual Studio.
cs: Řádky s nezaprotokolovanými změnami představují změny z jiných akcí než příkazů úloh rozhraní příkazového řádku .NET. Obvykle to představuje aktualizaci sady .NET SDK nebo sady Visual Studio.
de: Zeilen mit nicht protokollierten Änderungen stellen Änderungen von anderen Aktionen als .NET CLI-Workloadbefehlen dar. In der Regel stellt dies ein Update für das .NET SDK oder für Visual Studio dar.
es: Las filas con cambios sin registrar representan cambios de acciones distintas de los comandos de carga de trabajo de la CLI de .NET. Por lo general, esto representa una actualización del SDK de .NET o de Visual Studio.
fr: Les lignes avec des modifications non enregistrées représentent les modifications des actions autres que les commandes de charge de travail CLI .NET. Il s’agit généralement d’une mise à jour du Kit de développement logiciel (SDK) .NET ou de Visual Studio.
it: Le righe con modifiche non registrate rappresentano modifiche da azioni diverse dai comandi del carico di lavoro dell'interfaccia della riga di comando .NET. In genere si tratta di un aggiornamento di .NET SDK o di Visual Studio.
ja: ログに記録されていない変更がある行は、.NET CLI ワークロード コマンド以外のアクションからの変更を表します。通常、これは .NET SDK または Visual Studio の更新を表します。
ko: 기록되지 않은 변경 내용이 있는 행은 .NET CLI 워크로드 명령 이외의 작업에서 변경된 사항을 나타냅니다. 이러한 변경 사항은 일반적으로 .NET SDK 또는 Visual Studio에 대한 업데이트를 나타냅니다.
pl: Wiersze z niezarejestrowanymi zmianami reprezentują zmiany pochodzące z akcji innych niż polecenia obciążenia interfejsu wiersza polecenia platformy .NET. Zazwyczaj oznacza to aktualizację zestawu .NET SDK lub programu Visual Studio.
pt_br: As linhas com as alterações Não Registradas representam as alterações de ações diferentes dos comandos de carga de trabalho da CLI do .NET. Geralmente, isso representa uma atualização para o SDK do .NET ou para o Visual Studio.
ru: Строки с нерегистрируемыми в журнале изменениями представляют изменения из действий, отличных от команд рабочей нагрузки .NET CLI. Обычно это представляет обновление пакета SDK для .NET или Visual Studio.
tr: Kaydedilmemiş değişiklikler içeren satırlar, .NET CLI iş yükü komutları dışındaki eylemlerden kaynaklanan değişiklikleri temsil eder. Bu genellikle .NET SDK'ya veya Visual Studio'ya bir güncelleştirme anlamına gelir.
zh_hans: 具有未记录更改的行表示除 .NET CLI 工作负载命令以外的操作的更改。这通常表示对 .NET SDK 或 Visual Studio 的更新。
zh_hant: 具有未記錄變更的列代表變更來自 .NET CLI 工作負載命令以外的動作。這通常代表對 .NET SDK 或 Visual Studio 的更新。

# UnrecognizedDirective
source: Unrecognized directive '{0}' at {1}.
cs: Nerozpoznaná direktiva {0} na {1}.
de: Unbekannte Direktive "{0}" bei {1}.
es: Directiva no reconocida "{0}" en {1}.
fr: Directive « {0} » non reconnue au {1}.
it: Direttiva non riconosciuta '{0}' in {1}.
ja: {1} で認識されないディレクティブ ' {0}' です。
ko: '{0}' 지시문을 {1}에서 인식할 수 없습니다.
pl: Nierozpoznana dyrektywa „{0}” w {1}.
pt_br: Diretiva não reconhecida ''{0}'' em {1}.
ru: Нераспознанная директива "{0}" в {1}.
tr: {1} içinde tanınmayan '{0}' yönergesi.
zh_hans: {1} 中指令 ‘{0}’ 无法识别。
zh_hant: 在 {1} 的無法辨識的指示詞 '{0}'。

# UpdateAllOptionDescription
source: Update all tools.
cs: Aktualizuje všechny nástroje.
de: Alle Tools aktualisieren.
es: Actualizar todas las herramientas.
fr: Mettez à jour tous les outils.
it: Aggiorna tutti gli strumenti.
ja: すべてのツールを更新する。
ko: 모든 도구를 업데이트합니다.
pl: Zaktualizuj wszystkie narzędzia.
pt_br: Atualize todas as ferramentas.
ru: Обновление всех инструментов.
tr: Tüm araçları güncelleştirin.
zh_hans: 更新所有工具。
zh_hant: 更新所有工具。

# UpdateFromRollbackSwitchesModeToLooseManifests
source: Updating to a rollback file is not compatible with workload sets. Install and Update will now use loose manifests. To update to a specific workload version, use --version.
cs: Aktualizace na soubor vrácení zpět není kompatibilní se sadami úloh. Instalace a aktualizace teď budou používat volné manifesty. Pokud chcete provést aktualizaci na konkrétní verzi úlohy, použijte možnost --version.
de: Das Aktualisieren auf eine Rollbackdatei ist nicht mit Workloadsätzen kompatibel. Installation und Update verwenden jetzt lose Manifeste. Verwenden Sie „--version“, um auf eine bestimmte Workloadversion zu aktualisieren.
es: La actualización a un archivo de reversión no es compatible con los conjuntos de cargas de trabajo. Instalar y actualizar ahora usará manifiestos dinámicos. Para actualizar a una versión de carga de trabajo específica, use --versión.
fr: La mise à jour vers un fichier de restauration n’est pas compatible avec les jeux de charge de travail. L’installation et la mise à jour utiliseront désormais des manifestes libres. Pour effectuer une mise à jour vers une version de charge de travail spécifique, utilisez --version.
it: L'aggiornamento a un file di rollback non è compatibile con i set di carico di lavoro. L'installazione e l'aggiornamento useranno ora manifesti separati. Per eseguire l'aggiornamento a una versione specifica del carico di lavoro, usare --version.
ja: ロールバック ファイルへの更新は、ワークロード セットと互換性がありません。インストールと更新にルーズ マニフェストが使用されるようになりました。特定のワークロードのバージョンに更新するには、--version を使用します。
ko: 롤백 파일로 업데이트하는 것은 워크로드 집합과 호환되지 않습니다. 이제 설치 및 업데이트에서 느슨한 매니페스트를 사용합니다. 특정 워크로드 버전으로 업데이트하려면 --version을 사용합니다.
pl: Aktualizacja do pliku wycofywania nie jest zgodna z zestawami obciążeń. Zainstaluj i zaktualizuj będzie teraz używać luźnych manifestów. Aby zaktualizować do określonej wersji obciążenia, użyj opcji --version.
pt_br: Atualizar em um arquivo de reversão não é compatível com os conjuntos de carga de trabalho. A instalação e a atualização agora usarão manifestos flexíveis. Para atualizar para uma versão de carga de trabalho específica, use --versão.
ru: Обновление до файла отката несовместимо с наборами рабочих нагрузок. Теперь установка и обновление будут использовать свободные манифесты. Чтобы выполнить обновление до определенной версии рабочей нагрузки, используйте "--version".
tr: Geri alma dosyasının güncelleştirilmesi iş yükü kümeleriyle uyumlu değil. Yükle ve Güncelleştir özelliği artık bağımsız bildirimler kullanıyor. Belirli bir iş yükü sürümünde güncelleştirmek için “--version” komutunu kullanın.
zh_hans: 更新回退文件与工作负载集不兼容。安装和更新现在会使用松散清单。若要更新到特定工作负载版本，请使用 --version。
zh_hant: 更新至復原檔案與工作負載集不相容。安裝和更新現在將使用鬆散的資訊清單。若要更新至特定工作負載版本，請使用 --version。

# UpdateLocaToolSucceededVersionNoChange
source: Tool '{0}' is up to date (version '{1}' manifest file {2}) .
cs: Nástroj {0} je aktuální (verze {1}, soubor manifestu {2}).
de: Das Tool "{0}" ist auf dem neuesten Stand (Version {1}, Manifestdatei "{2}").
es: La herramienta "{0}" está actualizada (versión "{1}", archivo de manifiesto {2}) .
fr: L'outil '{0}' est à jour (version '{1}', fichier manifeste {2}).
it: Lo strumento '{0}' è aggiornato (file manifesto {2} versione '{1}').
ja: ツール '{0}' は最新の状態です (バージョン '{1}' マニフェスト ファイル {2})。
ko: '{0}' 도구는 최신 버전(버전 '{1}' 매니페스트 파일 {2})입니다.
pl: Narzędzie „{0}” jest aktualne (wersja „{1}”, plik manifestu {2}).
pt_br: A ferramenta '{0}' está atualizada (versão '{1}' arquivo de manifesto {2}) .
ru: Средство "{0}" обновлено (версия "{1}", файл манифеста {2}).
tr: '{0}' aracı güncel (sürüm '{1}' bildirim dosyası {2}).
zh_hans: 工具“{0}”是最新的(版本“{1}”清单文件 {2})。
zh_hant: 工具 '{0}' 為最新 (版本 '{1}' 資訊清單檔 {2})。

# UpdateLocalToolSucceeded
source: Tool '{0}' was successfully updated from version '{1}' to version '{2}' (manifest file {3}).
cs: Nástroj {0} byl úspěšně aktualizován z verze {1} na verzi {2} (soubor manifestu {3}).
de: Das Tool "{0}" wurde erfolgreich von Version {1} auf Version {2} aktualisiert (Manifestdatei "{3}").
es: La herramienta "{0}" se actualizó correctamente de la versión "{1}" a la versión "{2}" (archivo de manifiesto {3}).
fr: L'outil '{0}' a été correctement mis à jour de la version '{1}' à la version '{2}' (fichier manifeste {3}).
it: Lo strumento '{0}' è stato aggiornato dalla versione '{1}' alla versione '{2}' (file manifesto {3}).
ja: ツール '{0}' がバージョン '{1}' からバージョン '{2}' (マニフェストファイル {3}) に正常に更新されました。
ko: '{0}' 도구가 '{1}' 버전에서 '{2}' 버전(매니페스트 파일 {3})으로 업데이트되었습니다.
pl: Narzędzie „{0}” zostało pomyślnie zaktualizowane z wersji „{1}” do wersji „{2}” (plik manifestu {3}).
pt_br: A ferramenta '{0}' foi atualizada com êxito da versão '{1}' para a versão '{2}' (arquivo de manifesto {3}).
ru: Средство "{0}" обновлено с версии "{1}" до версии "{2}" (файл манифеста {3}).
tr: '{0}' aracı, '{1}' sürümünden '{2}' (bildirim dosyası {3}) sürümüne başarıyla güncelleştirildi.
zh_hans: 工具“{0}”已成功从版本“{1}”更新到版本“{2}”(清单文件 {3})。
zh_hant: 已成功將工具 '{0}' 從 '{1}' 版更新為 '{2}' 版 (資訊清單檔 {3})。

# UpdateLocalToolToLowerVersion
source: The requested version {0} is lower than existing version {1} (manifest file {2}). Use the --allow-downgrade option to allow this update.
cs: Požadovaná verze {0} je nižší než stávající verze {1} (soubor manifestu {2}). Pokud chcete povolit tuto aktualizaci, použijte možnost --allow-downgrade.
de: Die angeforderte Version {0} ist niedriger als die vorhandene Version {1} (Manifestdatei {2}). Verwenden Sie die Option--allow-downgrade, um dieses Update zuzulassen.
es: La versión solicitada {0} es anterior a la versión existente {1} (archivo de manifiesto {2}). Use la opción --allow-downgrade para permitir esta actualización.
fr: La version demandée {0} est inférieure à la version existante{1} (fichier manifeste {2}). Utilisez l’option --allow-downgrade pour autoriser cette mise à jour.
it: La versione richiesta {0} è inferiore a quella esistente {1} (file manifesto {2}). Usare l'opzione --allow-downgrade per consentire questo aggiornamento.
ja: 要求されたバージョン {0} は、既存のバージョン {1} (マニフェスト ファイル {2}) よりも低くなっています。この更新を許可するには、--allow-downgrade オプションを使用します。
ko: 요청된 {0} 버전이 기존 {1} 버전(매니페스트 파일 {2})보다 낮습니다. --allow-downgrade 옵션을 사용하여 이 업데이트를 허용하세요.
pl: Żądana wersja {0} jest niższa niż obecna wersja {1} (plik manifestu {2}). Użyj opcji --allow-downgrade (zezwól na zmianę na starszą lub mniej zaawansowaną wersję), aby zezwolić na tę aktualizację.
pt_br: A versão {0} solicitada é inferior à versão {1} existente (arquivo de manifesto {2}). Use a opção --allow-downgrade para permitir essa atualização.
ru: Запрошенная версия {0} ниже существующей версии {1} (файл манифеста {2}). Чтобы разрешить это обновление, используйте параметр --allow-downgrade.
tr: İstenen {0} sürümü mevcut {1} sürümünden ({2}bildirim dosyası) düşük. Bu güncelleştirmeye izin vermek için --allow-downgrade seçeneğini kullanın.
zh_hans: 请求的版本 {0} 低于现有版本 {1} (清单文件 {2})。使用 --allow-downgrade 选项允许此更新。
zh_hant: 要求的版本 {0} 低於現有版本 {1} (資訊清單檔 {2})。使用 --allow-downgrade 選項以允許此更新。

# UpdateModeDescription
source: Controls whether updates should look for workload sets or the latest version of each individual manifest.
cs: Určuje, zda mají aktualizace vyhledávat sady úloh nebo nejnovější verzi každého jednotlivého manifestu.
de: Steuert, ob Updates nach Workloadsätzen oder der neuesten Version jedes einzelnen Manifests suchen sollen.
es: Controla si las actualizaciones deben buscar conjuntos de cargas de trabajo o la versión más reciente de cada manifiesto individual.
fr: Contrôle si les mises à jour doivent rechercher des ensembles de charge de travail ou la dernière version de chaque manifeste individuel.
it: Controlla se gli aggiornamenti devono cercare i set di carichi di lavoro o la versione più recente di ogni singolo manifesto.
ja: 更新プログラムでワークロード セットを検索するか、各個別マニフェストの最新バージョンを検索するかを制御します。
ko: 업데이트에서 워크로드 집합을 찾을지 또는 각 개별 매니페스트의 최신 버전을 찾을지 여부를 제어합니다.
pl: Kontroluje, czy aktualizacje powinny szukać zestawów obciążeń, czy najnowszej wersji każdego pojedynczego manifestu.
pt_br: Controla se as atualizações devem procurar conjuntos de cargas de trabalho ou a versão mais recente de cada manifesto individual.
ru: Управляет тем, должны ли обновления искать наборы рабочих нагрузок или последнюю версию каждого отдельного манифеста.
tr: Güncelleştirmelerin iş yükü kümelerini mi yoksa her bir bildirimin en son sürümünü mü araması gerektiğini denetler.
zh_hans: 控制更新是应查找工作负载集还是每个单个清单的最新版本。
zh_hant: 控制更新是否應尋找工作負載集或每個單獨資訊清單的最新版本。

# UpdateModeDoesNotMatchGlobalJson
source: Specified to update workloads using {0} from the command line, but global.json file at {1} specified to use {2}.
cs: Určeno pro aktualizaci úloh pomocí {0} z příkazového řádku, ale soubor global.json v {1} je zadán pro použití {2}.
de: Es wurde angegeben, dass Workloads mithilfe von "{0}" über die Befehlszeile aktualisiert werden sollen, aber die global.json-Datei in "{1}" gibt an, dass "{2}" verwendet werden soll.
es: Se especifica para actualizar las cargas de trabajo mediante {0} desde la línea de comandos, pero el archivo global.json {1} especificado para usar {2}.
fr: Spécifié pour mettre à jour les charges de travail à l’aide de {0} à partir de la ligne de commande, mais le fichier global.json à {1} spécifie d’utiliser {2}.
it: Specificato per aggiornare i carichi di lavoro usando {0} dalla riga di comando, ma il file global.json in {1} specificato per usare {2}.
ja: コマンド ラインから {0} を使用してワークロードを更新するように指定されていますが、{1} の global.json では {2}を使用するように指定されています。
ko: 명령줄에서 {0}을(를) 사용하여 워크로드를 업데이트하도록 지정되었지만, {1}에서 {2}을(를) 사용하도록 지정된 global.json 파일입니다.
pl: Określono, aby aktualizować obciążenia przy użyciu {0} z wiersza polecenia, ale plik global.json w {1} został określony do użycia {2}.
pt_br: Especificado para atualizar cargas de trabalho usando {0} da linha de comando, mas o arquivo global.json em {1} especificado para usar {2}.
ru: Указано для обновления рабочих нагрузок с помощью {0} из командной строки, но файл global.json в {1} указывает на использование {2}.
tr: Komut satırından iş yüklerini {0} ile güncelleştirmek için belirtildi, ancak global.json dosyası {1} kullanmak için {2} olarak ayarlandı.
zh_hans: 已指定从命令行使用 {0} 更新工作负载，但位于 {1} 的 global.json 文件指定为使用 {2}。
zh_hant: 指定使用命令列的 {0} 來更新工作負載，但指定在 {1} 的 global.json 檔案使用 {2}。

# UpdateSucceededPreVersionNoChange
source: Tool '{0}' was reinstalled with the prerelease version (version '{1}').
cs: Nástroj {0} se přeinstaloval na předběžnou verzi (verze {1}).
de: Das Tool "{0}" wurde mit der Vorabversion (Version "{1}" ) neu installiert.
es: La herramienta "{0}" se ha reinstalado con la versión preliminar más reciente (versión "{1}").
fr: L'outil « {0} » a été réinstallé avec la version préliminaire (version « {1} »).
it: Lo strumento '{0}' è stato reinstallato con la versione preliminare (versione '{1}').
ja: ツール '{0}' がプレリリース バージョン (バージョン '{1}') で再インストールされました。
ko: '{0}' 도구가 시험판 버전('{1}' 버전)으로 다시 설치되었습니다.
pl: Narzędzie „{0}” zostało ponownie zainstalowane z wersją wstępną (wersja „{1}”).
pt_br: A ferramenta "{0}" foi reinstalada com a versão de pré-lançamento mais recente (versão "{1}").
ru: Инструмент "{0}" был переустановлен. Установлена предварительная версия (версия "{1}").
tr: '{0}' aracı, ön sürüm (sürüm '{1}') ile yeniden yüklendi.
zh_hans: 工具“{0}”已重新安装预发行版本(版本“{1}”)。
zh_hant: 已使用搶鮮版本 (版本 '{1}') 來重新安裝工具 '{0}'。

# UpdateSucceededStableVersionNoChange
source: Tool '{0}' was reinstalled with the stable version (version '{1}').
cs: Nástroj {0} se přeinstaloval na stabilní verzi (verze {1}).
de: Das Tool "{0}" wurde mit der stabilen Version (Version "{1}" ) neu installiert.
es: La herramienta "{0}" se reinstaló con la versión estable más reciente (versión "{1}").
fr: L'outil « {0} » a été réinstallé avec la version stable (version « {1} »).
it: Lo strumento '{0}' è stato reinstallato con la versione stabile (versione '{1}').
ja: ツール '{0}' が安定したバージョン (バージョン '{1}') で再インストールされました。
ko: '{0}' 도구가 안정화 버전('{1}' 버전)으로 다시 설치되었습니다.
pl: Narzędzie „{0}” zostało ponownie zainstalowane przy użyciu najnowszej stabilnej wersji (wersja „{1}”).
pt_br: A ferramenta "{0}" foi reinstalada com a versão estável mais recente (versão "{1}").
ru: Инструмент "{0}" был переустановлен. Установлена стабильная версия (версия "{1}").
tr: '{0}' aracı, kararlı sürüm (sürüm '{1}') ile yeniden yüklendi.
zh_hans: 工具“{0}”已重新安装稳定版本(版本“{1}”)。
zh_hant: 已使用穩定版本 (版本 '{1}') 來重新安裝工具 '{0}'。

# UpdateToLowerVersion
source: The requested version {0} is lower than existing version {1}.
cs: Požadovaná verze {0} je nižší než stávající verze {1}.
de: Die angeforderte Version {0} ist niedriger als die vorhandene Version {1}.
es: La versión solicitada {0} es inferior a la versión existente {1}.
fr: La version demandée {0} est inférieure à la version existante {1}.
it: La versione richiesta {0} è inferiore a quella esistente {1}.
ja: 要求されたバージョン {0} は、既存のバージョン {1} を下回っています。
ko: 요청된 버전 {0}이(가) 기존 버전 {1}보다 낮습니다.
pl: Żądana wersja {0} jest niższa niż istniejąca wersja {1}.
pt_br: A versão solicitada {0} é inferior à versão existente {1}.
ru: Запрошенная версия {0} ниже существующей версии {1}.
tr: İstenen sürümü ({0}) mevcut sürümünden ({1}) düşük.
zh_hans: 请求的版本 {0} 低于现有版本 {1}。
zh_hant: 要求的版本 {0} 低於現有版本 {1}。

# UpdateToolCommandInvalidAllAndPackageId
source: One must specify either package ID or use the update all option (--all).
cs: Jeden musí určovat buď ID balíčku, nebo použít možnost aktualizovat vše (--all).
de: Sie müssen entweder die Paket-ID angeben oder die Option „Alle aktualisieren“ (--all) verwenden.
es: Uno debe especificar el id. del paquete o usar la opción actualizar todo (--all).
fr: Vous devez spécifier l’ID de package ou utiliser l’option Mettre à jour tout (--all).
it: È necessario specificare l'ID pacchetto o usare l'opzione Aggiorna tutto (--all).
ja: パッケージ ID を指定するか、update all オプション (--all) を使用する必要があります。
ko: 패키지 ID를 지정하거나 모든 업데이트 옵션(--all)을 사용해야 합니다.
pl: Jedna z nich musi określić identyfikator pakietu lub użyj opcji aktualizacji wszystkiego (--all).
pt_br: É necessário especificar a ID do pacote ou usar a opção atualizar tudo (--all).
ru: Необходимо указать идентификатор пакета или использовать параметр общего обновления (--all).
tr: Paket kimliği belirtilmeli veya tümünü güncelleştirme (--all) seçeneğini kullanın..
zh_hans: 必须指定包 ID 或使用全部更新选项(--all)。
zh_hant: 必須指定套件識別碼，或使用更新所有選項 (--all)。

# UpdateToolCommandInvalidAllAndVersion
source: The version option (--version) and the update all option (--all) cannot be used together. Specify only one of the options: {0}.
cs: Možnost verze (--version) a možnost aktualizovat vše (--all) nejde použít naráz. Zadejte pouze jednu z možností: {0}.
de: Die Option „Version“ (--version) und die Option „Alle aktualisieren“ (--all) können nicht zusammen verwendet werden. Geben Sie nur eine der Optionen an: {0}.
es: La opción de versión (--version) y la opción actualizar todo (--all) no se pueden usar juntas. Especifique solo una de las opciones: {0}.
fr: L’option de version (--version) et l’option mettre à jour toutes (--all) ne peuvent pas être utilisées ensemble. Spécifiez une seule des options :{0}.
it: Non è possibile utilizzare contemporaneamente l'opzione versione (--version) e l'opzione aggiorna tutto (--all). Specificare solo una delle opzioni:{0}.
ja: version オプション (--version) と update all オプション (--all) は同時に使用できません。次のいずれかのオプションのみを指定してください:{0}。
ko: 버전 옵션(--version) 및 업데이트 모두 옵션(--all)을 함께 사용할 수 없습니다. 옵션 중 하나만 지정: {0}.
pl: Opcji wersji (--version) i opcji aktualizacji wszystkiego (--all) nie można używać jednocześnie. Określ tylko jedną z opcji:{0}.
pt_br: A opção versão (--version) e a opção atualizar tudo (--all) não podem ser usadas juntas. Especifique apenas uma das opções: {0}.
ru: Параметр версии (--version) и параметр общего обновления (--all) не могут использоваться вместе. Укажите только один из параметров: {0}.
tr: Sürüm seçeneği (--version) ve tümünü güncelleştirme seçeneği (--all) birlikte kullanılamaz. Şu seçeneklerden yalnızca birini belirtin: {0}.
zh_hans: 版本选项(--version)和全部更新选项(--all)不能一起使用。仅指定选项之一: {0}。
zh_hant: 版本選項 (--version) 和更新所有選項 (--all) 無法一起使用。請只指定其中一個選項: {0}。
