Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CmdConfigDescription
source: The path to the NuGet config file to use. Requires the '--outdated', '--deprecated' or '--vulnerable' option.
cs: Cesta ke konfiguračnímu souboru NuGet, který se má použít. Vyžaduje přepínač --outdated, --deprecated nebo --vulnerable.
de: Der Pfad zurNuGet-Konfigurationsdatei, die verwendet werden soll. Erfordert die Option "--outdated", "--deprecated" oder "--vulnerable".
es: La ruta de acceso al archivo de configuración de NuGet que se va a usar. Requiere la opción "--outdated", "--deprecated" o "--vulnerable".
fr: Chemin du fichier config NuGet à utiliser. Nécessite l'option '--outdated', '--deprecated' ou '--vulnerable'.
it: Percorso del file config NuGet da usare. Richiede l'opzione '--outdated', '--deprecated' o '--vulnerable'.
ja: 使用する NuGet config ファイルのパス。'--outdated'、'--deprecated'、または '--vulnerable' のオプションが必要です。
ko: 사용할 NuGet 구성 파일의 경로입니다. '--outdated', '--deprecated' 또는 '--vulnerable' 옵션이 필요합니다.
pl: Ścieżka do pliku konfiguracji NuGet do użycia. Wymaga opcji „--outdated”, „--deprecated” lub „--vulnerable”.
pt_br: O caminho para o arquivo de configuração do NuGet a ser usado. Exige a opção '--outdated', '--deprecated' ou '--vulnerable'.
ru: Путь к используемому файлу конфигурации NuGet. Требуется указать параметр "--outdated", "--deprecated" или "--vulnerable".
tr: Kullanılacak NuGet yapılandırma dosyasının yolu. '--outdated', '--deprecated' veya '--vulnerable' seçeneğini gerektirir.
zh_hans: 要使用的 NuGet 配置文件的路径。需要 "--outdated"、"--deprecated" 或 "--vulnerable" 选项。
zh_hant: 要使用的 NuGet 組態檔路徑。需要 '--outdated'、'--deprecated' 或 '--vulnerable' 選項。

# CmdConfigFileDescription
source: Specifies a testconfig.json file.
cs: Určuje soubor testconfig.json.
de: Gibt eine testconfig.json-Datei an.
es: Especifica un archivo testconfig.json.
fr: Spécifie un fichier testconfig.json.
it: Specifica un file testconfig.json.
ja: testconfig.json ファイルを指定します。
ko: testconfig.json 파일을 지정합니다.
pl: Określa plik testconfig.json.
pt_br: Especifica um arquivo testconfig.json.
ru: Указывает файл testconfig.json.
tr: testconfig.json dosyası belirtir.
zh_hans: 指定 testconfig.json 文件。
zh_hant: 指定 testconfig.json 檔案。

# CmdConfigFileOptionDescription
source: The NuGet configuration file to use.
cs: Konfigurační soubor NuGet, který se použije.
de: Die zu verwendende NuGet-Konfigurationsdatei.
es: Archivo de configuración de NuGet que debe usarse.
fr: Fichier de configuration NuGet à utiliser.
it: File di configurazione NuGet da usare.
ja: 使用する NuGet 構成ファイル。
ko: 사용할 NuGet 구성 파일입니다.
pl: Plik konfiguracji programu NuGet do użycia.
pt_br: O arquivo de configuração do NuGet a ser usado.
ru: Используемый файл конфигурации NuGet.
tr: Kullanılacak NuGet yapılandırma dosyası.
zh_hans: 要使用的 NuGet 配置文件。
zh_hant: 要使用的 NuGet 組態檔。

# CmdCurrentRuntimeOptionDescription
source: Use current runtime as the target runtime.
cs: Jako cílový modul runtime použijte aktuální modul.
de: Verwenden Sie die aktuelle Runtime als Zielruntime.
es: Use el runtime actual como runtime de destino.
fr: Utilisez le runtime actuel en tant que runtime cible.
it: Usa il runtime corrente come runtime di destinazione.
ja: 現在のランタイムをターゲット ランタイムとして使用します。
ko: 현재 런타임을 대상 런타임으로 사용합니다.
pl: Użyj bieżącego środowiska uruchomieniowego jako docelowego środowiska uruchomieniowego.
pt_br: Usar o runtime atual como o runtime de destino.
ru: Использовать текущую среду выполнения в качестве целевой среды выполнения.
tr: Hedef çalışma zamanı olarak geçerli çalışma zamanını kullanın.
zh_hans: 将当前运行时用作目标运行时。
zh_hant: 使用目前的執行階段作為目標執行階段。

# CmdDGFileException
source: Unable to create dependency graph file for project '{0}'. Cannot add package reference.
cs: Není možné vytvořit soubor grafu závislostí pro projekt {0}. Nelze přidat odkaz na balíček.
de: Die Abhängigkeitsdiagrammdatei für das Projekt "{0}" konnte nicht erstellt werden. Der Paketverweis kann nicht hinzugefügt werden.
es: No se puede crear el archivo de gráfico de dependencias para el proyecto "{0}". No se puede agregar la referencia de paquete.
fr: Impossible de créer le fichier de graphique de dépendance pour le projet '{0}'. Impossible d'ajouter la référence du package.
it: Non è possibile creare il file del grafico dipendenze per il progetto '{0}'. Non è possibile aggiungere il riferimento al pacchetto.
ja: プロジェクト '{0}' の依存関係グラフ ファイルを作成できません。パッケージ参照を追加できません。
ko: '{0}' 프로젝트에 대한 종속성 그래프 파일을 만들 수 없습니다. 패키지 참조를 추가할 수 없습니다.
pl: Nie można utworzyć pliku wykresu tworzenia zależności dla projektu „{0}”. Nie można dodać odwołania do pakietu.
pt_br: Não é possível criar o arquivo de gráfico de dependência para o projeto '{0}'. Não é possível adicionar a referência do pacote.
ru: Не удалось создать файл графа зависимостей для проекта "{0}". Невозможно добавить ссылку на пакет.
tr: '{0}' projesi için bağımlılık grafiği dosyası oluşturulamadı. Paket başvurusu eklenemiyor.
zh_hans: 无法为项目“{0}”创建依赖关系图文件。无法添加包引用。
zh_hant: 無法為專案 '{0}' 建立相依性關係圖檔案。無法新增套件參考。

# CmdDGFileIOException
source: Unable to generate a temporary file for project '{0}'. Cannot add package reference. Clear the temp directory and try again.
cs: Nejde generovat dočasný soubor pro projekt {0}. Není možné přidat odkaz na balíček. Vyprázdněte dočasný adresář a zkuste to znovu.
de: Für das Projekt "{0}" kann keine temporäre Datei generiert werden. Ein Paketverweis kann nicht hinzugefügt werden. Löschen Sie das temporäre Verzeichnis, und versuchen Sie es noch mal.
es: No se puede generar un archivo temporal para el proyecto "{0}". No se puede agregar la referencia del paquete. Borre el directorio temporal e inténtelo de nuevo.
fr: Impossible de générer un fichier temporaire pour le projet '{0}'. Impossible d'ajouter une référence de package. Effacez le répertoire temporaire et réessayez.
it: Non è possibile generare un file temporaneo per il progetto '{0}'. Non è possibile aggiungere il riferimento al pacchetto. Cancellare la directory temp e riprovare.
ja: プロジェクト '{0}' の一時ファイルを生成できません。パッケージ参照を追加できません。一時ディレクトリをクリアして、もう一度お試しください。
ko: '{0}' 프로젝트에 대한 임시 파일을 생성할 수 없습니다. 패키지 참조를 추가할 수 없습니다. 임시 디렉터리를 지우고 다시 시도하세요.
pl: Nie można wygenerować pliku tymczasowego dla projektu „{0}”. Nie można dodać odwołania do pakietu. Wyczyść katalog tymczasowy i spróbuj ponownie.
pt_br: Não é possível gerar um arquivo temporário para o projeto '{0}'. Não é possível adicionar a referência do pacote. Limpe o diretório temporário e tente novamente.
ru: Не удалось создать временный файл для проекта "{0}". Невозможно добавить ссылку на пакет. Очистите временный каталог и повторите попытку.
tr: '{0}' projesi için geçici dosya oluşturulamıyor. Paket başvurusu eklenemiyor. Geçici dizini temizleyin ve yeniden deneyin.
zh_hans: 无法为项目“{0}”生成临时文件。无法添加包引用。请清除临时目录，然后再重试。
zh_hant: 無法產生專案 '{0}' 的暫存檔案。無法新增套件參考。請清除該暫存目錄，然後再試一次。

# CmdDeprecatedDescription
source: Lists packages that have been deprecated. Cannot be combined with '--vulnerable' or '--outdated' options.
cs: Vypíše balíčky, které jsou zastaralé. Nedá se kombinovat s možností --vulnerable ani --outdated.
de: Listet Pakete auf, die veraltet sind. Kann nicht mit den Optionen "--vulnerable" oder "--outdated" kombiniert werden.
es: Muestra los paquetes que han quedado en desuso. No se puede combinar con las opciones "--outdated" o "--vulnerable".
fr: Liste les packages qui ont été dépréciés. Impossible à combiner avec les options '--vulnerable' ou '--outdated'.
it: Elenca i pacchetti che sono stati deprecati. Non può essere combinato con l'opzione '--vulnerable' o '--outdated'.
ja: 非推奨化されたパッケージを一覧表示します。'--vulnerable' または '--outdated' オプションと組み合わせることはできません。
ko: 사용되지 않는 패키지를 나열합니다. '--vulnerable' 또는 '--outdated' 옵션과 함께 사용할 수 없습니다.
pl: Wyświetla pakiety, które są przestarzałe. Nie można łączyć z opcją „--vulnerable” ani „--outdated”.
pt_br: Lista os pacotes que foram preteridos. Não pode ser combinado com a opção '--vulnerable' nem com a opção '--outdated'.
ru: Возвращает список устаревших пакетов. Не может использоваться с параметрами "--vulnerable" или "--outdated".
tr: Kullanım dışı bırakılan paketleri listeler. '--vulnerable' veya '--outdated' seçenekleriyle birleştirilemez.
zh_hans: 列出已被弃用的包。不能与 "--vulnerable" 或 "--outdated" 选项结合使用。
zh_hant: 列出已淘汰的套件。無法與 '--vulnerable' 或 '--outdated' 選項一併使用。

# CmdDiagnosticOutputDirectoryDescription
source: Output directory of the diagnostic logging. If not specified the file will be generated inside the default 'TestResults' directory.
cs: Výstupní adresář diagnostického protokolování. Pokud není zadaný, soubor se vygeneruje ve výchozím adresáři TestResults.
de: Das Ausgabeverzeichnis der Diagnoseprotokollierung. Sofern nicht angegeben, wird die Datei im Standardverzeichnis "TestResults" generiert.
es: Directorio de salida del registro de diagnóstico. Si no se especifica, el archivo se generará dentro del directorio predeterminado 'TestResults'.
fr: Répertoire de sortie de la journalisation des diagnostics. S’il n’est pas spécifié, le fichier est généré dans le répertoire « TestResults » par défaut.
it: Directory di output della registrazione diagnostica. Se non specificato, il file verrà generato all'interno della directory 'TestResults' predefinita.
ja: 診断ログの出力ディレクトリ。 指定しない場合、ファイルは既定の 'TestResults' ディレクトリ内に生成されます。
ko: 진단 로깅의 출력 디렉터리입니다. 지정하지 않으면 파일이 기본 'TestResults' 디렉터리 내에 생성됩니다.
pl: Katalog wyjściowy rejestrowania diagnostycznego. W katalogu domyślnym „TestResults” zostanie wygenerowany plik, jeśli nie został określony.
pt_br: Diretório de saída do registro em log de diagnóstico. Se não for especificado, o arquivo será gerado dentro do diretório padrão “TestResults”.
ru: Каталог выходных данных журнала диагностики. Если не указано иное, файл будет создан в каталоге по умолчанию "TestResults".
tr: Tanılama günlüğünün çıkış dizini. Belirtilmezse dosya varsayılan 'TestResults' dizini içinde oluşturulur.
zh_hans: 诊断日志记录的输出目录。 如果未指定，则会在默认的 "TestResults" 目录中生成该文件。
zh_hant: 診斷記錄的輸出目錄。 若未指定，則會在預設的 'TestResults' 目錄內產生檔案。

# CmdDirectoryDescription
source: Defines the path of directory to run. If not specified, it defaults to the current directory.
cs: Definuje cestu k adresáři pro spuštění. Pokud se nezadá, použije se výchozí nastavení aktuálního adresáře.
de: Definiert den Pfad des auszuführenden Verzeichnisses. Wenn keine Angabe erfolgt, wird standardmäßig das aktuelle Verzeichnis verwendet.
es: Define la ruta de acceso del directorio que se va a ejecutar. Si no se especifica, el valor predeterminado es el directorio actual.
fr: Définit le chemin d’accès du répertoire à exécuter. Si rien n’est spécifié, la valeur par défaut est le répertoire actif.
it: Definisce il percorso della directory da eseguire. Se non specificato, per impostazione predefinita viene usata la directory corrente.
ja: 実行するディレクトリのパスを定義します。指定しない場合は、既定で現在のディレクトリに設定されます。
ko: 실행할 디렉터리의 경로를 정의합니다. 지정하지 않으면 기본적으로 현재 디렉터리가 사용됩니다.
pl: Definiuje ścieżkę katalogu do uruchomienia. Jeśli nie zostanie określony, domyślnie będzie to bieżący katalog.
pt_br: Define o caminho do diretório a ser executado. Se não for especificado, o padrão será o diretório atual.
ru: Определяет путь к каталогу для выполнения. Если не указано, по умолчанию используется текущий каталог.
tr: Çalıştırılacak dizinin yolunu belirtir. Belirtilmezse, varsayılan olarak geçerli dizine ayarlar.
zh_hans: 定义要运行的目录的路径。如果未指定，则默认为当前目录。
zh_hant: 定義要執行的目錄路徑。如果未指定，則預設為目前目錄。

# CmdDisableParallelOptionDescription
source: Prevent restoring multiple projects in parallel.
cs: Zabrání souběžnému obnovení několika projektů.
de: Hiermit wird die parallele Wiederherstellung mehrerer Projekte verhindert.
es: Evite la restauración de varios proyectos en paralelo.
fr: Empêche la restauration de plusieurs projets en parallèle.
it: Impedisce il ripristino di più progetti in parallelo.
ja: 複数のプロジェクトを並行して復元できないようにします。
ko: 여러 프로젝트를 병렬로 복원하지 않습니다.
pl: Nie zezwalaj na równoległe przywracanie wielu projektów.
pt_br: Evite restaurar vários projetos em paralelo.
ru: Блокировка параллельного восстановления множества проектов.
tr: Birden fazla projenin paralel olarak geri yüklenmesini önler.
zh_hans: 防止并行还原多个项目。
zh_hant: 避免平行還原多個專案。

# CmdExpressionName
source: EXPRESSION
es: EXPRESIÓN
tr: İFADE
zh_hant: 運算式

# CmdFileDescription
source: Path to the file-based program.
cs: Cesta k programu na základě souboru
de: Pfad zum dateibasierten Programm.
es: Ruta de acceso al programa basado en archivos.
fr: Chemin vers le programme basé sur des fichiers.
it: Percorso del programma basato su file.
ja: ファイル ベースのプログラムへのパス。
ko: 파일 기반 프로그램의 경로입니다.
pl: Ścieżka do programu opartego na plikach.
pt_br: Caminho para o programa baseado em arquivo.
ru: Путь к программе на основе файла.
tr: Dosya tabanlı programın yolu.
zh_hans: 基于文件的程序的路径。
zh_hant: 檔案型程式之路徑。

# CmdForceRestoreOptionDescription
source: Force all dependencies to be resolved even if the last restore was successful. This is equivalent to deleting project.assets.json.
cs: Vynutí vyřešení všech závislostí, i když poslední obnovení proběhlo úspěšně. Jedná se o ekvivalent odstranění project.assets.json.
de: Hiermit wird erzwungen, dass alle Abhängigkeiten aufgelöst werden, auch wenn die letzte Wiederherstellung erfolgreich war. Dies entspricht dem Löschen von "project.assets.json".
es: Fuerce la resolución de todas las dependencias aunque la última restauración se haya realizado correctamente. Esta acción es equivalente a eliminar project.assets.json.
fr: Forcez la résolution de toutes les dépendances même si la dernière restauration a réussi. Cela équivaut à supprimer project.assets.json.
it: Forza la risoluzione di tutte le dipendenze anche se l'ultimo ripristino non è riuscito. Equivale a eliminare project.assets.json.
ja: 最後に行われた復元が成功した場合でも、強制的にすべての依存関係が解決されます。 これは、project.assets.json を削除することと同じです。
ko: 마지막 복원이 성공적인 경우에도 모든 종속성을 확인합니다. project.assets.json을 삭제하는 것과 동일합니다.
pl: Wymuś rozstrzygnięcie wszystkich zależności nawet w przypadku, gdy ostatnie przywracanie się powiodło. Jest to równoważne usunięciu pliku project.assets.json.
pt_br: Force todas as dependências a serem resolvidas, mesmo que a última restauração tenha tido êxito. Isso equivale a excluir o project.assets.json.
ru: Принудительное разрешение всех зависимостей даже в случае успеха последнего восстановления. Эквивалентно удалению файла project.assets.json.
tr: Son geri yükleme başarılı olsa bile tüm bağımlılıkları çözümlenmeye zorlar. project.assets.json öğesini silmeyle eşdeğerdir.
zh_hans: 强制解析所有依赖项，即使最后一次还原已经成功。 这等效于删除 project.assets.json。
zh_hant: 在即使上次還原已成功的情況下，仍然強制解決所有相依性。 如此等同於刪除 project.assets.json。

# CmdFormatDescription
source: Specifies the output format type for the list packages command.
cs: Určuje typ výstupního formátu pro příkaz list packages.
de: Gibt den Ausgabeformattyp für den Befehl "list packages" an.
es: Especifica el tipo de formato de salida para el comando Enumerar paquetes.
fr: Spécifie le type de format de sortie pour la commande list packages.
it: Specificare il tipo di formato di output per il comando list packages.
ja: list packages コマンドの出力形式の種類を指定します。
ko: 목록 패키지 명령의 출력 형식 유형을 지정합니다.
pl: Określa typ formatu wyjściowego polecenia pakietów listy.
pt_br: Especifica o tipo de formato de saída para o comando list packages.
ru: Указывает тип формата вывода для команды перечисления пакетов.
tr: Liste paketleri komutunun çıkış biçimi türünü belirtir.
zh_hans: 指定列表包命令的输出格式类型。
zh_hant: 指定清單套件命令的輸出格式類型。

# CmdHelpUsageTitle
source: Usage:
cs: Využití:
de: Verwendung:
es: Uso:
fr: Utilisation :
it: Utilizzo:
ja: 使用法:
ko: 사용법:
pl: Użycie:
pt_br: Uso:
ru: Использование:
tr: Kullanım:
zh_hans: 使用情况:
zh_hant: 使用方式:

# CmdHighestMinorDescription
source: Consider only the packages with a matching major version number when searching for newer packages. Requires the '--outdated' option.
cs: Při hledání novějších balíčků se budou brát v úvahu jenom balíčky s odpovídajícím číslem hlavní verze. Vyžaduje přepínač --outdated.
de: Hiermit werden bei der Suche nach neueren Paketen nur die Pakete mit übereinstimmender Hauptversionsnummer berücksichtigt. Hierfür ist die Option "--outdated" erforderlich.
es: Considere solo los paquetes con un número de versión mayor coincidente al buscar nuevos paquetes. Se requiere la opción "--outdated".
fr: Prenez en compte uniquement les packages avec un numéro de version majeure correspondant quand vous recherchez des packages plus récents. Nécessite l'option '--outdated'.
it: Prende in considerazione solo i pacchetti con il numero di versione principale corrispondente quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated'.
ja: 新しいパッケージを検索するときにメジャー バージョン番号が一致するパッケージのみを検討します。'--outdated' オプションが必要です。
ko: 최신 패키지를 검색할 때 주 버전 번호가 일치하는 패키지만 고려합니다. '--outdated' 옵션이 필요합니다.
pl: Podczas wyszukiwania nowszych pakietów uwzględniaj tylko pakiety ze zgodnym numerem wersji głównej. Wymaga opcji „--outdated”.
pt_br: Ao procurar pacotes mais novos, considerar apenas os pacotes com um número de versão principal correspondente. Requer a opção '--outdated'.
ru: Учитывает только пакеты с соответствующим номером основной версии при поиске более новых версий пакетов. Требуется указать параметр '--outdated'.
tr: Daha yeni paketler aranırken yalnızca eşleşen birincil sürüm numarasına sahip paketleri göz önünde bulundurun. '--outdated' seçeneğini gerektirir.
zh_hans: 在搜索较新的包时，仅考虑具有匹配的主要版本号的包。需要 "--outdated" 选项。
zh_hant: 在搜尋較新的套件時，建議只搜尋主要版本號碼相符的套件。需要使用 '--outdated' 選項。

# CmdHighestPatchDescription
source: Consider only the packages with a matching major and minor version numbers when searching for newer packages. Requires the '--outdated' option.
cs: Při hledání novějších balíčků se budou brát v úvahu jenom balíčky s odpovídajícími čísly hlavní verze a podverze. Vyžaduje přepínač --outdated.
de: Hiermit werden bei der Suche nach neueren Paketen nur die Pakete mit übereinstimmender Haupt- und Nebenversionsnummer berücksichtigt. Hierfür ist die Option "--outdated" erforderlich.
es: Considere solo los paquetes con números de versión mayor y menor coincidentes al buscar nuevos paquetes. Se requiere la opción "--outdated".
fr: Prenez en compte uniquement les packages avec des numéros de version majeure et mineure correspondants quand vous recherchez des packages plus récents. Nécessite l'option '--outdated'.
it: Prende in considerazione solo i pacchetti con i numeri di versione principale e secondaria corrispondenti quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated'.
ja: 新しいパッケージを検索するときにメジャーとマイナーのバージョン番号が一致するパッケージのみを検討します。'--outdated' オプションが必要です。
ko: 최신 패키지를 검색할 때 주 버전 번호와 부 버전 번호가 일치하는 패키지만 고려합니다. '--outdated' 옵션이 필요합니다.
pl: Podczas wyszukiwania nowszych pakietów uwzględniaj tylko pakiety ze zgodnym numerem wersji głównej i pomocniczej. Wymaga opcji „--outdated”.
pt_br: Considerar apenas os pacotes com números de versão principal e secundária correspondentes ao procurar pacotes mais novos. Requer a opção '--outdated'.
ru: Учитывать только пакеты с соответствующими номерами основной и дополнительной версий при поиске более новых версий пакетов. Требуется указать параметр "--outdated".
tr: Daha yeni paketler aranırken yalnızca eşleşen birincil ve ikincil sürüm numaralarına sahip paketleri değerlendirin. '--outdated' seçeneğini gerektirir.
zh_hans: 在搜索较新的包时，仅考虑具有匹配的主要和次要版本号的包。需要 "--outdated" 选项。
zh_hant: 在搜尋較新套件時，建議只搜尋主要和次要版本號碼相符的套件。需要使用 '--outdated’ 選項。

# CmdIgnoreFailedSourcesOptionDescription
source: Treat package source failures as warnings.
cs: Zacházet s nenalezenými zdroji balíčku jako s upozorněními
de: Paketquellfehler als Warnungen behandeln.
es: Indica que los errores de origen de paquete se traten como advertencias.
fr: Considérez les échecs de la source du package comme des avertissements.
it: Considera gli errori di origine pacchetto come avvisi.
ja: パッケージ ソース エラーを警告として処理します。
ko: 패키지 소스 오류를 경고로 처리합니다.
pl: Traktuj niepowodzenia źródła pakietów jako ostrzeżenia.
pt_br: Tratar falhas de origem de pacote como avisos.
ru: Обрабатывать сбои источников пакетов как предупреждения.
tr: Paket kaynağı hatalarını uyarı olarak kabul edin.
zh_hans: 将包源失败视为警告。
zh_hant: 將套件來源失敗視為警告。

# CmdIncludeSourceDescription
source: Include PDBs and source files. Source files go into the 'src' folder in the resulting nuget package.
cs: Zahrne soubory PDB a zdrojové soubory. Zdrojové soubory budou ve složce src ve výsledném balíčku NuGet.
de: Hiermit werden PDBs und Quelldateien eingeschlossen. Quelldateien werden im Ordner "src" im resultierenden NuGet-Paket abgelegt.
es: Se incluyen los archivos PDB y de código fuente. Los archivos de código fuente van a la carpeta "src" del paquete de NuGet resultante
fr: Incluez les fichiers PDB et les fichiers sources. Les fichiers sources vont dans le dossier 'src' du package NuGet résultant.
it: Include i PDB e i file di origine. I file di origine vengono inseriti nella cartella 'src' nel pacchetto NuGet risultante.
ja: PDB とソース ファイルを含めます。ソース ファイルは、結果の nuget パッケージの 'src' フォルダーに移ります。
ko: PDB 및 소스 파일을 포함합니다. 소스 파일이 결과 nuget 패키지의 'src' 폴더로 이동합니다.
pl: Dołącz pliki PDB i pliki źródłowe. Pliki źródłowe zostaną umieszczone w folderze „src” w wynikowym pakiecie NuGet.
pt_br: Incluir os arquivos de origem e os PDBs. Os arquivos de origem vão para a pasta 'src' no pacote do nuget resultante.
ru: Включение PDB-файлов и исходных файлов. Исходные файлы помещаются в папку "src" в итоговом пакете NuGet.
tr: PDB’leri ve kaynak dosyaları ekler. Elde edilen nuget paketinde kaynak dosyaları, ‘src’ klasöründe yer alır.
zh_hans: 包括 PDB 和源文件。源文件放入 nuget 结果包的“src”文件夹中。
zh_hant: 包含 PDB 和原始程式檔。原始程式檔會進入所產生之 NuGet 套件中的 'src' 資料夾。

# CmdIncludeSymbolsDescription
source: Include packages with symbols in addition to regular packages in output directory.
cs: Zahrne do výstupního adresáře kromě běžných balíčků i balíčky se symboly.
de: Pakete mit Symbolen zusätzlich zu regulären Paketen in Ausgabeverzeichnis einschließen.
es: Se incluyen paquetes con símbolos además de los paquetes habituales en el directorio de salida.
fr: Incluez les packages avec des symboles en plus des packages classiques dans le répertoire de sortie.
it: Include i pacchetti con simboli in aggiunta a quelli normali nella directory di output.
ja: 通常のパッケージに加えてシンボルを含むパッケージを出力ディレクトリに含めます。
ko: 일반 패키지 외에 기호가 포함된 패키지를 출력 디렉터리에 포함합니다.
pl: Dołącz pakiety z symbolami oprócz regularnych pakietów w folderze wyjściowym.
pt_br: Inclua os pacotes com símbolos no diretório de saída, além dos pacotes regulares.
ru: Включение пакетов с символами в дополнение к обычным пакетам в выходном каталоге.
tr: Çıkış dizinine, normal paketlere ek olarak sembol içeren paketler ekleyin.
zh_hans: 除了输出目录中的常规包之外，还包括带符号的包。
zh_hant: 將具符號的套件及一般套件包含在輸出目錄中。

# CmdInvalidProjectFileExtensionErrorDescription
source: The provided project file has an invalid extension: {0}.
cs: Zadaný soubor projektu má neplatnou příponu: {0}.
de: Die angegebene Projektdatei weist eine ungültige Erweiterung auf: {0}.
es: El archivo de proyecto proporcionado tiene una extensión no válida: {0}.
fr: Le fichier de projet fourni a une extension non valide : {0}.
it: L'estensione del file progetto fornito non è valida: {0}.
ja: 指定されたプロジェクト ファイルの拡張子が無効です: {0}。
ko: 제공된 프로젝트 파일의 확장명이 잘못되었습니다. {0}.
pl: Podany plik projektu ma nieprawidłowe rozszerzenie: {0}.
pt_br: O arquivo de projeto fornecido tem uma extensão inválida: {0}.
ru: Указанный файл проекта имеет недопустимое расширение: {0}.
tr: Sağlanan proje dosyasının uzantısı geçersiz: {0}.
zh_hans: 提供的项目文件具有无效的扩展名: {0}。
zh_hant: 提供的專案檔案的副檔名無效: {0}。
