Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# LaunchProfileDoesNotExist
source: A launch profile with the name '{0}' doesn't exist.
cs: Profil spuštění s názvem {0} neexistuje.
de: Es ist kein Startprofil mit dem Namen "{0}" vorhanden.
es: No existe ningún perfil de inicio con el nombre "{0}".
fr: Un profil de lancement avec le nom '{0}' n'existe pas.
it: Non esiste un profilo di avvio con il nome '{0}'.
ja: '{0} ' という名前の起動プロファイルは存在しません。
ko: 이름이 '{0}'인 시작 프로필이 없습니다.
pl: Profil uruchamiania o nazwie „{0}” nie istnieje.
pt_br: Um perfil de lançamento com o nome '{0}' não existe.
ru: Профиль запуска с именем "{0}" не существует.
tr: '{0}' adlı bir başlatma profili yok.
zh_hans: 名为“{0}”的启动配置文件不存在。
zh_hant: 名稱為 '{0}' 的啟動設定檔不存在。

# LaunchProfileHandlerCannotBeLocated
source: The launch profile type '{0}' is not supported.
cs: Typ profilu spuštění {0} se nepodporuje.
de: Der Startprofiltyp "{0}" wird nicht unterstützt.
es: No se admite el tipo de perfil de inicio "{0}".
fr: Le type de profil de lancement '{0}' n'est pas pris en charge.
it: Il tipo '{0}' del profilo di avvio non è supportato.
ja: 起動プロファイルの種類 '{0}' はサポートされていません。
ko: 시작 프로필 형식 '{0}'은(는) 지원되지 않습니다.
pl: Typ profilu uruchamiania „{0}” nie jest obsługiwany.
pt_br: Não há suporte para o tipo de perfil de inicialização '{0}'.
ru: Тип профиля запуска "{0}" не поддерживается.
tr: '{0}' başlatma profili türü desteklenmiyor.
zh_hans: 不支持启动配置文件类型“{0}”。
zh_hant: 不支援啟動設定檔類型 '{0}'。

# LaunchProfileIsNotAJsonObject
source: A profile with the specified name isn't a valid JSON object.
cs: Profil se zadaným názvem není platný objekt JSON.
de: Ein Profil mit dem angegebenen Namen ist kein gültiges JSON-Objekt.
es: Un perfil con el nombre especificado no es un objeto JSON válido.
fr: Un profil avec le nom spécifié n'est pas un objet JSON valide.
it: Un profilo con il nome specificato non è un oggetto JSON valido.
ja: 指定された名前のプロファイルは、有効な JSON オブジェクトではありません。
ko: 지정된 이름의 프로필은 유효한 JSON 개체가 아닙니다.
pl: Profil o określonej nazwie nie jest prawidłowym obiektem JSON.
pt_br: Um perfil com o nome especificado não é um objeto JSON válido.
ru: Профиль с указанным именем не является допустимым объектом JSON.
tr: Belirtilen adla bir profil, geçerli bir JSON nesnesi değil.
zh_hans: 具有指定名称的配置文件不是有效的 JSON 对象。
zh_hant: 具有指定名稱的設定檔不是有效的 JSON 物件。

# LaunchProfilesCollectionIsNotAJsonObject
source: The 'profiles' property of the launch settings document is not a JSON object.
cs: Vlastnost profiles v dokumentu nastavení spuštění není objektem JSON.
de: Die Eigenschaft "Profile" des Starteigenschaftendokuments ist kein JSON-Objekt.
es: La propiedad "profiles" del documento de configuración de inicio no es un objeto JSON.
fr: La propriété 'profiles' du document de paramètres de lancement n'est pas un objet JSON.
it: La proprietà 'profiles' del documento delle impostazioni di avvio non è un oggetto JSON.
ja: 起動設定のドキュメントの 'profiles' プロパティが JSON オブジェクトではありません。
ko: 시작 설정 문서의 '프로필' 속성이 JSON 개체가 아닙니다.
pl: Właściwość „profiles” dokumentu ustawień uruchamiania nie jest obiektem JSON.
pt_br: A propriedade 'perfis' do documento de configurações de inicialização não é um objeto JSON.
ru: Свойство "profiles" документа параметров запуска не является объектом JSON.
tr: Başlatma ayarları belgesinin 'profiles' özelliği bir JSON nesnesi değil.
zh_hans: 启动设置文档的“profiles”属性不是 JSON 对象。
zh_hant: 啟動設定文件的 'profiles' 屬性並非 JSON 物件。

# ListAppFullName
source: List all projects in a solution file.
cs: Vypíše seznam všech projektů v souboru řešení.
de: Listet alle Projekte in einer Projektmappendatei auf.
es: Enumera todos los proyectos de la solución.
fr: Listez tous les projets d'un fichier solution.
it: Elenca tutti i progetti presenti in un file di soluzione.
ja: ソリューション ファイル内のすべてのプロジェクトを一覧表示します。
ko: 솔루션 파일의 프로젝트를 모두 나열합니다.
pl: Wyświetl listę wszystkich projektów w pliku rozwiązania.
pt_br: Listar todos os projetos em um arquivo de solução.
ru: Вывод списка всех проектов в файле решения.
tr: Bir çözüm dosyasındaki tüm projeleri listeler.
zh_hans: 列出解决方案文件中的所有项目。
zh_hant: 列出解決方案檔中的所有專案。

# ListSolutionFoldersArgumentDescription
source: Display solution folder paths.
cs: Zobrazí cesty ke složkám řešení.
de: Projektmappenordnerpfade anzeigen.
es: Muestra las rutas de acceso de la carpeta de la solución.
fr: Afficher les chemins d'accès aux dossiers de solutions.
it: Visualizza i percorsi della cartella della soluzione.
ja: ソリューション フォルダーのパスを表示します。
ko: 솔루션 폴더 경로를 표시합니다.
pl: Wyświetl ścieżki folderów rozwiązania.
pt_br: Exibir caminhos de pasta da solução.
ru: Отображение путей к папке решения.
tr: Çözüm klasörü yollarını görüntüleyin.
zh_hans: 显示解决方案文件夹路径。
zh_hant: 顯示解決方案資料夾路徑。

# ListToolCommandInvalidGlobalAndLocalAndToolPath
source: The local option(--local), the global option (--global), the tool path option (--tool-path), can only have one at a time. Specify only one of the options: {0}.
cs: Možnost local (--local), možnost global (--global), možnost tool path (--tool-path), v jednu chvíli je možné mít jen jednu. Zadejte jen jednu z možností: {0}
de: Die lokale Option (--local), die globale Option (--global) und die Toolpfadoption (--tool-path) können nicht zusammen angegeben werden. Geben Sie nur eine der Optionen an: {0}.
es: La opción local (--local), la opción global (--global) y la opción de ruta de acceso de herramienta (--tool-path), solo pueden estar una cada vez. Especifique solo una de las opciones: {0}.
fr: L'option locale (--local), l'option globale (--global) et l'option de chemin d'outil (--tool-path) ne peuvent pas être utilisées simultanément. Spécifiez une seule des options : {0}.
it: Le opzioni locale (--local), globale (--global) e del percorso dello strumento (--tool-path) non possono essere specificate contemporaneamente. Specificare una sola di queste opzioni: {0}.
ja: ローカル オプション (--local)、グローバル オプション (--global)、ツール パス オプション (--tool-path) は、一度に 1 つだけ指定できます。オプションを 1 つだけ指定します: {0}。
ko: 로컬 옵션(--local), 전역 옵션(--global), 도구 경로 옵션(--tool-path)은 한 번에 하나씩만 사용할 수 있습니다. {0} 옵션 중에서 하나만 지정하세요.
pl: Można określić tylko jedną opcję jednocześnie: opcję lokalną (--local), opcję globalną (--global) lub opcję ścieżki do narzędzia (--tool-path). Podaj tylko jedną z opcji: {0}.
pt_br: As opções local (--local), global (--global) e do caminho da ferramenta (--tool-path) só podem ocorrer uma por vez. Especifique apenas uma das opções: {0}.
ru: Локальный параметр (--local), глобальный параметр (--global) и параметр пути к средству (--tool-path) можно использовать только отдельно друг от друга. Укажите только один из этих параметров: {0}.
tr: Yerel seçeneği (--local), genel seçeneği (--global), araç yolu seçeneği (--tool-path) arasından yalnızca biri seçilebilir. Seçeneklerden yalnızca birini belirtin: {0}.
zh_hans: 本地选项(--local)、全局选项(--global)和工具路径选项(--tool-path)一次只能有一个。请仅指定其中一个选项: {0}。
zh_hant: 一次只能有一個本機選項 (--local)、全域選項 (--global)、工具路徑選項 (--tool-path)。請僅指定其中一個選項: {0}。

# LocalOptionDoesNotSupportFrameworkOption
source: The local option(--local) does not support the framework option (--framework).
cs: Možnost local (--local) nepodporuje možnost framework (--framework).
de: Die lokale Option (--local) unterstützt nicht die Frameworkoption (--framework).
es: La opción local (--local) no admite la opción de marco de trabajo (--framework).
fr: L'option locale (--local) ne prend pas en charge l'option de framework (--framework).
it: L'opzione local (--local) non supporta l'opzione framework (--framework).
ja: ローカル オプション (--local) は、フレームワーク オプション (--framework) をサポートしていません。
ko: 로컬 옵션(--local)은 프레임워크 옵션(--framework)을 지원하지 않습니다.
pl: Opcja lokalna (--local) nie obsługuje opcji struktury (--framework).
pt_br: A opção local (--local) não dá suporte à opção de estrutura (--framework).
ru: Локальный параметр (--local) не поддерживает параметр платформы (--framework).
tr: Yerel seçeneği (--local) çerçeve seçeneğini (--framework) desteklemez.
zh_hans: 本地选项(--local)不支持框架选项(--framework)。
zh_hant: 本機選項 (--local) 並不支援架構選項 (-framework)。

# LocalToolInstallationSucceeded
source: You can invoke the tool from this directory using the following commands: 'dotnet tool run {0}' or 'dotnet {0}'. Tool '{1}' (version '{2}') was successfully installed. Entry is added to the manifest file {3}.
cs: Nástroj můžete z tohoto adresáře zavolat pomocí těchto příkazů: dotnet tool run {0} nebo dotnet {0}. Nástroj {1} (verze {2}) se úspěšně nainstaloval. Do souboru manifestu {3} se přidala položka.
de: Sie können das Tool aus diesem Verzeichnis mit den folgenden Befehlen aufrufen: "dotnet tool run {0}" oder "dotnet {0}". Das Tool "{1}" (Version {2}) wurde erfolgreich installiert. Der Eintrag wird der Manifestdatei "{3}" hinzugefügt.
es: Puede invocar la herramienta desde este directorio con los comandos siguientes: "dotnet tool run {0}" o "dotnet {0}". La herramienta "{1}" (versión "{2}") se instaló correctamente. Se ha agregado la entrada al archivo de manifiesto {3}.
fr: Vous pouvez appeler l'outil à partir de ce répertoire à l'aide des commandes suivantes : 'dotnet tool run {0}' ou 'dotnet {0}'. L'outil '{1}' (version '{2}') a été correctement installé. L'entrée est ajoutée au fichier manifeste {3}.
it: È possibile richiamare lo strumento da questa directory usando i comandi seguenti: 'dotnet tool run {0}' o 'dotnet {0}'. Lo strumento '{1}' versione '{2}' è stato installato. La voce è stata aggiunta al file manifesto {3}.
ja: 次のコマンドを使用してこのディレクトリからツールを呼び出すことができます: 'dotnet tool run {0}' または 'dotnet {0}'。 ツール '{1}' (バージョン '{2}') が正常にインストールされました。マニフェスト ファイル {3} にエントリが追加されました。
ko: 'dotnet tool run {0}' 또는 'dotnet {0}' 명령을 사용하여 이 디렉터리에서 도구를 호출할 수 있습니다. '{1}' 도구(버전 '{2}')가 설치되었습니다. 매니페스트 파일 {3}에 항목이 추가됩니다.
pl: Możesz wywołać narzędzie z tego katalogu przy użyciu następujących poleceń: „dotnet tool run {0}” lub „dotnet {0}”. Narzędzie „{1}” (wersja „{2}”) zostało pomyślnie zainstalowane. Wpis zostanie dodany do pliku manifestu {3}.
pt_br: Você pode invocar a ferramenta deste diretório usando os comandos a seguir: 'dotnet tool run {0}' ou 'dotnet {0}'. A ferramenta '{1}' (versão '{2}') foi instalada com êxito. A entrada foi adicionada ao arquivo de manifesto {3}.
ru: Вы можете вызвать средство из этого каталога с помощью следующих команд: "dotnet tool run {0}" или "dotnet {0}". Средство "{1}" (версия "{2}") успешно установлено. В файл манифеста {3} добавлена запись.
tr: Şu komutları kullanarak aracı bu dizinden çağırabilirsiniz: 'dotnet tool run {0}' veya 'dotnet {0}'. '{1}' aracı (sürüm '{2}') başarıyla yüklendi. Giriş {3} bildirim dosyasına eklendi.
zh_hans: 你可以使用以下命令从此目录调用工具: "dotnet tool run {0}" 或 "dotnet {0}"。 工具“{1}”(版本“{2}”)已成功安装。条目将添加到清单文件 {3} 中。
zh_hant: 您可使用下列命令，從此目錄叫用工具: 'dotnet tool run {0}' 或 'dotnet {0}'。 已成功安裝工具 '{1}' (版本 '{2}')。項目已新增至資訊清單檔 {3}。

# LocalToolsRestoreWasSuccessful
source: Restore was successful.
cs: Obnovení proběhlo úspěšně.
de: Die Wiederherstellung war erfolgreich.
es: Restauración realizada correctamente.
fr: La restauration a réussi.
it: Il ripristino è riuscito.
ja: 正常に復元されました。
ko: 복원했습니다.
pl: Przywracanie zakończyło się pomyślnie.
pt_br: A restauração foi bem-sucedida.
ru: Восстановление выполнено успешно.
tr: Geri yükleme başarılı oldu.
zh_hans: 还原成功。
zh_hant: 還原已成功。

# MSBuildEvaluationResult_Error_NoProjectFound
source: No project was found at the path: {0}.
cs: Žádný projekt se nepodařilo najít v cestě: {0}.
de: Im Pfad wurde kein Projekt gefunden: {0}.
es: No se encontró ningún proyecto en la ruta de acceso: {0}.
fr: Aucun projet n’a été trouvé dans le chemin d’accès : {0}.
it: Nessun progetto trovato nel percorso: {0}.
ja: パスにプロジェクトが見つかりませんでした: {0}。
ko: 경로 {0}에서 프로젝트를 찾을 수 없습니다.
pl: Nie znaleziono projektu w ścieżce: {0}.
pt_br: Nenhum projeto foi encontrado no caminho: {0}.
ru: Не удалось найти проект по пути: {0}.
tr: Yolda proje bulunamadı: {0}.
zh_hans: 在以下路径找不到项目: {0}。
zh_hant: 在路徑 {0} 中找不到任何專案。

# MSBuildEvaluationResult_Error_NotRestored
source: {0} is not restored.
cs: {0} se neobnovil.
de: {0} ist nicht wiederhergestellt.
es: {0} no se ha restaurado.
fr: {0} n’est pas restauré.
it: {0} non viene ripristinato.
ja: {0} は復元されません。
ko: {0}은(는) 복원되지 않습니다.
pl: {0} nie został przywrócony.
pt_br: {0} não restaurado.
ru: Восстановление {0} не выполнено.
tr: {0} geri yüklenmez.
zh_hans: 未还原 {0}。
zh_hant: {0} 未還原。

# MSBuildEvaluator_Error_NoTargetFramework
source: Project '{0}' is a SDK-style project, but does not specify the framework.
cs: Projekt {0} je projekt ve stylu sady SDK, ale neurčuje architekturu.
de: Das Projekt „{0}“ ist ein SDK-Projekt, gibt jedoch das Framework nicht an.
es: El proyecto "{0}" es un proyecto de estilo SDK, pero no especifica el marco.
fr: Project '{0}' est un projet de style de Kit de développement logiciel (SDK), mais ne spécifie pas le cadre.
it: Project '{0}' è un progetto di tipo SDK, ma non specifica il framework.
ja: プロジェクト '{0}' は SDK スタイルのプロジェクトですが、フレームワークが指定されていません。
ko: 프로젝트 '{0}'은(는) SDK 스타일 프로젝트이지만 프레임워크를 지정하지 않습니다.
pl: Projekt „{0}” jest projektem w stylu zestawu SDK, ale nie określa struktury.
pt_br: O projeto “{0}” é um projeto no estilo SDK, mas não especifica a estrutura.
ru: Проект "{0}" является проектом в стиле SDK, но не указывает платформу.
tr: '{0}' projesi SDK stili bir projedir, ancak çerçeveyi belirtmez.
zh_hans: 项目“{0}”是 SDK 样式的项目，但未指定框架。
zh_hant: 專案 '{0}' 是 SDK 樣式專案，但未指定架構。

# MSBuildOptionDescription
source: Shut down the MSBuild build server.
cs: Vypne buildovací server MSBuild.
de: Hiermit wird der MSBuild-Buildserver heruntergefahren.
es: Apaga el servidor de compilación de MSBuild.
fr: Arrêtez le serveur de builds MSBuild.
it: Arresta il server di compilazione di MSBuild.
ja: MSBuild ビルド サーバーをシャットダウンします。
ko: MSBuild 빌드 서버를 종료합니다.
pl: Zamknij serwer kompilacji MSBuild.
pt_br: Desligar o servidor de build do MSBuild.
ru: Завершает работу сервера сборки MSBuild.
tr: MSBuild derleme sunucusunu kapatır.
zh_hans: 关闭 MSBuild 生成服务器。
zh_hant: 關閉 MSBuild 組建伺服器。

# MaintenanceMessage
source: .NET {0} is going out of support soon.
cs: Rozhraní .NET {0} se zanedlouho přestane podporovat.
de: Die Unterstützung von .NET {0} läuft in Kürze aus.
es: .NET {0} se quedará sin soporte técnico en breve.
fr: .NET {0} ne sera bientôt plus pris en charge.
it: A breve il supporto per .NET {0} verrà dismesso.
ja: .NET {0} のサポートは間もなく終了します。
ko: .NET {0}은(는) 곧 지원이 중단됩니다.
pl: Platforma .NET {0} wkrótce przestanie być wspierana.
pt_br: Em breve, não haverá mais suporte para o .NET {0}.
ru: Поддержка .NET {0} в ближайшей мере будет прекращена.
tr: .NET {0} desteği yakında kaldırılacak.
zh_hans: .NET {0} 即将结束支持。
zh_hant: .NET {0} 即將不再支援。

# ManifestFileColumn
source: Manifest
es: Manifiesto
fr: Manifeste
it: Manifesto
ja: マニフェスト
ko: 매니페스트
pt_br: Manifesto
ru: Манифест
tr: Bildirim
zh_hans: 清单
zh_hant: 資訊清單

# ManifestMsiNotFoundInNuGetPackage
source: Manifest MSI not found in NuGet package {0}
cs: Instalační služba MSI manifestu se nenašla v balíčku NuGet {0}.
de: Manifest-MSI wurde im NuGet-Paket {0} nicht gefunden.
es: No se encontró el MSI del manifiesto en el paquete NuGet {0}
fr: MSI de manifeste introuvable dans le package NuGet {0}
it: L'identità del servizio gestita del manifesto non è stata trovata nel pacchetto NuGet {0}
ja: NuGet パッケージ {0} にマニフェスト MSI が見つかりません
ko: NuGet 패키지 {0}에서 매니페스트 MSI를 찾을 수 없습니다.
pl: Nie znaleziono pliku MSI manifestu w pakiecie NuGet {0}
pt_br: MSI do manifesto não encontrado no pacote NuGet {0}
ru: MSI манифеста не найден в пакете NuGet {0}
tr: {0} NuGet paketinde bildirim MSI'sı bulunamadı
zh_hans: 在 NuGet 包 {0} 中找不到清单 MSI
zh_hant: 在 NuGet 套件 {0} 中找不到資訊清單 MSI

# ManifestOptionDescription
source: The path to a target manifest file that contains the list of packages to be excluded from the publish step.
cs: Cesta k cílovému souboru manifestu obsahujícímu seznam balíčků, které se mají vyloučit z kroku publikování
de: Der Pfad zu einer Zielmanifestdatei, die die Liste der von der Veröffentlichung auszuschließenden Pakete enthält.
es: La ruta de acceso a un archivo de manifiesto de destino que contiene la lista de paquetes que se excluirán del paso de publicación.
fr: Chemin d'un fichier manifeste cible contenant la liste des packages à exclure de l'étape de publication.
it: Percorso di un file manifesto di destinazione che contiene l'elenco di pacchetti da escludere dal passaggio di pubblicazione.
ja: 公開ステップから除外されるパッケージのリストを含むターゲット マニフェスト ファイルへのパス。
ko: 게시 단계에서 제외할 패키지 목록이 들어 있는 대상 매니페스트 파일의 경로입니다.
pl: Ścieżka do docelowego pliku manifestu zawierającego listę pakietów, które mają zostać wykluczone z kroku publikowania.
pt_br: O caminho para um arquivo de manifesto de destino que contém a lista de pacotes a serem excluídos da etapa de publicação.
ru: Путь к целевому файлу манифеста, содержащему список пакетов, исключаемых из публикации.
tr: Yayımlama adımının dışında tutulacak paketlerin listesini içeren bir hedef bildirim dosyasının yolu.
zh_hans: 指向目标清单文件的路径，该文件包含要通过发布步骤执行的包的列表。
zh_hant: 目標資訊清單檔案的路徑，其包含要從發佈步驟中排除的套件清單。

# ManifestPackageUrlNotResolved
source: Manifest package not resolved. Manifest package or URL for {0} doesn't exist.
cs: Balíček manifestu nebyl přeložen. Balíček manifestu nebo adresa URL pro {0} neexistuje.
de: Das Manifestpaket wurde nicht aufgelöst. Das Manifestpaket oder die URL für {0} ist nicht vorhanden.
es: Paquete de manifiesto no resuelto. El paquete de manifiesto o la dirección URL de {0} no existe.
fr: Package de manifeste non résolu. Le package ou l’URL du manifeste pour {0} n’existe pas.
it: Pacchetto manifesto non risolto. L'URL o il pacchetto manifesto per {0} non esiste.
ja: マニフェスト パッケージが解決されていません。{0} のマニフェスト パッケージまたは URL が存在しません。
ko: 매니페스트 패키지가 해결되지 않았습니다. {0}에 대한 매니페스트 패키지 또는 URL이 존재하지 않습니다.
pl: Pakiet manifestu nie został rozpoznany. Pakiet manifestu lub adres URL {0} nie istnieje.
pt_br: Pacote de manifesto não resolvido. O pacote de manifesto ou a URL para {0} não existe.
ru: Пакет манифеста не разрешен. Пакет манифеста или URL-адрес для {0} не существует.
tr: Bildirim paketi çözümlenmedi. {0} için bildirim paketi veya URL yok.
zh_hans: 未解析清单包。{0} 的清单包或 URL 不存在。
zh_hant: 未解析資訊清單封裝。{0} 的資訊清單套件或 URL 不存在。

# MigrateAppFullName
source: Generate a .slnx file from a .sln file.
cs: Vygenerujte soubor .slnx ze souboru .sln.
de: Generieren Sie eine SLNX-Datei aus einer SLN-Datei.
es: Generar un archivo .slnx a partir de un archivo .sln.
fr: Générez un fichier .slnx à partir d’un fichier .sln.
it: Genera un file .slnx da un file .sln.
ja: .sln ファイルから .slnx ファイルを生成します。
ko: .sln 파일에서 .slnx 파일을 생성합니다.
pl: Wygeneruj plik .slnx na podstawie pliku .sln.
pt_br: Gere um arquivo .slnx de um arquivo .sln.
ru: Сгенерировать файл .slnx на основе файла .sln.
tr: Bir .sln dosyasından .slnx dosyası oluştur.
zh_hans: 根据 .sln 文件生成 .slnx 文件。
zh_hant: 從 .sln 檔案產生 .slnx 檔案。

# MinimumExpectedTestsPolicyViolation
source: Minimum expected tests policy violation, tests ran {0}, minimum expected {1}
cs: Minimální očekávané porušení zásad testů, spuštěné testy: {0}, očekávané minimum: {1}
de: Mindestens erwartete Testrichtlinienverletzung, {0} Tests wurden ausgeführt, mindestens erwartet: {1}
es: Infracción de directiva de pruebas mínimas esperadas, pruebas ejecutadas {0}, mínimas esperadas {1}
fr: Violation de stratégie de tests minimale attendue, tests exécutés {0}, minimum attendu {1}
it: Violazione minima dei criteri di test previsti, test eseguiti {0}, minimo previsto {1}
ja: 予想されるテストの最小ポリシー違反、テストの実行数 {0} 件、予想される最小数 {1} 件
ko: 예상되는 최소 테스트 정책 위반, 테스트 실행 {0}, 필요한 최소 {1}
pl: Minimalne oczekiwane naruszenie zasad testów, uruchomione testy: {0}, oczekiwane minimum: {1}
pt_br: Violação de política de testes mínimos esperados, {0} testes executados, mínimo esperado {1}
ru: Нарушение политики минимального ожидаемого числа тестов. Выполнено тестов: {0}, ожидаемый минимум: {1}
tr: Beklenen minimum test ilke ihlali, yürütülen test: {0}, beklenen minimum test: {1}
zh_hans: 最低预期测试策略冲突，测试已运行 {0} 次，最低预期 {1} 次
zh_hant: 預期測試原則違反的最小值，{0} 個執行的測試，預期的最小值為 {1}

# MissingDirectiveName
source: Missing name of '{0}' at {1}.
cs: Chybí název pro {0} v {1}.
de: Fehlender Name von "{0}" bei "{1}".
es: Falta el nombre de "{0}" en {1}.
fr: Nom manquant pour « {0} » à {1}.
it: Nome mancante di '{0}' in {1}.
ja: {1} に ' {0}' の名前がありません。
ko: {1}에 ' {0}'의 이름이 없습니다.
pl: Brak nazwy „{0}” w {1}.
pt_br: Nome de "{0}" ausente em {1}.
ru: В {1} отсутствует имя "{0}".
tr: {1} konumunda '{0}' paketinin adı eksik.
zh_hans: 缺少 {1} 处 ‘{0}’ 的名称。
zh_hant: 缺少位於 {1} 的 '{0}' 名稱。

# MsBuildDefinition
source: Run Microsoft Build Engine (MSBuild) commands.
cs: Spustí příkazy MSBuild (Microsoft Build Engine).
de: Hiermit werden Befehle der Microsoft-Build-Engine (MSBuild) ausgeführt.
es: Ejecuta comandos de Microsoft Build Engine (MSBuild).
fr: Exécutez des commandes MSBuild (Microsoft Build Engine).
it: Esegue i comandi di Microsoft Build Engine (MSBuild).
ja: Microsoft Build Engine (MSBuild) コマンドを実行します。
ko: Microsoft Build Engine(MSBuild) 명령을 실행합니다.
pl: Uruchom polecenia aparatu Microsoft Build Engine (MSBuild).
pt_br: Executar comandos do MSBuild (Microsoft Build Engine).
ru: Выполнение команд Microsoft Build Engine (MSBuild).
tr: Microsoft Build Engine (MSBuild) komutlarını çalıştırır.
zh_hans: 运行 Microsoft 生成引擎(MSBuild)命令。
zh_hant: 執行 Microsoft Build Engine (MSBuild) 命令。

# MsiProgressInstall
source: Installing {0}
cs: Instaluje se {0}.
de: {0} wird installiert
es: Instalando {0}
fr: Installation en cours de {0}
it: Installazione di {0}
ja: {0} をインストールしています
ko: {0} 설치 중
pl: Instalowanie {0}
pt_br: Instalando {0}
ru: Установка {0}
tr: {0} yükleniyor
zh_hans: 正在安装 {0}
zh_hant: 安裝 {0}

# MsiProgressRepair
source: Repairing {0}
cs: Opravuje se {0}
de: {0} wird repariert
es: Reparando {0}
fr: Réparation de {0}
it: Ripristino di {0}
ja: {0} を修復しています
ko: {0} 복구 중
pl: Naprawianie {0}
pt_br: Reparando {0}
ru: Восстановление {0}
tr: {0} onarılıyor
zh_hans: 修复 {0}
zh_hant: 修復 {0}

# MsiProgressUninstall
source: Removing {0}
cs: Odebírání {0}.
de: {0} wird entfernt
es: Quitando {0}
fr: Suppression de {0}
it: Rimozione di {0}
ja: {0} を削除しています
ko: {0} 제거 중
pl: Usuwanie {0}
pt_br: Removendo {0}
ru: Идет удаление {0}
tr: {0} kaldırılıyor
zh_hans: 正在删除 {0}
zh_hant: 正在移除 {0}

# MultipleProjectsEvaluationResult_Error
source: Multiple projects found: {0}.
cs: Našlo se více projektů: {0}.
de: Mehrere Projekte gefunden: {0}.
es: Se encontraron varios proyectos: {0}.
fr: Plusieurs projets trouvés : {0}
it: Sono stati trovati più progetti: {0}.
ja: 複数のプロジェクトが見つかりました: {0}。
ko: 여러 프로젝트를 찾았습니다: {0}.
pl: Znaleziono wiele projektów: {0}.
pt_br: Vários projetos encontrados: {0}.
ru: Найдено несколько проектов: {0}
tr: Birden çok proje bulundu: {0}.
zh_hans: 找到多个项目: {0}。
zh_hant: 找到多個專案: {0}。

# NameColumnHeader
source: Name
cs: Název
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
pl: Nazwa
pt_br: Nome
ru: Имя
tr: Ad
zh_hans: 名称
zh_hant: 名稱
