Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ProjectCapabilityConstraintFactory_Exception_EvaluationFailed
source: Failed to create constraint '{0}': failed to evaluate the project: {1}
cs: Nepovedlo se vytvořit omezení {0}: Nepovedlo se vyhodnotit projekt: {1}
de: Fehler beim Erstellen der Einschränkung '{0}': Fehler beim Auswerten des Projekts: {1}
es: Error en la creación de la restricción "{0}": no se pudo evaluar el proyecto: {1}
fr: Nous n’avons pas pu créer la contrainte '{0}' : échec de l’évaluation du projet : {1}.
it: Non è stato possibile creare il vincolo '{0}': impossibile valutare il progetto: {1}
ja: 制約 '{0}' を作成できませんでした: プロジェクトを評価できませんでした: {1}
ko: 제약 조건 '{0}' 생성 실패: 프로젝트 평가 실패: {1}
pl: Nie można utworzyć ograniczenia „{0}”: nie można ocenić projektu: {1}
pt_br: Falha ao criar a restrição “{0}”: falha ao avaliar o projeto: {1}
ru: Не удалось создать ограничение "{0}": не удалось оценить проект: {1}
tr: '{0}' kısıtlaması oluşturulamadı: proje değerlendirilemedi: {1}
zh_hans: 未能创建约束“{0}”: 未能评估项目: {1}
zh_hant: 無法建立限制式 '{0}': 無法評估專案: {1}

# ProjectCapabilityConstraintFactory_Exception_NoEvaluator
source: Failed to create constraint '{0}': {1} component is not available.
cs: Nepovedlo se vytvořit omezení {0}: Komponenta {1} není k dispozici.
de: Fehler beim Erstellen der Einschränkung '{0}': {1} Komponente ist nicht verfügbar.
es: Error en la creación de la restricción "{0}": {1} componente no está disponible.
fr: Nous n’avons pas pu créer la '{0}' de contrainte : {1} le composant n’est pas disponible.
it: Non è stato possibile creare il vincolo '{0}': {1} componente non è disponibile.
ja: 制約 '{0}' を作成できませんでした: {1} コンポーネントは使用できません。
ko: 제약 조건 '{0}' 생성 실패: {1} 구성 요소를 사용할 수 없습니다.
pl: Nie można utworzyć ograniczenia „{0}”: składnik {1} jest niedostępny.
pt_br: Falha ao criar a restrição “{0}”: {1} componente não está disponível.
ru: Не удалось создать ограничение "{0}": компонент {1} недоступен.
tr: '{0}' kısıtlaması oluşturulamadı: {1} bileşeni kullanılamıyor.
zh_hans: 未能创建约束“{0}”: {1} 组件不可用。
zh_hant: 無法建立限制式 '{0}': {1} 元件無法使用。

# ProjectCapabilityConstraint_DisplayName
source: Project capabilities
cs: Možnosti projektu
de: Projektfunktionen
es: Capacidades del proyecto
fr: Fonctionnalités de projet
it: Funzionalità del progetto
ja: プロジェクトの機能
ko: 프로젝트 기능
pl: Możliwości projektu
pt_br: Funcionalidades do projeto
ru: Возможности проекта
tr: Proje yetenekleri
zh_hans: 项目功能
zh_hant: 專案功能

# ProjectCapabilityConstraint_Error_ArgumentShouldBeString
source: argument should be a string
cs: argument musí být řetězec
de: das Argument muss eine Zeichenfolge sein
es: el argumento debe ser una cadena
fr: l’argument doit être une chaîne.
it: l'argomento deve essere una stringa
ja: 引数を文字列にしなければなりません
ko: 인수는 문자열이어야 합니다.
pl: argument powinien być ciągiem
pt_br: o argumento deve ser uma cadeia de caracteres
ru: аргумент должен быть строкой
tr: bağımsız değişken bir dize olmalıdır
zh_hans: 参数应为字符串
zh_hant: 引數應為字串

# ProjectCapabilityConstraint_Error_ArgumentShouldNotBeEmpty
source: arguments should not contain empty values
cs: argumenty by neměly obsahovat prázdné hodnoty
de: Argumente dürfen keine leeren Werte enthalten.
es: los argumentos no deben contener valores vacíos
fr: les arguments ne doivent pas contenir de valeurs vides.
it: gli argomenti non devono contenere valori vuoti
ja: 引数に空の値を含めることはできません
ko: 인수에는 빈 값이 포함되어서는 안 됩니다.
pl: argumenty nie powinny zawierać pustych wartości
pt_br: argumentos não devem conter valores vazios
ru: аргументы не должны содержать пустые значения
tr: bağımsız değişkenler boş değer içeremez
zh_hans: 参数不应包含空值
zh_hant: 引數不應包含空白值

# ProjectCapabilityConstraint_Error_InvalidConstraintConfiguration
source: Invalid constraint configuration
cs: Neplatná konfigurace omezení
de: Ungültige Einschränkungskonfiguration
es: Configuración de restricción no válida
fr: Configuration de contrainte non valide
it: Configurazione vincolo non valida
ja: 制約の構成が無効です
ko: 잘못된 제약 조건 구성
pl: Nieprawidłowa konfiguracja ograniczenia
pt_br: Configuração de restrição inválida
ru: Недопустимая конфигурация ограничения
tr: Geçersiz kısıtlama yapılandırması
zh_hans: 约束配置无效
zh_hant: 限制式設定無效

# ProjectCapabilityConstraint_Error_InvalidJson
source: invalid JSON
cs: neplatný JSON
de: ungültiges JSON
es: JSON no válido
fr: JSON non valide
it: JSON non valido
ja: 無効な JSON
ko: 잘못된 JSON
pl: Nieprawidłowy kod JSON
pt_br: JSON inválido
ru: Недопустимый JSON
tr: geçersiz JSON
zh_hans: JSON 无效
zh_hant: JSON 無效

# ProjectCapabilityConstraint_Restricted_EvaluationFailed_Message
source: Failed to evaluate project context: {0}
cs: Nepovedlo se vyhodnotit kontext projektu: {0}
de: Fehler beim Auswerten des Projektkontexts: {0}
es: No se pudo evaluar el contexto del proyecto: {0}
fr: Nous n’avons pas pu évaluer le contexte du projet : {0}.
it: Non è stato possibile valutare il contesto del progetto: {0}
ja: プロジェクト コンテキストを評価できませんでした: {0}
ko: 프로젝트 컨텍스트 평가 실패: {0}
pl: Nie można ocenić kontekstu projektu: {0}
pt_br: Falha ao avaliar o contexto do projeto: {0}
ru: Не удалось оценить контекст проекта: {0}
tr: Proje bağlamı değerlendirilemedi: {0}
zh_hans: 未能评估项目上下文: {0}
zh_hant: 無法評估專案內容: {0}

# ProjectCapabilityConstraint_Restricted_Message
source: The template needs project capability '{0}', and current project ({1}) does not satisfy it.
cs: Šablona potřebuje schopnost projektu {0} a aktuální projekt ({1}) ji nesplňuje.
de: Die Vorlage benötigt die Projektfunktion '{0}', und das aktuelle Projekt ({1}) erfüllt sie nicht.
es: La plantilla necesita una capacidad de proyecto "{0}" y el proyecto actual ({1}) no lo satisface.
fr: Le modèle a besoin d’une fonctionnalité de projet '{0}', et le projet actuel ({1}) ne le satisfait pas.
it: Il modello richiede la funzionalità '{0}' del progetto e il progetto corrente ({1}) non la soddisfa.
ja: テンプレートにはプロジェクト機能 '{0}' が必要ですが、現在のプロジェクト ({1}) はこの機能を満たしていません。
ko: 템플릿에 프로젝트 기능 '{0}'이(가) 필요하며 현재 프로젝트({1})가 이를 충족하지 않습니다.
pl: Szablon wymaga możliwości projektu „{0}”, a bieżący projekt ({1}) ich nie spełnia.
pt_br: O modelo precisa de recursos de projeto “{0}” e o projeto atual ({1}) não o satisfaz.
ru: Шаблону требуются возможность проекта "{0}", а текущий проект ({1}) не соответствует этому условию.
tr: Şablon, '{0}' proje özelliğine ihtiyaç duyar ve geçerli proje ({1}) bunu karşılamaz.
zh_hans: 模板需要项目功能“{0}”，而当前项目({1})不满足它的条件。
zh_hant: 範本需要專案功能 '{0}'，但目前的專案 ({1}) 無法滿足。

# ProjectCapabilityConstraint_Restricted_MultipleProjectsFound_CTA
source: Specify the project to use using {0} option.
cs: Zadejte projekt, který se má použít s možností {0}.
de: Geben Sie das Projekt an, das mit {0} Option verwendet werden soll.
es: Especifique el proyecto que se va a usar mediante la opción {0}.
fr: Spécifiez le projet à utiliser à l’aide de {0} option.
it: Specificare il progetto da utilizzare usando l'opzione {0}.
ja: {0} オプションを使用して、使用するプロジェクトを指定してください。
ko: {0} 옵션을 사용하여 사용할 프로젝트를 지정합니다.
pl: Określ projekt do użycia przy użyciu opcji {0}.
pt_br: Especifique o projeto a ser usado com a opção {0}.
ru: Укажите проект для использования с помощью параметра {0}.
tr: {0} seçeneği aracılığıyla kullanılacak projeyi belirtin.
zh_hans: 指定要使用 {0} 选项的项目。
zh_hant: 指定要使用 {0} 選項的專案。

# ProjectCapabilityConstraint_Restricted_NoProjectFound_CTA
source: This template can only be created inside the project.
cs: Tuto šablonu je možné vytvořit jenom v rámci projektu.
de: Diese Vorlage kann nur innerhalb des Projekts erstellt werden.
es: Esta plantilla solo se puede crear dentro del proyecto.
fr: Ce modèle ne peut être créé qu’à l’intérieur du projet.
it: Questo modello può essere creato solo all'interno del progetto.
ja: このテンプレートはプロジェクト内でのみ作成できます。
ko: 이 템플릿은 프로젝트 내에서만 만들 수 있습니다.
pl: Ten szablon można utworzyć tylko wewnątrz projektu.
pt_br: Este modelo somente pode ser criado dentro do projeto.
ru: Этот шаблон можно создать только внутри проекта.
tr: Bu şablon yalnızca proje içinde oluşturulabilir.
zh_hans: 只能在项目内创建此模板。
zh_hant: 此範本只能在專案內建立。

# ProjectCapabilityConstraint_Restricted_NonSDKStyle_Message
source: The project {0} is not an SDK style project, and is not supported for evaluation. It is only possible to use this template with SDK-style projects.
cs: Projekt {0} není projekt ve stylu sady SDK a není podporován pro hodnocení. Tuto šablonu je možné použít jenom s projekty ve stylu sady SDK.
de: Das Projekt {0} ist kein SDK-Projekt und wird für die Auswertung nicht unterstützt. Diese Vorlage kann nur mit Projekten im SDK-Stil verwendet werden.
es: El proyecto {0} no es un proyecto de estilo SDK y no se admite para la evaluación. Solo es posible usar esta plantilla con proyectos de estilo SDK.
fr: Le projet {0} n’est pas un projet de style SDK et n’est pas pris en charge pour l’évaluation. Ce modèle ne peut être utilisé qu’avec des projets de style SDK.
it: Il progetto {0} non è un progetto di stile SDK e non è supportato per la valutazione. È possibile usare questo modello solo con progetti di tipo SDK.
ja: プロジェクト {0}は SDK スタイルのプロジェクトではないため、評価の対象としてサポートされていません。このテンプレートは SDK スタイルのプロジェクトでのみ使用できます。
ko: 프로젝트 {0}은(는) SDK 스타일 프로젝트가 아니며 평가가 지원되지 않습니다. 이 템플릿은 SDK 스타일 프로젝트에서만 사용할 수 있습니다.
pl: Projekt {0} nie jest projektem w stylu zestawu SDK i nie jest obsługiwany na potrzeby oceny. Tego szablonu można używać tylko z projektami w stylu zestawu SDK.
pt_br: O projeto {0} não é um projeto de estilo SDK e não tem suporte para avaliação. Só é possível usar este modelo com projetos no estilo SDK.
ru: Проект {0} не является проектом в стиле SDK и не поддерживается для оценки. Этот шаблон можно использовать только с проектами в стиле SDK.
tr: {0} projesi bir SDK stili proje değil ve değerlendirme için desteklenmiyor. Bu şablon yalnızca SDK stili projelerle kullanılabilir.
zh_hans: 项目 {0} 不是 SDK 样式项目，不支持评估。只能将此模板与 SDK 样式项目配合使用。
zh_hant: 專案 {0} 不是 SDK 樣式專案，因此不支援評估。此範本只能搭配 SDK 樣式專案使用。

# ProjectCapabilityConstraint_Restricted_NotRestored_CTA
source: Run 'dotnet restore {0}' to restore the project.
cs: Spuštěním příkazu dotnet restore {0} projekt obnovíte.
de: Führen Sie "dotnet restore {0}" aus, um das Projekt wiederherzustellen.
es: Ejecute "dotnet restore {0}" para restaurar el proyecto.
fr: Exécutez « dotnet restore {0} » pour restaurer le projet.
it: Eseguire 'dotnet restore {0}' per ripristinare il progetto.
ja: 'dotnet restore {0}' を実行してプロジェクトを復元します。
ko: 프로젝트를 복원하려면 'dotnet restore {0}'을(를) 실행하세요.
pl: Uruchom polecenie „dotnet restore {0}”, aby przywrócić projekt.
pt_br: Executar o “dotnet restore {0}” para restaurar o projeto.
ru: Выполните команду "dotnet restore {0}", чтобы восстановить проект.
tr: Projeyi geri yüklemek için 'dotnet restore {0}' komutunu çalıştırın.
zh_hans: 运行“dotnet restore {0}”以还原项目。
zh_hant: 執行 'dotnet restore {0}' 以還原專案。

# ProjectContextSymbolSource_DisplayName
source: Project context
cs: Kontext projektu
de: Projektkontext
es: Contexto del proyecto
fr: Contexte du projet
it: Contesto progetto
ja: プロジェクト コンテキスト
ko: 프로젝트 컨텍스트
pl: Kontekst projektu
pt_br: Contexto do projeto
ru: Контекст проекта
tr: Proje bağlamı
zh_hans: 项目上下文
zh_hant: 專案內容

# ProjectConvertAppFullName
source: Convert a file-based program to a project-based program.
cs: Umožňuje převést program na bázi souboru na program na bázi projektu.
de: Konvertieren Sie ein dateibasiertes Programm in ein projektbasiertes Programm.
es: Convertir un programa basado en archivos en un programa basado en proyecto.
fr: Convertissez un programme basé sur des fichiers en programme basé sur un projet.
it: Converti un programma basato su file in un programma basato su progetto.
ja: ファイルベースのプログラムをプロジェクトベースのプログラムに変換します。
ko: 파일 기반 프로그램을 프로젝트 기반 프로그램으로 변환합니다.
pl: Konwertuj program oparty na plikach na program oparty na projekcie.
pt_br: Converta um programa baseado em arquivo em um programa baseado em projeto.
ru: Преобразование программы на основе файла в программу на основе проекта.
tr: Dosya tabanlı bir programı proje tabanlı bir programa dönüştür.
zh_hans: 将基于文件的程序转换为基于项目的程序。
zh_hant: 將檔案型程式轉換成專案型程式。

# ProjectConvertAskForOutputDirectory
source: Specify the output directory ({0}):
cs: Zadejte výstupní adresář ({0}):
de: Ausgabeverzeichnis ({0}) angeben:
es: Especifique el directorio de salida ({0}):
fr: Spécifiez le répertoire de sortie ({0}) :
it: Specifica la directory di output ({0}):
ja: 出力ディレクトリ ({0}) を指定します:
ko: 출력 디렉터리 지정({0}):
pl: Określ katalog wyjściowy ({0}):
pt_br: Especificar o diretório de saída ({0}):
ru: Укажите выходной каталог ({0}):
tr: Çıkış dizinini belirtin ({0}):
zh_hans: 指定输出目录({0}):
zh_hant: 指定輸出目錄 ({0}):

# ProjectConvertDryRun
source: Determines changes without actually modifying the file system
cs: Určuje změny, aniž by ve skutečnosti měnil systém souborů.
de: Bestimmt Änderungen, ohne das Dateisystem tatsächlich zu ändern.
es: Determina los cambios sin modificar realmente el sistema de archivos
fr: Détermine les modifications sans réellement modifier le système de fichiers
it: Determina le modifiche senza modificare effettivamente il file system
ja: ファイル システムを実際に変更せずに変更を決定します
ko: 파일 시스템을 실제로 수정하지 않고 변경 내용을 결정합니다.
pl: Określa zmiany bez faktycznej modyfikacji systemu plików
pt_br: Determina alterações sem modificar o sistema de arquivos
ru: Определяет изменения, не внося фактических изменений в файловую систему
tr: Dosya sistemini gerçekten değiştirmeden değişiklikleri belirler
zh_hans: 确定更改但不实际修改文件系统
zh_hant: 確定變更而不實際修改檔案系統

# ProjectConvertWouldConvertFile
source: Dry run: would remove file-level directives from file: {0}
cs: Zkušební spuštění: odebere direktivy na úrovni souboru ze souboru: {0}
de: Probelauf. Anweisungen auf Dateiebene würden aus Datei entfernt: {0}
es: Simulación: se eliminarían las directivas a nivel de archivo del archivo {0}
fr: Test à blanc : supprimerait les directives de niveau fichier du fichier : {0}
it: Esecuzione di prova: rimuoverebbe le direttive a livello di file dal file: {0}
ja: ドライ ラン: ファイルからファイル レベルのディレクティブを削除します: {0}
ko: 시험 실행: 파일에서 파일 수준 지시문을 제거합니다. {0}
pl: Przebieg próbny: spowoduje usunięcie dyrektyw na poziomie pliku z pliku: {0}
pt_br: Execução de teste: diretivas de nível de arquivo a serem removidas do arquivo: {0}
ru: Пробный прогон: будут удалены директивы на уровне файла из файла: {0}
tr: Deneme çalıştırması: dosya düzeyindeki yönergeleri şu dosyadan kaldırıyor: {0}
zh_hans: 试运行: 将从文件 {0} 中移除文件级指令
zh_hant: 試執行: 將從檔案移除檔案層級指示詞: {0}

# ProjectConvertWouldCopyFile
source: Dry run: would copy file '{0}' to '{1}'.
cs: Zkušební spuštění: zkopíruje soubor {0} do {1}.
de: Probelauf. Datei „{0}“ würde nach „{1}“ kopiert.
es: Simulación: se copiaría el archivo "{0}" a "{1}".
fr: Test à blanc : copierait le fichier « {0} » vers « {1} ».
it: Esecuzione di prova: copierebbe il file '{0}' in '{1}'.
ja: ドライ ラン: ファイル '{0}' を '{1}' にコピーします。
ko: 시험 실행: '{0}' 파일을 '{1}'에 복사합니다.
pl: Przebieg próbny: spowoduje skopiowanie pliku „{0}” do „{1}”.
pt_br: Execução de teste: arquivo '{0}' a ser copiado para '{1}'.
ru: Пробный прогон: файл "{0}" будет скопирован в "{1}".
tr: Deneme çalıştırması: '{0}' dosyası '{1}' konumuna kopyalanıyor.
zh_hans: 试运行: 会将文件“{0}”复制到“{1}”。
zh_hant: 試執行: 將會把檔案 '{0}' 複製到 '{1}'。

# ProjectConvertWouldCreateDirectory
source: Dry run: would create directory: {0}
cs: Zkušební spuštění: vytvoří adresář: {0}
de: Probelauf. Verzeichnis würde erstellt: {0}
es: Simulación: se crearía el directorio {0}
fr: Test à blanc : création du répertoire : {0}
it: Esecuzione di prova: creerebbe la directory: {0}
ja: ドライ ラン: ディレクトリを作成します: {0}
ko: 시험 실행: 디렉터리를 만듭니다. {0}
pl: Przebieg próbny: spowoduje utworzenie katalogu: {0}
pt_br: Execução de teste: diretório a ser criado: {0}
ru: Пробный прогон: будет создан каталог: {0}
tr: Deneme çalıştırması: şu dizin oluşturuluyor: {0}
zh_hans: 试运行: 将创建目录: {0}
zh_hant: 試執行: 將會建立目錄: {0}

# ProjectConvertWouldCreateFile
source: Dry run: would create file: {0}
cs: Zkušební spuštění: vytvoří soubor: {0}
de: Probelauf. Datei würde erstellt: {0}
es: Simulación: se crearía el archivo {0}
fr: Test à blanc : création du fichier : {0}
it: Esecuzione di prova: creerebbe il file: {0}
ja: ドライ ラン: ファイルを作成します: {0}
ko: 시험 실행: 파일을 만듭니다. {0}
pl: Przebieg próbny: spowoduje utworzenie pliku: {0}
pt_br: Execução de teste: arquivo a ser criado: {0}
ru: Пробный прогон: будет создан файл: {0}
tr: Deneme çalıştırması: şu dosya oluşturuluyor: {0}
zh_hans: 试运行: 将创建文件: {0}
zh_hant: 試執行: 將會建立檔案: {0}

# ProjectConvertWouldDeleteFile
source: Dry run: would delete file: {0}
cs: Zkušební spuštění: odstraní soubor: {0}
de: Probelauf. Datei würde gelöscht: {0}
es: Simulación: se eliminaría el archivo {0}
fr: Test à blanc : supprimerait le fichier : {0}
it: Esecuzione di prova: eliminerebbe il file: {0}
ja: ドライ ラン: ファイルを削除します: {0}
ko: 시험 실행: 파일을 삭제합니다. {0}
pl: Przebieg próbny: spowoduje usunięcie pliku: {0}
pt_br: Execução de teste: arquivo a ser excluído: {0}
ru: Пробный прогон: будет удален файл: {0}
tr: Deneme çalıştırması: şu dosya siliniyor: {0}
zh_hans: 试运行: 将删除文件: {0}
zh_hant: 試執行: 將會刪除檔案: {0}

# ProjectConvertWouldMoveFile
source: Dry run: would move file '{0}' to '{1}'.
cs: Zkušební spuštění: přesune soubor {0} do {1}.
de: Probelauf. Datei „{0}“' würde nach „{1}“ verschoben.
es: Simulación: se movería el archivo "{0}" a "{1}".
fr: Test à blanc : déplacerait le fichier « {0} » vers « {1} ».
it: Esecuzione di prova: sposterebbe il file '{0}' in '{1}'.
ja: ドライ ラン: ファイル '{0}' を '{1}' に移動します。
ko: 시험 실행: '{0}' 파일을 '{1}'(으)로 이동합니다.
pl: Przebieg próbny: spowoduje przeniesienie pliku „{0}” do „{1}”.
pt_br: Execução de teste: arquivo '{0}' a ser movido para '{1}'.
ru: Пробный прогон: файл "{0}" будет перемещен в "{1}".
tr: Deneme çalıştırması: '{0}' dosyası '{1}' konumuna taşınıyor.
zh_hans: 试运行: 会将文件“{0}”移动到“{1}”。
zh_hant: 試執行: 將會把檔案 '{0}' 移至 '{1}'。

# ProjectManifestDescription
source: The XML file that contains the list of packages to be stored.
cs: Soubor XML obsahující seznam balíčků, které se mají uložit
de: Die XML-Datei, die die Liste der zu speichernden Pakete enthält.
es: El archivo XML que contiene la lista de paquetes que se van a almacenar.
fr: Fichier XML qui contient la liste des packages à stocker.
it: File XML che contiene l'elenco di pacchetti da archiviare.
ja: 格納されるパッケージのリストを含む XML ファイル。
ko: 저장될 패키지 목록을 포함하는 XML 파일입니다.
pl: Plik XML zawierający listę pakietów, które mają być przechowywane.
pt_br: O arquivo XML que contém a lista de pacotes a serem armazenados.
ru: Файл XML со списком сохраняемых пакетов.
tr: Depolanacak paketlerin listesini içeren XML dosyası.
zh_hans: 包含要存储的包列表的 XML 文件。
zh_hant: 包含要儲存之套件清單的 XML 檔案。

# ProjectsHeader
source: Project(s)
cs: Projekty
de: Projekt(e)
es: Proyectos
fr: Projet(s)
it: Progetto/i
ja: プロジェクト
ko: 프로젝트
pl: Projekty
pt_br: Projetos
ru: Проекты
tr: Projeler
zh_hans: 项目
zh_hant: 專案

# PropertyDirectiveInvalidName
source: Invalid property name at {0}. {1}
cs: Neplatný název vlastnosti v {0}. {1}
de: Ungültiger Eigenschaftenname bei "{0}". {1}
es: Nombre de propiedad no válido en {0}. {1}
fr: Nom de propriété non valide à {0}. {1}
it: Nome proprietà non valido in {0}. {1}
ja: {0} のプロパティ名が無効です。{1}
ko: {0}의 속성 이름이 잘못되었습니다. {1}
pl: Nieprawidłowa nazwa właściwości w {0}. {1}
pt_br: Nome de propriedade inválido em {0}. {1}
ru: Недопустимое имя свойства в {0}. {1}
tr: {0} konumunda geçersiz özellik adı. {1}
zh_hans: {0} 处的属性名称无效。{1}
zh_hant: 位於 {0} 的屬性名稱無效。{1}

# PropertyDirectiveMissingParts
source: The property directive needs to have two parts separated by '=' like '#:property PropertyName=PropertyValue': {0}
cs: Direktiva property musí mít dvě části oddělené znakem =, například #:property PropertyName=PropertyValue: {0}
de: Die Eigenschaftsdirektive muss zwei durch "=" getrennte Teile aufweisen, z. B. "#:property PropertyName=PropertyValue": {0}
es: La directiva de propiedad debe tener dos partes separadas por "=", como "like '#:property PropertyName=PropertyValue": {0}
fr: La directive de propriété doit avoir deux parties séparées par '=' comme '#:property PropertyName=PropertyValue' : {0}
it: La direttiva di proprietà deve avere due parti separate da '=', come '#:property PropertyName=PropertyValue': {0}
ko: property 지시문에는 '#:property PropertyName=PropertyValue'와 같이 '='로 구분된 두 부분이 있어야 합니다. {0}.
pl: Dyrektywa właściwości musi mieć dwie części oddzielone znakiem „=”, na przykład „'#:property PropertyName=PropertyValue”: {0}
ru: Директива свойства должна иметь две части, разделенные символом "=", например "#:property PropertyName=PropertyValue": {0}
tr: Özellik yönergesi '#:property PropertyName=PropertyValue' gibi '=' ile ayrılmış iki parçaya sahip olmalıdır: {0}
zh_hans: 属性指令需要包含两个由 ‘=’ 分隔的部件，例如 '#:property PropertyName=PropertyValue': {0}
zh_hant: 屬性指示詞必須有兩個部分，其以 '=' 分隔，例如 '#:property PropertyName=PropertyValue': {0}

# PublishAppDescription
source: Publisher for the .NET Platform
cs: Vydavatel pro platformu .NET
de: Herausgeber für die .NET-Plattform
es: Publicador para la plataforma .NET
fr: Éditeur pour la plateforme .NET
it: Editore per la piattaforma .NET
ja: .NET Platform 用パブリッシャー
ko: .NET 플랫폼용 게시자입니다.
pl: Wydawca dla platformy .NET.
pt_br: Editor para a Plataforma .NET
ru: Издатель для платформы .NET
tr: .NET Platformunun yayımcısı.
zh_hans: 适用于 .NET 平台的发布服务器
zh_hant: .NET 平台的發行者

# PublishCmdNoLogo
source: Do not display the startup banner or the copyright message.
cs: Nezobrazovat úvodní nápis ani zprávu o autorských právech
de: Zeigt kein Startbanner und keine Copyrightmeldung an.
es: No mostrar la pancarta de inicio ni el mensaje de copyright.
fr: N'affiche pas la bannière de démarrage ni le message de copyright.
it: Evita la visualizzazione del messaggio di avvio o di copyright.
ja: 著作権情報を表示しません。
ko: 시작 배너 또는 저작권 메시지를 표시하지 않습니다.
pl: Nie wyświetlaj baneru początkowego ani komunikatu o prawach autorskich.
pt_br: Não exibe a faixa de inicialização ou a mensagem de direitos autorais.
ru: Не отображать начальный баннер или сообщение об авторских правах.
tr: Başlangıç bandını veya telif hakkı iletisini görüntüleme.
zh_hans: 不显示启动版权标志或版权消息。
zh_hant: 不顯示啟始資訊或著作權訊息。

# PublishConfigurationOptionDescription
source: The configuration to publish for. The default is 'Release' for NET 8.0 projects and above, but 'Debug' for older projects.
cs: Konfigurace, pro kterou se má publikovat. Pro projekty NET 8.0 a vyšší je výchozí hodnota Release, ale pro starší projekty je hodnota Debug.
de: Die Konfiguration, für die veröffentlicht werden soll. Der Standardwert ist "Release" für NET 8.0-Projekte und höher, aber "Debug" für ältere Projekte.
es: Configuración para la que se va a publicar. El valor predeterminado es "Versión" para proyectos de NET 8.0 y versiones posteriores, pero "Depurar" para proyectos anteriores.
fr: Configuration pour lequel publier. La valeur par défaut est « Release » pour les projets NET 8.0 et versions ultérieures, mais « Debug » pour les projets plus anciens.
it: Configurazione per la pubblicazione. Il valore predefinito per i progetti NET 8.0 e versioni successive è 'Release', ma per i progetti meno recenti è 'Debug'.
ja: 発行する構成。既定値は、NET 8.0 以降のプロジェクトの場合は 'Release' ですが、旧プロジェクトの場合は 'Debug' です。
ko: 게시할 구성입니다. 기본값은 NET 8.0 프로젝트의 경우 'Release'이지만, 이전 프로젝트의 경우 'Debug'입니다.
pl: Konfiguracja do opublikowania. Wartość domyślna to „Wersja” dla projektów NET 8.0 i nowszych, ale „Debugowanie” dla starszych projektów.
pt_br: A configuração para a qual publicar. O padrão é 'Release' para projetos NET 8.0 e superiores, mas 'Debug' para projetos mais antigos.
ru: Конфигурация для публикации. Значение по умолчанию — "Release" для проектов NET 8.0 и более поздней версии, но "Debug" для более старых проектов.
tr: Yayımlanacak yapılandırma. NET 8.0 projeleri ve üzeri için varsayılan değer 'Release' iken eski projeler için değer 'Debug' olmalıdır.
zh_hans: 发布所对应的配置。对于 NET 8.0 及更高版本的项目，默认值为 "Release"，但对于较低版本的项目，默认值为 "Debug"。
zh_hant: 要發佈的設定。.NET 8.0 專案及更新版本的預設值為 'Release'，但較舊專案的預設值為 'Debug'。
