Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CommandOptionFileDescription
source: The path to the file-based app to run (can be also passed as the first argument if there is no project in the current directory).
cs: Cesta ke spuštěné souborové aplikaci (dá se také předat jako první argument, pokud v aktuálním adresáři není žádný projekt).
de: Der Pfad zur dateibasierten App, die ausgeführt werden soll (kann auch als erstes Argument übergeben werden, wenn sich im aktuellen Verzeichnis kein Projekt befindet).
es: Ruta de acceso a la aplicación basada en archivos que se va a ejecutar (también se puede pasar como primer argumento si no hay ningún proyecto en el directorio actual).
fr: Chemin de l’application basée sur des fichiers à exécuter (peut également être transmis en tant que premier argument s’il n’existe pas de projet dans le répertoire courant).
it: Percorso dell'app basata su file da eseguire (può essere passato anche come primo argomento se non è presente alcun progetto nella directory corrente).
ja: 実行するファイル ベースのアプリへのパス (現在のディレクトリにプロジェクトがない場合は、最初の引数として渡すこともできます)。
ko: 실행할 파일 기반 앱의 경로입니다(현재 디렉터리에 프로젝트가 없는 경우 첫 번째 인수로도 전달할 수 있습니다).
pl: Ścieżka do aplikacji opartej na plikach do uruchomienia (można ją również przekazać jako pierwszy argument, jeśli w bieżącym katalogu nie ma projektu).
pt_br: O caminho para o aplicativo baseado em arquivo a ser executado (também pode ser passado como o primeiro argumento se não houver nenhum projeto no diretório atual).
ru: Путь к приложению на основе файлов для запуска (можно также передать в качестве первого аргумента, если в текущем каталоге нет проекта).
tr: Çalıştırılacak dosya tabanlı uygulamanın yolu (geçerli dizinde proje yoksa ilk bağımsız değişken olarak da geçirilebilir).
zh_hans: 要运行的基于文件的应用的路径(如果当前目录中没有项目，也可作为第一个参数传递)。
zh_hant: 執行檔案型應用程式的路徑 (如果目前目錄中沒有專案，也可以作為第一個引數傳遞)。

# CommandOptionLaunchProfileDescription
source: The name of the launch profile (if any) to use when launching the application.
cs: Název profilu spuštění (pokud existuje), který se má použít při spuštění aplikace.
de: Der Name des Startprofils (sofern vorhanden), das beim Starten der Anwendung verwendet werden soll.
es: El nombre del perfil de inicio (si lo hay) que se usará al iniciar la aplicación.
fr: Nom du profil de lancement (le cas échéant) à utiliser au lancement de l'application.
it: Nome dell'eventuale profilo di avvio da usare all'avvio dell'applicazione.
ja: アプリケーションを起動するときに使用する起動プロファイルの名前 (存在する場合)。
ko: 애플리케이션을 시작할 때 사용하는 시작 프로필(있는 경우)의 이름입니다.
pl: Nazwa profilu uruchamiania (jeśli istnieje), który ma być używany podczas uruchamiania aplikacji.
pt_br: O nome do perfil de inicialização (se houver) a ser usado ao iniciar o aplicativo.
ru: Имя профиля запуска (если он есть), используемое при запуске приложения.
tr: Uygulama başlatılırken kullanılacak başlatma profilinin (varsa) adı.
zh_hans: 启动应用程序时使用的启动配置文件名称(如果有).
zh_hant: 啟動應用程式時，所要使用的啟動設定檔 (若有) 名稱。

# CommandOptionNoBuildDescription
source: Do not build the project before running. Implies --no-restore.
cs: Nesestavujte projekt, dokud ho nespustíte. Implikuje možnost --no-restore.
de: Erstellt das Projekt nicht vor der Ausführung. Impliziert "--no-restore".
es: No compile el proyecto antes de ejecutarlo. Implica --no-restore.
fr: Ne pas générer le projet avant l'exécution. Implique --no-restore.
it: Non compila il progetto prima dell'esecuzione. Implica --no-restore.
ja: 実行する前にプロジェクトをビルドしないでください。--no-restore を意味します。
ko: 실행하기 전에 프로젝트를 빌드하지 않습니다. --no-restore 의미합니다.
pl: Nie kompiluj tego projektu przed uruchomieniem. Powoduje przyjęcie, że podano parametr --no-restore.
pt_br: Não compile o projeto antes de executar. Implica em --no-restore.
ru: Сборка проекта перед запуском не выполняется. Подразумевает --no-restore.
tr: Çalıştırmadan önce projeyi derlemeyin. --no-restore anlamına gelir.
zh_hans: 运行之前不要生成项目。Implies --no-restore.
zh_hant: 請勿在執行之前建置專案。提示: --no-restore.

# CommandOptionNoCacheDescription
source: Skip up to date checks and always build the program before running.
cs: Přeskočit aktuální kontroly a před spuštěním vždy sestavit program
de: Überspringen Sie aktuelle Überprüfungen, und erstellen Sie das Programm immer, bevor Sie es ausführen.
es: Omite las comprobaciones actualizadas y compile siempre el programa antes de ejecutarlo.
fr: Ignorez les vérifications à jour et générez toujours le programme avant de l’exécuter.
it: Ignora i controlli aggiornati e compila sempre il programma prima dell'esecuzione.
ja: 最新状態チェックをスキップし、実行する前に常にプログラムをビルドします。
ko: 최신 검사를 건너뛰고 실행하기 전에 항상 프로그램을 빌드합니다.
pl: Pomiń aktualne testy i zawsze kompiluj program przed uruchomieniem.
pt_br: Ignore as verificações atualizadas e sempre compile o programa antes de executar.
ru: Пропускать проверки на наличие последней версии и всегда выполнять сборку программы перед запуском.
tr: Güncel denetimleri atla ve çalıştırmadan önce her zaman programı derle.
zh_hans: 跳过最新检查，并始终在运行之前生成程序。
zh_hant: 在執行之前，略過最新的檢查並一律建置程式。

# CommandOptionNoLaunchProfileArgumentsDescription
source: Do not use arguments specified in launch profile to run the application.
cs: Ke spuštění aplikace nepoužívat argumenty zadané v profilu spuštění.
de: Verwenden Sie die im Startprofil angegebenen Argumente nicht zum Ausführen der Anwendung.
es: No use los argumentos especificados en el perfil de inicio para ejecutar la aplicación.
fr: N’utilisez pas les arguments spécifiés dans le profil de lancement pour exécuter l’application.
it: Non usare gli argomenti specificati nel profilo di avvio per eseguire l'applicazione.
ja: 起動プロファイルで指定された引数を使用してアプリケーションを実行しないでください。
ko: 시작 프로필에 지정된 인수를 사용하여 애플리케이션을 실행하지 마세요.
pl: Nie używaj argumentów określonych w profilu uruchamiania do uruchamiania aplikacji.
pt_br: Não use argumentos especificados no perfil de inicialização para executar o aplicativo.
ru: Не использовать аргументы, указанные в профиле запуска, для запуска приложения.
tr: Uygulamayı çalıştırmak için başlatma profilinde belirtilen bağımsız değişkenleri kullanmayın.
zh_hans: 不使用启动配置文件中指定的参数来运行应用程序。
zh_hant: 請勿使用啟動設定檔中指定的引數來執行應用程式。

# CommandOptionNoLaunchProfileDescription
source: Do not attempt to use launchSettings.json or [app].run.json to configure the application.
cs: Nepokoušejte se ke konfiguraci aplikace použít launchSettings.json nebo [app].run.json.
de: Versuchen Sie nicht, „launchSettings.json“ oder „[app].run.json“ zum Konfigurieren der Anwendung zu verwenden.
es: No intente usar launchSettings.json o [app].run.json para configurar la aplicación.
fr: N’essayez pas d’utiliser launchSettings.json ou [app].run.json pour configurer l’application.
it: Evitare di usare launchSettings.json o [app].run.json per configurare l'applicazione.
ja: launchSettings.json または [app].run.json を使用してアプリケーションを構成しないでください。
ko: launchSettings.json 또는 [app].run.json을 사용하여 애플리케이션을 구성하지 마세요.
pl: Nie próbuj używać plików launchSettings.json ani [app].run.json do konfigurowania aplikacji.
pt_br: Não tente usar launchSettings.json ou [app].run.json para configurar o aplicativo.
ru: Не используйте launchSettings.json или [app].run.json для настройки приложения.
tr: Uygulamayı yapılandırmak için launchSettings.json veya [app].run.json dosyalarını kullanmaya çalışmayın.
zh_hans: 请勿尝试使用 launchSettings.json 或 [app].run.json 来配置应用程序。
zh_hant: 請勿嘗試使用 launchSettings.json 或 [app].run.json 設定該應用程式。

# CommandOptionProjectDescription
source: The path to the project file to run (defaults to the current directory if there is only one project).
cs: Cesta ke spouštěnému souboru projektu (výchozí je aktuální adresář, pokud existuje jenom jeden projekt)
de: Der Pfad zur auszuführenden Projektdatei (standardmäßig das aktuelle Verzeichnis, falls nur ein einzelnes Projekt vorhanden ist).
es: Ruta de acceso al archivo del proyecto que debe ejecutarse (si solo hay un proyecto, es el directorio actual de forma predeterminada).
fr: Chemin du fichier projet à exécuter (la valeur par défaut est le répertoire actif s'il n'y a qu'un seul projet).
it: Percorso del file di progetto da eseguire. Se è presente un solo progetto, per impostazione predefinita viene usata la directory corrente.
ja: 実行するプロジェクト ファイルへのパス (プロジェクトが 1 つのみの場合、既定は現在のディレクトリです)。
ko: 실행할 프로젝트 파일의 경로입니다(프로젝트가 하나만 있는 경우 현재 디렉터리로 기본 설정됨).
pl: Ścieżka do pliku projektu, który ma zostać uruchomiony (w przypadku tylko jednego projektu wartością domyślną jest bieżący katalog).
pt_br: O caminho para o arquivo de projeto a ser executado (usará como padrão o diretório atual se houver apenas um projeto).
ru: Путь к выполняемому файлу проекта (по умолчанию — текущий каталог, если имеется только один проект).
tr: Çalıştırılacak proje dosyasının yolu (yalnızca bir proje varsa, geçerli dizin varsayılan olarak kullanılır).
zh_hans: 要运行的项目文件的路径(如果只有一个项目，则默认使用当前目录)。
zh_hant: 要執行之專案檔的路徑 (如果只有一個專案，預設為目前的目錄)。

# Commands
source: SDK commands
cs: Příkazy sady SDK
de: SDK-Befehle
es: Comandos de SDK
fr: Commandes du SDK
it: Comandi SDK
ja: SDK コマンド
ko: SDK 명령
pl: Polecenia zestawu SDK
pt_br: Comandos do SDK
ru: Команды SDK
tr: SDK komutları
zh_hans: SDK 命令
zh_hant: SDK 命令

# CommandsMismatch
source: The command {0} specified in the tool manifest file is not contained in the package with Package Id {1}. The commands contained in the package are {2}.
cs: Příkaz {0}, který se zadal v souboru manifestu nástroje, není součástí balíčku s ID {1}. Příkazy obsažené v balíčku jsou {2}.
de: Der in der Toolmanifestdatei angegebene Befehl "{0}" ist im Paket mit der Paket-ID {1} nicht enthalten. Im Paket enthaltene Befehle: {2}.
es: El comando {0} especificado en el archivo de manifiesto de la herramienta no está incluido en el paquete con el id. de paquete {1}. Los comandos contenidos en el paquete son {2}.
fr: La commande {0} spécifiée dans le fichier manifeste d'outils n'est pas contenue dans le package ayant l'ID de package {1}. Les commandes contenues dans le package sont {2}.
it: Il comando {0} specificato nel file manifesto dello strumento non è contenuto nel pacchetto con ID pacchetto {1}. I comandi contenuti nel pacchetto sono {2}.
ja: ツール マニフェスト ファイルで指定されているコマンド {0} は、パッケージ ID {1} のパッケージに含まれていません。パッケージに含まれているコマンドは {2} です。
ko: 도구 매니페스트 파일에 지정된 {0} 명령이 패키지 ID가 {1}인 패키지에 포함되지 않았습니다. 패키지에 포함된 명령은 {2}입니다.
pl: Polecenie {0} określone w pliku manifestu narzędzia nie znajduje się w pakiecie o identyfikatorze {1}. Polecenia zawarte w pakiecie to {2}.
pt_br: O comando {0} especificado no arquivo de manifesto de ferramenta não está contido no pacote com a ID de Pacote {1}. Os comandos contidos no pacote são {2}.
ru: Команда {0}, указанная в файле манифеста средства, не содержится в пакете с идентификатором {1}. Команды, содержащиеся в этом пакете: {2}.
tr: Araç bildirimi dosyasında belirtilen {0} komutu Paket Kimliği {1} olan pakette yok. Paketteki komutlar: {2}.
zh_hans: 包 ID 为 {1} 的包中不包含工具清单文件中指定的命令 {0}。包中包含的命令为 {2}。
zh_hant: 指定在工具資訊清單檔中的命令 {0}，不包含在套件識別碼為 {1} 的套件中。套件中包含的命令是 {2}。

# ConfigFileArgumentName
source: ConfigFile
tr: YapılandırmaDosyası

# ConfigFileDescription
source: The NuGet configuration file. If specified, only the settings from this file will be used. If not specified, the hierarchy of configuration files from the current directory will be used. For more information, see https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
cs: Konfigurační soubor NuGet. Když se zadá, použijí se jen nastavení z tohoto souboru. Když se soubor nezadá, použijte se hierarchie konfiguračních souborů z aktuálního adresáře. Další informace najdete na adrese https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
de: Die NuGet-Konfigurationsdatei. Sofern angegeben, werden nur die Einstellungen aus dieser Datei verwendet. Falls nicht angegeben, wird die Hierarchie der Konfigurationsdateien aus dem aktuellen Verzeichnis verwendet. Weitere Informationen finden Sie unter https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
es: Archivo de configuración de NuGet. Si se especifica, solo se usará la configuración de este archivo. Si no se especifica, se usará la jerarquía de los archivos de configuración del directorio actual. Para obtener más información, vea https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
fr: Le fichier config NuGet. Si ce fichier est spécifié, seuls ses paramètres sont utilisés. S’il n’est pas spécifié, la hiérarchie des fichiers config du répertoire actif est utilisée. Pour plus d’informations, consultez https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
it: File di configurazione NuGet. Se è specificato, verranno usate solo le impostazioni di questo file. Se non è specificato, verrà usata la gerarchia dei file di configurazione della directory corrente. Per altre informazioni, vedere https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
ja: NuGet 構成ファイル。指定した場合、このファイルの設定のみが使用されます。指定しない場合、現在のディレクトリの構成ファイルの階層が使用されます。詳細については、https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior を参照してください。
ko: NuGet 구성 파일. 지정한 경우 이 파일의 설정만 사용됩니다. 지정하지 않은 경우 현재 디렉터리의 구성 파일 계층 구조가 사용됩니다. 자세한 내용은 https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior를 참조하세요.
pl: Plik konfiguracyjny pakietu NuGet. Jeśli jest określony, używane będą tylko ustawienia z tego pliku. Jeśli nie jest określony, używana będzie hierarchia plików konfiguracyjnych z bieżącego katalogu. Aby uzyskać więcej informacji, zobacz https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
pt_br: O arquivo de configuração do NuGet. Se for especificado, somente as configurações desse arquivo serão usadas. Se não for especificado, a hierarquia de arquivos de configuração do diretório atual será usada. Para saber mais, acesse https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
ru: Файл конфигурации NuGet. Если указан, будут использоваться только параметры из этого файла. Если не указан, будет использоваться иерархия файлов конфигурации из текущего каталога. Дополнительные сведения см. на странице https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
tr: NuGet yapılandırma dosyası. Belirtilirse, yalnızca bu dosyadaki ayarlar kullanılır. Belirtilmezse, geçerli dizindeki yapılandırma dosyaları hiyerarşisi kullanılır. Daha fazla bilgi için bkz. https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior.
zh_hans: NuGet 配置文件。如果指定，将仅使用此文件中的设置。如果未指定，则将使用当前目录中的配置文件的层次结构。有关详细信息，请参阅 https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior
zh_hant: NuGet 組態檔。若已指定，則只會使用此檔案中的設定。若未指定，則會使用目前目錄中的組態檔階層。如需詳細資訊，請參閱 https://docs.microsoft.com/nuget/consume-packages/configuring-nuget-behavior (機器翻譯)

# ConfirmationPromptInvalidChoiceMessage
source: Please type '{0}' for yes or '{1}' for no.
cs: Zadejte prosím {0} pro yes (ano) nebo {1} pro no (ne).
de: Geben Sie "{0}" für Ja oder "{1}" für Nein ein.
es: Escriba "{0}" para sí o "{1}" para no.
fr: Tapez « {0} » pour Oui ou « {1} » pour non.
it: Digita '{0}' per sì o '{1}' per no.
ja: はいの場合は「{0}」、いいえの場合は「{1}」と入力してください。
ko: '{0}'을(를) 예로 입력하거나 '{1}'을(를) 아니요로 입력하세요.
pl: Wpisz „{0}”, aby dla tak lub „{1}” dla nie.
pt_br: Digite "{0}" para sim ou "{1}" para não.
ru: Введите "{0}", чтобы указать "да", и "{1}", чтобы указать "нет".
tr: Lütfen evet için '{0}' veya hayır için '{1}' yazın.
zh_hans: 请键入 '{0}' 以表示是或键入 '{1}' 以表示否。
zh_hant: 請輸入 '{0}' 表示是或 '{1}' 表示否。

# ConfirmationPromptNoValue
source: n
tr: h

# ConfirmationPromptYesValue
source: y
es: s
fr: o
pl: t
tr: e

source: Console is already in batching mode.
cs: Konzole je již v režimu dávkování.
de: Die Konsole befindet sich bereits im Batchmodus.
es: La consola ya está en modo de procesamiento por lotes.
fr: La console est déjà en mode de traitement par lot.
it: La console è già in modalità batch.
ja: コンソールは既にバッチ 処理モードです。
ko: 콘솔이 이미 일괄 처리 모드에 있습니다.
pl: Konsola jest już w trybie dzielenia na partie.
pt_br: O console já está no modo de lote.
ru: Консоль уже находится в пакетном режиме.
tr: Konsol zaten işlem grubu oluşturma modunda bulunuyor.
zh_hans: 控制台已处于批处理模式。
zh_hant: 主控台已處於批次處理模式。

# CouldNotConvertToBoolean
source: Could not convert the value of property '{0}' to a boolean.
cs: Hodnotu vlastnosti {0} nejde převést na logickou hodnotu.
de: Der Wert der Eigenschaft "{0}" konnte nicht in einen booleschen Wert konvertiert werden.
es: No se pudo convertir el valor de la propiedad "{0}" en un booleano.
fr: Impossible de convertir la valeur de la propriété '{0}' en valeur booléenne.
it: Non è stato possibile convertire il valore della proprietà '{0}' in un valore booleano.
ja: プロパティ ' {0} ' の値をブール値に変換できませんでした。
ko: '{0}' 속성 값을 부울로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości właściwości „{0}” na wartość logiczną.
pt_br: Não foi possível converter o valor da propriedade '{0}' em um booliano.
ru: Не удалось преобразовать значение свойства "{0}" в логическое значение.
tr: '{0}' özelliğinin değeri boole değerine dönüştürülemedi.
zh_hans: 无法将属性“{0}”的值转换为布尔值。
zh_hant: 無法將屬性 '{0}' 的值轉換為布林值。

# CouldNotConvertToString
source: Could not convert the value of property '{0}' to a string.
cs: Hodnotu vlastnosti {0} nejde převést na řetězec.
de: Der Wert der Eigenschaft "{0}" konnte nicht in eine Zeichenfolge konvertiert werden.
es: No se pudo convertir el valor de la propiedad "{0}" en una cadena.
fr: Impossible de convertir la valeur de la propriété '{0}' en chaîne.
it: Non è stato possibile convertire il valore della proprietà '{0}' in una stringa.
ja: プロパティ '{0}' の値を文字列に変換できませんでした。
ko: '{0}' 속성 값을 문자열로 변환할 수 없습니다.
pl: Nie można przekonwertować wartości właściwości „{0}” na ciąg.
pt_br: Não foi possível converter o valor da propriedade '{0}' em uma cadeia de caracteres.
ru: Не удалось преобразовать значение свойства "{0}" в строку.
tr: '{0}' özelliğinin değeri dizeye dönüştürülemedi.
zh_hans: 无法将属性“{0}”的值转换为字符串。
zh_hant: 無法將屬性 '{0}' 的值轉換為字串。

# CouldNotFindAProject
source: Couldn't find a project. Ensure that a project exists in {0}, or pass the path to the project using {1}.
cs: Projekt se nepovedlo najít. Ověřte, že projekt existuje v {0}, nebo pomocí parametru {1} předejte cestu k projektu.
de: Es konnte kein Projekt gefunden werden. Vergewissern Sie sich, dass unter {0} ein Projekt vorhanden ist, oder übergeben Sie den Pfad zum Projekt mithilfe von {1}.
es: No se ha podido encontrar un proyecto. Asegúrese de que exista uno en {0} o pase la ruta de acceso al proyecto mediante {1}.
fr: Il n'existe aucun projet. Vérifiez qu'il existe un projet dans {0} ou passez le chemin au projet via {1}.
it: Non è stato trovato alcun progetto. Assicurarsi che sia presente un progetto in {0} oppure passare il percorso al progetto con {1}.
ja: プロジェクトが見つかりませんでした。プロジェクトが {0} に存在することを確認するか、{1} を使用してパスをプロジェクトに渡してください。
ko: 프로젝트를 찾을 수 없습니다. 프로젝트가 {0}에 있는지 확인하거나 {1}을(를) 사용하여 프로젝트에 경로를 전달하세요.
pl: Nie można odnaleźć projektu. Upewnij się, że projekt istnieje w programie {0} lub przekaż ścieżkę do projektu przy użyciu {1}.
pt_br: Não foi possível localizar um projeto. Verifique se existe um projeto em {0} ou passe o caminho para o projeto usando {1}.
ru: Не удалось найти проект. Убедитесь, что проект существует в {0}, или передайте путь к проекту с помощью {1}.
tr: Proje bulunamadı. {0} içinde proje olduğundan emin olun veya {1} kullanarak yolu projeye geçirin.
zh_hans: 找不到项目。请确保 {0} 中存在项目，或使用 {1} 传递项目路径。
zh_hant: 找不到專案。請確認專案存在於 {0} 中，或使用 {1} 將該路徑傳送至專案。

# CrashDumpTypeArgumentName
source: DUMP_TYPE
tr: DÖKÜM_TÜRÜ

# CreateManifestIfNeededOptionDescription
source: Create a tool manifest if one isn't found during tool installation. For information on how manifests are located, see https://aka.ms/dotnet/tools/create-manifest-if-needed
cs: Vytvořte manifest nástroje, pokud se nějaký nenajde během instalace nástroje. Informace o tom, jak se manifesty nacházejí, najdete v tématu https://aka.ms/dotnet/tools/create-manifest-if-needed
de: Erstellen Sie ein Toolmanifest, wenn es während der Toolinstallation nicht gefunden wird. Informationen dazu, wie Manifeste gefunden werden, finden Sie unter https://aka.ms/dotnet/tools/create-manifest-if-needed
es: Cree un manifiesto de herramienta si no se encuentra ninguno durante la instalación de la herramienta. Para obtener información sobre cómo se encuentran los manifiestos, consulte https://aka.ms/dotnet/tools/create-manifest-if-needed
fr: Créez un manifeste d'outil si aucun n'est trouvé lors de l'installation de l'outil. Pour plus d'informations sur la localisation des manifestes, voir https://aka.ms/dotnet/tools/create-manifest-if-needed
it: Creare un manifesto dello strumento se non ne viene trovato uno durante l'installazione dello strumento. Per informazioni sulla posizione dei manifesti, vedere https://aka.ms/dotnet/tools/create-manifest-if-needed
ja: ツールのインストール中にツール マニフェスト見つからない場合は作成します。マニフェストの場所については、https://aka.ms/dotnet/tools/create-manifest-if-needed を参照してください
ko: 도구 설치 중에 도구 매니페스트를 찾을 수 없는 경우 도구 매니페스트를 만드세요. 매니페스트의 위치는 https://aka.ms/dotnet/tools/create-manifest-if-needed를 참조하세요.
pl: Utwórz manifest narzędzi, jeśli nie zostanie znaleziony podczas instalacji narzędzia. Aby uzyskać informacje o lokalizacji manifestów, zobacz https://aka.ms/dotnet/tools/create-manifest-if-needed
pt_br: Crie um manifesto de ferramenta se nenhum for encontrado durante a instalação da ferramenta. Para obter informações sobre como os manifestos estão localizados, consulte https://aka.ms/dotnet/tools/create-manifest-if-needed
ru: Создайте манифест инструмента, если он не найден во время установки инструмента. Сведения о способе размещения манифестов см. на странице https://aka.ms/dotnet/tools/create-manifest-if-needed
tr: Araç yüklemesi sırasında bir araç bildirimi bulunmazsa bir araç bildirimi oluşturun. Bildirimlerin nasıl bulunduğu hakkında bilgi edinmek için bkz. https://aka.ms/dotnet/tools/create-manifest-if-needed
zh_hans: 如果在工具安装期间找不到工具清单，请创建一个工具清单。若要了解如何查找清单，请参阅 https://aka.ms/dotnet/tools/create-manifest-if-needed
zh_hant: 如果在工具安裝期間找不到工具資訊清單，則建立工具資訊清單。如需如何尋找資訊清單的相關資訊，請參閱 https://aka.ms/dotnet/tools/create-manifest-if-needed

# CurrentRuntimeOptionDescription
source: Use current runtime as the target runtime.
cs: Jako cílový modul runtime použijte aktuální modul.
de: Verwenden Sie die aktuelle Runtime als Zielruntime.
es: Use el runtime actual como runtime de destino.
fr: Utilisez le runtime actuel en tant que runtime cible.
it: Usa il runtime corrente come runtime di destinazione.
ja: 現在のランタイムをターゲット ランタイムとして使用します。
ko: 현재 런타임을 대상 런타임으로 사용합니다.
pl: Użyj bieżącego środowiska uruchomieniowego jako docelowego środowiska uruchomieniowego.
pt_br: Usar o runtime atual como o runtime de destino.
ru: Использовать текущую среду выполнения в качестве целевой среды выполнения.
tr: Hedef çalışma zamanı olarak geçerli çalışma zamanını kullanın.
zh_hans: 将当前运行时用作目标运行时。
zh_hant: 使用目前的執行階段作為目標執行階段。

source: Date
cs: Datum
de: Datum
es: Fecha
it: Data
ja: 日付
ko: 날짜
pl: Data
pt_br: Data
ru: Дата
tr: Tarih
zh_hans: 日期
zh_hant: 日期

# DefaultLaunchProfileDisplayName
source: (Default)
cs: (výchozí)
de: (Standard)
es: (Predeterminada)
fr: (Par défaut)
it: (Predefinita)
ja: (既定)
ko: (기본값)
pl: (Domyślne)
pt_br: (Padrão)
ru: (По умолчанию)
tr: (Varsayılan)
zh_hans: (默认值)
zh_hant: (預設)
