Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WorkloadVersionDescription
source: Display the currently installed workload version.
cs: Zobrazí aktuálně nainstalovanou verzi úlohy.
de: Zeigt die aktuell installierte Workloadversion an.
es: Muestra la versión de la carga de trabajo que está instalada actualmente.
fr: Affichez la version de charge de travail actuellement installée.
it: Visualizza la versione del carico di lavoro attualmente installata.
ja: 現在インストールされているワークロードのバージョンを表示します。
ko: 현재 설치된 워크로드 버전을 표시합니다.
pl: Wyświetl aktualnie zainstalowaną wersję obciążenia.
pt_br: Exiba a versão da carga de trabalho atualmente instalada.
ru: Отобразить текущую установленную версию рабочей нагрузки.
tr: Şu anda yüklü olan iş yükü sürümünü görüntüleyin.
zh_hans: 显示当前安装的工作负载版本。
zh_hant: 顯示目前安裝的工作負載版本。

# WorkloadVersionNotInstalledShort
source: (not installed)
cs: (nenainstalováno)
de: (nicht installiert)
es: (sin instalar)
fr: (non installé)
it: (non installato)
ja: (インストールされていません)
ko: (설치되지 않음)
pl: (nie zainstalowano)
pt_br: (não instalado)
ru: (не установлено)
tr: (yüklü değil)
zh_hans: (未安装)
zh_hant: (未安裝)

# WorkloadVersionRequestedNotFound
source: Workload version {0} not found.
cs: Verze úlohy {0} nebyla nalezena.
de: Die Workloadversion "{0}" wurde nicht gefunden.
es: No se encontró la versión de carga de trabajo {0}.
fr: Nous n’avons pas pu trouver la version de la charge de travail {0}.
it: Versione del carico di lavoro {0} non trovata.
ja: ワークロード バージョン {0} が見つかりませんでした。
ko: 워크로드 버전 {0}을(를) 찾을 수 없습니다.
pl: Nie znaleziono wersji obciążenia {0}.
pt_br: A versão da carga de trabalho {0} não foi encontrada.
ru: Версия рабочей нагрузки {0} не найдена.
tr: {0} iş yükü sürümü bulunamadı.
zh_hans: 找不到工作负载版本 {0}。
zh_hant: 找不到工作負載版本 {0}。

# WorkloadVersionWithSpecifiedManifestNotFound
source: No workload version matching {0} was found.
cs: Nenašla se žádná verze úlohy odpovídající {0}.
de: Es wurde keine Workloadversion gefunden, die mit "{0}" übereinstimmt.
es: No se encontró ninguna versión de carga de trabajo que coincidiera con {0}.
fr: Aucune version de charge de travail correspondant à {0} n’a été trouvée.
it: Non è stata trovata alcuna versione del carico di lavoro corrispondente {0}.
ja: {0} に一致するワークロード バージョンが見つかりませんでした。
ko: {0}와(과) 일치하는 워크로드 버전을 찾을 수 없습니다.
pl: Nie znaleziono dopasowania {0} wersji obciążenia.
pt_br: Nenhuma correspondência de versão de carga de trabalho {0} foi encontrada.
ru: Не найдена версия рабочей нагрузки, соответствующая {0}.
tr: {0} ile eşleşen herhangi bir iş yükü sürümü bulunamadı.
zh_hans: 找不到匹配 {0} 的工作负载版本。
zh_hant: 找不到符合 {0} 的工作負載版本。

source: Workloads
cs: Úlohy
es: Cargas de trabajo
fr: Charges de travail
it: Carichi di lavoro
ja: ワークロード
ko: 워크로드
pl: Obciążenia
pt_br: Cargas de trabalho
ru: Рабочие нагрузки
tr: İş yükleri
zh_hans: 工作负载
zh_hant: 工作負載

# WriteCLIRecordForVisualStudioWorkloadMessage
source: Writing install records for Visual Studio workloads: '{0}'
cs: Probíhá zápis záznamů o instalaci pro úlohy sady Visual Studio: {0}
de: Installationseinträge für Visual Studio Workloads werden geschrieben: „{0}“
es: Escritura de registros de instalación para cargas de trabajo de Visual Studio: '{0}'
fr: Écriture des enregistrements d'installation pour les charges de travail Visual Studio : « {0} »
it: Scrittura dei record di installazione per carichi di lavoro Visual Studio: '{0}'
ja: Visual Studio ワークロードのインストール レコードを書き込み中: '{0}'
ko: Visual Studio 워크로드에 대한 설치 레코드를 쓰는 중: '{0}'
pl: Pisanie rekordów instalacji dla obciążeń w usłudze Visual Studio: „{0}”
pt_br: Gravando registros de instalação para cargas de trabalho do Visual Studio: "{0}"
ru: Запись сведений об установках для рабочих нагрузок Visual Studio: "{0}"
tr: Visual Studio iş yükleri için yükleme yazma: '{0}'
zh_hans: 写入 Visual Studio 工作负载的安装记录:“{0}”
zh_hant: 正在寫入 Visual Studio 工作負載的安裝紀錄：'{0}'

# WritingPackInstallRecordMessage
source: Writing workload pack installation record for {0} version {1}...
cs: Zapisuje se záznam instalace sady úloh pro {0} verze {1}...
de: Der Installationsdatensatz für die Workload Pack-Version für {0} Version {1} wird geschrieben...
es: Escribiendo el registro de instalación de paquete de carga de trabajo para {0} versión {1}...
fr: Écriture de l’enregistrement d’installation du pack de charge de travail pour {0} version {1}...
it: Scrittura record di installazione del pacchetto del carico di lavoro per la versione {1} di {0}...
ja: {0} バージョン {1} のワークロード パックのインストール レコードを書き込んでいます...
ko: {0} 버전 {1}에 대한 워크로드 팩 설치 레코드를 작성하는 중...
pl: Trwa zapisywanie rekordu instalacji pakietu obciążenia dla {0} w wersji {1}...
pt_br: Gravando o registro da instalação do pacote de carga de trabalho para {0} versão {1}...
ru: Идет запись установки пакета рабочей нагрузки для {0} версии {1}…
tr: {0} sürümü {1} için iş yükü paketi yükleme kaydı yazılıyor...
zh_hans: 正在写入 {0} 版本 {1} 的工作负载包安装记录...
zh_hant: 正在寫入 {0} 版本 {1} 的工作負載套件安裝記錄...

source: Zero tests ran
cs: Spustila se nula testů
de: Es wurden keine Tests ausgeführt.
es: No se ejecutaron pruebas
fr: Zéro tests exécutés
it: Nessun test eseguito
ja: 0 件のテストが実行されました
ko: 테스트가 0개 실행됨
pl: Uruchomiono zero testów
pt_br: Zero testes executados
ru: Запущено ноль тестов
tr: Sıfır test çalıştırıldı
zh_hans: 运行了零个测试
zh_hant: 已執行零項測試

# cmdCollectDescription
source: The friendly name of the data collector to use for the test run. More info here: https://aka.ms/vstest-collect
cs: Popisný název kolekce dat, která se má použít pro testovací běh. Další informace: https://aka.ms/vstest-collect
de: Der Anzeigename des Datensammlers für den Testlauf. Weitere Informationen finden Sie hier: https://aka.ms/vstest-collect
es: Nombre descriptivo del recopilador de datos que se usará para la serie de pruebas. Más información aquí: https://aka.ms/vstest-collect
fr: Nom convivial du collecteur de données à utiliser pour la série de tests. Plus d'informations ici : https://aka.ms/vstest-collect
it: Nome descrittivo dell'agente di raccolta dati da usare per l'esecuzione dei test. Per altre informazioni, vedere: https://aka.ms/vstest-collect
ja: テストの実行に使用するデータ コレクターのフレンドリ名。 詳細情報: https://aka.ms/vstest-collect
ko: 테스트 실행에 사용할 데이터 수집기의 이름입니다. 자세한 정보: https://aka.ms/vstest-collect
pl: Przyjazna nazwa modułu zbierającego dane do użycia dla przebiegu testu. Więcej informacji można znaleźć tutaj: https://aka.ms/vstest-collect
pt_br: O nome amigável do coletor de dados a ser usado para a execução de teste. Mais informações aqui: https://aka.ms/vstest-collect
ru: Понятное имя сборщика данных для тестового запуска. Дополнительные сведения: https://aka.ms/vstest-collect.
tr: Test çalıştırması için kullanılacak veri toplayıcının kolay adı. Daha fazla bilgi için bkz.: https://aka.ms/vstest-collect
zh_hans: 用于测试运行的数据收集器的友好名称。 有关详细信息，请访问: https://aka.ms/vstest-collect
zh_hant: 用於測試執行的資料收集器之易記名稱。 此處提供詳細資訊: https://aka.ms/vstest-collect

# ToolInstallFrameworkOptionName
source: FRAMEWORK
es: MARCO
zh_hant: 架構

# WorkloadVersionArgument
source: WORKLOAD_VERSION
pl: WERSJA_OBCIĄŻENIA

# CommandOptionFileHelpName
source: FILE_PATH
cs: CESTA K_SOUBORU

# ToolInstallAddSourceOptionName
source: ADDSOURCE
de: QUELLE HINZUFÜGEN
