Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CheckForUpdatedWorkloadManifests
source: Checking for updated workload version.
cs: Kontroluje se aktualizovaná verze úlohy.
de: Es wird nach einer aktualisierten Workloadversion gesucht.
es: Comprobando la versión de las cargas de trabajo actualizadas.
fr: Vérification de la version mise à jour de la charge de travail.
it: Verifica della disponibilità di versioni dei carichi di lavori aggiornate.
ja: 更新されたワークロード バージョンを確認しています。
ko: 업데이트된 워크로드 버전을 확인하는 중입니다.
pl: Sprawdzanie dostępności zaktualizowanej wersji obciążenia.
pt_br: Verificando versões de carga de trabalho atualizadas.
ru: Проверка обновленной версии рабочей нагрузки.
tr: Güncellenmiş iş yükü sürümü kontrol ediliyor.
zh_hans: 正在检查更新的工作负载版本。
zh_hant: 正在檢查更新的工作負載版本。

# CleanAllOptionDescription
source: Causes clean to remove and uninstall all workload components from all SDK versions.
cs: Způsobí vyčištění, které odebere a odinstaluje všechny součásti úloh ze všech verzí sady SDK.
de: Bewirkt, dass alle Workloadkomponenten aus allen SDK-Versionen entfernt und deinstalliert werden.
es: Hace que la limpieza quite y desinstale todos los componentes de carga de trabajo de todas las versiones del SDK.
fr: Entraîne la suppression et la désinstallation de tous les composants de charge de travail de toutes les versions du Kit de développement logiciel (SDK).
it: Provoca la rimozione e la disinstallazione di tutti i componenti del carico di lavoro da tutte le versioni dell'SDK.
ja: すべての SDK バージョンからすべてのワークロード コンポーネントをクリーンに削除およびアンインストールします。
ko: 정리를 수행하여 모든 SDK 버전에서 모든 워크로드 구성 요소를 제거합니다.
pl: Powoduje usunięcie i odinstalowanie wszystkich składników obciążenia ze wszystkich wersji zestawu SDK.
pt_br: Causa limpeza para remover e desinstalar todos os componentes da carga de trabalho de todas as versões do SDK.
ru: Вызывает очистку с удалением всех компонентов рабочей нагрузки из всех версий пакета SDK.
tr: Tüm SDK sürümlerindeki iş yükü bileşenlerinin tümünü tamamen kaldıracak şekilde temizlemeyi sağlar.
zh_hans: 使清理操作能够从所有 SDK 版本中删除和卸载所有工作负载组件。
zh_hant: 導致從所有 SDK 版本移除及解除安裝所有工作負載元件。

# CleanAppFullName
source: .NET Clean Command
cs: Příkaz rozhraní .NET pro vyčištění
de: .NET-Befehl "Clean"
es: Comando Clean de .NET
fr: Commande de nettoyage .NET
it: Comando di pulizia .NET
ja: .NET Clean コマンド
ko: .NET 정리 명령
pl: Polecenie clean platformy .NET
pt_br: Comando Clean do .NET
ru: Команда .NET Clean
tr: .NET Clean Komutu
zh_hans: .NET 清理命令
zh_hant: .NET 清除命令

# CleanCmdNoLogo
source: Do not display the startup banner or the copyright message.
cs: Nezobrazovat úvodní nápis ani zprávu o autorských právech
de: Zeigt kein Startbanner und keine Copyrightmeldung an.
es: No mostrar la pancarta de inicio ni el mensaje de copyright.
fr: N'affiche pas la bannière de démarrage ni le message de copyright.
it: Evita la visualizzazione del messaggio di avvio o di copyright.
ja: 著作権情報を表示しません。
ko: 시작 배너 또는 저작권 메시지를 표시하지 않습니다.
pl: Nie wyświetlaj baneru początkowego ani komunikatu o prawach autorskich.
pt_br: Não exibe a faixa de inicialização ou a mensagem de direitos autorais.
ru: Не отображать начальный баннер или сообщение об авторских правах.
tr: Başlangıç bandını veya telif hakkı iletisini görüntüleme.
zh_hans: 不显示启动版权标志或版权消息。
zh_hant: 不顯示啟始資訊或著作權訊息。

# CleanCmdOutputDirDescription
source: The directory containing the build artifacts to clean.
cs: Adresář obsahující artefakty buildu, které se mají vyčistit
de: Das Verzeichnis mit den zu bereinigenden Buildartefakten.
es: Directorio que contiene los artefactos de compilación para limpiar.
fr: Répertoire contenant les artefacts de build à nettoyer.
it: Directory contenente gli artefatti della compilazione da pulire.
ja: クリーンするビルド成果物を含むディレクトリ。
ko: 정리할 빌드 아티팩트를 포함하는 디렉터리입니다.
pl: Katalog zawierający artefakty kompilacji do oczyszczenia.
pt_br: O diretório que contém os artefatos de compilação a serem limpos.
ru: Каталог, содержащий артефакты сборки, которые нужно очистить.
tr: Temizlenecek derleme yapıtlarını içeren dizin.
zh_hans: 包含要清理的生成工件的目录。
zh_hant: 包含要清理之組建成品的目錄。

# CleanConfigurationOptionDescription
source: The configuration to clean for. The default for most projects is 'Debug'.
cs: Konfigurace pro vyčištění. Výchozí možností pro většinu projektů je Debug.
de: Die Konfiguration für die Bereinigung. Der Standardwert für die meisten Projekte ist "Debug".
es: La configuración para la que se limpia. El valor predeterminado para la mayoría de los proyectos es "Debug".
fr: Configuration pour laquelle le nettoyage est effectué. La valeur par défaut pour la plupart des projets est 'Debug'.
it: Configurazione per cui eseguire la pulizia. L'impostazione predefinita per la maggior parte dei progetti è 'Debug'.
ja: クリーンする対象の構成。大部分のプロジェクトで、既定値は 'Debug' です。
ko: 정리할 구성입니다. 대부분의 프로젝트에서 기본값은 'Debug'입니다.
pl: Konfiguracja, dla której ma być wykonane czyszczenie. W przypadku większości projektów ustawienie domyślne to „Debugowanie”.
pt_br: A configuração para a qual a limpeza ocorrerá. O padrão para a maioria dos projetos é 'Debug'.
ru: Конфигурация для очистки. По умолчанию для большинства проектов используется "Debug".
tr: Temizlenecek yapılandırma. Çoğu proje için varsayılan, ‘Hata Ayıklama’ seçeneğidir.
zh_hans: 要清理的配置。大多数项目的默认值是 "Debug"。
zh_hant: 要為其進行清理的組態。大部分的專案預設為「偵錯」。

# CleanDefinition
source: Clean build outputs of a .NET project.
cs: Vyčistí výstupy sestavení projektu .NET.
de: Hiermit werden Buildausgaben eines .NET-Projekts bereinigt.
es: Limpia los resultados de compilación de un proyecto .NET.
fr: Nettoyez les sorties de build d'un projet .NET.
it: Pulisce gli output di compilazione di un progetto .NET.
ja: .NET プロジェクトのビルド出力をクリーンします。
ko: .NET 프로젝트의 빌드 출력을 정리합니다.
pl: Wyczyść dane wyjściowe kompilacji projektu platformy .NET.
pt_br: Limpar as saídas do build de um projeto do .NET.
ru: Очистка выходных данных сборки проекта .NET.
tr: Bir .NET projesinin derleme çıktılarını temizler.
zh_hans: 清理 .NET 项目的生成输出。
zh_hant: 清除 .NET 專案的組建輸出。

# CleanFileBasedAppArtifactsCommandDescription
source: Removes artifacts created for file-based apps
cs: Odebere artefakty vytvořené pro souborové aplikace.
de: Entfernt Artefakte, die für dateibasierte Apps erstellt wurden.
es: Quita los artefactos creados para las aplicaciones basadas en archivos
fr: Supprime les artefacts créés pour les applications basées sur des fichiers
it: Rimuove gli artefatti creati per le app basate su file
ja: ファイルベースのアプリ用に作成された成果物を削除します
ko: 파일 기반 앱에 대해 만든 아티팩트 제거
pl: Usuwa artefakty utworzone dla aplikacji opartych na plikach
pt_br: Remove artefatos criados para aplicativos baseados em arquivo
ru: Удаляет артефакты, созданные для файловых приложений
tr: Dosya tabanlı uygulamalar için oluşturulan yapıtları kaldırır
zh_hans: 移除为基于文件的应用创建的项目
zh_hant: 移除針對檔案型應用程式建立的成品

# CleanFileBasedAppArtifactsDays
source: How many days an artifact folder needs to be unused in order to be removed
cs: Kolik dní musí být složka artefaktů nepoužívaná, aby byla odebrána
de: Wie viele Tage muss ein Artefaktordner ungenutzt bleiben, um entfernt zu werden?
es: Número de días que una carpeta de artefactos debe no usarse para poder quitarse
fr: Nombre de jours pendant lesquels un dossier d’artefacts doit être inutilisé pour être supprimé
it: Quanti giorni deve rimanere inutilizzata una cartella di artefatti affinché possa essere rimossa
ja: 成果物フォルダーが削除されるためには、何日間未使用である必要がありますか
ko: 아티팩트 폴더를 제거하기 위해 사용하지 않아야 하는 일 수
pl: Ile dni folder artefaktów musi pozostawać nieużywany, aby został usunięty
pt_br: Quantos dias uma pasta de artefato precisa ficar sem uso para ser removida
ru: Сколько дней папка артефактов должна оставаться неиспользуемой для ее удаления
tr: Bir yapıt klasörünün kaldırılabilmesi için kaç gün kullanılmaması gerekir?
zh_hans: 项目文件夹需要处于未使用状态多少天才能被移除
zh_hant: 成品資料夾需要閒置多少天才能移除

# CleanFileBasedAppArtifactsDirectoryNotFound
source: Warning: Artifacts directory does not exist: {0}
cs: Upozornění: Adresář artefaktů neexistuje: {0}
de: Warnung: Das Artefaktverzeichnis existiert nicht: {0}
es: Advertencia: el directorio de artefactos no existe: {0}
fr: Avertissement – le répertoire d’artefacts n’existe pas : {0}
it: Avviso: la directory degli artefatti non esiste: {0}
ja: 警告: 成果物ディレクトリが存在しません: {0}
ko: 경고: 아티팩트 디렉터리가 없음: {0}
pl: Ostrzeżenie: katalog artefaktów nie istnieje — {0}
pt_br: Aviso: o diretório de artefatos não existe: {0}
ru: Внимание! Каталог артефактов не существует: {0}
tr: Uyarı: Yapıtlar dizini mevcut değil: {0}
zh_hans: 警告: 项目目录不存在: {0}
zh_hant: 警告: 成品目錄不存在: {0}

# CleanFileBasedAppArtifactsDryRun
source: Determines changes without actually modifying the file system
cs: Určuje změny, aniž by ve skutečnosti měnil systém souborů.
de: Bestimmt Änderungen, ohne das Dateisystem tatsächlich zu ändern.
es: Determina los cambios sin modificar realmente el sistema de archivos
fr: Détermine les modifications sans réellement modifier le système de fichiers
it: Determina le modifiche senza modificare effettivamente il file system
ja: ファイル システムを実際に変更せずに変更を決定します
ko: 파일 시스템을 실제로 수정하지 않고 변경 내용을 결정합니다.
pl: Określa zmiany bez faktycznej modyfikacji systemu plików
pt_br: Determina alterações sem modificar o sistema de arquivos
ru: Определяет изменения, не внося фактических изменений в файловую систему
tr: Dosya sistemini gerçekten değiştirmeden değişiklikleri belirler
zh_hans: 确定更改但不实际修改文件系统
zh_hant: 確定變更而不實際修改檔案系統

# CleanFileBasedAppArtifactsErrorRemovingFolder
source: Error removing folder '{0}': {1}
cs: Chyba při odebírání složky {0}: {1}
de: Fehler beim Entfernen des Ordners „{0}“: {1}
es: Error al eliminar la carpeta "{0}": {1}
fr: Erreur lors de la suppression du dossier « {0} » : {1}
it: Errore durante la rimozione della cartella '{0}': {1}
ja: フォルダー '{0}' の削除中にエラーが発生しました: {1}
ko: '{0}'폴더를 제거하는 동안 오류 발생: {1}
pl: Błąd podczas usuwania folderu „{0}”: {1}
pt_br: Erro ao remover a pasta '{0}': {1}
ru: Ошибка при удалении папки "{0}": {1}
tr: ‘{0}’ klasörünü kaldırırken hata oluştu: {1}
zh_hans: 移除文件夹 "{0}" 时出错: {1}
zh_hant: 移除資料夾 '{0}' 時發生錯誤: {1}

# CleanFileBasedAppArtifactsScanning
source: Scanning for folders to remove in: {0}
cs: Vyhledávání složek k odebrání v: {0}
de: Es wird nach Ordnern gesucht, die in folgendem Verzeichnis entfernt werden sollen: {0}
es: Buscando carpetas para quitar en: {0}
fr: Recherche des dossiers à supprimer dans : {0}
it: Ricerca delle cartelle da rimuovere in: {0}
ja: 削除するフォルダーをスキャンしています: {0}
ko: 제거할 폴더 검색 위치: {0}
pl: Skanowanie w poszukiwaniu folderów do usunięcia w ścieżce {0}
pt_br: Procurando pastas para remover em: {0}
ru: Сканирование на наличие папок для удаления в: {0}
tr: Kaldırılacak klasörler için tarama: {0}
zh_hans: 正在扫描要进行移除操作的文件夹: {0}
zh_hant: 正在掃描要移除的資料夾位置: {0}

# CleanFileBasedAppArtifactsTotalFoldersRemoved
source: Total folders removed: {0}
cs: Celkový počet odebraných složek: {0}
de: Insgesamt entfernte Ordner: {0}
es: Total de carpetas quitadas: {0}
fr: Nombre total de dossiers supprimés : {0}
it: Totale cartelle rimosse: {0}
ja: 削除されたフォルダーの合計: {0}
ko: 제거된 총 폴더 수: {0}
pl: Łączna liczba usuniętych folderów: {0}
pt_br: Total de pastas removidas: {0}
ru: Всего удалено папок: {0}
tr: Toplam silinen klasör sayısı: {0}
zh_hans: 已移除的文件夹总数: {0}
zh_hant: 已移除的資料夾總數: {0}

# CleanFileBasedAppArtifactsWouldRemoveFolders
source: Would remove folders: {0}
cs: Odebere složky: {0}
de: Zu entfernende Ordner: {0}
es: Quitaría carpetas: {0}
fr: Supprimerait les dossiers : {0}
it: Rimuovere le cartelle: {0}
ja: フォルダーを削除しますか: {0}
ko: 제거할 폴더 수: {0}
pl: Usunie następującą liczbę folderów: {0}
pt_br: Pastas que seriam removidas: {0}
ru: Будет удалено папок: {0}
tr: Şu klasörleri siler: {0}
zh_hans: 将移除文件夹: {0}
zh_hant: 將移除的資料夾數量: {0}

# CleanFrameworkOptionDescription
source: The target framework to clean for. The target framework must also be specified in the project file.
cs: Cílová architektura pro vyčištění. Cílová architektura musí být určená také v souboru projektu.
de: Das Zielframework für die Bereinigung. Das Zielframework muss auch in der Projektdatei angegeben werden.
es: La plataforma de destino para la que se limpia. La plataforma de destino se debe especificar en el archivo de proyecto.
fr: Framework cible pour lequel le nettoyage est effectué. Le framework cible doit également être spécifié dans le fichier projet.
it: Framework di destinazione per cui eseguire la pulizia. Il framework di destinazione deve essere specificato anche nel file di progetto.
ja: クリーンする対象のターゲット フレームワーク。ターゲット フレームワークはプロジェクト ファイルでも指定する必要があります。
ko: 정리할 대상 프레임워크입니다. 대상 프레임워크는 프로젝트 파일에도 지정되어야 합니다.
pl: Platforma docelowa czyszczenia. Platforma docelowa musi być również określona w pliku projektu.
pt_br: A estrutura de destino para a qual a limpeza ocorrerá. A estrutura de destino também precisa ser especificada no arquivo de projeto.
ru: Целевая платформа для очистки. Целевая платформа также должна быть указана в файле проекта.
tr: Temizlenecek hedef çerçeve. Hedef çerçevenin proje dosyasında da belirtilmesi gerekir.
zh_hans: 要清理的目标框架。必须在项目文件中指定目标框架。
zh_hant: 要為其進行清理的目標架構。該目標架構必須在專案檔中指定。

# CleanRuntimeOptionDescription
source: The target runtime to clean for.
cs: Cílový modul runtime pro vyčištění.
de: Die Zielruntime für die Bereinigung.
es: El entorno de tiempo de ejecución para el que se limpia.
fr: Runtime cible pour lequel le nettoyage est effectué.
it: Runtime di destinazione per cui eseguire la pulizia.
ja: クリーンする対象のターゲット ランタイム。
ko: 정리할 대상 런타임입니다.
pl: Docelowe środowisko uruchomieniowe czyszczenia.
pt_br: O runtime de destino para o qual a limpeza ocorrerá.
ru: Целевая среда выполнения для очистки.
tr: Temizlenecek hedef çalışma zamanı.
zh_hans: 要清理的目标运行时。
zh_hant: 要為其進行清理的目標執行階段。

# CmdBlameCrashCollectAlwaysDescription
source: Enables collecting crash dump on expected as well as unexpected testhost exit.
cs: Umožní shromažďovat výpisy stavu systému při očekávaných i neočekávaných ukončeních hostitele testů.
de: Aktiviert die Erfassung von Absturzabbildern bei einer erwarteten und einer unerwarteten Beendigung des Testhosts.
es: Habilita la recopilación del volcado de memoria en la salida del host de prueba esperada e inesperada.
fr: Active la collecte des données de vidage sur plantage en cas de sortie attendue et inattendue de testhost.
it: Abilita la raccolta del dump di arresto anomalo in caso di chiusura prevista e imprevista dell'host di test.
ja: TestHost の予期されるおよび予期されない終了時にクラッシュ ダンプを収集することを有効にします。
ko: 예상된 테스트 호스트 종료와 예기치 않은 테스트 호스트 종료 시 크래시 덤프 수집을 사용하도록 설정합니다.
pl: Włącza zbieranie zrzutów awaryjnych po oczekiwanym i nieoczekiwanym zakończenia działania przez host testowy.
pt_br: Habilita a coleta de despejo de memória nas saídas esperada e inesperada do host de teste.
ru: Включает сбор аварийного дампа при ожидаемом и неожиданном завершении работы узла тестирования.
tr: Hem beklenen hem de beklenmeyen test ana bilgisayarı çıkışında kilitlenme bilgi dökümünün toplanmasını sağlar.
zh_hans: 允许在预期和意外的 testhost 退出时收集故障转储。
zh_hant: 允許在測試主機如預期或未預期地結束時收集損毀傾印。
