Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NoWorkloadHistoryRecords
source: Workload history records are created when when running an operation that modifies workloads like update or install. Cannot update from history until workload history records exist.
cs: Záznamy historie úloh se vytvářejí při spuštění operace, která mění úlohy, jako je aktualizace nebo instalace. Není možné aktualizovat z historie, dokud neexistují záznamy historie úlohy.
de: Workloadverlaufsdatensätze werden beim Ausführen eines Vorgangs erstellt, der Workloads ändert. wie Updates oder Installationen. Ein Update aus dem Verlauf kann erst ausgeführt werden, wenn Workloadverlaufsdatensätze vorhanden sind.
es: Los registros del historial de cargas de trabajo se crean cuando se ejecuta una operación que modifica cargas de trabajo como actualizar o instalar. No se puede actualizar desde el historial hasta que existan registros del historial de cargas de trabajo.
fr: Les enregistrements d’historique des charges de travail sont créés lors de l’exécution d’une opération qui modifie des charges de travail telles que la mise à jour ou l’installation. Impossible de mettre à jour à partir de l’historique tant que les enregistrements d’historique de charge de travail n’existent pas.
it: I record della cronologia del carico di lavoro vengono creati quando si esegue un'operazione che modifica carichi di lavoro come l'aggiornamento o l'installazione. Non è possibile eseguire l'aggiornamento dalla cronologia finché non sono presenti record della cronologia del carico di lavoro.
ja: ワークロード履歴レコードは、更新やインストールなど、ワークロードを変更する操作を実行するときに作成されます。ワークロード履歴レコードが作成されるまで、履歴から更新することはできません。
ko: 워크로드 기록 레코드는 업데이트 또는 설치와 같은 워크로드를 수정하는 작업을 실행할 때 만들어집니다. 워크로드 기록 레코드가 있어야 기록에서 업데이트할 수 있습니다.
pl: Rekordy historii obciążeń są tworzone podczas uruchamiania operacji modyfikującej obciążenia, takiej jak aktualizacja lub instalacja. Nie można zaktualizować z historii, dopóki nie istnieją rekordy historii obciążeń.
pt_br: Os registros de histórico de carga de trabalho são criados ao executar uma operação que modifica cargas de trabalho como atualização ou instalação. Não é possível atualizar do histórico até que existam registros de histórico de carga de trabalho.
ru: Записи журнала рабочей нагрузки создаются при выполнении операции, которая изменяет рабочие нагрузки, такой как обновление или установка. Невозможно выполнить обновление из журнала, пока не появятся записи журнала рабочей нагрузки.
tr: İş yükü geçmişi kayıtları, güncelleştirme veya yükleme gibi iş yüklerini değiştiren bir işlem çalıştırılırken oluşturulur. İş yükü geçmişi kayıtları mevcut olana kadar geçmiş güncelleştirilemez.
zh_hans: 运行修改工作负载(如更新或安装)的操作时，将创建工作负载历史记录。在工作负载历史记录存在之前，无法从历史记录更新。
zh_hant: 執行會修改工作負載 (例如更新或安裝) 的作業時，會建立工作負載歷程記錄。在工作負載歷程記錄存在之前，無法從歷程記錄更新。

source: No workload update found.
cs: Nenašla se žádná aktualizace úlohy.
de: Es wurde kein Workload-Update gefunden.
es: No se encontró ninguna actualización de carga de trabajo.
fr: Aucune mise à jour de charge de travail trouvée.
it: Non è stato trovato alcun aggiornamento del carico di lavoro.
ja: ワークロードの更新が見つかりませんでした。
ko: 워크로드 업데이트를 찾을 수 없습니다.
pl: Nie znaleziono aktualizacji obciążenia.
pt_br: Nenhuma atualização de carga de trabalho foi encontrada.
ru: Изменений рабочей нагрузки не найдено.
tr: İş yükü güncelleştirmesi bulunamadı.
zh_hans: 找不到工作负载更新。
zh_hant: 找不到任何工作負載更新。

# NoWorkloadVersionsFound
source: No workload versions found for SDK feature band {0}.
cs: Nenašly se žádné verze úloh pro pásmo funkcí sady SDK {0}.
de: Für SDK-Featureband {0} wurden keine Workloadversionen gefunden.
es: No se encontraron versiones de carga de trabajo para la banda de características del SDK {0}.
fr: Aucune version de charge de travail trouvée pour la bande de fonctionnalités du Kit de développement logiciel (SDK) {0}.
it: Nessuna versione del carico di lavoro trovata per {0} della banda di funzionalità SDK.
ja: SDK 機能バンド {0} のワークロード バージョンが見つかりません。
ko: SDK 기능 대역 {0}에 대한 워크로드 버전을 찾을 수 없습니다.
pl: Nie znaleziono wersji obciążenia dla pasma funkcji zestawu SDK {0}.
pt_br: Nenhuma versão de carga de trabalho encontrada para a faixa de recursos do SDK {0}.
ru: Не найдены версии рабочей нагрузки для диапазона функций SDK {0}.
tr: SDK özellik bandı {0} için iş yükü sürümü bulunamadı.
zh_hans: 找不到 SDK 功能区段 {0} 的工作负载版本。
zh_hant: 找不到 SDK 功能帶 {0} 的工作負載版本。

# NoWorkloadsInstalledInfoWarning
source: There are no installed workloads to display.
cs: Nejsou k dispozici žádné nainstalované úlohy, které by se daly zobrazit.
de: Es sind keine installierten Workloads zum Anzeigen vorhanden.
es: No hay cargas de trabajo instaladas para mostrar.
fr: Il n'y a aucune charge de travail installée à afficher.
it: Non sono presenti carichi di lavoro installati da visualizzare.
ja: 表示するインストール済みワークロードはありません。
ko: 표시할 설치된 워크로드가 없습니다.
pl: Brak zainstalowanych obciążeń do wyświetlenia.
pt_br: Não há cargas de trabalho instaladas para exibir.
ru: Нет установленных рабочих нагрузок для отображения.
tr: Görüntülenecek yüklü iş yükü yok.
zh_hans: 没有要显示的已安装工作负载。
zh_hant: 沒有已安裝的工作負載可顯示。

# NoWorkloadsToRepair
source: No workloads are installed, nothing to repair. Run `dotnet workload search` to find workloads to install.
cs: Nejsou nainstalované žádné úlohy, nic se nedá opravit. Pokud chcete najít úlohy, které se mají nainstalovat, spusťte vyhledávání úloh dotnet.
de: Es sind keine Workloads installiert, es ist keine Reparatur erforderlich. Führen Sie „dotnet workload search“ aus, um zu installierende Workloads zu finden.
es: No hay cargas de trabajo instaladas, no hay nada que reparar. Ejecute "dotnet workload search" para buscar las cargas de trabajo que se van a instalar.
fr: Aucune charge de travail n’est installée, rien à réparer. Exécutez « recherche de charge de travail dotnet » pour trouver les charges de travail à installer.
it: Nessun carico di lavoro installato, nulla da ripristinare. Eseguire 'ricerca del carico di lavoro DotNet' per trovare i carichi di lavoro da installare.
ja: ワークロードがインストールされていないため、修復するものがありません。`dotnet ワークロード検索` を実行してインストールするワークロードを検索します。
ko: 워크로드가 설치되어 있지 않고 복구할 것도 없습니다. ‘dotnet 워크로드 검색’을 실행하여 설치할 워크로드를 찾으세요.
pl: Nie zainstalowano żadnych obciążeń i nie ma nic do naprawienia. Uruchom polecenie „dotnet workload search”, aby znaleźć obciążenia do zainstalowania.
pt_br: Nenhuma carga de trabalho instalada, nada para reparar. Execute a 'pesquisa de carga de trabalho dotnet' para encontrar cargas de trabalho a serem instaladas.
ru: Рабочие нагрузки не установлены, не нужно ничего восстанавливать. Запустите "Поиск рабочей нагрузки DotNet", чтобы найти рабочие нагрузки для установки.
tr: İş yükü yüklenmediğinden onarılacak iş yükü yok. Yüklenecek iş yüklerini bulmak için `dotnet workload search` çalıştırın.
zh_hans: 未安装工作负载，没有要修复的内容。请运行“dotnet workload search”，查找要安装的工作负载。
zh_hant: 未安裝任何工作負載，沒有要修復的項目。請執行 `dotnet workload search` 以尋找要安裝的工作負載。

# NoWorkloadsToUpdate
source: No workloads installed for this feature band. To update workloads installed with earlier SDK versions, include the --from-previous-sdk option.
cs: Pro toto pásmo funkcí nejsou nainstalované žádné úlohy. Pokud chcete provést aktualizaci úlohy nainstalované z předchozí sady SDK, přidejte možnost --from-previous-sdk.
de: Für diesen Featurebereich sind keine Workloads installiert. Um Workloads zu aktualisieren, die mit früheren SDK-Versionen installiert wurden, schließen Sie die Option „--from-previous-sdk“ ein.
es: No hay cargas de trabajo instaladas para esta banda de características. Para actualizar las cargas de trabajo instaladas con versiones anteriores del SDK, incluya la opción --from-previous-sdk.
fr: Aucune charge de travail installée pour cette bande de fonctionnalités. Pour mettre à jour les charges de travail installées avec des versions antérieures du SDK, incluez l'option --from-previous-sdk.
it: Nessun carico di lavoro installato per questa banda di caratteristiche. Per eseguire l'aggiornamento da un SDK precedente, includere l'opzione --from-previous-sdk.
ja: この機能バンドにはワークロードがインストールされていません。以前の SDK バージョンでインストールしたワークロードを更新するには、--from-previous-sdk オプションを含めます。
ko: 이 기능 밴드에 대해 설치된 워크로드가 없습니다. 이전 SDK 버전으로 설치된 워크로드를 업데이트하려면 --from-previous-sdk 옵션을 포함합니다.
pl: Nie zainstalowano żadnych obciążeń dla tego pasma funkcji. Aby zaktualizować obciążenia zainstalowane przy użyciu wcześniejszych wersji zestawu SDK, dołącz opcję --from-previous-sdk.
pt_br: Nenhuma carga de trabalho instalada para esta faixa de recursos. Para atualizar cargas de trabalho instaladas com versões anteriores do SDK, inclua a opção --from-previous-sdk.
ru: Для этого диапазона функций не установлены рабочие нагрузки. Чтобы обновить рабочие нагрузки, установленные в более ранних версиях SDK, включите параметр --from-previous-sdk.
tr: Bu özellik bandı için iş yükü yüklenmedi. Önceki SDK sürümleriyle yüklenen iş yüklerini güncelleştirmek için --from-previous-sdk seçeneğini ekleyin.
zh_hans: 没有为此功能带安装工作负载。若要使用更早的 SDK 版本更新已安装的工作负载，请包括“the --from-previous-sdk”选项。
zh_hant: 此功能帶未安裝任何工作負載。若要更新與舊版本 SDK 一起安裝的工作負載，請包含 --from-previous-sdk 選項。

# NugetDefinition
source: Provides additional NuGet commands.
cs: Nabízí další příkazy NuGet.
de: Stellt zusätzliche NuGet-Befehle bereit.
es: Proporciona comandos NuGet adicionales.
fr: Fournit des commandes NuGet supplémentaires.
it: Fornisce comandi NuGet aggiuntivi.
ja: 追加の NuGet コマンドを提供します。
ko: 추가 NuGet 명령을 제공합니다.
pl: Udostępnia dodatkowe polecenia NuGet.
pt_br: Fornece comandos adicionais do NuGet.
ru: Предоставление дополнительных команд NuGet.
tr: Ek NuGet komutları sağlar.
zh_hans: 提供其他 NuGet 命令。
zh_hant: 提供其他 NuGet 命令。

# OSDoesNotSupportMsi
source: MSI installations are only supported on Windows.
cs: Instalace MSI jsou podporovány pouze v systému Windows.
de: MSI-Installationen werden nur unter Windows unterstützt.
es: Las instalaciones MSI solo se admiten en Windows.
fr: Les installations MSI sont prises en charge uniquement sur Windows.
it: Le installazioni MSI sono supportate solo in Windows.
ja: MSI のインストールは Windows でのみサポートされています。
ko: MSI 설치는 Windows에서만 지원됩니다.
pl: Instalacje MSI są obsługiwane tylko w systemie Windows.
pt_br: As instalações MSI só têm suporte no Windows.
ru: Установки MSI поддерживаются только в Windows.
tr: MSI yüklemeleri yalnızca Windows 'da desteklenir.
zh_hans: MSI 安装仅在 Windows 上受支持。
zh_hant: 只有 Windows 支援 MSI 安裝。

# OnlyLocalOptionSupportManifestFileOption
source: Specifying the tool manifest option (--tool-manifest) is only valid with the local option (--local or the default).
cs: Zadávání možnosti manifestu nástroje (--tool-manifest) je platné jen spolu s možností local (--local nebo výchozí).
de: Die Angabe der Toolmanifestoption (--tool-manifest) ist nur mit der lokalen Option gültig (--local oder Standardwert).
es: La especificación de la opción del manifiesto de herramienta (--tool-manifest) solo es válida con la opción local (--local o el valor predeterminado).
fr: La spécification de l'option de manifeste d'outils (--tool-manifest) est valide uniquement avec l'option locale (--local ou la valeur par défaut).
it: La specifica dell'opzione tool-manifest (--tool-manifest) è valida solo con l'opzione local (--local o impostazione predefinita).
ja: ツール マニフェスト オプション (--tool-manifest) の指定は、ローカル オプション (--local または既定) でのみ有効です。
ko: 도구 매니페스트 옵션(--tool-manifest) 지정은 로컬 옵션(--local 또는 기본값)에만 유효합니다.
pl: Określenie opcji manifestu narzędzia (--tool-manifest) jest prawidłowe tylko z opcją lokalną (--local lub wartość domyślna).
pt_br: A especificação da opção de manifesto da ferramenta (--tool-manifest) é válida somente com a opção local (--local ou o padrão).
ru: Указание параметра манифеста средства (--tool-manifest) допустимо только с локальным параметром (--local или значение по умолчанию).
tr: Araç bildirimi seçeneğini (--tool-manifest) belirtme işlemi yalnızca yerel seçeneğiyle (--local veya varsayılan) geçerlidir.
zh_hans: 指定工具清单选项(--tool-manifest)仅对本地选项(--local 或默认值)有效。
zh_hant: 只有出現區域選項 (--local 或預設) 時，才可指定工具資訊清單選項 (--tool-manifest)。

# OptionsCannotBeCombined
source: Options '--outdated', '--deprecated' and '--vulnerable' cannot be combined.
cs: Možnosti --outdated, --deprecated a --vulnerable se nedají kombinovat.
de: Die Optionen "--outdated", "--deprecated" und "--vulnerable" können nicht kombiniert werden.
es: No se pueden combinar las opciones "--outdated", "--deprecated" y "--vulnerable".
fr: Les options '--outdated', '--deprecated' et '--vulnerable' ne peuvent pas être combinées.
it: Non è possibile combinare le opzioni '--outdated', '--deprecated' e '--vulnerable'.
ja: オプション '--outdated'、'--deprecated'、'--vulnerable' を組み合わせることはできません。
ko: '--outdated', '--deprecated' 및 '--vulnerable' 옵션은 함께 사용할 수 없습니다.
pl: Nie można łączyć opcji „--outdated”, „--deprecated” i „--vulnerable”.
pt_br: As opções '--outdated', '--deprecated' e '--vulnerable' não podem ser combinadas.
ru: Параметры "--outdated", "--deprecated" и "--vulnerable" не могут использоваться вместе.
tr: '--outdated', '--deprecated' ve '--vulnerable' seçenekleri birleştirilemez.
zh_hans: 不能将 "--outdated'"、"--deprecated" 和 "--vulnerable" 选项结合使用。
zh_hant: '--outdated'、'--deprecated' 與 '--vulnerable' 選項無法一併使用。

# OutOfProcessArtifactsProduced
source: Out of process file artifacts produced:
cs: Vytvořené artefakty souboru mimo proces:
de: Nicht verarbeitete Dateiartefakte erstellt:
es: Artefactos de archivo fuera de proceso producidos:
fr: Artefacts de fichier hors processus produits :
it: Artefatti file non in elaborazione prodotti:
ja: アウトプロセスのファイル成果物が生成されました:
ko: 생성된 Out of process 파일 아티팩트:
pl: Wygenerowane artefakty pliku poza procesem:
pt_br: Artefatos de arquivo fora do processo produzidos:
ru: Созданные вне процесса артефакты файлов:
tr: Üretilen işlem dışı dosya yapıtları:
zh_hans: 生成的进程外文件项目:
zh_hant: 產生的流程外檔案成品：

# OutOfSupportMessage
source: .NET {0} is out of support.
cs: Rozhraní .NET {0} se už nepodporuje.
de: .NET {0} wird nicht mehr unterstützt.
es: .NET {0} no tiene soporte técnico.
fr: .NET {0} n'est plus pris en charge.
it: Il supporto per .NET {0} non è più disponibile.
ja: .NET {0} はサポートされていません。
ko: .NET {0}은(는) 지원되지 않습니다.
pl: Platforma .NET {0} nie jest już wspierana.
pt_br: Não há mais suporte para o .NET {0}.
ru: .NET {0} не поддерживается.
tr: .NET {0} desteği kaldırıldı.
zh_hans: .NET {0} 结束支持。
zh_hant: .NET {0} 已不再支援。

# PackAppFullName
source: .NET Core NuGet Package Packer
cs: Nástroj .NET Core pro balení balíčku NuGet
fr: Compresseur de package NuGet .NET Core
it: Strumento di creazione pacchetti NuGet di .NET Core
ja: .NET Core NuGet パッケージ パッカー
ko: .NET Core NuGet 패키지 패커
pl: Tworzenie pakietów NuGet w programie .NET Core
pt_br: Empacotador de Pacotes NuGet do .NET Core
ru: Упаковщик пакетов NuGet .NET Core
tr: .NET Core NuGet Paketi Paketleyicisi
zh_hans: .NET Core NuGet 包打包程序
zh_hant: .NET Core NuGet 套件封裝器

# PackCmdNoLogo
source: Do not display the startup banner or the copyright message.
cs: Nezobrazovat úvodní nápis ani zprávu o autorských právech
de: Zeigt kein Startbanner und keine Copyrightmeldung an.
es: No mostrar la pancarta de inicio ni el mensaje de copyright.
fr: N'affiche pas la bannière de démarrage ni le message de copyright.
it: Evita la visualizzazione del messaggio di avvio o di copyright.
ja: 著作権情報を表示しません。
ko: 시작 배너 또는 저작권 메시지를 표시하지 않습니다.
pl: Nie wyświetlaj baneru początkowego ani komunikatu o prawach autorskich.
pt_br: Não exibe a faixa de inicialização ou a mensagem de direitos autorais.
ru: Не отображать начальный баннер или сообщение об авторских правах.
tr: Başlangıç bandını veya telif hakkı iletisini görüntüleme.
zh_hans: 不显示启动版权标志或版权消息。
zh_hant: 不顯示啟始資訊或著作權訊息。

# PackCmdOutputDirDescription
source: The output directory to place built packages in.
cs: Výstupní adresář, kam se mají umístit sestavené balíčky
de: Das Ausgabeverzeichnis, in dem erstellte Pakete abgelegt werden.
es: Directorio de salida en el que se ubicarán los paquetes compilados.
fr: Répertoire de sortie dans lequel placer les packages générés.
it: Directory di output in cui inserire i pacchetti compilati.
ja: ビルドしたパッケージを配置する出力ディレクトリ。
ko: 빌드된 패키지를 배치할 출력 디렉터리입니다.
pl: Katalog wyjściowy, w którym mają zostać umieszczone skompilowane pakiety.
pt_br: O diretório de saída no qual os pacotes do build serão colocados.
ru: Выходной каталог для размещения собранных пакетов.
tr: Derlenen paketlerin yerleştirileceği çıkış dizini.
zh_hans: 要放置生成包的输出目录。
zh_hant: 放置組建套件所在的輸出目錄。

# PackCmdVersion
source: VERSION
cs: VERZE
es: VERSIÓN
it: VERSIONE
ja: バージョン
pl: WERSJA
pt_br: VERSÃO
tr: SÜRÜM
zh_hans: 版本
zh_hant: 版本

# PackCmdVersionDescription
source: The version of the package to create
cs: Verze balíčku, který se má vytvořit
de: Die Version des Pakets, das erstellt werden soll
es: La versión del paquete para crear
fr: Version du package à créer
it: La versione del pacchetto da creare
ja: 作成するパッケージのバージョン
ko: 생성할 패키지의 버전
pl: Wersja pakietu do utworzenia
pt_br: A versão do pacote a ser criado
ru: Версия создаваемого пакета
tr: Oluşturulacak paketin sürümü
zh_hans: 要创建的包版本
zh_hant: 要建立的套件版本

# PackConfigurationOptionDescription
source: The configuration to use for building the package. The default is 'Release'.
cs: Konfigurace, která se má použít k sestavení balíčku. Výchozí hodnota je Release.
de: Die für die Paketerstellung zu verwendende Konfiguration. Der Standardwert lautet "Release".
es: Configuración que se va a usar para compilar el paquete. El valor predeterminado es "Release".
fr: Configuration à utiliser pour la génération du package. La valeur par défaut est « Release ».
it: Configurazione da usare per la compilazione del pacchetto. Il valore predefinito è 'Release'.
ja: パッケージのビルドに使用する構成。既定値は 'Release' です。
ko: 패키지를 빌드하는 데 사용할 구성입니다. 기본값은 'Release'입니다.
pl: Konfiguracja używana do kompilowania pakietu. Wartość domyślna to „Wersja”.
pt_br: A configuração a ser usada para compilar o pacote. O padrão é 'Liberar'.
ru: Конфигурация, используемая для сборки пакета. Значение по умолчанию — "Release".
tr: Paketi derlemek için kullanılacak yapılandırma. Varsayılan değer 'Release' olur.
zh_hans: 用于生成包的配置。默认值为 "Release"。
zh_hant: 用於建置套件的設定。預設值為 'Release'。

# PackDefinition
source: Create a NuGet package.
cs: Vytvoří balíček NuGet.
de: Hiermit wird ein NuGet-Paket erstellt.
es: Crea un paquete de NuGet.
fr: Créez un package NuGet.
it: Crea un pacchetto NuGet.
ja: NuGet パッケージを作成します。
ko: NuGet 패키지를 만듭니다.
pl: Utwórz pakiet NuGet.
pt_br: Criar um pacote do NuGet.
ru: Создание пакета NuGet.
tr: Bir NuGet paketi oluşturur.
zh_hans: 创建 NuGet 包。
zh_hant: 建立 NuGet 套件。

# PackageAddAppFullName
source: Add a NuGet package reference to the project.
cs: Přidat odkaz na balíček NuGet do projektu
de: Hiermit fügen Sie dem Projekt einen NuGet-Paketverweis hinzu.
es: Agrega una referencia de paquete de NuGet al proyecto.
fr: Ajoutez une référence de package NuGet au projet.
it: Aggiunge un riferimento al pacchetto NuGet al progetto.
ja: プロジェクトに NuGet パッケージ参照を追加します。
ko: 프로젝트에 NuGet 패키지 참조를 추가합니다.
pl: Dodaj odwołanie do pakietu NuGet do projektu.
pt_br: Adicione uma referência do pacote do NuGet ao projeto.
ru: Добавление в проект ссылки на пакет NuGet.
tr: Projeye bir NuGet paketi başvurusu ekleyin.
zh_hans: 向项目添加 NuGet 包引用。
zh_hant: 將 NuGet 套件參考新增至專案。

# PackageAddCmdFramework
source: FRAMEWORK
es: MARCO
tr: ÇERÇEVE
zh_hant: 架構

# PackageAddCmdFrameworkDescription
source: Add the reference only when targeting a specific framework.
cs: Přidá odkaz jen v případě, že cílem je konkrétní architektura.
de: Hiermit wird der Verweis nur dann hinzugefügt, wenn ein bestimmtes Zielframework als Zielversion verwendet wird.
es: Agrega una referencia solo cuando el destino es una plataforma específica.
fr: Ajoutez la référence uniquement en cas de ciblage d'un framework spécifique.
it: Aggiunge il riferimento solo se destinato a un framework specifico.
ja: 特定のフレームワークを対象とする場合にのみ参照を追加します。
ko: 특정 프레임워크를 대상으로 지정할 때에만 참조를 추가합니다.
pl: Dodaj odwołanie tylko w przypadku określenia konkretnej platformy docelowej.
pt_br: Adicionar a referência apenas ao direcionar a uma estrutura específica.
ru: Добавление ссылки только для конкретной целевой платформы.
tr: Başvuruyu yalnızca belirli bir çerçeveyi hedeflerken ekler.
zh_hans: 仅针对特定框架添加引用。
zh_hant: 只有在以特定架構為目標時才新增此參考。

# PackageAddCmdNoRestoreDescription
source: Add the reference without performing restore preview and compatibility check.
cs: Přidá odkaz bez provedení náhledu obnovení a kontroly kompatibility.
de: Hiermit wird ein Verweis hinzugefügt, ohne dass eine Wiederherstellung der Vorschau oder eine Kompatibilitätsprüfung durchgeführt wird.
es: Agrega la referencia sin realizar la vista previa de restauración y la comprobación de compatibilidad.
fr: Ajoutez la référence sans effectuer d'aperçu de restauration ni de vérification de compatibilité.
it: Aggiunge il riferimento senza eseguire l'anteprima di restore e la verifica della compatibilità.
ja: 復元のプレビューや互換性チェックを行わずに参照を追加します。
ko: 미리 보기 복원 및 호환성 검사를 수행하지 않고 참조를 추가합니다.
pl: Dodaj odwołanie bez tworzenia podglądu przywracania i sprawdzania zgodności.
pt_br: Adicionar a referência sem executar a visualização da restauração e a verificação de compatibilidade.
ru: Добавление ссылки без предварительной проверки восстановления и совместимости.
tr: Başvuruyu, geri yükleme önizlemesi ve uyumluluk denetimi gerçekleştirmeden ekler.
zh_hans: 在没有执行还原预览和兼容性检查的情况下添加引用。
zh_hant: 無須執行還原預覽及相容性檢查，即可新增參考。

# PackageAddCmdSource
source: SOURCE
cs: ZDROJ
de: QUELLE
es: ORIGEN
pl: ŹRÓDŁO
pt_br: ORIGEM
tr: KAYNAK
zh_hant: 來源

# PackageAddCmdSourceDescription
source: The NuGet package source to use during the restore.
cs: Zdroj balíčku NuGet, který se použije při obnovení
de: Die für die Wiederherstellung zu verwendende NuGet-Paketquelle.
es: El origen de un paquete de NuGet para usarlo durante la restauración.
fr: Source de package NuGet à utiliser durant la restauration.
it: Origine pacchetto NuGet da usare durante il ripristino.
ja: 復元中に使用する NuGet パッケージ ソース。
ko: 복원 중 사용할 NuGet 패키지 소스입니다.
pl: Źródło pakietów NuGet do użycia podczas przywracania.
pt_br: A origem do pacote do NuGet a ser usada durante a restauração.
ru: Источник пакетов NuGet, используемый во время восстановления.
tr: Geri yükleme sırasında kullanılacak NuGet paketi kaynağı.
zh_hans: 要在还原期间使用的 NuGet 包源。
zh_hant: 還原期間所使用的 NuGet 套件來源。

# PackageDefinition
source: Search for, add, remove, or list PackageReferences for a .NET project.
cs: Umožňuje vyhledat, přidat, odebrat nebo vypsat PackageReferences pro projekt .NET.
de: PackageReferences für ein .NET-Projekt suchen, hinzufügen, entfernen oder auflisten.
es: Busque, agregue, quite o enumere PackageReferences para un proyecto de .NET.
fr: Recherchez, ajoutez, supprimez ou répertoriez des PackageReferences pour un projet .NET.
it: Cerca, aggiungi, rimuovi o elenca PackageReferences per un progetto .NET.
ja: .NET プロジェクトの PackageReferences を検索、追加、削除、または一覧表示します。
ko: .NET 프로젝트에 대한 PackageReferences를 검색, 추가, 제거 또는 나열합니다.
pl: Wyszukaj, dodaj, usuń lub wyświetl listę elementów PackageReference dla projektu platformy .NET.
pt_br: Pesquise, adicione, remova ou liste PackageReferences para um projeto do .NET.
ru: Поиск, добавление, удаление или перечисление PackageReferences для проекта .NET.
tr: .NET projesi için PackageReferences arayın, ekleyin, kaldırın veya listeleyin.
zh_hans: 搜索、添加、移除或列出 .NET 项目的 PackageReferences。
zh_hant: 搜尋、新增、移除或列出 .NET 專案的 PackageReferences。
