Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# WorkloadListWorkloadUpdatesAvailable
source: Updates are available for the following workload(s): {0}. Run `dotnet workload update` to get the latest.
cs: Aktualizace jsou k dispozici pro následující úlohy: {0}. Pokud chcete získat nejnovější verzi, spusťte aktualizaci úlohy dotnet (`dotnet workload update`).
de: Updates sind für die folgenden Workloads verfügbar: {0}. Führen Sie „dotnet workload update“ aus, um die neueste Updates zu erhalten.
es: Hay actualizaciones disponibles para las siguientes cargas de trabajo: {0}. Ejecute "dotnet workload update" para obtener la versión más reciente.
fr: Des mises à jour sont disponibles pour les charges de travail suivantes : {0}. Exécutez `dotnet workload update` pour obtenir la dernière version.
it: Gli aggiornamenti sono disponibili per i carichi di lavoro seguenti: {0}. Per ottenere la versione più recente, eseguire 'dotnet workload update'.
ja: 次のワークロードについて更新プログラムを入手可能です: {0}。最新版を取得するには、`dotnet workload update` を実行します。
ko: 다음 워크로드에 대한 업데이트를 사용할 수 있습니다. {0}. 최신 버전을 받으려면 `dotnet workload update`를 실행하세요.
pl: Aktualizacje są dostępne dla następujących obciążeń: {0}. Uruchom polecenie `dotnet workload update`, aby uzyskać najnowszą wersję.
pt_br: As atualizações estão disponíveis para as seguintes cargas de trabalho(s): {0}. Execute `dotnet workload update` para obter o mais recente.
ru: Обновления доступны для следующих рабочих нагрузок: {0}. Чтобы получить последнюю версию, запустите `dotnet workload update`.
tr: Şu iş yükleri için güncelleştirmeler var: {0}. En son sürümü almak için `dotnet workload update` çalıştırın.
zh_hans: 以下工作负载有可用的更新: {0}。请运行 `dotnet workload update` 以获取最新版本。
zh_hant: 以下工作負載有可用的更新: {0}。執行 `dotnet workload update` 以取得最新更新。

# WorkloadManifestFeatureBandColumn
source: Manifest feature band
cs: Pásmo funkcí manifestu
es: Banda de características del manifiesto
fr: Bande de fonctionnalités du manifeste
it: Banda di funzionalità del manifesto
ja: マニフェスト機能バンド
ko: 매니페스트 기능 밴드
pl: Pasek funkcji manifestu
pt_br: Faixa de recursos do manifesto
ru: Диапазон функций манифеста
tr: Bildirim özellik bandı
zh_hans: 清单功能区段
zh_hant: 資訊清單功能帶

# WorkloadManifestIdColumn
source: Workload manifest ID
cs: ID manifestu úlohy
es: Id. de manifiesto de carga de trabajo
fr: ID du manifeste de charge de travail
it: ID manifesto del carico di lavoro
ja: ワークロード マニフェスト ID
ko: 워크로드 매니페스트 ID
pl: Identyfikator manifestu obciążenia
pt_br: ID do manifesto da carga de trabalho
ru: Идентификатор манифеста рабочей нагрузки
tr: İş yükü bildirimi kimliği
zh_hans: 工作负载清单 ID
zh_hant: 工作負載資訊清單識別碼

# WorkloadManifestInstallationConfigurationLooseManifests
source: Configured to use loose manifests when installing new manifests.
cs: Nakonfigurováno pro použití volných manifestů při instalaci nových manifestů
de: Für die Verwendung von losen Manifesten bei der Installation neuer Manifeste konfiguriert.
es: Configurado para usar manifiestos dinámicos al instalar nuevos manifiestos.
fr: Configuré pour utiliser des manifestes non liés lors de l’installation de nouveaux manifestes.
it: Configurato per l'uso manifesti staccati durante l'installazione di nuovi manifesti.
ja: 新しいマニフェストをインストールするときに緩いマニフェストを使用するように構成されています。
ko: 새 매니페스트를 설치할 때 느슨한 매니페스트를 사용하도록 구성됩니다.
pl: Skonfigurowano używanie luźnych manifestów podczas instalowania nowych manifestów.
pt_br: Configurado para usar manifestos soltos ao instalar novos manifestos.
ru: Настроено на использование отдельных манифестов при установке новых манифестов.
tr: Yeni bildirimler yüklenirken bağımsız bildirimler kullanacak şekilde yapılandırılmıştır.
zh_hans: 已配置为在安装新清单时使用松散清单。
zh_hant: 設為在安裝新資訊清單時使用鬆散的資訊清單。

# WorkloadManifestInstallationConfigurationWorkloadSets
source: Configured to use workload sets when installing new manifests.
cs: Nakonfigurováno pro použití sad úloh (workload sets) při instalaci nových manifestů
de: Für die Verwendung von workload sets bei der Installation neuer Manifeste konfiguriert.
es: Configurado para usar workload sets al instalar nuevos manifiestos.
fr: Configuré pour utiliser desworkload sets lors de l’installation de nouveaux manifestes.
it: Configurato per l'uso "workload sets" durante l'installazione di nuovi manifesti.
ja: 新しいマニフェストをインストールするときに workload sets を使用するように構成されています。
ko: 새 매니페스트를 설치할 때 use workload sets 사용하도록 구성됩니다.
pl: Skonfigurowano używanie workload sets podczas instalowania nowych manifestów.
pt_br: Configurado para usar workload sets ao instalar novos manifestos.
ru: Настроено на использование workload sets при установке новых манифестов.
tr: Yeni bildirimler yüklenirken workload sets kullanacak şekilde yapılandırılmıştır.
zh_hans: 已配置为在安装新清单时使用 workload sets。
zh_hant: 設為在安裝新資訊清單時使用 workload sets。

# WorkloadManifestPathColumn
source: Manifest Path
cs: Cesta manifestu
de: Manifestpfad
es: Ruta de acceso del manifiesto
fr: Chemin d'accès au Manifeste
it: Percorso del manifesto
ja: マニフェスト パス
ko: 매니페스트 경로
pl: Ścieżka manifestu
pt_br: Caminho do Manifesto
ru: Путь к манифесту
tr: Bildirim Yolu
zh_hans: 清单路径
zh_hant: 資訊清單路徑

# WorkloadManifestVersionColumn
source: Manifest Version
cs: Verze manifestu
es: Versión del manifiesto
fr: Version de manifeste
it: Versioni del manifesto
ja: マニフェストのバージョン
ko: 매니페스트 버전
pl: Wersja manifestu
pt_br: Versão do Manifesto
ru: Версия манифеста
tr: Bildirim Sürümü
zh_hans: 清单版本
zh_hant: 資訊清單版本

# WorkloadNotInstalled
source: Couldn't find workload ID(s): {0}
cs: Nepovedlo se najít ID úlohy: {0}
de: Die Workload-ID(s) wurden nicht gefunden: {0}
es: No se encontraron los identificadores de carga de trabajo: {0}
fr: Impossible de trouver le ou les ID de la charge de travail : {0}
it: Non è stato possibile trovare gli ID del carico di lavoro: {0}
ja: ワークロード ID が見つかりませんでした: {0}
ko: 작업 ID {0}을(를) 찾을 수 없습니다
pl: Nie można znaleźć identyfikatorów obciążenia: {0}
pt_br: Não foi possível encontrar as IDs de carga de trabalho: {0}
ru: Не удалось найти идентификаторы рабочей нагрузки: {0}
tr: İş yükü kimlikleri bulunamadı: {0}
zh_hans: 找不到工作负载 ID: {0}
zh_hant: 找不到工作負載識別碼: {0}

# WorkloadNotRecognized
source: Workload ID {0} is not recognized.
cs: ID úlohy {0} nebylo rozpoznáno.
de: Die Workload-ID {0} wird nicht erkannt.
es: No se reconoce el id. de carga de trabajo {0}.
fr: La charge de travail avec l’ID {0} n’est pas reconnue.
it: L'ID del carico di lavoro {0} non è stato riconosciuto.
ja: ワークロード ID {0} は認識されません。
ko: 워크로드 ID {0} 인식할 수 없습니다.
pl: Nie rozpoznano identyfikatora obciążenia {0}.
pt_br: A ID de carga de trabalho {0} não é reconhecida.
ru: Рабочая нагрузка с идентификатором {0} не распознана.
tr: {0} iş yükü kimliği tanınmıyor.
zh_hans: 未识别工作负载 ID {0}。
zh_hant: 無法辨識工作負載識別碼 {0}。

# WorkloadNotSupportedOnPlatform
source: Workload ID {0} isn't supported on this platform.
cs: ID úlohy {0} na této platformě není podporované.
de: Die Workload-ID {0} wird auf dieser Plattform nicht unterstützt.
es: El id. de carga de trabajo {0} no es compatible con esta plataforma.
fr: L’ID de charge de travail {0} n’est pas pris en charge sur cette plateforme.
it: L'ID del carico di lavoro {0} non è supportato su questa piattaforma.
ja: ワークロード ID {0} は、このプラットフォームでサポートされていません。
ko: 이 플랫폼에서는 워크로드 ID {0}이(가) 지원되지 않습니다.
pl: Identyfikator obciążenia {0} nie jest obsługiwany na tej platformie.
pt_br: A ID de carga de trabalho {0} não tem suporte nesta plataforma.
ru: ИД рабочей нагрузки {0} не поддерживается на этой платформе.
tr: {0} iş yükü kimliği bu platformda desteklenmiyor.
zh_hans: 此平台不受支持工作负载 ID {0}。
zh_hant: 此平台不支援工作負載識別碼 {0}。

# WorkloadPackAlreadyInstalledMessage
source: Pack {0} version {1} is already installed.
cs: Sada {0} verze {1} se už nainstalovala.
de: Pack "{0}" (Version {1}) ist bereits installiert.
es: Paquete {0} versión {1} ya está instalado.
fr: La version {1} du pack {0} est déjà installée.
it: La versione {1} del pacchetto {0} è già installata.
ja: パック '{0}' バージョン {1} は既にインストールされています。
ko: {0} 팩 버전 {1}이(가) 이미 설치되었습니다.
pl: Pakiet obciążenia {0} w wersji {1} jest już zainstalowany.
pt_br: O pacote {0} versão {1} já está instalado.
ru: Пакет "{0}" версии {1} уже установлен.
tr: Paket {0} sürüm {1} zaten yüklü.
zh_hans: 已安装版本包 {0} 版本{1}。
zh_hant: 套件{0} ({1} 版本) 已經安裝。

# WorkloadRepairCommandDescription
source: Repair workload installations.
cs: Opravte instalace úloh.
de: Reparieren Sie Workloadinstallationen.
es: Repara las instalaciones de cargas de trabajo.
fr: Réparez les installations de charge de travail.
it: Ripara le installazioni del carico di lavoro.
ja: ワークロード インストールを修復します。
ko: 워크로드 설치를 복구합니다.
pl: Napraw instalacje obciążeń.
pt_br: Repare as instalações de carga de trabalho.
ru: Восстановление установок рабочей нагрузки.
tr: İş yükü yüklemelerini onarın.
zh_hans: 修复工作负载安装。
zh_hant: 修復工作負載安裝。

# WorkloadRepairFailed
source: Workload repair failed: {0}
cs: Oprava úlohy se nezdařila: {0}
de: Fehler bei der Reparatur von Workload: {0}
es: Error en la reparación de la carga de trabajo: {0}
fr: Échec de la réparation de la charge de travail : {0}
it: Ripristino del carico di lavoro non riuscita: {0}
ja: ワークロードの修復に失敗しました: {0}
ko: 워크로드를 복구하지 못했습니다. {0}
pl: Nie można naprawić obszaru roboczego: {0}
pt_br: Falha no reparo da carga de trabalho: {0}
ru: Сбой исправления рабочей нагрузки: {0}
tr: İş yükü onarılamadı: {0}
zh_hans: 工作负载修复失败: {0}
zh_hant: 工作負載修復失敗: {0}

# WorkloadRestoreCommandDescription
source: Restore workloads required for a project.
cs: Obnovte úlohy požadované pro projekt.
de: Stellen Sie Workloads wieder her, die für ein Projekt erforderlich sind.
es: Restaure las cargas de trabajo necesarias para un proyecto.
fr: Restaurez les charges de travail nécessaires à un projet.
it: Ripristina i carichi di lavoro richiesti per il progetto.
ja: プロジェクトに必要なワークロードを復元します。
ko: 프로젝트에 필요한 워크로드를 복원합니다.
pl: Przywróć obciążenia wymagane dla projektu.
pt_br: Restaurar as cargas de trabalho necessárias para um projeto.
ru: Восстановление рабочих нагрузок, необходимых для проекта.
tr: Proje için gereken iş yüklerini geri yükleyin.
zh_hans: 还原项目所需的工作负载。
zh_hant: 還原專案所需的工作負載。

# WorkloadSearchCommandDescription
source: Search for available workloads.
cs: Vyhledávejte dostupné úlohy.
de: Suchen Sie nach verfügbaren Workloads.
es: Permite buscar cargas de trabajo disponibles.
fr: Recherchez les charges de travail disponibles.
it: Cercare carichi di lavoro disponibili.
ja: 使用可能なワークロードを検索します。
ko: 사용 가능한 워크로드를 검색합니다.
pl: Wyszukaj dostępne obciążenia.
pt_br: Pesquise cargas de trabalho disponíveis.
ru: Поиск доступных рабочих нагрузок.
tr: Kullanılabilir iş yüklerini arayın.
zh_hans: 搜索可用的工作负载。
zh_hant: 搜尋可用的工作負載。

# WorkloadSetFromGlobalJsonInstalled
source: Using workload version {0}, which was specified in the global.json file at {1}.
cs: Používá se verze úlohy {0}, která byla zadána v souboru global.json na {1}.
de: Es wird die Workloadversion {0} verwendet, die in der Datei „global.json“ unter {1} angegeben wurde.
es: Utilizando la versión {0} de carga de trabajo, que se especificó en el archivo global.json en {1}.
fr: Utilisation de la version de charge de travail {0}, qui a été spécifiée dans le fichier global.json à {1}.
it: Si utilizza la versione del carico di lavoro {0}, specificata nel file di global.json in {1}.
ja: {1} のglobal.json ファイルで指定されたワークロード バージョン {0} を使用しています。
ko: {1}의 global.json 파일에 지정된 워크로드 버전 {0}을(를) 사용합니다.
pl: Użycie wersji obciążenia {0}, która została określona w pliku global.json w {1}.
pt_br: Usando a versão {0} da carga de trabalho, que foi especificada no arquivo global.json em {1}.
ru: Использование версии рабочей нагрузки {0}, указанной в файле global.json в {1}.
tr: {1} içindeki global.json dosyasında belirtilen {0} iş yükü sürümünün kullanılması.
zh_hans: 使用工作负载版本 {0}，该版本于 {1} 在 global.json 文件中指定。
zh_hant: 使用工作負載版本 {0}，這是在 {1} 的 global.json 檔案中所指定。

# WorkloadSetFromGlobalJsonNotInstalled
source: Workload version {0}, which was specified in {1}, was not found. Run "dotnet workload restore" to install this workload version.
cs: Verze {0} úlohy, která byla zadána v {1}, nebyla nalezena. Spuštěním příkazu dotnet workload restore nainstalujte tuto verzi úlohy.
de: Die Arbeitsauslastungsversion {0}, die in {1} angegeben wurde, wurde nicht gefunden. Führen Sie „dotnet workload restore“ aus, um diese Workloadversion zu installieren.
es: No se encontró la versión de carga de trabajo {0}, que se especificó en {1}. Ejecuta "dotnet workload restore" para instalar esta versión de carga de trabajo.
fr: La version de charge de travail {0}, qui a été spécifiée dans {1}, est introuvable. Exécutez « dotnet workload restore » pour installer cette version de charge de travail.
it: La versione del carico di lavoro {0}, specificata in {1}, non è stata trovata. Eseguire "dotnet workload restore" per installare questa versione del carico di lavoro.
ja: {1} で指定されたワークロード バージョン {0} が見つかりませんでした。"dotnet workload restore" を実行して、このワークロード バージョンをインストールします。
ko: {1}에 지정된 워크로드 버전 {0}을(를) 찾을 수 없습니다. "dotnet workload restore"을 실행하여 이 워크로드 버전을 설치합니다.
pl: Nie znaleziono wersji obciążenia {0} określonej w kontenerze {1}. Uruchom polecenie „dotnet workload restore”, aby zainstalować tę wersję obciążenia.
pt_br: A versão da carga de trabalho {0}, especificada em {1}, não foi localizada. Execute "dotnet workload restore" para instalar esta versão da carga de trabalho.
ru: Версия рабочей нагрузки {0}, указанная в {1}, не найдена. Запустите команду "dotnet workload restore", чтобы установить эту версию рабочей нагрузки.
tr: {1} konumunda belirtilen {0} iş yükü sürümü bulunamadı. Bu iş yükü sürümünü yüklemek için "dotnet workload restore" komutunu çalıştırın.
zh_hans: 找不到在 {1} 中指定的工作负载版本 {0}。运行“dotnet workload restore”以安装此工作负载版本。
zh_hant: 找不到 {1} 中指定的工作負載版本 {0}。執行 "dotnet workload restore" 以安裝此工作負載版本。

# WorkloadSetVersionOptionDescription
source: A workload version to display or one or more workloads and their versions joined by the '@' character.
cs: Verze úlohy, která se má zobrazit, nebo jedna nebo více úloh a jejich verze spojené znakem @.
de: Eine Workloadversion zum Anzeigen oder mindestens eine Workload und deren Versionen, die mit dem Zeichen "@" verknüpft sind.
es: Una versión de carga de trabajo para mostrar o una o varias cargas de trabajo y sus versiones unidas por el carácter "@".
fr: Version de charge de travail à afficher ou une ou plusieurs charges de travail et leurs versions jointes par le caractère « @ ».
it: Una versione del carico di lavoro da visualizzare oppure uno o più carichi di lavoro e le relative versioni unite dal carattere '@'.
ja: 表示するワークロードのバージョン、または '@' 文字で結合された 1 つ以上のワークロードとそのバージョン。
ko: 표시할 워크로드 버전 또는 '@' 문자로 결합된 하나 이상의 워크로드와 해당 버전입니다.
pl: Wersja obciążenia do wyświetlenia lub jedno lub więcej obciążeń i ich wersji połączonych znakiem „@”.
pt_br: Uma versão de carga de trabalho para exibir ou uma ou mais cargas de trabalho e suas versões unidas pelo caractere ''@''.
ru: Версия рабочей нагрузки для отображения или одной или нескольких рабочих нагрузок и их версий, соединенных символом "@".
tr: Görüntülenecek bir iş yükü sürümü veya bir veya daha fazla iş yükü ve bunların '@' karakteriyle birleştirilen sürümleri.
zh_hans: 要显示的工作负载版本，或一个或多个工作负载，并且其版本由 ‘@’ 字符联接。
zh_hant: 要顯示的工作負載版本，或是一或多個工作負載及其由 '@' 字元連接的版本。

# WorkloadSourceColumn
source: Installation Source
cs: Zdroj instalace
de: Installationsquelle
es: Origen de la instalación
fr: Source de l’installation
it: Origine dell'installazione
ja: インストール ソース
ko: 설치 원본
pl: Źródło instalacji
pt_br: Origem da Instalação
ru: Источник установки
tr: Yükleme Kaynağı
zh_hans: 安装源文件
zh_hant: 安裝來源

# WorkloadUninstallCommandDescription
source: Uninstall one or more workloads.
cs: Odinstalujte nejméně jednu úlohu.
de: Deinstallieren Sie mindestens eine Workload.
es: Desinstale una o varias cargas de trabajo.
fr: Désinstallez une ou plusieurs charges de travail.
it: Disinstallare uno o più carichi di lavoro.
ja: 1 つ以上のワークロードをアンインストールします。
ko: 하나 이상의 워크로드를 제거합니다.
pl: Odinstaluj co najmniej jedno obciążenie.
pt_br: Desinstale uma ou mais cargas de trabalho.
ru: Удалите одну или несколько рабочих нагрузок.
tr: Bir veya daha fazla iş yükünü kaldırın.
zh_hans: 卸载一个或多个工作负载。
zh_hant: 解除安裝一或多個工作負載。

# WorkloadUninstallFailed
source: Workload uninstallation failed: {0}
cs: Neúspěšná odinstalace úloh: {0}
de: Fehler bei Deinstallation von Workload(s): {0}
es: Error de desinstalación de la carga de trabajo: {0}
fr: La désinstallation de la charge de travail a échoué : {0}
it: La disinstallazione del carico di lavoro non è riuscita: {0}
ja: ワークロード {0} のアンインストールに失敗しました
ko: 워크로드를 제거하지 못함: {0}
pl: Niepowodzenie odinstalowania pakietów roboczych: {0}
pt_br: A desinstalação da carga de trabalho falhou: {0}
ru: Сбой удаления рабочей нагрузки: {0}
tr: İş yükü kaldırma başarısız: {0}
zh_hans: 工作负载卸载失败: {0}
zh_hant: 工作負載解除安裝失敗: {0}

# WorkloadUninstallUninstallSucceeded
source: Successfully uninstalled workload(s): {0}
cs: Úspěšně odinstalované úlohy: {0}
de: Workload(s) erfolgreich deinstalliert: {0}
es: Carga(s) de trabajo: {0} desinstalada(s) correctamente
fr: Désinstallation réussie de la ou des charges de travail {0}
it: I carichi di lavoro sono stati disinstallati correttamente: {0}
ja: ワークロード {0} が正常にアンインストールされました
ko: 워크로드를 제거함: {0}
pl: Pomyślnie odinstalowane pakiety robocze: {0}
pt_br: Carga(s) de trabalho desinstalada(s) com sucesso: {0}
ru: Рабочие нагрузки {0} удалены.
tr: İş yükleri başarıyla kaldırıldı: {0}
zh_hans: 成功卸载的工作负载: {0}
zh_hant: 已成功將工作負載解除安裝: {0}

# WorkloadUpdateAdManifestsSucceeded
source: Successfully updated advertising manifests.
cs: Manifesty reklamy se úspěšně aktualizovaly.
de: Werbemanifeste wurden erfolgreich aktualisiert.
es: Los manifiestos de publicidad se han actualizado correctamente.
fr: Les manifestes de publicité ont été mis à jour.
it: I manifesti pubblicitari sono stati aggiornati.
ja: 広告マニフェストを正常に更新しました。
ko: 알림 매니페스트를 업데이트했습니다.
pl: Pomyślnie zaktualizowano manifesty reklam.
pt_br: Manifestos de anúncio atualizados com êxito.
ru: Манифесты рекламы успешно обновлены.
tr: Reklam bildirimleri başarıyla güncelleştirildi.
zh_hans: 成功更新广告清单。
zh_hant: 已成功更新廣告資訊清單。

# WorkloadUpdateCommandDescription
source: Update all installed workloads.
cs: Aktualizace všech nainstalovaných úloh.
de: Aktualisieren Sie alle installierten Workloads.
es: Actualice todas las cargas de trabajo instaladas.
fr: Mettez à jour toutes les charges de travail installées.
it: Aggiornare tutti i carichi di lavoro installati.
ja: インストールされたすべてのワークロードを更新します。
ko: 설치된 모든 워크로드를 업데이트합니다.
pl: Aktualizuj wszystkie zainstalowane obciążenia.
pt_br: Atualizar todas as cargas de trabalho instaladas.
ru: Обновление всех установленных рабочих нагрузок.
tr: Tüm yüklü iş yüklerini güncelleştirin.
zh_hans: 更新所有已安装的工作负载。
zh_hant: 更新所有已安裝的工作負載。

# WorkloadUpdateFailed
source: Workload update failed: {0}
cs: Aktualizace úlohy se nepovedla: {0}.
de: Fehler bei der Workloadaktualisierung: {0}
es: No se pudo actualizar la carga de trabajo: {0}
fr: Échec de la mise à jour du chargement vers le serveur : {0}
it: Aggiornamento del carico di lavoro non riuscito: {0}
ja: ワークロードの更新に失敗しました: {0}
ko: 워크로드 업데이트 실패: {0}
pl: Aktualizacja pakietu roboczego nie powiodła się: {0}
pt_br: A atualização da carga de trabalho falhou: {0}
ru: Сбой обновления рабочей нагрузки: {0}
tr: İş yükü güncelleştirmesi başarısız oldu: {0}
zh_hans: 工作负载更新失败: {0}
zh_hant: 工作負載更新失敗: {0}

# WorkloadUpdateRollBackFailedMessage
source: Installation rollback failed: {0}
cs: Vrácení instalace se nepovedlo: {0}
de: Fehler beim Installationsrollback: {0}
es: Error en la reversión de la instalación: {0}
fr: Échec de la restauration de l'installation : {0}
it: Impossibile eseguire il rollback dell'installazione: {0}
ja: インストールのロールバックに失敗しました: {0}
ko: 설치 롤백 실패: {0}
pl: Wycofywanie instalacji nie powiodło się: {0}
pt_br: Falha na reversão da instalação: {0}
ru: Сбой отката установки: {0}
tr: Yükleme geri alınamadı: {0}
zh_hans: 安装回滚失败: {0}
zh_hant: 安裝復原失敗: {0}

# WorkloadUpdateRollingBackInstall
source: Workload installation failed. Rolling back installed packs...
cs: Instalace úlohy se nepovedla. Vrací se zpět nainstalované balíčky…
de: Fehler bei der Workloadinstallation. Für die installierten Pakete wird ein Rollback ausgeführt...
es: Error en la instalación de carga de trabajo. Revirtiendo a los paquetes instalados...
fr: Échec de l’installation de la charge de travail, restauration des packs installés...
it: L'installazione del carico di lavoro non è riuscita, eseguire il rollback dei pacchetti installati...
ja: ワークロードをインストールできませんでした。インストール パックをロールバックしています...
ko: 워크로드를 설치하지 못했습니다. 설치된 팩을 롤백하는 중...
pl: Instalacja obciążenia nie powiodła się. Trwa wycofywanie zainstalowanych pakietów...
pt_br: A instalação da carga de trabalho falhou, revertendo os pacotes instalados...
ru: Сбой установки рабочей нагрузки. Выполняется откат установленных пакетов...
tr: İş yükü yüklenemedi. Yüklü paketler geri alınıyor...
zh_hans: 工作负载安装失败。正在回滚已安装的包...
zh_hant: 工作負載安裝失敗。正在復原已安裝的套件...

# WorkloadUpdateUpdateSucceeded
source: Successfully updated workload(s): {0}.
cs: Úlohy se úspěšně aktualizovaly: {0}.
de: Workload(s) erfolgreich aktualisiert: {0}.
es: La(s) carga(s) de trabajo se ha(n) actualizado correctamente: {0}
fr: Mise à jour réussie du charge de travail : {0}.
it: I carichi di lavoro sono stati aggiornati: {0}.
ja: ワークロード {0} が正常に更新されました。
ko: 워크로드를 업데이트했습니다. {0}.
pl: Pomyślnie zaktualizowano pakiety robocze: {0}.
pt_br: Carga(s) de trabalho atualizada(s) com êxito: {0}.
ru: Рабочие нагрузки успешно обновлены: {0}.
tr: İş yükleri başarıyla güncelleştirildi: {0}.
zh_hans: 已成功更新工作负载: {0}。
zh_hant: 已成功更新工作負載: {0}。

# WorkloadUpdateWorkloadCacheDownloadFailed
source: Failed to download workload update packages to cache: {0}
cs: Nepovedlo se stáhnout balíčky aktualizace úlohy do mezipaměti: {0}.
de: Fehler beim Herunterladen von Paketen zur Workloadaktualisierung in den Cache: {0}
es: No se pudieron descargar los paquetes de actualización de la carga de trabajo en caché: {0}
fr: Échec du téléchargement des packages de mise à jour de charge de travail dans le cache : {0}
it: Non è stato possibile scaricare i pacchetti di aggiornamento del carico di lavoro nella cache: {0}
ja: ワークロード更新パッケージをキャッシュにダウンロードできませんでした: {0}
ko: 캐시할 워크로드 업데이트 패키지를 다운로드하지 못했습니다. {0}
pl: Nie można pobrać pakietów aktualizacji pakietów roboczych do pamięci podręcznej: {0}
pt_br: Falha ao baixar pacotes de atualização de carga de trabalho para o cache: {0}
ru: Не удалось скачать пакеты обновления рабочей нагрузки в кэш: {0}
tr: İş yükü güncelleştirme paketleri önbelleğe yüklenemedi: {0}
zh_hans: 未能将工作负载更新程序包下载到缓存: {0}
zh_hant: 無法將工作負載更新套件下載到快取: {0}

# WorkloadVersionArgumentDescription
source: Output workload manifest versions associated with the provided workload version.
cs: Verze manifestu výstupní úlohy přidružené k zadané verzi úlohy.
de: Geben Workloadmanifestversionen, die der angegebenen Workloadversion zugeordnet sind, aus.
es: Versiones del manifiesto de carga de trabajo de salida asociadas a la versión de carga de trabajo proporcionada.
fr: Affiche le manifeste de charge de travail associé à la version de charge de travail fournie.
it: Versioni del manifesto del carico di lavoro di output associate alla versione del carico di lavoro fornita.
ja: 指定されたワークロード バージョンに関連付けられたワークロード マニフェストのバージョンを出力します。
ko: 제공된 워크로드 버전과 연결된 워크로드 매니페스트 버전을 출력합니다.
pl: Wersje manifestu obciążenia wyjściowego skojarzone z udostępnioną wersją obciążenia.
pt_br: Versões de manifesto de carga de trabalho de saída associadas à versão de carga de trabalho fornecida.
ru: Вывод версий манифеста рабочей нагрузки, связанных с указанной версией рабочей нагрузки.
tr: Sağlanan iş yükü sürümüyle ilişkili iş yükü bildirimi sürümlerinin çıkışını görüntüler.
zh_hans: 输出与所提供的工作负载版本关联的工作负载清单版本。
zh_hant: 與提供的工作負載版本相關聯的輸出工作負載資訊清單版本。
