Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FailedToInstallWorkloadManifest
source: Failed to install manifest {0} version {1}: {2}.
cs: Nepodařilo se nainstalovat manifest {0} verze {1}: {2}.
de: Fehler beim Installieren des Manifests "{0}", Version {1}: {2}.
es: No se pudo instalar el manifiesto {0}, versión {1}: {2}.
fr: Impossible d'installer la {0} version de manifeste {1}: {2}
it: Non è stato possibile installare il manifesto {0}, versione {1}: {2}.
ja: マニフェスト {0} のバージョン {1} をインストールできませんでした: {2}。
ko: 매니페스트 {0} 버전 {1}: {2}을(를) 설치하지 못했습니다.
pl: Instalowanie manifestu {0} w wersji {1} nie powiodło się: {2}.
pt_br: Falha ao instalar o manifesto {0} versão {1}: {2}.
ru: Не удалось установить манифест {0} версии {1}: {2}.
tr: {0} bildirimi sürüm {1} yüklenemedi:{2}.
zh_hans: 未能安装清单 {0} 版本 {1}: {2}。
zh_hant: 無法安裝資訊清單 {0} 版本 {1}: {2}。

# FailedToInstallWorkloadSet
source: Failed to install workload version {0}: {1}
cs: Nepovedlo se nainstalovat verzi úlohy {0}: {1}
de: Fehler beim Installieren der Workloadversion {0}: {1}
es: No se pudo instalar la versión de carga de trabajo {0}: {1}
fr: Échec de l’installation de la version de charge de travail {0}: {1}
it: Non è stato possibile installare la versione del carico di lavoro {0}: {1}
ja: ワークロード バージョン {0} をインストールできませんでした: {1}
ko: {0} 워크로드 버전을 설치하지 못했습니다. {1}
pl: Nie można zainstalować wersji obciążenia {0}: {1}
pt_br: Falha ao instalar a versão da carga de trabalho {0}: {1}
ru: Не удалось установить версию рабочей нагрузки {0}: {1}
tr: İş yükü sürümü {0}: {1} yüklenemedi
zh_hans: 未能安装工作负载版本 {0}：{1}
zh_hant: 無法安裝工作負載版本 {0}：{1}

# FailedToRunTarget
source: Failed to restore workload for project {0}: Failed to run MSBuild Target _GetRequiredWorkloads.
cs: Nepovedlo se obnovit úlohu pro projekt {0}: nepovedlo se spustit _GetRequiredWorkloads cíle nástroje MSBuild.
de: Fehler beim Wiederherstellen der Workload für das Projekt {0}: Fehler beim Ausführen von MSBuild mit Ziel _GetRequiredWorkloads.
es: No se ha podido restaurar la carga de trabajo del proyecto {0}: no se pudo ejecutar el _GetRequiredWorkloads de destino de MSBuild.
fr: Échec de la restauration de la charge de travail pour le projet {0} : échec de l’exécution du _GetRequiredWorkloads cible MSBuild.
it: Non è stato possibile ripristinare il carico di lavoro per il progetto {0}: non è stato possibile eseguire il _GetRequiredWorkloads di destinazione MSBuild.
ja: プロジェクト {0} のワークロードを復元できませんでした。MSBuild Target _GetRequiredWorkloads の実行に失敗しました。
ko: 프로젝트 {0}에 대한 워크로드를 복원하지 못했습니다. MSBuild Target _GetRequiredWorkloads를 실행하지 못했습니다.
pl: Nie można przywrócić obciążenia dla projektu {0}: nie można uruchomić polecenia _GetRequiredWorkloads obiektu docelowego programu MSBuild.
pt_br: Falha ao restaurar a carga de trabalho para o projeto {0}: falha ao executar o destino do MSBuild _GetRequiredWorkloads.
ru: Не удалось восстановить рабочую нагрузку для проекта {0}: не удалось запустить _GetRequiredWorkloads целевого объекта MSBuild.
tr: {0} projesi için iş yükü geri yüklenemedi. MSBuild Target _GetRequiredWorkloads çalıştırılamadı.
zh_hans: 未能还原项目 {0} 的工作负载: 无法运行 MSBuild 目标 _GetRequiredWorkloads。
zh_hant: 無法還原專案 {0} 的工作負載: 無法執行 MSBuild 目標 _GetRequiredWorkloads。

# FailedToUninstallTool
source: Failed to uninstall tool '{0}': {1}
cs: Nepodařilo se odinstalovat nástroj {0}: {1}.
de: Fehler beim Deinstallieren des Tools "{0}": {1}
es: No se pudo desinstalar la herramienta "{0}": {1}
fr: Échec de désinstallation de l'outil '{0}' : {1}
it: Non è stato possibile disinstallare lo strumento '{0}': {1}
ja: ツール '{0}' をアンインストールできませんでした: {1}
ko: 도구 '{0}'을(를) 제거하지 못했습니다. {1}
pl: Nie można odinstalować narzędzia „{0}”: {1}
pt_br: Falha ao desinstalar a ferramenta '{0}': {1}
ru: Не удалось удалить инструмент "{0}": {1}
tr: '{0}' aracı kaldırılamadı: {1}
zh_hans: 无法卸载工具“{0}”: {1}
zh_hant: 無法將工具 '{0}' 解除安裝: {1}

# FailedWithErrors
source: failed with {0} error(s)
cs: selhalo s {0} chybou/chybami.
de: fehlerhaft mit {0} Fehler(n)
es: error con {0} errores
fr: a échoué avec {0} erreur(s)
it: non riuscito con {0} errori
ja: {0} 件のエラーで失敗しました
ko: {0} 오류로 실패
pl: zakończono niepowodzeniem, z następującą liczbą błędów: {0}
pt_br: falhou com {0} erros
ru: сбой с ошибками ({0})
tr: {0} hatayla başarısız oldu
zh_hans: 失败并出现 {0} 个错误
zh_hant: 失敗，有 {0} 個錯誤

# FailedWithErrorsAndWarnings
source: failed with {0} error(s) and {1} warning(s)
cs: selhalo s chybami (celkem {0}) a upozorněními (celkem {1})
de: fehlerhaft mit {0} Fehler(n) und {1} Warnung(en)
es: error con {0} errores y {1} advertencias
fr: a échoué avec {0} erreur(s) et {1} avertissement(s)
it: non riuscito con {0} errori e {1} avvisi
ja: {0} 件のエラーと {1} 件の警告で失敗しました
ko: {0} 오류와 {1} 경고와 함께 실패
pl: zakończono niepowodzeniem, z błędami w liczbie: {0} i ostrzeżeniami w liczbie: {1}
pt_br: falhou com{0} erros e {1} avisos
ru: сбой с ошибками ({0}) и предупреждениями ({1})
tr: {0} hata ve {1} uyarıyla başarısız oldu
zh_hans: 失败，出现 {0} 错误和 {1} 警告
zh_hant: 失敗，有 {0} 個錯誤和 {1} 個警告

# FailedWithWarnings
source: failed with {0} warning(s)
cs: selhalo s {0} upozorněním(i).
de: fehlerhaft mit {0} Warnung(en)
es: error con {0} advertencias
fr: a échoué avec {0} avertissement(s)
it: non riuscito con {0} avvisi
ja: {0} 件の警告付きで失敗しました
ko: {0} 경고와 함께 실패
pl: zakończono niepowodzeniem, z ostrzeżeniami w liczbie: {0}
pt_br: falhou com {0} aviso(s)
ru: сбой с предупреждениями ({0})
tr: {0} uyarıyla başarısız oldu
zh_hans: 失败，出现 {0} 警告
zh_hant: 失敗，有 {0} 個警告

source: For test
cs: Pro testování
de: Für Test
es: Para prueba
fr: Pour le test
it: Per test
ja: テスト用
ko: 테스트용
pl: Na potrzeby testu
pt_br: Para teste
ru: Для теста
tr: Test için
zh_hans: 用于测试
zh_hant: 用於測試

# FormatArgumentName
source: Format
cs: Formát
es: Formato
it: Formato
ja: 形式
ko: 형식
pl: Formatuj
pt_br: Formato
ru: Формат
tr: Biçim
zh_hans: 格式
zh_hant: 格式

# FormatDefinition
source: Apply style preferences to a project or solution.
cs: Aplikujte předvolby stylu na projekt nebo řešení.
de: Wenden Sie Formatvorlageneinstellungen auf ein Projekt oder eine Lösung an.
es: Aplicar preferencias de estilo a un proyecto o solución.
fr: Appliquez les préférences de style à un projet ou une solution.
it: Applicare le preferenze di stile a un progetto o una soluzione.
ja: プロジェクトやソリューションにスタイルのユーザー設定を適用します。
ko: 프로젝트 또는 솔루션에 스타일 기본 설정을 적용합니다.
pl: Zastosuj preferencje stylu do projektu lub rozwiązania.
pt_br: Aplicar preferências de estilo a um projeto ou solução.
ru: Применение настроек стилей к проекту или решению.
tr: Stil tercihlerini bir projeye veya çözüme uygulayın.
zh_hans: 将样式首选项应用到项目或解决方案。
zh_hant: 將樣式喜好設定套用至專案或解決方案。

# FormatDescription
source: Format the output accordingly. Either `table`, or `json`. The default value is `table`.
cs: Formátuje výstup odpovídajícím způsobem. Buď table, nebo json. Výchozí hodnota je table.
de: Formatieren Sie die Ausgabe entsprechend. Entweder "table" oder "json". Der Standardwert ist "table".
es: Dé formato a la salida en consecuencia. Puede ser 'table' o 'json'. El valor predeterminado es 'table'.
fr: Mettre en forme la sortie en conséquence. Soit « table », soit « json ». La valeur par défaut est « table ».
it: Formattare l'output in modo appropriato. 'table' o 'json'. Il valore predefinito è 'table'.
ja: それに応じて出力をフォーマットします。'table' または 'json'。既定値は 'table' です。
ko: 출력의 서식을 적절하게 지정하세요. 'table' 또는 'json'입니다. 기본값은 'table'입니다.
pl: Odpowiednio sformatuj dane wyjściowe. Element „table” lub „json”. Wartość domyślna to „table”.
pt_br: Formatar a saída adequadamente. ''table'' ou ''json''. O valor padrão é ''table''.
ru: Отформатируйте вывод соответствующим образом. Либо `table`, либо `json`. Значение по умолчанию — `table`.
tr: Çıkışı uygun şekilde biçimlendir. “Tablo” veya “json”. Varsayılan değer: “tablo”.
zh_hans: 相应地设置输出格式。`table`或`json`。默认值为`table`。
zh_hant: 依此格式化輸出。可以是 `table` 或 `json`。預設值為 `table`。

# FormatOptionDescription
source: Changes the format of outputted workload versions. Can take 'json' or 'list'
cs: Změní formát výstupních verzí úloh. Může přijmout json nebo list.
de: Ändert das Format der ausgegebenen Workloadversionen. Kann „json“ oder „list“ annehmen
es: Cambia el formato de las versiones de la carga de trabajo de salida. Puede tomar "json" o "list"
fr: Modifie le format des versions de charge de travail générées. Accepte « json » ou « list »
it: Modifica il formato delle versioni del carico di lavoro di output. Può accettare 'json' o 'list'
ja: 出力されるワークロード バージョンの形式を変更します。'json' または 'list' を指定できます
ko: 출력된 워크로드 버전의 형식을 변경합니다. 'json' 또는 'list'를 사용할 수 있습니다.
pl: Zmienia format wersji obciążeń wyjściowych. Może przyjmować format „json” lub „list”
pt_br: Altera o formato das versões de carga de trabalho geradas. Pode usar 'json' ou 'list'
ru: Изменяет формат выводимых версий рабочей нагрузки. Может принимать значения "json" или "list"
tr: Çıkış iş yükü sürümlerinin biçimini değiştirir. 'json' veya 'list' alabilir
zh_hans: 更改输出的工作负载版本的格式。可以使用 "json" 或 "list"
zh_hant: 變更所輸出工作負載版本的格式。可以使用 'json' 或 'list'

# FrameworkVersionOptionDescription
source: The Microsoft.NETCore.App package version that will be used to run the assemblies.
cs: Verze balíčku Microsoft.NETCore.App, který se použije ke spuštění sestavení
de: Die Microsoft.NETCore.App-Paketversion, die zum Ausführen der Assemblys verwendet wird.
es: La versión del paquete Microsoft.NETCore.App que se usará para ejecutar los ensamblados
fr: Version du package Microsoft.NETCore.App à utiliser pour exécuter les assemblys.
it: Versione del pacchetto Microsoft.NETCore.App che verrà usata per eseguire gli assembly.
ja: アセンブリの実行に使用される Microsoft.NETCore.App パッケージのバージョン。
ko: 어셈블리를 실행하는 데 사용되는 Microsoft.NETCore.App 패키지 버전입니다.
pl: Wersja pakietu Microsoft.NETCore.App, za pomocą której mają być uruchamiane zestawy.
pt_br: A versão do pacote Microsoft.NETCore.App que será usada para executar os assemblies.
ru: Версия пакета Microsoft.NETCore.App, которая будет использоваться для выполнения сборок.
tr: Bütünleştirilmiş kodları çalıştırmak için kullanılacak Microsoft.NETCore.App paket sürümü
zh_hans: 要用于运行程序集的 Microsoft.NETCore.App 包版本。
zh_hant: 將用於執行組件的 Microsoft.NETCore.App 套件版本。

# FromCacheOptionArgumentName
source: DIRECTORY
cs: ADRESÁŘ
de: VERZEICHNIS
es: DIRECTORIO
fr: RÉPERTOIRE
ja: ディレクトリ
ko: 디렉터리
pl: KATALOG
pt_br: DIRETÓRIO
ru: КАТАЛОГ
tr: DİZİN
zh_hans: 目录
zh_hant: 目錄

# FromCacheOptionDescription
source: Complete the operation from cache (offline).
cs: Dokončete operaci z mezipaměti (offline).
de: Führen Sie den Vorgang aus dem Cache (offline) aus.
es: Completa la operación desde la memoria caché (sin conexión).
fr: Effectuer l'opération à partir du cache (hors connexion).
it: Completa l'operazione dalla cache (offline).
ja: キャッシュから操作を完了します (オフライン)。
ko: 캐시에서 작업을 완료합니다(오프라인).
pl: Ukończ operację z pamięci podręcznej (offline).
pt_br: Concluir a operação do cache (offline).
ru: Завершение операции из кэша (вне сети).
tr: İşlemi önbellekten (çevrimdışı) tamamlayın.
zh_hans: 从缓存中完成操作(脱机)。
zh_hant: 從快取完成作業 (離線)。

# FromFile
source: from
cs: od
de: von
es: desde
fr: à partir de
it: da
ja: 参照元:
ko: 출처
pl: z
pt_br: de
ru: из
tr: şu dosyadan:
zh_hans: 从
zh_hant: 來自

# FromHistoryOptionDescription
source: Update workloads to a previous version specified by the argument. Use the 'dotnet workload history' to see available workload history records.
cs: Aktualizujte úlohy na předchozí verzi určenou argumentem. K zobrazení dostupných záznamů historie úloh použijte příkaz dotnet workload history.
de: Aktualisieren Workloads auf eine frühere Version, die von dem Argument angegeben wurde. Verwenden die „dotnet workload history“, um verfügbare Workloadverlaufsdatensätze anzuzeigen.
es: Actualizar las cargas de trabajo a una versión anterior especificada por el argumento. Usar el "historial de cargas de trabajo de dotnet" para ver los registros del historial de cargas de trabajo disponibles.
fr: Mettre à jour les charges de travail vers une version précédente spécifiée par l’argument. Utiliser l'« historique de charge de travail dotnet » pour afficher les enregistrements d’historique de charge de travail disponibles.
it: Aggiornare i carichi di lavoro a una versione precedente specificata dall'argomento. Usare la 'cronologia del carico di lavoro dotnet' per visualizzare i record della cronologia del carico di lavoro disponibili.
ja: 引数で指定された以前のバージョンにワークロードを更新します。使用可能なワークロード履歴レコードを表示するには、'dotnet workload history' を使用します。
ko: 인수에 지정된 이전 버전으로 워크로드를 업데이트합니다. 'dotnet 워크로드 기록'을 사용하여 사용 가능한 워크로드 기록 레코드를 확인합니다.
pl: Zaktualizuj obciążenia do poprzedniej wersji określonej przez argument. Użyj opcji „historia obciążeń dotnet”, aby wyświetlić dostępne rekordy historii obciążeń.
pt_br: Atualizar cargas de trabalho para uma versão anterior especificada pelo argumento. Use o 'histórico de carga de trabalho dotnet' para ver os registros de histórico de carga de trabalho disponíveis.
ru: Обновление рабочих нагрузок до предыдущей версии, указанной в аргументе. Используйте "журнал рабочей нагрузки dotnet" для просмотра доступных записей журнала рабочей нагрузки.
tr: İş yüklerini bağımsız değişken tarafından belirtilen önceki bir sürüme güncelleştirin. Kullanılabilir iş yükü geçmişi kayıtlarını görmek için 'dotnet iş yükü geçmişi' komutunu kullanın.
zh_hans: 将工作负载更新为参数指定的以前版本。使用 "dotnet workload history" 查看可用的工作负载历史记录。
zh_hant: 將工作負載更新為引數指定的舊版。使用 'dotnet workload history' 來查看可用的工作負載歷程記錄。

# FromPreviousSdkOptionDescription
source: Include workloads installed with earlier SDK versions in update.
cs: Zahrnout do aktualizace úlohy nainstalované s předchozími verzemi sady SDK.
de: Schließen Sie Workloads in die Aktualisierung ein, die mit früheren SDK-Versionen installiert wurden.
es: Incluir las cargas de trabajo instaladas con versiones anteriores de SDK en la actualización.
fr: Ajoutez les charges de travail installées avec les versions postérieures du SDK dans le mise à jour.
it: Includere nell'aggiornamento i carichi di lavoro installati con le versioni SDK precedenti.
ja: 以前の SDK バージョンでインストールされたワークロードを更新プログラムに含めます。
ko: 업데이트에 이전 SDK 버전과 함께 설치된 워크로드를 포함합니다.
pl: Uwzględnij obciążenia zainstalowane z wcześniejszymi wersjami zestawu SDK w aktualizacji.
pt_br: Inclua cargas de trabalho instaladas com versões anteriores do SDK na atualização.
ru: Включить в обновление рабочие нагрузки, установленные с более ранними версиями пакета SDK.
tr: Önceki SDK sürümleriyle yüklenen iş yüklerini güncelleştirmeye ekleyin.
zh_hans: 包括更新期间使用更早的 SDK 版本安装的工作负荷。
zh_hant: 包含更新中與舊版本 SDK 一起安裝的工作負載。

# FromRollbackDefinitionOptionDescription
source: Update workloads based on specified rollback definition file.
cs: Aktualizuje úlohy na základě zadaného souboru definice vrácení zpět.
de: Aktualisieren Sie Workloads basierend auf der angegebenen Rollbackdefinitionsdatei.
es: Actualice las cargas de trabajo en función del archivo de definición de reversión especificado.
fr: Mettez à jour les charges de travail en fonction du fichier de définition de restauration spécifié.
it: Aggiornare i carichi di lavoro in base al file di definizione di ripristino dello stato precedente specificato.
ja: 指定されたロールバック定義ファイルに基づいてワークロードを更新します。
ko: 지정된 롤백 정의 파일을 기반으로 워크로드를 업데이트합니다.
pl: Zaktualizuj obciążenia na podstawie określonego pliku definicji wycofywania.
pt_br: Atualizar cargas de trabalho com base no arquivo de definição de reversão especificado.
ru: Обновление рабочих нагрузок на основе указанного файла определения отката.
tr: İş yüklerini belirtilen geri alma tanım dosyasına göre güncelleştirin.
zh_hans: 基于指定的回滚定义文件更新工作负载。
zh_hant: 根據指定的復原定義檔更新工作負載。

# FsiDefinition
source: Start F# Interactive / execute F# scripts.
cs: Spustí F# Interactive / spustí skripty F#.
de: F# Interactive starten/F#-Skripts ausführen.
es: Inicie F# interactivo o ejecute scripts de F#.
fr: Démarrer F# Interactive / exécuter les scripts F#.
it: Avvia F# Interactive/esegue script F#.
ja: F# Interactive を開始するか、F# スクリプトを実行します。
ko: F# Interactive를 시작하고 F# 스크립트를 실행합니다.
pl: Uruchom środowisko F# Interactive / wykonaj skrypty języka F#.
pt_br: Iniciar F# Interativo / executar scripts do F#.
ru: Запуск F# Interactive / выполнение скриптов F#.
tr: F# Etkileşimli'yi başlatın / F# betiklerini yürütün.
zh_hans: 启动 F# 交互/执行 F# 脚本。
zh_hant: 啟動 F# Interactive/執行 F# 指令碼。

# FxVersionDefinition
source: Version of the installed Shared Framework to use to run the application.
cs: Verze nainstalované sdílené architektury, která se má použít ke spuštění aplikace
de: Version des installierten freigegebenen Frameworks, das zum Ausführen der Anwendung verwendet werden soll.
es: Versión de la instancia de Shared Framework instalada que se usará para ejecutar la aplicación.
fr: Version du framework partagé installé à utiliser pour exécuter l'application.
it: Versione di Shared Framework installata da usare per eseguire l'applicazione.
ja: アプリケーションを実行するために使用するインストール済み Shared Framework のバージョン。
ko: 애플리케이션을 실행하는 데 사용할 설치된 공유 프레임워크의 버전입니다.
pl: Wersja zainstalowanej platformy współużytkowanej służącej do uruchamiania aplikacji.
pt_br: Versão do Shared Framework instalada a ser usada para a execução do aplicativo.
ru: Версия установленной общей платформы, которую следует использовать для запуска приложения.
tr: Uygulamayı çalıştırmak için kullanılacak olan yüklü Paylaşılan Çerçevenin sürümü
zh_hans: 要用于运行应用程序的安装版共享框架的版本。
zh_hant: 用於執行應用程式的已安裝之共用架構的版本。

# GarbageCollectingSdkFeatureBandsMessage
source: Garbage collecting for SDK feature band(s) {0}...
cs: Pásma funkcí sady SDK {0} pro uvolňování paměti...
de: Automatische Speicherbereinigung für SDK-Featurebereich(e) {0}...
es: Recolección de elementos no utilizados para bandas de características de SDK {0}...
fr: Nettoyage de la mémoire pour les bandes de fonctionnalités SDK {0}...
it: Esecuzione del processo di garbage collection per le fasce funzionali dell'SDK {0}...
ja: SDK 機能バンド {0} のガベージ コレクトを行っています...
ko: SDK 기능 대역 {0}에 대한 가비지 수집 중...
pl: Trwa odzyskiwanie pamięci w przypadku przedziałów funkcji zestawu SDK {0}...
pt_br: Coleta de lixo para faixa(s) do recurso SDK {0}...
ru: Идет сбор мусора для диапазонов компонентов SDK {0}…
tr: {0} SDK özellik bantları için atık toplama...
zh_hans: 正在执行 SDK 功能区段 {0} 的垃圾收集...
zh_hant: SDK 功能級區 {0} 的垃圾收集...

# GarbageCollectionFailed
source: Warning: Workload garbage collection failed with error: {0}.
cs: Upozornění: uvolňování paměti úlohy selhalo s chybou: {0}.
de: Warnung: Fehler bei der automatischen Speicherbereinigung der Workload: {0}.
es: Advertencia: se ha producido un error en la recolección de elementos no utilizados de carga de trabajo: {0}.
fr: AVERTISSEMENT : la charge de travail garbage collection a échoué avec l’erreur : {0}.
it: Avviso: operazione di Garbage Collection del carico di lavoro non riuscita. Errore: {0}.
ja: 警告: ワークロードのガベージ コレクションでエラーが発生しました: {0}。
ko: 경고: {0} 오류로 인해 워크로드 가비지 수집에 실패했습니다.
pl: Ostrzeżenie: odzyskiwanie pamięci obciążenia nie powiodło się z powodu błędu: {0}.
pt_br: Aviso: a coleta de lixo de carga de trabalho falhou com o erro: {0}.
ru: Предупреждение: сборка мусора рабочей нагрузки завершилась ошибкой: {0}.
tr: Uyarı: İş yükü atık toplaması {0} hatasıyla başarısız oldu.
zh_hans: 警告: 工作负载垃圾回收失败，错误: {0}。
zh_hant: 警告: 工作負載垃圾收集失敗，錯誤碼: {0}。

source: Global.json Version
cs: Verze souboru global.json
es: Versión de Global.json
it: Versione Global.json
ja: Global.json のバージョン
ko: Global.json 버전
pl: Wersja Global.json
pt_br: Versão de global.json
tr: Global.json Sürümü
zh_hans: Global.json 版本
zh_hant: Global.json 版本

# HangDumpTypeArgumentName
source: DUMP_TYPE
tr: DÖKÜM_TÜRÜ

# HangTimeoutArgumentName
source: TIMESPAN
tr: ZAMAN_ARALIĞI

# HelpAppFullName
source: .NET CLI help utility
cs: Nástroj nápovědy k rozhraní příkazového řádku .NET
de: .NET CLI-Hilfeprogramm
es: Utilidad de ayuda de la CLI de .NET
fr: Utilitaire d'aide .NET CLI
it: Utilità della Guida dell'interfaccia della riga di comando .NET
ja: .NET CLI ヘルプ ユーティリティ
ko: .NET CLI 도움말 유틸리티
pl: Narzędzie pomocy interfejsu wiersza polecenia platformy .NET
pt_br: Utilitário de ajuda da CLI do .NET
ru: Вспомогательная программа .NET CLI
tr: .NET CLI yardımcı programı
zh_hans: .NET CLI 帮助实用程序
zh_hant: .NET CLI 說明公用程式

# HelpDefinition
source: Opens the reference page in a browser for the specified command.
cs: Otevře v prohlížeči referenční stránku pro zadaný příkaz.
de: Öffnet die Referenzseite in einem Browser für den angegebenen Befehl.
es: Abre la página de referencia en un explorador para el comando especificado.
fr: Ouvre la page de référence dans un navigateur pour la commande spécifiée.
it: Apre la pagina di riferimento in un browser per il comando specificato.
ja: 指定されたコマンドの参照ページをブラウザーで開きます。
ko: 지정된 명령에 대한 참조 페이지를 브라우저에서 엽니다.
pl: Otwiera stronę odwołania w przeglądarce dla określonego polecenia.
pt_br: Abre a página de referência em um navegador para o comando especificado.
ru: Открывает в браузере справочную страницу для указанной команды.
tr: Başvuru sayfasını belirtilen komut için bir tarayıcıda açar.
zh_hans: 在浏览器中打开指定命令的引用页。
zh_hant: 在瀏覽器中開啟指定命令的參考頁面。

# HelpExtensionOptions
source: Extension Options:
cs: Parametry rozšíření:
de: Erweiterungsoptionen:
es: Opciones de extensión:
fr: Options d’extension :
it: Opzioni di estensione:
ja: 拡張機能オプション:
ko: 확장 옵션:
pl: Opcje rozszerzenia:
pt_br: Opções de Extensão:
ru: Параметры расширения:
tr: Uzantı Seçenekleri:
zh_hans: 扩展选项:
zh_hant: 延伸模組選項:

# HelpModuleIsMissingTheOptionBelow
source: {0} is missing the option below
cs: V názvu {0} chybí níže uvedený parametr.
de: {0} fehlt die folgende Option.
es: {0} le falta la siguiente opción
fr: {0} n’a pas l’option ci-dessous
it: {0} manca dell'opzione seguente
ja: {0} には以下のオプションがありません
ko: {0}에는 아래 옵션이 없습니다.
pl: W module {0} brakuje poniższej opcji
pt_br: {0} está faltando a opção abaixo
ru: В модуле {0} отсутствует указанный ниже параметр
tr: {0} modülünün aşağıdaki seçeneği eksik
zh_hans: {0} 缺少以下选项
zh_hant: {0} 缺少下列選項

# HelpModuleIsMissingTheOptionsBelow
source: {0} is missing the options below
cs: V názvu {0} chybí níže uvedený parametr.
de: {0} fehlen die folgenden Optionen.
es: {0} le falta la opción siguiente
fr: {0} n’a pas les options ci-dessous
it: {0} manca delle opzioni seguenti
ja: {0} には以下のオプションがありません
ko: {0}에는 아래 옵션이 없습니다.
pl: W module {0} brakuje poniższych opcji
pt_br: {0} está faltando as opções abaixo
ru: В модуле {0} отсутствуют указанные ниже параметры
tr: {0} modülünün aşağıdaki seçenekleri eksik
zh_hans: {0} 缺少以下选项
zh_hant: {0} 缺少下列選項

# HelpModulesAreMissingTheOptionBelow
source: {0} are missing the option below
cs: V názvu {0} chybí níže uvedený parametr.
de: {0} fehlt die folgende Option.
es: {0} le faltan las siguientes opciones
fr: {0} n’ont pas l’option ci-dessous
it: {0} mancano dell'opzione seguente
ja: {0} には以下のオプションがありません
ko: {0}에는 아래 옵션이 없습니다.
pl: W modułach {0} brakuje poniższej opcji
pt_br: {0} estão faltando a opção abaixo
ru: В модулях {0} отсутствует указанный ниже параметр
tr: {0} modüllerinin aşağıdaki seçeneği eksik
zh_hans: {0} 缺少以下选项
zh_hant: {0} 缺少下列選項

# HelpModulesAreMissingTheOptionsBelow
source: {0} are missing the options below
cs: V názvu {0} chybí níže uvedené parametry.
de: {0} fehlen die folgenden Optionen.
es: {0} le faltan las opciones siguientes
fr: {0} n’ont pas les options ci-dessous
it: {0} mancano delle opzioni seguenti
ja: {0} には以下のオプションがありません
ko: {0}에는 아래 옵션이 없습니다.
pl: W modułach {0} brakuje poniższych opcji
pt_br: {0} estão faltando as opções abaixo
ru: В модулях {0} отсутствуют указанные ниже параметры
tr: {0} modüllerinin aşağıdaki seçenekleri eksik
zh_hans: {0} 缺少以下选项
zh_hant: {0} 缺少下列選項

# HelpOptions
source: Options:
cs: Parametry:
de: Optionen:
es: Opciones:
it: Opzioni:
ja: オプション:
ko: 옵션:
pl: Opcje:
pt_br: Opções:
ru: Параметры:
tr: Seçenekler:
zh_hans: 选项:
zh_hant: 選項:
