Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CannotAnalyzeVSWorkloadBand
source: Workloads managed by Visual Studio must be uninstalled using the Visual Studio Installer. For the version of Visual Studio managing the SDK '{0}', we could not display workloads to uninstall. This is likely because '{0}' uses a different dotnet root path or custom user profile directory from the current running SDK. Paths searched: '{1}', '{2}'.
cs: Úlohy spravované Visual Studio se musí odinstalovat pomocí Instalačního programu pro Visual Studio. U verze Visual Studio správy sady SDK „{0}“ se nám nepovedlo zobrazit úlohy k odinstalaci. Je to pravděpodobně proto, že „{0}“ používá jinou kořenovou cestu dotnet nebo vlastní adresář profilu uživatele z aktuální spuštěné sady SDK. Prohledané cesty: „{1}“, „{2}“.
de: Von Visual Studio verwaltete Workloads müssen mithilfe des Visual Studio-Installer deinstalliert werden. Für die Version von Visual Studio Verwalten des SDK "{0}" konnten keine zu deinstallierenden Workloads angezeigt werden. Dies liegt wahrscheinlich daran, dass "{0}" einen anderen dotnet-Stammpfad oder ein anderes benutzerdefiniertes Benutzerprofilverzeichnis als das aktuell ausgeführte SDK verwendet. Durchsuchte Pfade: "{1}", "{2}".
es: Las cargas de trabajo administradas por Visual Studio deben desinstalarse mediante el Instalador Visual Studio. Para la versión de Visual Studio que gestiona el SDK "{0}", no pudimos mostrar cargas de trabajo para desinstalar. Esto se debe probablemente a que "{0}" usa una ruta de acceso raíz de dotnet diferente o un directorio de perfil de usuario personalizado del SDK en ejecución actual. Rutas de acceso buscadas: "{1}", "{2}".
fr: Les charges de travail gérées par Visual Studio doivent être désinstallées à l’aide du Visual Studio Installer. Pour la version de Visual Studio la gestion du SDK «{0}», nous n’avons pas pu afficher les charges de travail à désinstaller. Cela est probablement dû au fait que «{0}» utilise un chemin racine dotnet différent ou un répertoire de profil utilisateur personnalisé du Kit de développement logiciel (SDK) en cours d’exécution. Les chemins d’accès ont recherché : « {1} », « {2} ».
it: I carichi di lavoro gestiti da Visual Studio devono essere disinstallati usando Visual Studio Installer. Per la versione di Visual Studio che gestisce l'SDK '{0}' non è stato possibile visualizzare i carichi di lavoro da disinstallare. Ciò è probabile perché '{0}' usa un percorso radice dotnet differente o una directory del profilo utente personalizzata diversa dall'SDK in esecuzione corrente. Percorsi cercati: '{1}', '{2}'.
ja: Visual Studio によって管理されているワークロードは、Visual Studio Installer を使用してアンインストールする必要があります。SDK '{0}' を管理している Visual Studio のバージョンでは、アンインストールするワークロードを表示できませんでした。これは、'{0}' が現在実行中の SDK とは異なる dotnet ルート パスまたはカスタム ユーザー プロファイル ディレクトリを使用していることが原因である可能性があります。 検索されたパス: '{1}'、'{2}'。
ko: Visual Studio에서 관리하는 워크로드는 Visual Studio 설치 관리자를 사용하여 제거해야 합니다. '{0}' SDK를 관리하는 Visual Studio 버전의 경우 제거할 워크로드를 표시할 수 없습니다. '{0}'에서 현재 실행 중인 SDK와 다른 dotnet 루트 경로 또는 사용자 지정 사용자 프로필 디렉터리를 사용하기 때문일 수 있습니다. 검색된 경로: '{1}', '{2}'.
pl: Obciążenia zarządzane przez program Visual Studio należy odinstalować przy użyciu Instalatora programu Visual Studio. W przypadku wersji programu Visual Studio zarządzającej zestawem SDK „{0}” nie można wyświetlić obciążeń do odinstalowania. Jest to prawdopodobnie spowodowane tym, że element „{0}” używa innej ścieżki głównej dotnet lub niestandardowego katalogu profilu użytkownika z bieżącego uruchomionego zestawu SDK. Przeszukane ścieżki: „{1}”, „{2}”.
pt_br: As cargas de trabalho gerenciadas pelo Visual Studio devem ser desinstaladas usando o Visual Studio Installer. Para a versão do Visual Studio gerenciando o SDK "{0}", não foi possível exibir cargas de trabalho para desinstalar. Provavelmente porque "{0}" usa um caminho raiz dotnet diferente ou um diretório de perfil de usuário personalizado do SDK em execução atual. Caminhos pesquisados: "{1}", "{2}".
ru: Рабочие нагрузки, управляемые Visual Studio, следует удалять с помощью Visual Studio Installer. Для версии Visual Studio под управлением SDK "{0}" не удалось показать рабочие нагрузки, которые следует удалить. Вероятно, это вызвано тем, что "{0}" использует другой корневой путь dotnet или настраиваемый каталог профилей пользователей из запущенного и работающего в данный момент пакета SDK. Пути, по которым производился поиск: "{1}", "{2}".
tr: Visual Studio tarafından yönetilen iş yüklerinin Visual Studio Yükleyicisi kullanılarak kaldırılması gerekir. '{0}' SDK’sını yöneten Visual Studio sürümü için kaldırılacak iş yüklerini görüntüleyemedik. Bunun nedeni büyük olasılıkla '{0}' öğesinin geçerli çalışan SDK'dan farklı bir dotnet kök yolu veya özel kullanıcı profili dizini kullanmasıdır. Aranan yollar: '{1}', '{2}'.
zh_hans: 必须使用 Visual Studio 安装程序卸载由 Visual Studio 管理的工作负载。对于管理 SDK ‘{0}’ 的 Visual Studio 版本，无法显示要卸载的工作负载。这可能是因为 ‘{0}’ 使用了与当前运行的 SDK 不同的 dotnet 根路径或自定义用户配置文件目录。 已搜索路径: '{1}'、'{2}'。
zh_hant: 必須使用 Visual Studio 安裝程式解除安裝由 Visual Studio 管理的工作負載。針對管理 SDK '{0}' 的 Visual Studio 版本，我們無法顯示要解除安裝的工作負載。這可能是因為 '{0}' 使用與目前執行中 SDK 不同的 dotnet 根路徑或自訂使用者設定檔目錄。 搜尋的路徑: '{1}'、'{2}'。

# CannotCombineOptions
source: Cannot use the {0} and {1} options together.
cs: Možnosti {0} a {1} nelze použít společně.
de: Die Optionen {0} und {1} können nicht zusammen verwendet werden.
es: No se pueden usar las opciones {0} y {1} juntas.
fr: Désolé, impossible d’utiliser les options {0} et {1} ensemble.
it: Impossibile utilizzare contemporaneamente le opzioni {0} e {1}.
ja: {0} オプションと {1} オプションを同時に使用することはできません。
ko: {0} 및 {1} 옵션을 함께 사용할 수 없습니다.
pl: Nie można używać opcji {0} i {1} razem.
pt_br: Não é possível usar as opções {0} e {1} juntas.
ru: Невозможно использовать параметры {0} и {1} одновременно.
tr: {0} ve {1} seçenekleri birlikte kullanılamaz.
zh_hans: 不能同时使用 {0} 和 {1} 选项。
zh_hant: 無法同時使用 {0} 與 {1} 選項。

# CannotCombineSearchStringAndVersion
source: Cannot specify both the {0} and {1} arguments.
cs: Argumenty {0} a {1} není možné zadat zároveň.
de: Die Argumente {0} und {1} können nicht gleichzeitig angegeben werden.
es: No se pueden especificar los argumentos {0} y {1}.
fr: Impossible de spécifier à la fois les arguments {0} et {1}.
it: Non è possibile specificare entrambi gli argomenti {0} e {1}.
ja: {0} 引数と {1} 引数の両方を指定することはできません。
ko: {0} 인수와 {1} 인수를 모두 지정할 수 없습니다.
pl: Nie można określić zarówno argumentu {0}, jak i {1}.
pt_br: Não é possível especificar os argumentos {0} e {1}.
ru: Невозможно одновременно указать аргументы {0} и {1}.
tr: {0} ve {1} bağımsız değişkenleri birlikte belirtilemez.
zh_hans: 不能同时指定 {0} 和 {1} 参数。
zh_hant: 無法同時指定 {0} 和 {1} 引數。

# CannotCombineSkipManifestAndRollback
source: Cannot use the {0} and {1} options together. If installing from a rollback file, remove {0}. Otherwise, remove {1}
cs: Možnosti {0} a {1} nelze použít společně. Při instalaci ze souboru vráceného zpět odeberte {0}. V opačném případě odeberte {1}.
de: Die Optionen {0} und {1} können nicht zusammen verwendet werden. Entfernen Sie bei der Installation aus einer Rollbackdatei {0}. Entfernen Sie andernfalls {1}
es: No se pueden usar las opciones {0} y {1} juntas. Si se instala desde un archivo de reversión, quite {0}. De lo contrario, quite {1}
fr: Impossible d’utiliser les options {0} et {1} ensemble. Si vous installez à partir d’un fichier de restauration, supprimez {0}. Sinon, supprimez {1}.
it: Impossibile utilizzare contemporaneamente le opzioni {0} e {1}. Se si esegue l'installazione da un file di rollback, rimuovere {0}. In caso contrario, rimuovere {1}
ja: {0} オプションと {1} オプションを併用することはできません。ロールバック ファイルからインストールする場合、{0} を削除してください。その他の場合には、{1} を削除します
ko: {0} 및 {1} 옵션을 함께 사용할 수 없습니다. 롤백 파일에서 설치하는 경우 {0}을(를) 제거합니다. 그렇지 않으면 {1}을(를) 제거합니다.
pl: Nie można jednocześnie używać poleceń {0} i {1}. W przypadku instalowania z pliku wycofywania usuń polecenie {0}. W przeciwnym razie usuń polecenie {1}
pt_br: Não é possível usar as opções {0} e {1} juntas. Se estiver instalando a partir de um arquivo de reversão, remova {0}. Caso contrário, remova {1}
ru: Невозможно использовать параметры {0} и {1} одновременно. При установке из файла отката удалите {0}, в противном случае удалите {1}.
tr: {0} ve {1} seçenekleri birlikte kullanılamıyor. Bir geri alma dosyasından yükleniyorsa {0} seçeneğini kaldırın. Aksi takdirde, {1} seçeneğini kaldırın
zh_hans: 不能同时使用 {0} 和 {1} 选项。如果从回滚文件安装，请删除 {0}。否则，请删除 {1}
zh_hant: 無法同時使用 {0} 與 {1} 選項。如果從復原檔案安裝，請移除 {0}。否則，請移除 {1}

# CannotCombineSkipManifestAndVersion
source: Cannot use the {0} and {1} options together. Remove one of the options.
cs: Možnosti {0} a {1} nelze použít společně. Jednu z možností odeberte.
de: Die Optionen {0} und {1} können nicht zusammen verwendet werden. Entfernen Sie eine der Optionen.
es: No se pueden usar las opciones {0} y {1} juntas. Quite una de las opciones.
fr: Impossible d’utiliser les options {0} et {1} ensemble. Supprimez l’une des options.
it: Impossibile utilizzare contemporaneamente le opzioni {0} e {1}. Rimuove una delle opzioni.
ja: {0} オプションと {1} オプションを同時に使用することはできません。いずれかのオプションを削除してください。
ko: {0} 및 {1} 옵션을 함께 사용할 수 없습니다. 옵션 중 하나를 제거하세요.
pl: Nie można używać opcji {0} i {1} razem. Usuń jedną z opcji.
pt_br: Não é possível usar as opções {0} e {1} juntas. Escolha uma das opções.
ru: Невозможно использовать параметры {0} и {1} одновременно. Удалите один из параметров.
tr: {0} ve {1} seçenekleri birlikte kullanılamaz. Seçeneklerden birini kaldırın.
zh_hans: 不能同时使用 {0} 和 {1} 选项。移除其中一个选项。
zh_hant: 無法同時使用 {0} 與 {1} 選項。移除其中一個選項。

# CannotConvertDirective
source: Some directives cannot be converted: the first error is at {0}. Run the file to see all compilation errors. Specify '--force' to convert anyway.
cs: Některé direktivy nelze převést: První chyba je tady: {0}. Spuštěním souboru zobrazíte všechny chyby kompilace. Zadejte '--force', pokud chcete přesto provést převod.
de: Einige Direktiven können nicht konvertiert werden: Der erste Fehler ist bei "{0}". Führen Sie die Datei aus, um alle Kompilierungsfehler anzuzeigen. Geben Sie "--force" an, um das Umwandeln trotzdem auszuführen.
es: Algunas directivas no se pueden convertir: el primer error está en {0}. Ejecute el archivo para ver todos los errores de compilación. Especifique "--force" para convertir de todos modos.
fr: Certaines directives ne peuvent pas être converties : la première erreur est au {0}. Exécutez le fichier pour voir toutes les erreurs de compilation. Spécifiez « --force » pour convertir quand même.
it: Non è possibile convertire alcune direttive: il primo errore si trova in {0}. Eseguire il file per visualizzare tutti gli errori di compilazione. Specifica '--force' per convertire comunque.
ja: 一部のディレクティブを変換できません。最初のエラーは {0} で発生しました。ファイルを実行して、すべてのコンパイル エラーを表示します。それでも変換する場合は '--force' を指定してください。
ko: 일부 지시문을 변환할 수 없습니다. 첫 번째 오류는 {0}에 있습니다. 파일을 실행하여 모든 컴파일 오류를 확인하세요. 변환을 강제로 진행하려면 '--force'를 지정하세요.
pl: Nie można przekonwertować niektórych dyrektyw: pierwszy błąd pojawia się w: {0}. Uruchom plik, aby wyświetlić wszystkie błędy kompilacji. Określ element „--force”, aby mimo to przekonwertować.
pt_br: Algumas diretivas não podem ser convertidas: o primeiro erro é em {0}. Execute o arquivo para ver todos os erros de compilação. Especifique "--force" para converter mesmo assim.
ru: Некоторые директивы не удалось преобразовать. Местонахождение первой ошибки (файл, строка): {0}. Запустите файл, чтобы увидеть все ошибки компиляции. Укажите параметр "--force", чтобы выполнить преобразование, невзирая на ошибки.
tr: Bazı yönergeler dönüştürülemiyor: ilk hata {0} anında. Tüm derleme hatalarını görmek için dosyayı çalıştırın. Yine de dönüştürmek için '--force' belirtin.
zh_hans: 一些指令无法转换: 第一个错误位于 {0}。运行该文件以查看所有编译错误。请指定 '--force' 以进行转换。
zh_hant: 無法轉換某些指示詞: 第一個錯誤位於 {0}。執行檔案以查看所有編譯錯誤。指定 '--force' 以繼續轉換。

# CannotFindCommandName
source: Cannot find a tool in the manifest file that has a command named '{0}'.
cs: V souboru manifestu se nepovedlo najít nástroj, který obsahuje příkaz s názvem {0}.
de: In der Manifestdatei wurde kein Tool mit einem Befehl namens "{0}" gefunden.
es: No se encuentra una herramienta en el manifiesto de archivo que tiene un comando denominado "{0}".
fr: Outil introuvable dans le fichier manifeste comportant une commande nommée '{0}'.
it: Non è possibile trovare uno strumento nel file manifesto che include un comando denominato '{0}'.
ja: '{0}' という名前のコマンドを持つマニフェスト ファイルでツールが見つかりません。
ko: 이름이 '{0}'인 명령이 있는 매니페스트 파일에서 도구를 찾을 수 없습니다.
pl: Nie można odnaleźć narzędzia w pliku manifestu, które zawiera polecenie o nazwie „{0}”.
pt_br: Não é possível localizar uma ferramenta no arquivo de manifesto com um comando chamado '{0}'.
ru: Не удается найти средство в файле манифеста, который содержит команду с именем "{0}".
tr: Bildirim dosyasında komut adı '{0}' olan bir araç bulunamıyor.
zh_hans: 在清单文件中找不到命令名为“{0}”的工具。
zh_hant: 在資訊清單中找不到有名稱 '{0}' 命令的工具。

# CannotMigrateSlnx
source: Only .sln files can be migrated to .slnx format.
cs: Do formátu .slnx lze migrovat pouze soubory .sln.
de: Nur SLN-Dateien können in das SLNX-Format migriert werden.
es: Solo los archivos .sln se pueden migrar al formato .slnx.
fr: Seuls les fichiers .sln peuvent être migrés vers le format .slnx.
it: È possibile eseguire la migrazione al formato .slnx solo dei file .sln.
ja: .slnx 形式に移行できるのは、.sln ファイルのみです。
ko: .sln 파일만 .slnx 형식으로 마이그레이션할 수 있습니다.
pl: Tylko pliki .sln można migrować do formatu .slnx.
pt_br: Somente arquivos .sln podem ser migrados para o formato .slnx.
ru: В формат .slnx можно перенести только файлы .sln.
tr: Yalnızca .sln dosyaları .slnx biçimine geçirilebilir.
zh_hans: 只有 .sln 文件可以迁移到 .slnx 格式。
zh_hant: 只有 .sln 檔案可以移轉為 .slnx 格式。

# CannotSpecifyVersionAndWorkloadIdsByComponent
source: Cannot specify a workload version using the --version option while also specifying versions to install using workload@version syntax.
cs: Nelze zadat verzi úlohy pomocí parametru --version a současně zadat verze k instalaci pomocí syntaxe workload@version.
de: Es kann keine Workloadversion mithilfe der Option --version angegeben werden, während gleichzeitig Versionen angegeben werden, die mit der Syntax workload@version installiert werden sollen.
es: No se puede especificar una versión de carga de trabajo utilizando la opción --version al mismo tiempo que se especifican versiones para instalar utilizando la sintaxis workload@version.
fr: Impossible de spécifier une version de charge de travail à l’aide de l’option --version tout en spécifiant également les versions à installer à l’aide de la syntaxe workload@version.
it: Non è possibile specificare una versione del carico di lavoro utilizzando l'opzione --version mentre si specificano anche le versioni da installare usando la sintassi workload@version.
ja: workload@version 構文を使用してインストールするバージョンを指定しているときに、--version オプションを使用してワークロードのバージョンも指定することはできません。
ko: workload@version 구문을 사용하여 설치할 버전을 지정하는 동안에는 --version 옵션을 사용하여 워크로드 버전을 지정할 수 없습니다.
pl: Nie można określić wersji obciążenia przy użyciu opcji --version, określając jednocześnie wersje do zainstalowania przy użyciu składni workload@version.
pt_br: Não é possível especificar uma versão de carga de trabalho usando a opção --version ao especificar também as versões a serem instaladas usando workload@version sintaxe.
ru: При указании версии рабочей нагрузки с помощью параметра --version нельзя одновременно указывать версии для установки с помощью синтаксиса workload@version.
tr: workload@version sözdizimini kullanarak yüklenecek sürümleri belirtirken --version seçeneğini kullanarak bir iş yükü sürümü belirtilemez.
zh_hans: 无法在使用 workload@version 语法指定要安装的版本的同时，使用 --version 选项指定工作负载版本。
zh_hant: 同時指定要使用 workload@version 語法安裝的版本時，無法使用 --version 選項指定工作負載版本。

# CannotSpecifyVersionOnCommandLineAndInGlobalJson
source: Cannot specify a particular workload version on the command line via --version or --from-history when there is already a version specified in global.json file {0}. To update the globally installed workload version, run the command outside of the path containing that global.json file or update the version specified in the global.json file and run "dotnet workload update."
cs: Na příkazovém řádku nelze pomocí možnosti --version nebo --from-history zadat konkrétní verzi úlohy, pokud je již verze zadána v souboru global.json {0}. Pokud chcete aktualizovat globálně nainstalovanou verzi úlohy, spusťte příkaz mimo cestu obsahující daný soubor global.json nebo aktualizujte verzi uvedenou v souboru global.json a spusťte příkaz dotnet workload update.
de: Eine bestimmte Workload-Version kann in der Befehlszeile nicht über „--version“ oder „--from-history“ angegeben werden, wenn bereits eine Version in der global.json-Datei „{0}“ angegeben ist. Um die global installierte Workload-Version zu aktualisieren, führen Sie den Befehl außerhalb des Pfads aus, der diese global.json-Datei enthält, oder aktualisieren Sie die in der global.json Datei angegebene Version, und führen Sie „dotnet workload update“ aus.
es: No se puede especificar una versión de carga de trabajo determinada en la línea de comandos mediante --version o --from-history cuando ya hay una versión especificada en el archivo global.json {0}. Para actualizar la versión de carga de trabajo instalada globalmente, ejecute el comando fuera de la ruta de acceso que contiene ese archivo global.json o actualice la versión especificada en el archivo global.json y ejecute "dotnet workload update".
fr: Impossible de spécifier une version de charge de travail particulière sur la ligne de commande via --version ou --from-history lorsqu’une version est déjà spécifiée dans global.json fichier {0}. Pour mettre à jour la version de la charge de travail installée globalement, exécutez la commande en dehors du chemin contenant ce fichier global.json ou mettez à jour la version spécifiée dans le fichier global.json et exécutez « dotnet workload update »
it: Impossibile specificare una determinata versione del carico di lavoro nella riga di comando tramite --version o --from-history quando è già specificata una versione nel file global.json {0}. Per aggiornare la versione del carico di lavoro installata a livello globale, eseguire il comando all'esterno del percorso contenente tale file global.json o aggiornare la versione specificata nel file di global.json ed eseguire "dotnet workload update".
ja: global.json ファイル {0} に既にバージョンが指定されている場合は、コマンド ラインで --version または --from-history を使用して特定のワークロード バージョンを指定することはできません。グローバルにインストールされたワークロード バージョンを更新するには、その global.json ファイルを含むパスの外部でコマンドを実行するか、global.json ファイルで指定されたバージョンを更新して、"dotnet workload update" を実行します。
ko: global.json 파일 {0}에 지정된 버전이 이미 있는 경우 --version 또는 --from-history를 통해 명령줄에서 특정 워크로드 버전을 지정할 수 없습니다. 전역으로 설치된 워크로드 버전을 업데이트하려면 해당 global.json 파일이 포함된 경로 외부에서 명령을 실행하거나 global.json 파일에 지정된 버전을 업데이트하고 "dotnet 워크로드 업데이트"를 실행합니다.
pl: Nie można określić określonej wersji obciążenia w wierszu polecenia za pomocą opcji --version lub --from-history, jeśli istnieje już wersja określona w pliku global.json {0}. Aby zaktualizować wersję obciążenia zainstalowaną globalnie, uruchom polecenie poza ścieżką zawierającą ten plik global.json lub zaktualizuj wersję określoną w pliku global.json i uruchom polecenie „dotnet workload update”.
pt_br: Não é possível especificar uma versão específica da carga de trabalho na linha de comando por meio de --version ou --from-history quando já existe uma versão especificada no arquivo global.json {0}. Para atualizar a versão da carga de trabalho instalada globalmente, execute o comando fora do caminho que contém o arquivo global.json ou atualize a versão especificada no arquivo global.json e execute "dotnet workload update".
ru: Невозможно указать конкретную версию рабочей нагрузки в командной строке с помощью --version или --from-history, если в файле global.json уже указана версия {0}. Чтобы обновить глобально установленную версию рабочей нагрузки, выполните команду вне пути, содержащего этот файл global.json, либо измените версию в файле global.json и выполните команду "dotnet workload update".
tr: {0} global.json dosyasında zaten belirtilen bir sürüm varsa, “--version” veya “--from-history” aracılığıyla komut satırında belirli bir iş yükü sürümü belirtilemez. Genel olarak yüklenen iş yükü sürümünü güncelleştirmek için, komutu global.json dosyasını içeren yolun dışında çalıştırın veya global.json dosyasında belirtilen sürümü güncelleştirin ve “dotnet workload update” komutunu çalıştırın.
zh_hans: 当 global.json 文件 {0} 中已指定版本时，无法在命令行上通过 --version 或 --from-history 指定特定工作负载版本。若要更新全局安装的工作负载版本，请在包含该 global.json 文件的路径外部运行命令，或者更新 global.json 文件中指定的版本，然后运行 "dotnet workload update"。
zh_hant: 當 global.json 檔案 {0} 中已指定版本時，無法在命令列上透過 --version 或 --from-history 指定特定工作負載版本。若要更新全域安裝的工作負載版本，請在包含該 global.json 檔案的路徑外執行命令，或更新 global.json 檔案中指定的版本，然後執行 "dotnet workload update"。

# CannotUseSkipManifestWithGlobalJsonWorkloadVersion
source: Cannot use the {0} option when workload version is specified in global.json. Remove the {0} option, or remove the 'workloadVersion' element from {1}.
cs: Možnost {0} se nedá použít, pokud je v global.json zadaná verze úlohy. Odeberte možnost {0} nebo odeberte element workloadVersion z {1}.
de: Die Option {0} kann nicht verwendet werden, wenn die workloadVersion in global.json angegeben ist. Entfernen Sie die Option {0}, oder entfernen Sie das workloadVersion-Element aus {1}.
es: No se puede usar la opción {0} cuando se especifica la versión de la carga de trabajo en global.json. Quite la opción {0} o quite el elemento "workloadVersion" de {1}.
fr: Impossible d’utiliser l’option {0} lorsque la version de la charge de travail est spécifiée dans global.json. Supprimez l’option {0} ou supprimez l’élément « workloadVersion » de {1}.
it: Non è possibile usare l'opzione {0} quando la versione del carico di lavoro è specificata in global.json. Rimuovere l'opzione {0} o rimuovere l'elemento 'workloadVersion' da {1}.
ja: ワークロードのバージョンが global.json で指定されている場合、{0} オプションは使用できません。{0} オプションを削除するか、{1} から 'workloadVersion' 要素を削除してください。
ko: global.json에 워크로드 버전이 지정된 경우 {0} 옵션을 사용할 수 없습니다. {0} 옵션을 제거하거나, {1}에서 'workloadVersion' 요소를 제거하세요.
pl: Nie można użyć opcji {0}, jeśli wersja obciążenia jest określona w pliku global.json. Usuń opcję {0} lub usuń element „workloadVersion” z {1}.
pt_br: Não é possível usar a opção {0} quando a versão da carga de trabalho é especificada em global.json. Remova a opção {0} ou remova o elemento 'workloadVersion' de {1}.
ru: Невозможно использовать параметр {0}, если версия рабочей нагрузки указана в файле global.json. Удалите параметр {0} или удалите элемент "workloadVersion" из {1}.
tr: Global.json'da iş yükü sürümü belirtildiğinde {0} seçeneği kullanılamaz. {0} seçeneğini kaldırın veya "workloadVersion" öğesini {1}‘den kaldırın.
zh_hans: 在 global.json 中指定工作负载版本时，无法使用 {0} 选项。移除 {0} 选项，或从 {1} 中移除“workloadVersion”元素。
zh_hant: global.json 中指定工作負載版本時，無法使用 {0} 選項。移除 {0} 選項，或從 {1} 移除 'workloadVersion' 元素。

# CapabilityExpressionEvaluator_Exception_InvalidExpression
source: Invalid expression, position: {0}.
cs: Neplatný výraz, pozice: {0}
de: Ungültiger Ausdruck, Position: {0}.
es: Expresión no válida, posición: {0}.
fr: Expression non valide, position : {0}
it: Espressione non valida. Posizione: {0}.
ja: 式が無効です、位置: {0}。
ko: 잘못된 식, 위치: {0}.
pl: Nieprawidłowe wyrażenie, pozycja: {0}.
pt_br: Expressão inválida, posição: {0}.
ru: Недопустимое выражение, позиция: {0}.
tr: Geçersiz ifade, konum: {0}.
zh_hans: 表达式无效，位置: {0}。
zh_hant: 運算式無效，位置: {0}。
