Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ToolListLocalOptionDescription
source: List the tools installed in the local tool manifest.
cs: Vypíše nástroje nainstalované v manifestu místního nástroje.
de: Hiermit listen Sie die im lokalen Toolmanifest installierten Tools auf.
es: Mostrar las herramientas instaladas en el manifiesto de la herramienta local.
fr: Liste les outils installés dans le manifeste d'outils locaux.
it: Elenca gli strumenti installati nel manifesto degli strumenti locale.
ja: ローカル ツール マニフェストにインストールされているツールを一覧表示します。
ko: 로컬 도구 매니페스트에 설치된 도구를 나열합니다.
pl: Wyświetl listę narzędzi zainstalowanych w manifeście narzędzi lokalnych.
pt_br: Liste as ferramentas instaladas no manifesto de ferramenta local.
ru: Перечисление средств, установленных в манифесте локального инструмента.
tr: Yerel araç bildiriminde yüklü araçları listeleyin.
zh_hans: 列出在本地工具清单中安装的工具。
zh_hant: 在本機工具資訊清單中列出已安裝的工具。

# ToolListPackageIdArgumentDescription
source: The NuGet Package Id of the tool to list
cs: ID balíčku NuGet nástroje, který se má vypsat
de: Die NuGet-Paket-ID des Tools, das aufgelistet werden soll.
es: Id del paquete NuGet de la herramienta que se va a listar
fr: L'ID de package NuGet de l'outil à répertorier
it: ID del pacchetto NuGet dello strumento da elencare.
ja: リストするツールの NuGet パッケージ ID
ko: 나열할 도구의 NuGet 패키지 ID
pl: Identyfikator pakietu NuGet narzędzia do zaktualizowania.
pt_br: A ID do Pacote NuGet da ferramenta a ser listada
ru: Идентификатор пакета NuGet перечисляемого инструмента
tr: Listelenen aracın NuGet Paket Kimliği
zh_hans: 要列出的工具的 NuGet 包 ID
zh_hant: 要列出的工具的 NuGet 套件識別碼

# ToolListPackageIdColumn
source: Package Id
cs: ID balíčku
de: Paket-ID
es: Id. del paquete
fr: ID du package
it: ID pacchetto
ja: パッケージ ID
ko: 패키지 ID
pl: Identyfikator pakietu
pt_br: ID do Pacote
ru: Идентификатор пакета
tr: Paket Kimliği
zh_hans: 包 ID
zh_hant: 套件識別碼

# ToolListToolPathOptionDescription
source: The directory containing the tools to list.
cs: Adresář obsahující nástroje, které se mají vypsat
de: Das Verzeichnis, das die aufzulistenden Tools enthält.
es: El directorio que contiene las herramientas que se van a enumerar.
fr: Répertoire contenant les outils à lister.
it: Directory contenente gli strumenti da elencare.
ja: 一覧表示するツールが入っているディレクトリ。
ko: 나열할 도구를 포함하는 디렉터리입니다.
pl: Katalog zawierający narzędzia do wyświetlenia na liście.
pt_br: O diretório que contém as ferramentas a serem listadas.
ru: Каталог, содержащий перечисляемые инструменты.
tr: Listelenecek aracı içeren dizin.
zh_hans: 包含要列出的工具的目录。
zh_hant: 包含要列出之工具的目錄。

# ToolListVersionColumn
source: Version
cs: Verze
es: Versión
it: Versione
ja: バージョン
ko: 버전
pl: Wersja
pt_br: Versão
ru: Версия
tr: Sürüm
zh_hans: 版本
zh_hant: 版本

# ToolRestoreCommandDescription
source: Restore tools defined in the local tool manifest.
cs: Obnoví nástroje definované v manifestu místního nástroje.
de: Hiermit stellen Sie die im lokalen Toolmanifest definierten Tools wieder her.
es: Restaurar las herramientas definidas en el manifiesto de la herramienta local.
fr: Restaure les outils définis dans le manifeste d'outils locaux.
it: Ripristina gli strumenti definiti nel manifesto degli strumenti locale.
ja: ローカル ツール マニフェストで定義されているツールを復元します。
ko: 로컬 도구 매니페스트에 정의된 도구를 복원합니다.
pl: Przywróć narzędzia zdefiniowane w manifeście narzędzi lokalnych.
pt_br: Restaure as ferramentas definidas no manifesto de ferramenta local.
ru: Восстановление средств, определенных в манифесте локального инструмента.
tr: Yerel araç bildiriminde tanımlı araçları geri yükleyin.
zh_hans: 还原本地工具清单中定义的工具。
zh_hant: 還原本機工具資訊清單中所定義的工具。

# ToolRestoreManifestPathOptionDescription
source: Path to the manifest file.
cs: Cesta k souboru manifestu
de: Pfad zur Manifestdatei.
es: Ruta de acceso al archivo de manifiesto.
fr: Chemin du fichier manifeste.
it: Percorso del file manifesto.
ja: マニフェスト ファイルへのパス。
ko: 매니페스트 파일 경로입니다.
pl: Ścieżka do pliku manifestu.
pt_br: Caminho para o arquivo de manifesto.
ru: Путь к файлу манифеста.
tr: Bildirim dosyasının yolu.
zh_hans: 清单文件的路径。
zh_hant: 資訊清單檔的路徑。

# ToolRunArgumentsDescription
source: Arguments forwarded to the tool
cs: Argumenty předané nástroji
de: An das Tool weitergeleitete Argumente.
es: Argumentos reenviados a la herramienta
fr: Arguments transmis à l'outil
it: Argomenti inviati allo strumento
ja: ツールに渡された引数
ko: 도구에 전달된 인수
pl: Argumenty przekazane do narzędzia
pt_br: Argumentos encaminhados para a ferramenta
ru: Аргументы, переданные инструменту
tr: Araca iletilen bağımsız değişkenler
zh_hans: 转发到工具的参数
zh_hant: 轉發到工具的引數

# ToolRunCommandDescription
source: Run a local tool. Note that this command cannot be used to run a global tool.
cs: Spustí místní nástroj. Tento příkaz nejde použít ke spuštění globálního nástroje.
de: Lokales Tool aus ausführen. Beachten Sie, dass dieser Befehl nicht zum Ausführen eines globalen Tools verwendet werden kann.
es: Ejecute una herramienta local. Tenga en cuenta que este comando no se puede usar para ejecutar una herramienta global.
fr: Exécuter un outil local. Notez que cette commande ne peut pas être utilisée pour exécuter un outil global.
it: Eseguire uno strumento locale. Si noti che questo comando non può essere utilizzato per eseguire uno strumento globale.
ja: ローカル ツールを実行します。このコマンドを使用してグローバル ツールを実行することはできません。
ko: 로컬 도구를 실행합니다. 이 명령은 전역 도구를 실행하는 데 사용할 수 없습니다.
pl: Uruchom narzędzie lokalne. Pamiętaj, że tego polecenia nie można używać do uruchamiania narzędzia globalnego.
pt_br: Execute uma ferramenta local. Observe que este comando não pode ser usado para executar uma ferramenta global.
ru: Запуск локального инструмента. Обратите внимание, что с помощью этой команды невозможно запустить глобальный инструмент.
tr: Yerel araç çalıştırın. Bu komutun bir genel aracı çalıştırmak için kullanılamayacağını unutmayın.
zh_hans: 运行本地工具。请注意，此命令不能用于运行全局工具。
zh_hant: 執行本機工具。請注意，此命令無法用來執行全域工具。

# ToolSearchCommandDescription
source: Search dotnet tools in nuget.org
cs: Hledat nástroje dotnet v nuget.org
de: "dotnet tools" in nuget.org suchen
es: Busca las herramientas dotnet en nuget.org.
fr: Rechercher les outils dotnet dans nuget.org
it: Cerca negli strumenti dotnet in nuget.org
ja: nuget.org で dotnet ツールを検索します
ko: nuget.org에서 dotnet 도구 검색
pl: Wyszukaj narzędzia dotnet w witrynie nuget.org
pt_br: Pesquisar as ferramentas do dotnet em nuget.org
ru: Поиск инструментов .NET на сайте nuget.org
tr: Nuget.org'da dotnet araçlarını arayın
zh_hans: 在 nuget.org 中搜索 dotnet 工具
zh_hant: 搜尋 nuget.org 中的 dotnet 工具

# ToolSearchPrereleaseDescription
source: Include pre-release packages.
cs: Zahrnuje balíčky v předběžné verzi.
de: Vorabversionspakete einschließen.
es: Incluir paquetes de versión preliminar.
fr: Inclure des packages en préversion.
it: Includi pacchetti pre-release.
ja: プレリリース パッケージが含まれます。
ko: 시험판 패키지를 포함합니다.
pl: Uwzględnij pakiety wersji wstępnej.
pt_br: Inclua pacotes de pré-lançamento.
ru: Включить пакеты предварительного выпуска.
tr: Ön sürüm paketlerini ekleyin.
zh_hans: 包括预发行包。
zh_hant: 包含發行前版本套件。

# ToolSearchSearchTermDescription
source: Search term from package id or package description. Require at least one character.
cs: Hledaný výraz z ID nebo popisu balíčku. Vyžaduje alespoň jeden znak.
de: Suchbegriff aus Paket-ID oder Paketbeschreibung. Es ist mindestens ein Zeichen erforderlich.
es: Término de búsqueda del identificador del paquete o de la descripción del paquete. Se requiere al menos un carácter.
fr: Rechercher un terme à partir de l'ID de package ou de la description du package. Nécessite au moins un caractère.
it: Termine di ricerca incluso nell'ID pacchetto o nella descrizione del pacchetto. È richiesto almeno un carattere.
ja: パッケージ ID またはパッケージの説明から語句を検索します。少なくとも 1 文字が必要です。
ko: 패키지 ID 또는 패키지 설명에서 가져온 검색어입니다. 1자 이상이어야 합니다.
pl: Wyszukaj termin na podstawie identyfikatora pakietu lub opisu pakietu. Wymagaj co najmniej jednego znaku.
pt_br: Termo de pesquisa da ID ou da descrição do pacote. Exige pelo menos um caractere.
ru: Условие поиска из идентификатора пакета или описания пакета. Необходимо указать по крайней мере один символ.
tr: Paket kimliğinden veya paket açıklamasından terim arayın. En az bir karakter gerektirin.
zh_hans: 包 ID 或包说明中的搜索词。至少需要一个字符。
zh_hant: 從套件識別碼或套件描述搜尋字詞。至少需要一個字元。

# ToolSearchSkipArgumentName
source: Skip
cs: Přeskočit
de: Überspringen
es: Omitir
fr: Ignorer
it: Ignora
ja: スキップ
ko: 건너뛰기
pl: Pomiń
pt_br: Ignorar
ru: Пропустить
tr: Atla
zh_hans: 跳过
zh_hant: 跳過

# ToolSearchSkipDescription
source: The number of results to skip, for pagination.
cs: Počet výsledků, které se mají přeskočit pro stránkování
de: Die Anzahl der zu überspringenden Ergebnisse für die Paginierung.
es: Número de resultados que se van a omitir, para la paginación.
fr: Nombre de résultats à ignorer pour la pagination.
it: Numero di risultati da ignorare per l'impaginazione.
ja: 改ページ位置の自動修正のためにスキップする結果の数。
ko: 페이지 매김을 위해 건너뛸 결과 수입니다.
pl: Liczba wyników do pominięcia na potrzeby dzielenia na strony.
pt_br: O número de resultados a serem ignorados para paginação.
ru: Число пропускаемых результатов для разбивки на страницы.
tr: Sayfalandırma için atlanacak sonuç sayısı.
zh_hans: 用于分页的要跳过的结果数。
zh_hant: 要跳過的結果數目，以便進行分頁。

# ToolSearchTakeArgumentName
source: Take
cs: Převzít
de: Übernehmen
it: Includi
ja: 取得
ko: 가져오기
pl: Pobierz
pt_br: Obter
ru: Получить
tr: Al
zh_hant: 採用

# ToolSearchTakeDescription
source: The number of results to return, for pagination.
cs: Počet výsledků, které se mají vrátit pro stránkování
de: Die Anzahl der zurückzugebenden Ergebnisse für die Paginierung.
es: Número de resultados que se van a devolver, para la paginación.
fr: Nombre de résultats à retourner pour la pagination.
it: Numero di risultati da restituire per l'impaginazione.
ja: 改ページ位置の自動修正のために返す結果の数。
ko: 페이지 매김을 위해 반환할 결과 수입니다.
pl: Liczba wyników do zwrócenia na potrzeby dzielenia na strony.
pt_br: O número de resultados a serem retornados para paginação.
ru: Число возвращаемых результатов для разбивки на страницы.
tr: Sayfalandırma için döndürülecek sonuç sayısı.
zh_hans: 用于分页的要返回的结果数。
zh_hant: 要傳回的結果數目，以便進行分頁。

# ToolUninstallCommandDescription
source: Uninstall a global tool or local tool.
cs: Odinstaluje globální nebo místní nástroj.
de: Deinstallieren Sie ein globales oder lokales Tool.
es: Desinstalar una herramienta global o local.
fr: Désinstalle un outil global ou un outil local.
it: Disinstalla uno strumento globale o locale.
ja: グローバル ツールまたはローカル ツールをアンインストールします。
ko: 전역 도구 또는 로컬 도구를 제거합니다.
pl: Odinstaluj narzędzie globalne lub lokalne.
pt_br: Desinstale uma ferramenta global ou local.
ru: Удаление глобального или локального средства.
tr: Genel veya yerel bir aracı kaldırın.
zh_hans: 卸载全局工具或本地工具。
zh_hant: 解除安裝全域工具或本機工具。

# ToolUninstallGlobalOptionDescription
source: Uninstall the tool from the current user's tools directory.
cs: Odinstaluje nástroj z adresáře nástrojů aktuálního uživatele.
de: Hiermit wird das Tool im Toolverzeichnis des aktuellen Benutzers deinstalliert.
es: Desinstala la herramienta del directorio de herramientas del usuario actual.
fr: Désinstallez l'outil du répertoire des outils de l'utilisateur actuel.
it: Disinstalla lo strumento dalla directory degli strumenti dell'utente corrente.
ja: 現在のユーザーのツール ディレクトリからツールをアンインストールします。
ko: 현재 사용자의 도구 디렉터리에서 도구를 제거합니다.
pl: Odinstaluj narzędzie z katalogu narzędzi bieżącego użytkownika.
pt_br: Desinstalar a ferramenta do diretório de ferramentas do usuário atual.
ru: Удаление инструмента из каталога инструментов текущего пользователя.
tr: Aracı geçerli kullanıcının araçlar dizininden kaldırır.
zh_hans: 从当前用户的工具目录中卸载该工具。
zh_hant: 從目前使用者的工具目錄，解除安裝工具。

# ToolUninstallInvalidToolPathOption
source: Tool path '{0}' does not exist.
cs: Cesta k nástroji {0} neexistuje.
de: Der Toolpfad "{0}" ist nicht vorhanden.
es: La ruta de acceso de la herramienta "{0}" no existe.
fr: Le chemin d'outil '{0}' n'existe pas.
it: Il percorso '{0}' dello strumento non esiste.
ja: ツール パス '{0}' は存在しません。
ko: '{0}' 도구 경로가 없습니다.
pl: Ścieżka narzędzia „{0}” nie istnieje.
pt_br: O caminho da ferramenta '{0}' não existe.
ru: Путь к средству "{0}" не существует.
tr: '{0}' araç yolu yok.
zh_hans: 工具路径“{0}”不存在。
zh_hant: 工具路徑 {0} 不存在。

# ToolUninstallLocalOptionDescription
source: Uninstall the tool and remove it from the local tool manifest.
cs: Odinstaluje nástroj a odebere ho z manifestu místního nástroje.
de: Deinstallieren Sie das Tool, und entfernen Sie es aus dem lokalen Toolmanifest.
es: Desinstalar la herramienta y quitarla del manifiesto de la herramienta local.
fr: Désinstalle l'outil et le supprime du manifeste d'outils locaux.
it: Disinstalla lo strumento e lo rimuove dal manifesto degli strumenti locale.
ja: ツールをアンインストールし、ローカル ツール マニフェストから削除します。
ko: 도구를 제거하고 로컬 도구 매니페스트에서 제거합니다.
pl: Odinstaluj narzędzie i usuń je z manifestu narzędzi lokalnych.
pt_br: Desinstale a ferramenta e a remova do manifesto de ferramenta local.
ru: Удаление средства и исключение его из манифеста локального средства.
tr: Aracı kaldırın ve yerel araç bildiriminden çıkarın.
zh_hans: 卸载工具并将其从本地工具清单中移除。
zh_hant: 解除安裝該工具，並將其從本機工具資訊清單中移除。

# ToolUninstallManifestPathOptionDescription
source: Path to the manifest file.
cs: Cesta k souboru manifestu
de: Pfad zur Manifestdatei.
es: Ruta de acceso al archivo de manifiesto.
fr: Chemin du fichier manifeste.
it: Percorso del file manifesto.
ja: マニフェスト ファイルへのパス。
ko: 매니페스트 파일 경로입니다.
pl: Ścieżka do pliku manifestu.
pt_br: Caminho para o arquivo de manifesto.
ru: Путь к файлу манифеста.
tr: Bildirim dosyasının yolu.
zh_hans: 清单文件的路径。
zh_hant: 資訊清單檔的路徑。

# ToolUninstallToolHasMultipleVersionsInstalled
source: Tool '{0}' has multiple versions installed and cannot be uninstalled.
cs: Nástroj {0} má několik nainstalovaných verzí a nelze ho odinstalovat.
de: Es sind mehrere Versionen von Tool "{0}" installiert, eine Deinstallation ist nicht möglich.
es: La herramienta "{0}" tiene varias versiones instaladas y no se puede desinstalar.
fr: L'outil '{0}' a plusieurs versions installées et ne peut pas être désinstallé.
it: Lo strumento '{0}' non può essere disinstallato perché ne sono installate più versioni.
ja: ツール '{0}' の複数のバージョンがインストールされており、アンインストールできません。
ko: 도구 '{0}'의 여러 버전이 설치되어 있으며 제거할 수 없습니다.
pl: Jest zainstalowanych wiele wersji narzędzia „{0}” i nie można go odinstalować.
pt_br: A ferramenta '{0}' tem várias versões instaladas e não pode ser desinstalada.
ru: Установлено несколько версий инструмента "{0}", и удалить его невозможно.
tr: '{0}' aracının birden fazla sürümü yüklü ve kaldırılamıyor.
zh_hans: 工具“{0}”已安装多个版本，无法卸载。
zh_hant: 工具 '{0}' 有多個安裝的版本，且無法解除安裝。

# ToolUninstallToolNotInstalled
source: A tool with the package Id '{0}' could not be found. Tools are uninstalled using their package Id which may be different from the tool name you use when calling the tool. You can find the tool names and the corresponding package Ids for installed tools using the command 'dotnet tool list'.
cs: Nástroj s ID balíčku {0} se nenašel. Nástroje se odinstalují pomocí svého ID balíčku, které se může lišit od názvu nástroje, který používáte při volání nástroje. Názvy nástrojů najdete a odpovídající ID balíčků nainstalovaných nástrojů najdete pomocí příkazu „dotnet tool list“.
de: Ein Tool mit der Paket-ID "{0}" wurde nicht gefunden. Tools werden unter Verwendung der zugehörigen Paket-ID deinstalliert, die sich möglicherweise vom Toolnamen unterscheidet, den Sie zum Aufrufen des Tools verwenden. Sie können die Toolnamen und die zugehörigen Paket-IDs für installierte Tools über den Befehl "dotnet tool list" abrufen.
es: No se encontró ninguna herramienta con el id. de paquete "{0}". Las herramientas se desinstalan utilizando su idd de paquete, que puede ser distinto del nombre de herramienta que se usa al llamarla. Puede buscar los nombres de herramientas y los identificadores de los paquetes correspondientes a las herramientas instaladas mediante el comando "dotnet tool list".
fr: L'outil ayant l'ID de package « {0} » est introuvable. Les outils sont désinstallés via leur ID de package, lequel peut être différent du nom d'outil que vous utilisez quand vous appelez ce dernier. Pour trouver les noms d'outils et les ID de package correspondants aux outils installés, utilisez la commande « dotnet tool list ».
it: Non è stato possibile trovare uno strumento con ID pacchetto '{0}'. Gli strumenti vengono disinstallati usando il relativo ID pacchetto che potrebbe differente dal nome dello strumento usato quando si chiama lo strumento. Puoi trovare i nomi degli strumenti e gli ID pacchetto corrispondenti per gli strumenti installati usando il comando 'dotnet tool list'.
ja: パッケージ Id が ' {0} ' のツールが見つかりませんでした。 ツールは、異なるパッケージ Id を使用してアンインストールされます ツールを呼び出すときに使用するツール名。ツール名が見つかります と、コマンドを使用してインストールされたツールの対応するパッケージ Id ' dotnet tool list '。
ko: 패키지 ID가 '{0}'인 도구를 찾을 수 없습니다. 도구를 호출할 때 사용한 도구 이름과 다를 수 있는 패키지 ID를 사용하여 도구가 제거되었습니다. 'dotnet tool list' 명령을 사용하여 설치된 도구의 도구 이름 및 해당 패키지 ID를 확인할 수 있습니다.
pl: Nie można odnaleźć narzędzia o identyfikatorze pakietu „{0}”. Narzędzia są odinstalowywane przy użyciu ich identyfikatora pakietu, który może być inny niż nazwa narzędzia używana podczas wywoływania narzędzia. Nazwy narzędzi można znaleźć i odpowiednie identyfikatory pakietów zainstalowanych narzędzi można znaleźć przy użyciu polecenia „dotnet tool list”.
pt_br: Não foi possível encontrar uma ferramenta com a ID ''{0}'' do pacote. As ferramentas são desinstaladas usando a ID do pacote que pode ser diferente do nome da ferramenta que você usa ao chamar a ferramenta. Você pode encontrar os nomes das ferramentas e as Ids de pacote correspondentes para as ferramentas instaladas usando o comando "dotnet tool list".
ru: Не удалось найти инструмент с идентификатором пакета "{0}" . Инструменты удалены с помощью идентификатора пакета, который может отличаться от имени инструмента, используемого при его вызове. Имена инструментов и соответствующие идентификаторы пакетов для установленных инструментов можно найти с помощью команды "dotnet tool list".
tr: '{0}' paket kimliğine sahip araç bulunamadı. Araçlar, aracı çağırırken kullandığınız araç adından farklı olabilen paket kimlikleri kullanılarak kaldırılır. Yüklü araçların araç adlarını ve karşılık gelen paket kimliklerini bulmak için 'dotnet tool list' komutunu kullanabilirsiniz.
zh_hans: 找不到包 ID 为 ‘{0}’ 的工具。 工具是使用其包 ID 卸载的，该 ID 可能 与调用工具时使用的工具名称不同。可使用 ‘dotnet tool list’ 命令查找 已安装工具的工具名称和 对应的包 ID。
zh_hant: 找不到套件識別碼為 '{0}' 的工具。 必須使用工具的套件識別碼才能將其解除安裝 而該識別碼可能與您在呼叫工具時的工具名稱不同。您可以使用命令 'dotnet tool list' 來針對已安裝工具尋找工具名稱 和對應的套件識別碼。

# ToolUninstallToolPathOptionDescription
source: The directory containing the tool to uninstall.
cs: Adresář obsahující nástroj, který se má odinstalovat
de: Das Verzeichnis, das das zu deinstallierende Tool enthält.
es: El directorio que contiene la herramienta que se va a instalar.
fr: Répertoire contenant l'outil à désinstaller.
it: Directory contenente lo strumento da disinstallare.
ja: アンインストールするツールが入っているディレクトリ。
ko: 제거할 도구를 포함하는 디렉터리입니다.
pl: Katalog zawierający narzędzie do odinstalowania.
pt_br: O diretório que contém a ferramenta a ser desinstalada.
ru: Каталог, содержащий удаляемый инструмент.
tr: Kaldırılacak aracı içeren dizin.
zh_hans: 包含要卸载的工具的目录。
zh_hant: 包含要解除安裝之工具的目錄。

# ToolUninstallUninstallSucceeded
source: Tool '{0}' (version '{1}') was successfully uninstalled.
cs: Nástroj {0} (verze {1}) byl úspěšně odinstalován.
de: Das Tool "{0}" (Version "{1}") wurde erfolgreich deinstalliert.
es: La herramienta "{0}" (versión "{1}") se desinstaló correctamente.
fr: L'outil '{0}' (version '{1}') a été désinstallé.
it: Lo strumento '{0}' (versione '{1}') è stato disinstallato.
ja: ツール '{0}' (バージョン '{1}') は正常にアンインストールされました。
ko: 도구 '{0}'(버전 '{1}')을(를) 제거했습니다.
pl: Pomyślnie odinstalowano narzędzie „{0}” (wersja: „{1}”).
pt_br: A ferramenta '{0}' (versão '{1}') foi desinstalada com êxito.
ru: Инструмент "{0}" (версия "{1}") удален.
tr: '{0}' aracı (sürüm '{1}') başarıyla kaldırıldı.
zh_hans: 已成功卸载工具“{0}”(版本“{1}”).
zh_hant: 已成功解除安裝工具 '{0}' ('{1}' 版)。

# ToolUpdateCommandDescription
source: Update a global or local tool.
cs: Aktualizace globálního nebo místního nástroje.
de: Hiermit aktualisieren Sie ein globales oder lokales Tool.
es: Actualizar una herramienta global o local.
fr: Met à jour un outil global ou local.
it: Aggiornare uno strumento globale o locale.
ja: グローバルまたはローカル ツールを更新します。
ko: 전역 또는 로컬 도구를 업데이트합니다.
pl: Zaktualizuj narzędzie globalne lub lokalne.
pt_br: Atualize uma ferramenta global ou local.
ru: Обновление глобального или локального средства.
tr: Genel veya yerel bir aracı güncelleştirin.
zh_hans: 更新全局或本地工具。
zh_hant: 更新全域或本機工具。

# ToolUpdatePackageIdArgumentDescription
source: The NuGet Package Id of the tool to update.
cs: ID balíčku NuGet nástroje, který se má aktualizovat
de: Die NuGet-Paket-ID des zu aktualisierenden Tools.
es: El id. del paquete de NuGet que se actualizará.
fr: ID de package NuGet de l'outil à mettre à jour.
it: ID pacchetto NuGet dello strumento da aggiornare.
ja: 更新するツールの NuGet パッケージ ID。
ko: 업데이트할 도구의 NuGet 패키지 ID입니다.
pl: Identyfikator pakietu NuGet narzędzia do zaktualizowania.
pt_br: A ID do pacote do NuGet da ferramenta a ser atualizada.
ru: Идентификатор пакета NuGet обновляемого инструмента.
tr: Güncelleştirilecek aracın NuGet Paket Kimliği.
zh_hans: 要更新的工具的 NuGet 包 ID。
zh_hant: 要更新之工具的 NuGet 套件識別碼。

# ToolUpdateToolHasMultipleVersionsInstalled
source: Tool '{0}' has multiple versions installed and cannot be updated.
cs: Nástroj {0} má několik nainstalovaných verzí a nelze ho aktualizovat.
de: Es sind mehrere Versionen des Tools "{0}" installiert, eine Aktualisierung ist nicht möglich.
es: La herramienta "{0}" tiene varias versiones instaladas y no se puede actualizar.
fr: Dans la mesure où plusieurs versions de l'outil '{0}' sont installées, il ne peut pas être mis à jour.
it: Lo strumento '{0}' non può essere aggiornato perché ne sono installate più versioni.
ja: ツール '{0}' の複数のバージョンがインストールされており、更新できません。
ko: '{0}' 도구는 여러 버전이 설치되어 있으며 업데이트할 수 없습니다.
pl: Jest zainstalowanych wiele wersji narzędzia „{0}” i nie można go zaktualizować.
pt_br: A ferramenta '{0}' tem várias versões instaladas e não pode ser atualizada.
ru: Установлено несколько версий инструмента "{0}", и обновить его невозможно.
tr: '{0}' aracının birden fazla sürümü yüklü ve güncelleştirilemiyor.
zh_hans: 工具“{0}”已安装多个版本，无法更新。
zh_hant: 工具 '{0}' 有多個安裝的版本，且無法更新。

# ToolUpdateUpdateSucceeded
source: Tool '{0}' was successfully updated from version '{1}' to version '{2}'.
cs: Nástroj {0} byl úspěšně aktualizován z verze {1} na verzi {2}.
de: Das Tool "{0}" wurde erfolgreich von Version {1} auf Version {2} aktualisiert.
es: La herramienta "{0}" se actualizó correctamente de la versión"{1}" a la versión "{2}".
fr: L'outil '{0}' a été correctement mis à jour de la version '{1}' à la version '{2}'.
it: Lo strumento '{0}' è stato aggiornato dalla versione '{1}' alla versione '{2}'.
ja: ツール '{0}' がバージョン '{1}' からバージョン '{2}' に正常に更新されました。
ko: '{0}' 도구가 '{1}' 버전에서 '{2}' 버전으로 업데이트되었습니다.
pl: Narzędzie „{0}” zostało pomyślnie zaktualizowane z wersji „{1}” do wersji „{2}”.
pt_br: A ferramenta '{0}' foi atualizada com êxito da versão '{1}' para a versão '{2}'.
ru: Инструмент "{0}" успешно обновлен с версии "{1}" до версии "{2}".
tr: '{0}' aracı, '{1}' sürümünden '{2}' sürümüne başarıyla güncelleştirildi.
zh_hans: 工具“{0}”已成功从版本“{1}”更新到版本“{2}”。
zh_hant: 已成功將工具 '{0}' 從 '{1}' 版更新為 '{2}' 版。

# Try
source: try {0}
cs: {0} pokus
de: {0} testen
es: intento {0}
fr: essayer {0}
it: prova {0}
ja: {0} を試す
ko: {0} 시도
pl: wypróbuj {0}
pt_br: experimente {0}
ru: попробуйте {0}
tr: Şunu deneyin: {0}
zh_hans: 尝试 {0}
zh_hant: 嘗試 {0}
