Repository: dotnet/sdk
Catalog: src/Cli/dotnet/Commands/xlf/CliCommandStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# StoreFrameworkOptionDescription
source: The target framework to store packages for. The target framework has to be specified in the project file.
cs: Cílová architektura pro uložení balíčků. Cílová architektura musí být zadaná v souboru projektu.
de: Das Zielframework zum Speichern von Paketen. Das Zielframework muss in der Projektdatei angegeben werden.
es: La plataforma de destino para la que se almacenan los paquetes. La plataforma de destino se debe especificar en el archivo de proyecto.
fr: Framework cible pour lequel le stockage des packages est effectué. Le framework cible doit être spécifié dans le fichier projet.
it: Framework di destinazione per cui archiviare i pacchetti. Il framework di destinazione deve essere specificato nel file di progetto.
ja: パッケージを格納するターゲット フレームワーク。ターゲット フレームワークはプロジェクト ファイルで指定する必要があります。
ko: 패키지를 저장할 대상 프레임워크입니다. 대상 프레임워크는 프로젝트 파일에서 지정해야 합니다.
pl: Platforma docelowa, dla której mają być przechowywane pakiety. Platforma docelowa musi być określona w pliku projektu.
pt_br: A estrutura de destino cujos pacotes serão armazenados. A estrutura de destino precisa ser especificada no arquivo de projeto.
ru: Целевая платформа для хранения пакетов. Целевая платформа должна быть указана в файле проекта.
tr: Paketlerin depolanacağı hedef çerçeve. Hedef çerçevenin proje dosyasında belirtilmesi gerekir.
zh_hans: 要存储包的目标框架。目标框架必须在项目文件中指定。
zh_hant: 要對其儲存套件的目標架構。該目標架構必須在專案檔中指定。

# StoreOutputOptionDescription
source: The output directory to store the given assemblies in.
cs: Výstupní adresář, do kterého se mají uložit daná sestavení
de: Das Ausgabeverzeichnis, in dem die angegebenen Assemblys gespeichert werden.
es: El directorio de salida en el que se almacenarán los ensamblados especificados.
fr: Répertoire de sortie dans lequel stocker les assemblys spécifiés.
it: Directory di output in cui archiviare gli assembly specificati.
ja: 指定されたアセンブリを格納する出力ディレクトリ。
ko: 지정된 어셈블리를 저장할 출력 디렉터리입니다.
pl: Katalog wyjściowy, w którym mają być przechowywane podane zestawy.
pt_br: O diretório de saída no qual os assemblies fornecidos serão armazenados.
ru: Выходной каталог, в котором хранятся указанные сборки.
tr: Belirtilen bütünleştirilmiş kodların depolanacağı çıkış dizini.
zh_hans: 要存储给定程序集的输出目录。
zh_hant: 儲存指定組件的輸出目錄。

# StoreRuntimeOptionDescription
source: The target runtime to store packages for.
cs: Cílový modul runtime pro uložení balíčků
de: Die Zielruntime zum Speichern von Paketen.
es: El entorno tiempo de ejecución de destino para el que se almacenan los paquetes.
fr: Runtime cible pour lequel le stockage des packages est effectué.
it: Runtime di destinazione per cui archiviare i pacchetti.
ja: パッケージを格納するターゲット ランタイム。
ko: 패키지를 저장할 대상 런타임입니다.
pl: Docelowe środowisko uruchomieniowe, dla którego mają być przechowywane pakiety.
pt_br: O runtime de destino no qual os pacotes serão armazenados.
ru: Целевая среда выполнения, для которой хранятся пакеты.
tr: Paketlerin geri yükleneceği hedef çalışma zamanı.
zh_hans: 要存储包的目标运行时。
zh_hant: 要對其儲存套件的目標執行階段。

source: Summary
cs: Souhrn
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
it: Riepilogo
ja: 概要
ko: 요약
pl: Podsumowanie
pt_br: Resumo
ru: Сводка
tr: Özet
zh_hans: 摘要
zh_hant: 摘要

source: Tags
cs: Značky
es: Etiquetas
fr: Balises
it: Tag
ja: タグ
ko: 태그
pl: Tagi
ru: Теги
tr: Etiketler
zh_hans: 标记
zh_hant: 標記

# TempDirOptionDescription
source: Specify a temporary directory for this command to download and extract NuGet packages (must be secure).
cs: Zadejte dočasný adresář pro tento příkaz, který se má stáhnout a extrahujte balíčky NuGet (musí být zabezpečené).
de: Geben Sie ein temporäres Verzeichnis für diesen Befehl zum Herunterladen und Extrahieren von NuGet-Paketen an (muss sicher sein).
es: Especifique un directorio temporal para que este comando descargue y extraiga paquetes NuGet (debe ser seguro).
fr: Spécifiez un répertoire temporaire pour que cette commande télécharge et extrait les packages NuGet (doit être sécurisé).
it: Specificare una directory temporanea per questo comando per scaricare ed estrarre i pacchetti NuGet (deve essere protetta).
ja: このコマンドに NuGet パッケージをダウンロードして抽出するための一時ディレクトリを指定します (セキュリティで保護する必要があります)。
ko: NuGet 패키지를 다운로드하고 추출하려면 이 명령의 임시 디렉터리를 지정합니다(보안이 있어야 합니다).
pl: Określ katalog tymczasowy dla tego polecenia, aby pobrać i wyodrębnić pakiety NuGet (musi być bezpieczny).
pt_br: Especifique um diretório temporário para este comando baixar e extrair pacotes NuGet (deve ser seguro).
ru: Укажите временный каталог для этой команды, чтобы скачать и извлечь пакеты NuGet (должны быть защищены).
tr: Bu komut için NuGet paketlerini indirmek ve ayıklamak üzere geçici bir dizin belirtin (güvenli olmalıdır).
zh_hans: 为此命令指定一个临时目录，以下载并提取(必须安全)的 NuGet 包。
zh_hant: 指定此命令的暫存目錄，以下載並解壓縮 NuGet 套件 (必須為安全)。

# TestAppFullName
source: .NET Test Driver
cs: Testovací ovladač .NET
de: .NET-Testtreiber
es: Controlador de pruebas de .NET
fr: Pilote de test .NET
it: Driver di test .NET
ko: .NET 테스트 드라이버
pl: Sterownik testów platformy .NET
pt_br: Driver de Teste do .NET
ru: Драйвер тестов .NET
tr: .NET Test Sürücüsü
zh_hans: .NET 测试驱动程序
zh_hant: .NET 測試驅動程式

# TestCmdNoLogo
source: Run test(s), without displaying Microsoft Testplatform banner
cs: Spustit testy bez zobrazení nápisu Microsoft Testplatform
de: Test(s) ohne Anzeige des Microsoft-Testplattformbanners ausführen
es: Ejecutar pruebas, sin mostrar la pancarta de Microsoft Testplatform
fr: Exécute le ou les tests, sans afficher la bannière Microsoft Testplatform
it: Esegui test senza visualizzare il banner di Microsoft Testplatform
ja: Microsoft Testplatform バナーを表示せずにテストを実行する
ko: Microsoft Testplatform 배너를 표시하지 않고 테스트 실행
pl: Uruchom testy bez wyświetlania baneru platformy testowej firmy Microsoft
pt_br: Executar testes, sem exibir a faixa do Microsoft Testplatform
ru: Запуск тестов без отображения баннера Testplatform Майкрософт
tr: Testleri Microsoft Testplatform bandını görüntülemeden çalıştır
zh_hans: 运行测试，而不显示 Microsoft Testplatform 版权标志
zh_hant: 執行測試，但不顯示 Microsoft Testplatform 橫幅

# TestCommandUseDirectoryWithSwitch
source: Specifying a directory for 'dotnet test' should be via '--project' or '--solution'.
ko: 'dotnet test'에 대한 디렉터리를 지정하려면 '--project' 또는 '--solution'을 통해 지정해야 합니다.
tr: 'dotnet test' için bir dizin belirtme '--project' veya '--solution' ile yapılmalıdır.
zh_hans: 应通过 ‘--project’ 或 ‘--solution’ 指定 ‘dotnet test’ 的目录。
zh_hant: 指定 'dotnet test' 的目錄應透過 '--project' 或 '--solution'。

# TestCommandUseProject
source: Specifying a project for 'dotnet test' should be via '--project'.
cs: Zadání projektu pro dotnet test by mělo být prostřednictvím --project.
de: Die Angabe eines Projekts für „dotnet test“ sollte über „--project“ erfolgen.
es: La especificación de un proyecto para 'dotnet test' debe hacerse mediante '--project'.
fr: La spécification d’un projet pour « dotnet test » doit se faire via « --project ».
it: La specifica di un progetto per 'dotnet test' deve avvenire tramite '--project'.
ja: 'dotnet test' のプロジェクトを指定するには、'--project' を使用する必要があります。
ko: 'dotnet test'에 대한 프로젝트를 지정하려면 '--project'를 통해 지정해야 합니다.
pl: Określanie projektu dla „dotnet test” powinno być za pomocą „--project”.
pt_br: A especificação de um projeto para 'dotnet test' deve ser feita por meio de '--project'.
ru: Указание проекта для "dotnet test" следует выполнять через "--project".
tr: ‘dotnet test’ için bir proje belirlemek ‘--project’ ile yapılmalıdır.
zh_hans: 应通过 "--project" 为 "dotnet test" 指定项目。
zh_hant: 指定 'dotnet test' 的專案應透過 '--project'。

# TestCommandUseSolution
source: Specifying a solution for 'dotnet test' should be via '--solution'.
cs: Zadání řešení pro dotnet test by mělo být prostřednictvím --solution.
de: Die Angabe einer Lösung für „dotnet test“ sollte über „--solution“ erfolgen.
es: La especificación de una solución para 'dotnet test' debe hacerse mediante '--solution'.
fr: La spécification d’une solution pour « dotnet test » doit se faire via « --solution ».
it: La specifica di una soluzione per 'dotnet test' deve avvenire tramite '--solution'.
ja: 'dotnet test' のソリューションを指定するには、'--solution' を使用する必要があります。
ko: 'dotnet test'에 대한 솔루션을 지정하려면 '--solution'을 통해 지정해야 합니다.
pl: Określenie rozwiązania dla „dotnet test” powinno być za pomocą „--solution”.
pt_br: A especificação de uma solução para 'dotnet test' deve ser feita por meio de '--solution'.
ru: Указание решения для "dotnet test" следует выполнять через "--solution".
tr: ‘dotnet test’ için bir çözüm belirtmek ‘--solution’ ile yapılmalıdır.
zh_hans: 应通过 "--solution" 为 "dotnet test" 指定解决方案。
zh_hant: 指定 'dotnet test' 的解決方案應透過 '--solution'。

# TestCommandUseTestModules
source: Specifying dlls or executables for 'dotnet test' should be via '--test-modules'.
cs: Zadání knihoven DLL nebo spustitelných souborů pro dotnet test by mělo být prostřednictvím --test-modules.
de: Die Angabe von DLLs oder ausführbaren Dateien für „dotnet test“ sollte über „--test-modules“ erfolgen.
es: La especificación de archivos DLL o ejecutables para 'dotnet test' debe hacerse mediante '--test-modules'.
fr: La spécification de DLL ou d’exécutables pour « dotnet test » doit se faire via « --test-modules ».
it: La specifica di DLL o eseguibili per 'dotnet test' deve avvenire tramite '--test-modules'.
ja: 'dotnet test' に dll または実行可能ファイルを指定するには、'--test-modules' を使用する必要があります。
ko: 'dotnet test'에 대한 dll 또는 실행 파일을 지정하는 것은 '--test-modules'를 통해 지정해야 합니다.
pl: Określanie bibliotek dll lub plików wykonywalnych dla „dotnet test” powinno być za pomocą „--test-modules”.
pt_br: A especificação de dlls ou executáveis para 'dotnet test' deve ser feita por meio de '--test-modules'.
ru: Указание DLL или исполняемых файлов для "dotnet test" следует выполнять через "--test-modules".
tr: ‘dotnet test’ için dll'leri veya yürütülebilir dosyaları belirtmek ‘--test-modules’ ile yapılmalıdır.
zh_hans: 应通过 "--test-modules" 为 "dotnet test" 指定 dll 或可执行文件。
zh_hant: 指定 'dotnet test' 的 DLL 或可執行檔應透過 '--test-modules'。

# TestConfigurationOptionDescription
source: The configuration to use for running tests. The default for most projects is 'Debug'.
cs: Konfigurace, která se má použít pro spuštění testů. Výchozí možností pro většinu projektů je Debug.
de: Die für die Testausführung zu verwendende Konfiguration. Standard für die meisten Projekte ist "Debug".
es: La configuración que se usará para ejecutar pruebas. El valor predeterminado para la mayoría de los proyectos es "Debug".
fr: Configuration à utiliser pour l'exécution des tests. La valeur par défaut pour la plupart des projets est 'Debug'.
it: Configurazione da usare per eseguire i test. L'impostazione predefinita per la maggior parte dei progetti è 'Debug'.
ja: テストの実行に使用する構成。ほとんどのプロジェクトで、既定値は 'Debug' です。
ko: 테스트 실행에 사용할 구성입니다. 대부분의 프로젝트에서 기본값은 'Debug'입니다.
pl: Konfiguracja do użycia na potrzeby uruchamiania testów. W przypadku większości projektów ustawienie domyślne to „Debugowanie”.
pt_br: A configuração a ser usada para executar testes. O padrão para a maioria dos projetos é 'Debug'.
ru: Конфигурация для выполнения тестов. По умолчанию для большинства проектов используется "Debug".
tr: Testleri çalıştırmak için kullanılacak yapılandırma. Çoğu proje için varsayılan, ‘Hata Ayıklama’ seçeneğidir.
zh_hans: 用于运行测试的配置。大多数项目的默认值是 "Debug"。
zh_hant: 要用於執行測試的組態。大部分的專案預設為「偵錯」。

# TestDefinition
source: Run unit tests using the test runner specified in a .NET project.
cs: Spustí testy jednotek v nástroji Test Runner zadaném v projektu .NET.
de: Hiermit werden mithilfe des im .NET-Projekt angegebenen Test Runners Komponententests ausgeführt.
es: Ejecuta pruebas unitarias usando el ejecutor de pruebas especificado en un proyecto de .NET.
fr: Exécutez des tests unitaires à l'aide du programme Test Runner spécifié dans un projet .NET.
it: Esegue gli unit test con l'istanza di Test Runner specificata in un progetto .NET.
ja: .NET プロジェクトに指定されているテスト ランナーを使用して、単体テストを実行します。
ko: .NET 프로젝트에 지정된 Test Runner를 사용하여 단위 테스트를 실행합니다.
pl: Uruchom testy jednostkowe przy użyciu modułu uruchamiającego testy określonego w projekcie platformy .NET.
pt_br: Executar testes de unidade usando o executor de testes especificado em um projeto do .NET.
ru: Запуск модульных тестов с помощью средства, указанного в проекте .NET.
tr: .NET projesinde belirtilen test çalıştırıcısını kullanarak birim testleri çalıştırır.
zh_hans: 使用 .NET 项目中指定的测试运行程序运行单元测试。
zh_hant: 使用 .NET 專案中指定的測試執行器，執行單元測試。

# TestDiscoveryExitCode
source: Test discovery completed with non-success exit code: {0} (see: https://aka.ms/testingplatform/exitcodes)
cs: Testovací zjišťování bylo dokončeno s neúspěšným ukončovacím kódem: {0} (viz: https://aka.ms/testingplatform/exitcodes)
de: Die Testermittlung wurde mit einem nicht erfolgreichen Exitcode abgeschlossen: {0} (siehe: https://aka.ms/testingplatform/exitcodes)
es: Detección de pruebas completada con código de salida no correcto: {0} (vea: https://aka.ms/testingplatform/exitcodes)
fr: La découverte de tests s’est terminée avec un code de sortie non réussi : {0} (voir : https://aka.ms/testingplatform/exitcodes)
it: Individuazione dei test completata con codice di uscita non riuscito: {0} (vedi: https://aka.ms/testingplatform/exitcodes)
ja: テスト検出が異常終了コードで完了しました: {0} (参照: https://aka.ms/testingplatform/exitcodes)
ko: 성공하지 않은 종료 코드로 테스트 검색이 완료되었습니다. {0}(참조: https://aka.ms/testingplatform/exitcodes)
pl: Odnajdywanie testów zostało ukończone z kodem zakończenia bez powodzenia: {0} (zobacz: https://aka.ms/testingplatform/exitcodes)
pt_br: Descoberta de testes concluída com código de saída sem sucesso: {0} (veja: https://aka.ms/testingplatform/exitcodes)
ru: Обнаружение тестов завершено с кодом выхода неудачного состояния: {0} (сведения: https://aka.ms/testingplatform/exitcodes)
tr: Test bulma, {0} başarısız çıkış koduyla tamamlandı ( https://aka.ms/testingplatform/exitcodes adresine bakın)
zh_hans: 已完成测试发现，但显示非成功退出代码: {0} (请参阅: https://aka.ms/testingplatform/exitcodes)
zh_hant: 測試探索已完成，未成功的結束代碼為: {0} (請參閱: https://aka.ms/testingplatform/exitcodes)

# TestDiscoverySummary
source: Discovered {0} tests in {1} assemblies.
cs: Počet zjištěných testů v(e) {1} sestaveních: {0}
de: Ermittelte {0} Tests in {1} Assemblys.
es: {0} pruebas detectadas en {1} ensamblados.
fr: {0} tests découverts dans {1} assemblys.
it: {0} individuati in {1} assembly.
ja: {1} アセンブリで {0} つのテストを検出しました。
ko: {1}개의 어셈블리에서 {0}개의 테스트가 검색됨
pl: Odnaleziono testy ({0}) w zestawach {1}.
pt_br: Testes {0} descobertos nos assemblies {1}.
ru: Обнаружены тесты ({0}) в сборках ({1})
tr: {1} derlemelerde {0} test bulundu.
zh_hans: 在 {1} 个程序集中发现了 {0} 个测试。
zh_hant: 在 {1} 組件中找到 {0} 個測試。

# TestDiscoverySummarySingular
source: Discovered {0} tests.
cs: Počet zjištěných testů: {0}
de: Ermittelte {0} Tests.
es: {0} pruebas detectadas.
fr: {0} tests découverts.
it: {0} test individuati.
ja: {0} つのテストが検出されました。
ko: {0}개 테스트가 검색됨
pl: Odnaleziono testy ({0}).
pt_br: Testes {0} descobertos.
ru: Обнаружены тесты ({0}).
tr: {0} test bulundu.
zh_hans: 已发现 {0} 个测试。
zh_hant: 已找到 {0} 個測試。

# TestFrameworkOptionDescription
source: The target framework to run tests for. The target framework must also be specified in the project file.
cs: Cílová architektura pro spuštění testů. Cílová architektura musí být určená také v souboru projektu.
de: Das Zielframework für den Testlauf. Das Zielframework muss auch in der Projektdatei angegeben werden.
es: La plataforma de destino para la que se ejecutan pruebas. La plataforma de destino se debe especificar en el archivo de proyecto.
fr: Framework cible pour lequel les tests sont exécutés. Le framework cible doit également être spécifié dans le fichier projet.
it: Framework di destinazione per cui eseguire i test. Il framework di destinazione deve essere specificato anche nel file di progetto.
ja: テストを実行する対象のターゲット フレームワーク。ターゲット フレームワークはプロジェクト ファイルでも指定する必要があります。
ko: 테스트를 실행할 대상 프레임워크입니다. 대상 프레임워크는 프로젝트 파일에도 지정되어야 합니다.
pl: Platforma docelowa, dla której mają być uruchamiane testy. Platforma docelowa musi być również określona w pliku projektu.
pt_br: A estrutura de destino para a qual a execução de testes ocorrerá. A estrutura de destino também precisa ser especificada no arquivo de projeto.
ru: Целевая платформа для выполнения тестов. Целевая платформа также должна быть указана в файле проекта.
tr: Testlerin çalıştırılacağı hedef çerçeve. Hedef çerçevenin proje dosyasında da belirtilmesi gerekir.
zh_hans: 运行测试的目标框架。必须在项目文件中指定目标框架。
zh_hant: 要為其執行測試的目標架構。該目標架構必須在專案檔中指定。

# TestRunExitCode
source: Test run completed with non-success exit code: {0} (see: https://aka.ms/testingplatform/exitcodes)
cs: Testovací běh byl dokončen s neúspěšným ukončovacím kódem: {0} (viz: https://aka.ms/testingplatform/exitcodes)
de: Der Testlauf wurde mit einem nicht erfolgreichen Exitcode abgeschlossen: {0} (siehe: https://aka.ms/testingplatform/exitcodes)
es: Serie de pruebas completada con código de salida incorrecto: {0} (consulte: https://aka.ms/testingplatform/exitcodes)
fr: L’exécution de tests s’est terminée avec un code de sortie non réussi : {0} (voir : https://aka.ms/testingplatform/exitcodes)
it: Esecuzione del test completata con codice di uscita non riuscito: {0} (vedi: https://aka.ms/testingplatform/exitcodes)
ja: テスト実行が非成功終了コードで完了しました: {0} (参照: https://aka.ms/testingplatform/exitcodes)
ko: 성공하지 않은 종료 코드로 테스트 실행이 완료되었습니다. {0}(참조: https://aka.ms/testingplatform/exitcodes)
pl: Przebieg testu został ukończony z kodem zakończenia bez powodzenia: {0} (zobacz: https://aka.ms/testingplatform/exitcodes)
pt_br: Execução de testes concluída com código de saída sem sucesso: {0} (veja: https://aka.ms/testingplatform/exitcodes)
ru: Выполнение теста завершено с кодом выхода неудачного состояния: {0} (сведения: https://aka.ms/testingplatform/exitcodes)
tr: Test çalıştırması, {0} başarısız çıkış koduyla tamamlandı ( https://aka.ms/testingplatform/exitcodes adresine bakın)
zh_hans: 已完成测试运行，但显示非成功退出代码: {0} (请参阅: https://aka.ms/testingplatform/exitcodes)
zh_hant: 測試執行已完成，未成功的結束代碼為: {0} (請參閱: https://aka.ms/testingplatform/exitcodes)

source: Test run summary:
cs: Souhrn testovacího běhu:
de: Testlaufzusammenfassung:
es: Resumen de la serie de pruebas:
fr: Résumé de série de tests :
it: Riepilogo esecuzione test:
ja: テストの実行の概要:
ko: 테스트 실행 요약:
pl: Podsumowanie przebiegu testu:
pt_br: Resumo da execução de teste:
ru: Сводка тестового запуска:
tr: Test çalıştırması özeti:
zh_hans: 测试运行摘要:
zh_hant: 測試回合摘要：

# TestRuntimeOptionDescription
source: The target runtime to test for.
cs: Cílový modul runtime pro testování.
de: Die Zielruntime, für die Tests ausgeführt werden sollen.
es: El tiempo de ejecución de destino para probar.
fr: Runtime cible à tester.
it: Runtime di destinazione per cui eseguire il test.
ja: テスト対象のターゲット ランタイム。
ko: 테스트할 대상 런타임입니다.
pl: Docelowe środowisko uruchomieniowe na potrzeby testowania.
pt_br: O runtime escolhido para testar.
ru: Целевая среда выполнения для тестирования.
tr: Test için hedef çalışma zamanı.
zh_hans: 要为其测试的目标运行时。
zh_hant: 要測試的目標執行時間。

# ToolAlreadyInstalled
source: Tool '{0}' is already installed.
cs: Nástroj {0} je už nainstalovaný.
de: Das Tool "{0}" ist bereits installiert.
es: La herramienta "{0}" ya está instalada.
fr: L'outil '{0}' est déjà installé.
it: Lo strumento '{0}' è già installato.
ja: ツール '{0}' は既にインストールされています。
ko: '{0}' 도구가 이미 설치되어 있습니다.
pl: Narzędzie „{0}” jest już zainstalowane.
pt_br: A ferramenta '{0}' já está instalada.
ru: Инструмент "{0}" уже установлен.
tr: '{0}' aracı zaten yüklü.
zh_hans: 已安装工具“{0}”。
zh_hant: 工具 '{0}' 已安裝。

# ToolCommandDescription
source: Install or work with tools that extend the .NET experience.
cs: Instaluje nástroje, které rozšiřují prostředí .NET, nebo s nimi pracuje.
de: Installation oder Arbeit mit Tools zum Erweitern der .NET-Benutzeroberfläche.
es: Instale o trabaje con herramientas que mejoran la experiencia de uso de .NET.
fr: Installez ou utilisez des outils qui étendent l'expérience .NET.
it: Consente di installare o usare strumenti che estendono l'esperienza .NET.
ja: .NET のエクスペリエンスを向上するツールをインストールするか、使用します。
ko: .NET 환경을 확장하는 도구를 설치하거나 도구로 작업합니다.
pl: Zainstaluj lub pracuj z narzędziami, które rozszerzają środowisko .NET.
pt_br: Instale ou trabalhe com as ferramentas que ampliam a experiência do .NET.
ru: Установка и использование средств, расширяющих возможности .NET.
tr: .NET deneyiminizi genişleten araçları yükleyin veya bu araçlarla çalışın.
zh_hans: 安装或使用扩展 .NET 体验的工具。
zh_hant: 安裝或使用可擴充 .NET 體驗的工具。

# ToolCommonNoManifestGuide
source: If you intended to perform the action on a global tool, use the `--global` option for the command.
cs: Pokud jste chtěli provést akci s globálním nástrojem, použijte pro příkaz možnost --global.
de: Wenn Sie die Aktion für ein globales Tool ausführen möchten, verwenden Sie für den Befehl die Option "--global".
es: Si quiere realizar la acción en una herramienta global, use la opción "--global" para el comando.
fr: Si vous avez l'intention d'effectuer l'action sur un outil global, utilisez l'option '--global' avec la commande.
it: Se si intende eseguire l'azione su uno strumento globale, usare l'opzione `--global` per il comando.
ja: グローバル ツールでアクションを実行する場合は、コマンドで `--global` オプションを使用してください。
ko: 전역 도구에 대해 작업을 수행하려면 명령에 '--global' 옵션을 사용하세요.
pl: Jeśli zamierzasz wykonać akcję na narzędziu globalnym, użyj opcji „--global” dla polecenia.
pt_br: Se você pretende executar a ação em uma ferramenta global, use a opção `--global` para o comando.
ru: Если вы хотели выполнить действие с глобальным инструментом, используйте параметр "--global" для этой команды.
tr: Eylemi genel bir araç üzerinde gerçekleştirmeyi amaçlıyorsanız, komut için `--global` seçeneğini kullanın.
zh_hans: 如果打算在全局工具上执行操作，请使用命令的 "--global" 选项。
zh_hant: 如果您打算在全域工具上執行動作，請對命令使用 `--global` 選項。

# ToolDefinition
source: Install or manage tools that extend the .NET experience.
cs: Umožňuje instalaci nebo správu nástrojů, které rozšiřují prostředí .NET.
de: Hiermit werden Tools zum Erweitern der .NET-Benutzeroberfläche installiert oder verwaltet.
es: Instala o administra herramientas que mejoran la experiencia de .NET.
fr: Installez ou gérez les outils qui étendent l'expérience .NET.
it: Consente di installare o gestire strumenti che estendono l'esperienza .NET.
ja: .NET のエクスペリエンスを向上するツールをインストールまたは管理します。
ko: .NET 환경을 확장하는 도구를 설치하거나 관리합니다.
pl: Zainstaluj lub zarządzaj narzędziami, które rozszerzają środowisko .NET.
pt_br: Instalar ou gerenciar ferramentas que ampliam a experiência do .NET.
ru: Установка и настройка инструментов, расширяющих возможности .NET.
tr: .NET deneyimini genişleten araçları yükler veya yönetir.
zh_hans: 安装或管理扩展 .NET 体验的工具。
zh_hant: 安裝或管理可擴充 .NET 體驗的工具。

# ToolDownloadCanceled
source: Tool package download canceled
cs: Stahování balíčku nástrojů bylo zrušeno.
de: Download des Toolpakets abgebrochen
es: Descarga del paquete de herramientas cancelada
fr: Téléchargement du package d'outils annulé
it: Download del pacchetto dello strumento annullato
ja: ツール パッケージのダウンロードがキャンセルされました
ko: 도구 패키지 다운로드가 취소됨
pl: Anulowano pobieranie pakietu narzędzi
pt_br: Download do pacote de ferramentas cancelado
ru: Скачивание пакета инструмента отменено
tr: Araç paketi indirme işlemi iptal edildi
zh_hans: 已取消工具包下载
zh_hant: 工具套件下載已取消
