Repository: dotnet/sdk
Catalog: src/Containers/Microsoft.NET.Build.Containers/Resources/xlf/Strings.*.xlf
Languages: ru

# AmazonRegistryFailed
source: CONTAINER1002: Request to Amazon Elastic Container Registry failed prematurely. This is often caused when the target repository does not exist in the registry.
ru: CONTAINER1002: преждевременный сбой запроса к Реестру контейнеров Amazon Elastic. Это часто происходит из-за отсутствия целевого репозитория в реестре.

# AmbiguousTags
source: CONTAINER2008: Both {0} and {1} were provided, but only one or the other is allowed.
ru: CONTAINER2008: {0} и {1} предоставлены, но разрешен только один из них.

# AppCommandArgsSetNoAppCommand
source: CONTAINER2025: ContainerAppCommandArgs are provided without specifying a ContainerAppCommand.
ru: CONTAINER2025: ContainerAppCommandArgs предоставлены без указания ContainerAppCommand.

# AppCommandSetNotUsed
source: CONTAINER2026: ContainerAppCommand and ContainerAppCommandArgs must be empty when ContainerAppCommandInstruction is '{0}'.
ru: CONTAINER2026: ContainerAppCommand и ContainerAppCommandArgs должны быть пустыми, если ContainerAppCommandInstruction — "{0}".

# ArchiveRegistry_PushInfo
source: local archive at '{0}'
ru: локальное архивирование в "{0}"

# BaseEntrypointOverwritten
source: CONTAINER2022: The base image has an entrypoint that will be overwritten to start the application. Set ContainerAppCommandInstruction to 'Entrypoint' if this is desired. To preserve the base image entrypoint, set ContainerAppCommandInstruction to 'DefaultArgs'.
ru: CONTAINER2022: базовый образ содержит точку входа, которая будет перезаписана для запуска приложения. При необходимости настройте для ContainerAppCommandInstruction значение "Entrypoint". Чтобы сохранить точку входа базового образа, настройте для ContainerAppCommandInstruction значение "DefaultArgs".

# BaseImageNameParsingFailed
source: CONTAINER2009: Could not parse {0}: {1}
ru: CONTAINER2009: не удалось проанализировать {0}: {1}

# BaseImageNameRegistryFallback
source: CONTAINER2020: {0} does not specify a registry and will be pulled from Docker Hub. Please prefix the name with the image registry, for example: '{1}/<image>'.
ru: CONTAINER2020: {0} не указывает реестр и будет извлечен из Docker Hub. Добавьте для имени префикс в виде реестра образов, например: "{1}/<image>".

# BaseImageNameWithSpaces
source: CONTAINER2013: {0} had spaces in it, replacing with dashes.
ru: CONTAINER2013: {0} содержит пробелы, замененные на дефисы.

# BaseImageNotFound
source: CONTAINER1011: Couldn't find matching base image for {0} that matches RuntimeIdentifier {1}.
ru: CONTAINER1011: не удалось найти соответствующий базовый образ для {0}, соответствующего RuntimeIdentifier {1}.

# BlobUploadFailed
source: CONTAINER1001: Failed to upload blob using {0}; received status code '{1}'.
ru: CONTAINER1001: не удалось отправить BLOB-объект с помощью {0}; получен код состояния "{1}".

# BuildingImageIndex
source: Building image index '{0}' on top of manifests {1}.
ru: Построение индекса '{0}' поверх манифестов {1}.

# ContainerBuilder_ImageUploadedToLocalDaemon
source: Pushed image '{0}' to {1}.
ru: Изображение "{0}" отправлено в {1}.

# ContainerBuilder_ImageUploadedToRegistry
source: Pushed image '{0}' to registry '{1}'.
ru: Изображение "{0}" отправлено в реестр "{1}".

# ContainerBuilder_StartBuildingImage
source: Building image '{0}' with tags '{1}' on top of base image '{2}'.
ru: Выполняется сборка образа "{0}" с тегами "{1}" поверх базового образа "{2}".

# CouldntDeserializeJsonToken
source: CONTAINER1007: Could not deserialize token from JSON.
ru: CONTAINER1007: не удалось десериализовать токен из JSON.

# CouldntRecognizeRegistry
source: CONTAINER2012: Could not recognize registry '{0}'.
ru: CONTAINER2012: не удалось распознать реестр "{0}".

# DockerCli_PushInfo
source: local registry via '{0}'
ru: локальный реестр через "{0}"

# DockerInfoFailed
source: CONTAINER3002: Failed to get docker info({0})\n{1}\n{2}
ru: CONTAINER3002: не удалось получить сведения Docker({0})\n{1}\n{2}

# DockerInfoFailed_Ex
source: CONTAINER3002: Failed to get docker info: {0}
ru: CONTAINER3002: не удалось получить сведения Docker: {0}

# ContainerRuntimeProcessCreationFailed
source: CONTAINER3001: Failed creating {0} process.
ru: CONTAINER3001: не удалось создать процесс {0}.

# EmptyOrWhitespacePropertyIgnored
source: CONTAINER4006: Property '{0}' is empty or contains whitespace and will be ignored.
ru: CONTAINER4006: свойство "{0}" пусто или содержит пробелы и будет пропущено.

# EmptyValuesIgnored
source: CONTAINER4004: Items '{0}' contain empty item(s) which will be ignored.
ru: CONTAINER4004: элементы "{0}" содержат пустые элементы, которые будут пропущены.

# EntrypointAndAppCommandArgsSetNoAppCommandInstruction
source: CONTAINER2023: A ContainerEntrypoint and ContainerAppCommandArgs are provided. ContainerAppInstruction must be set to configure how the application is started. Valid instructions are {0}.
ru: CONTAINER2023: предоставлены ContainerEntrypoint и ContainerAppCommandArgs. Чтобы настроить способ запуска приложения, необходимо настроить ContainerAppInstruction. Допустимые инструкции: {0}.

# EntrypointSetNoAppCommandInstruction
source: CONTAINER2027: A ContainerEntrypoint is provided. ContainerAppInstruction must be set to configure how the application is started. Valid instructions are {0}.
ru: CONTAINER2027: предоставлен ContainerEntrypoint. Чтобы настроить способ запуска приложения, необходимо настроить ContainerAppInstruction. Допустимые инструкции: {0}.

# EntrypointArgsSetNoEntrypoint
source: CONTAINER2024: ContainerEntrypointArgs are provided without specifying a ContainerEntrypoint.
ru: CONTAINER2024: ContainerEntrypointArgs предоставлены без указания ContainerEntrypoint.

# EntrypointArgsSetPreferAppCommandArgs
source: CONTAINER2029: ContainerEntrypointArgsSet are provided. Change to use ContainerAppCommandArgs for arguments that must always be set, or ContainerDefaultArgs for arguments that can be overridden when the container is created.
ru: CONTAINER2029: предоставлен параметр ContainerEntrypointArgsSet. Измените, чтобы использовать ContainerAppCommandArgs для аргументов, которые всегда должны быть настроены, или ContainerDefaultArgs для аргументов, которые можно переопределить при создании контейнера.

# EntrypointConflictAppCommand
source: CONTAINER2028: ContainerEntrypoint can not be combined with ContainerAppCommandInstruction '{0}'.
ru: CONTAINER2028: ContainerEntrypoint невозможно объединить с ContainerAppCommandInstruction "{0}".

# FailedRetrievingCredentials
source: CONTAINER1008: Failed retrieving credentials for "{0}": {1}
ru: CONTAINER1008: Не удалось получить учетные данные для "{0}": {1}

# GenerateDigestLabelWithoutGenerateLabels
source: CONTAINER2030: GenerateLabels was disabled but GenerateDigestLabel was enabled - no digest label will be created.
ru: CONTAINER2030: параметр GenerateLabels был отключен, но параметр GenerateDigestLabel был включен — метка дайджеста не будет создана.

# HostObjectNotDetected
source: No host object detected.
ru: Объект узла не обнаружен.

# ImageIndexUploadedToRegistry
source: Pushed image index '{0}' to registry '{1}'.
ru: Индекс изображения "{0}" отправлен в реестр "{1}".

# ImageLoadFailed
source: CONTAINER1009: Failed to load image from local registry. stdout: {0}
ru: CONTAINER1009: не удалось загрузить образ из локального реестра. stdout: {0}

# ImagePullNotSupported
source: CONTAINER1010: Pulling images from local registry is not supported.
ru: CONTAINER1010: извлечение образов из локального реестра не поддерживается.

# ImagesEmpty
source: Cannot create manifest list (image index) because no images were provided.
ru: Не удается создать список манифестов (индекс образа), так как изображения не предоставлены.

# InvalidEnvVar
source: CONTAINER2015: {0}: '{1}' was not a valid Environment Variable. Ignoring.
ru: CONTAINER2015: {0}: "{1}" не является допустимой переменной среды. Пропуск.

# InvalidImageMetadata
source: Cannot create manifest list (image index) because provided images are invalid. Items must have 'Config', 'Manifest', 'ManifestMediaType' and 'ManifestDigest' metadata.
ru: Не удается создать список манифестов (индекс образа), так как предоставленные образы недопустимы. Элементы должны иметь метаданные "Config", "Manifest", "ManifestMediaType" и "ManifestDigest".

# InvalidImageName_EntireNameIsInvalidCharacters
source: CONTAINER2005: The inferred image name '{0}' contains entirely invalid characters. The valid characters for an image name are alphanumeric characters, -, /, or _, and the image name must start with an alphanumeric character.
ru: CONTAINER2005: Предполагаемое имя изображения "{0}" содержит совершенно недопустимые символы. Допустимыми символами для имени изображения являются буквенно-цифровые символы, -, / или _, а имя изображения должно начинаться с буквенно-цифрового символа.

# InvalidImageName_NonAlphanumericStartCharacter
source: CONTAINER2005: The first character of the image name '{0}' must be a lowercase letter or a digit and all characters in the name must be an alphanumeric character, -, /, or _.
ru: CONTAINER2005: Первый символ имени изображения "{0}" должен быть строчной буквой или цифрой, а все символы в имени должны быть буквенно-цифровым символом, -, / или _.

# InvalidPort_Number
source: CONTAINER2017: A ContainerPort item was provided with an invalid port number '{0}'. ContainerPort items must have an Include value that is an integer, and a Type value that is either 'tcp' or 'udp'.
ru: CONTAINER2017: элемент ContainerPort предоставлен с недопустимым номером порта "{0}". Элементы ContainerPort должны иметь значение Include, являющееся целым числом, и значением типа "tcp" или "udp".

# InvalidPort_NumberAndType
source: CONTAINER2017: A ContainerPort item was provided with an invalid port number '{0}' and an invalid port type '{1}'. ContainerPort items must have an Include value that is an integer, and a Type value that is either 'tcp' or 'udp'.
ru: CONTAINER2017: элемент ContainerPort был предоставлен с недопустимым номером порта "{0}" и недопустимым типом порта "{1}". Элементы ContainerPort должны иметь значение Include, которое является числом, и значение типа "tcp" или "udp".

# InvalidPort_Type
source: CONTAINER2017: A ContainerPort item was provided with an invalid port type '{0}'. ContainerPort items must have an Include value that is an integer, and a Type value that is either 'tcp' or 'udp'.
ru: CONTAINER2017: элемент ContainerPort предоставлен с недопустимым типом порта "{0}". Элементы ContainerPort должны иметь значение Include, являющееся целым числом, и значением типа "tcp" или "udp".

# InvalidSdkPrereleaseVersion
source: CONTAINER2018: Invalid SDK prerelease version '{0}' - only 'rc' and 'preview' are supported.
ru: CONTAINER2018: недопустимая предварительная версия SDK "{0}" — поддерживаются только "rc" и "preview".

# InvalidSdkVersion
source: CONTAINER2019: Invalid SDK semantic version '{0}'.
ru: CONTAINER2019: недопустимая семантическая версия SDK "{0}".

# InvalidTag
source: CONTAINER2007: Invalid {0} provided: {1}. Image tags must be alphanumeric, underscore, hyphen, or period.
ru: CONTAINER2007: предоставлен недопустимый {0}: {1}. В качестве тегов изображений допускаются буквы, цифры, символы подчеркивания, дефисы и точки.

# InvalidTags
source: CONTAINER2010: Invalid {0} provided: {1}. {0} must be a semicolon-delimited list of valid image tags. Image tags must be alphanumeric, underscore, hyphen, or period.
ru: CONTAINER2010: предоставлен недопустимый {0}: {1}. {0} должен быть списком допустимых тегов изображений, разделенных точкой с запятой. В качестве тегов изображений допускаются буквы, цифры, символы подчеркивания, дефисы и точки.

# InvalidTargetRuntimeIdentifiers
source: Invalid string[] TargetRuntimeIdentifiers. Either all should be 'linux-musl' or none.
ru: Недопустимая строка[] TargetRuntimeIdentifiers. Все должны быть либо "linux-маскали", либо нет.

# InvalidTokenResponse
source: CONTAINER1003: Token response had neither token nor access_token.
ru: CONTAINER1003: ответ токена не содержит маркера и access_token.

# ItemsWithoutMetadata
source: CONTAINER4005: Item '{0}' contains items without metadata 'Value', and they will be ignored.
ru: CONTAINER4005: элемент "{0}" содержит элементы без метаданных "Value", и они будут пропущены.

# LocalRegistryNotAvailable
source: CONTAINER1012: The local registry is not available, but pushing to a local registry was requested.
ru: CONTAINER1012: локальный реестр недоступен, но была запрошена отправка в локальный реестр.

# LocalDocker_FailedToGetConfig
source: Error while reading daemon config: {0}
ru: Ошибка при чтении конфигурации управляющей программы: {0}

# LocalDocker_LocalDaemonErrors
source: The daemon server reported errors: {0}
ru: Сервер управляющей программы сообщил об ошибках: {0}

# MissingLinkToRegistry
source: CONTAINER2004: Unable to download layer with descriptor '{0}' from registry '{1}' because it does not exist.
ru: CONTAINER2004: не удается скачать слой с дескриптором "{0}" из реестра "{1}", так как он не существует.

# MissingPortNumber
source: CONTAINER2016: ContainerPort item '{0}' does not specify the port number. Please ensure the item's Include is a port number, for example '<ContainerPort Include="80" />'
ru: CONTAINER2016: элемент ContainerPort "{0}" не указывает номер порта. Убедитесь, что include элемента является номером порта, например "<ContainerPort Include="80" />"

# MixedMediaTypes
source: 'mediaType' of manifests should be the same in manifest list (image index).
ru: MediaType манифестов должен быть одинаковым в списке манифестов (индексе образа).

# NoRequestUriSpecified
source: CONTAINER1004: No RequestUri specified.
ru: CONTAINER1004: не указан RequestUri.

# NormalizedContainerName
source: '{0}' was not a valid container image name, it was normalized to '{1}'
ru: "{0}" не является допустимым именем образа контейнера, оно нормализовано до "{1}"

# OciImageMultipleTagsNotSupported
source: Unable to create tarball for oci image with multiple tags.
ru: Невозможно создать tarball для образа oci с несколькими тегами.

# PublishDirectoryDoesntExist
source: CONTAINER2011: {0} '{1}' does not exist
ru: CONTAINER2011: {0} "{1}" не существует

# RegistryOperationFailed
source: CONTAINER1017: Unable to communicate with the registry '{0}'.
ru: CONTAINER1017: не удается связаться с реестром "{0}".

# RegistryOutputPushFailed
source: CONTAINER1013: Failed to push to the output registry: {0}
ru: CONTAINER1013: не удалось отправить в выходной реестр: {0}

# RegistryPullFailed
source: CONTAINER1014: Manifest pull failed.
ru: CONTAINER1014: сбой вытягивания манифеста.

# RegistryPushFailed
source: CONTAINER1005: Registry push failed; received status code '{0}'.
ru: CONTAINER1005: сбой отправки реестра, получен код состояния "{0}".

# Registry_ConfigUploadStarted
source: Uploading config to registry at blob '{0}',
ru: Отправка конфигурации в реестр в BLOB-объекте "{0}",

# Registry_ConfigUploaded
source: Uploaded config to registry.
ru: Конфигурация отправлена в реестр.

# Registry_LayerExists
source: Layer '{0}' already exists.
ru: Слой "{0}" уже существует.

# Registry_LayerUploadStarted
source: Uploading layer '{0}' to '{1}'.
ru: Отправка слоя "{0}" в "{1}".

# Registry_LayerUploaded
source: Finished uploading layer '{0}' to '{1}'.
ru: Завершена отправка слоя "{0}" в "{1}".

# Registry_ManifestUploadStarted
source: Uploading manifest to registry '{0}' as blob '{1}'.
ru: Отправка манифеста в реестр "{0}" как BLOB-объект "{1}".

# Registry_ManifestUploaded
source: Uploaded manifest to '{0}'.
ru: Манифест отправлен в "{0}".

# Registry_TagUploadStarted
source: Uploading tag '{0}' to '{1}'.
ru: Отправка тега "{0}" в "{1}".

# Registry_TagUploaded
source: Uploaded tag '{0}' to '{1}'.
ru: Отправлен тег "{0}" в "{1}".

# RepositoryNotFound
source: CONTAINER1015: Unable to access the repository '{0}' at tag '{1}' in the registry '{2}'. Please confirm that this name and tag are present in the registry.
ru: CONTAINER1015: не удается получить доступ к репозиторию "{0}" тега "{1}" в реестре "{2}". Подтвердите, что это имя и тег присутствуют в реестре.

# RequiredItemsContainsEmptyItems
source: CONTAINER4003: Required '{0}' items contain empty items.
ru: CONTAINER4003: необходимые "{0}" содержат пустые элементы.

# RequiredItemsNotSet
source: CONTAINER4002: Required '{0}' items were not set.
ru: CONTAINER4002: обязательные "{0}" не установлены.

# RequiredPropertyNotSetOrEmpty
source: CONTAINER4001: Required property '{0}' was not set or empty.
ru: CONTAINER4001: обязательное свойство "{0}" не установлено или пусто.

# TooManyRetries
source: CONTAINER1006: Too many retries, stopping.
ru: CONTAINER1006: слишком много повторных попыток, остановка.

# UnableToAccessRepository
source: CONTAINER1016: Unable to access the repository '{0}' in the registry '{1}'. Please confirm your credentials are correct and that you have access to this repository and registry.
ru: CONTAINER1016: не удается получить доступ к репозиторию "{0}" в реестре "{1}". Убедитесь, что ваши учетные данные верны и что у вас есть доступ к этому репозиторию и реестру.

# UnknownAppCommandInstruction
source: CONTAINER2021: Unknown AppCommandInstruction '{0}'. Valid instructions are {1}.
ru: CONTAINER2021: неизвестный элемент AppCommandInstruction "{0}". Допустимые инструкции: {1}.

# UnknownLocalRegistryType
source: CONTAINER2002: Unknown local registry type '{0}'. Valid local container registry types are {1}.
ru: CONTAINER2002: неизвестный тип локального реестра "{0}". Допустимыми типами реестра локального контейнера являются {1}.

# UnknownMediaType
source: CONTAINER2003: The manifest for {0}:{1} from registry {2} was an unknown type: {3}. Please raise an issue at https://github.com/dotnet/sdk-container-builds/issues with this message.
ru: CONTAINER2003: манифест для {0}:{1} из реестра{2} был неизвестного типа: {3}. Создайте вопрос на https://github.com/dotnet/sdk-container-builds/issues с этим сообщением.

# UnrecognizedMediaType
source: CONTAINER2001: Unrecognized mediaType '{0}'.
ru: CONTAINER2001: нераспознанный тип мультимедиа "{0}".

# UnsupportedMediaType
source: Cannot create manifest list (image index) for the provided 'mediaType' = '{0}'.
ru: Не удается создать список манифестов (индекс образа) для указанного "mediaType" = '{0}'.

# UnsupportedMediaTypeForTarball
source: Unable to create tarball for mediaType '{0}'.
ru: Не удалось создать tarball для mediaType "{0}".

# _Test
source: CONTAINER0000: Value for unit test {0}
ru: CONTAINER0000: значение для модульного теста {0}
