Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ProjectOrFileArgumentDescription
source: The project file or C# file-based app to operate on. If a file is not specified, the command will search the current directory for a project file.
cs: Soubor projektu nebo souborová aplikace v jazyce C#, se kterou se má pracovat. Pokud soubor není zadaný, příkaz vyhledá soubor projektu v aktuálním adresáři.
de: Die Projekt- oder C#-Datei (dateibasiertes Programm), auf die zugegriffen werden soll. Wenn keine Datei angegeben ist, durchsucht der Befehl das aktuelle Verzeichnis nach einer Projektdatei.
es: El archivo de proyecto o la aplicación basada en archivos de C# en que se va a operar. Si no se especifica un archivo, el comando buscará un archivo de proyecto en el directorio actual.
fr: Application basée sur des fichiers C# ou fichier projet sur laquelle effectuer des opérations. Si aucun fichier n’est spécifié, la commande recherche un fichier projet dans le répertoire actuel.
it: Il file di progetto o l'app basata su file C# su cui eseguire operazioni. Se non si specifica un file, il comando cercherà un progetto o una soluzione nella directory corrente.
ja: 操作するプロジェクト ファイルまたは C# ファイル ベースのアプリ。ファイルが指定されていない場合、コマンドは現在のディレクトリでプロジェクト ファイルを検索します。
ko: 작업할 프로젝트 파일 또는 C# 파일 기반 앱입니다. 파일을 지정하지 않으면 명령이 현재 디렉터리에서 프로젝트 파일을 검색합니다.
pl: Plik projektu lub aplikacja oparta na plikach języka C#, na którym ma działać. Jeśli plik nie zostanie określony, polecenie wyszuka bieżący katalog w poszukiwaniu pliku projektu.
pt_br: O arquivo do projeto ou aplicativo baseado em arquivo C# a ser operado. Se um arquivo não for especificado, o comando pesquisará um arquivo de projeto no diretório atual.
ru: Приложение на основе файла проекта или файла C# для работы. Если файл не указан, команда будет искать файл проекта в текущем каталоге.
tr: İşlem yapılacak proje dosyası veya C# dosyası tabanlı uygulama. Bir dosya belirtilmezse, komut geçerli dizinde bir proje dosyası arar.
zh_hans: 要操作的项目文件或基于 C# 文件的应用。如果未指定文件，则该命令将在当前目录中搜索项目文件。
zh_hant: 要執行的專案檔案或 C# 檔案型應用程式。若未指定檔案，命令就會在目前的目錄中搜尋專案或檔案。

# ProjectOrFileArgumentName
source: PROJECT | FILE
cs: PROJEKT | SOUBOR
de: PROJEKT | DATEI
es: PROYECTO | ARCHIVO
fr: FICHIER | PROJET
it: FILE DI | PROGETTO
ja: プロジェクト | ファイル
ko: 프로젝트 | 파일
pl: PROJEKT | PLIK
pt_br: PROJETO | ARQUIVO
ru: ПРОЕКТ | ФАЙЛ
tr: PROJE | DOSYA
zh_hans: 项目|文件
zh_hant: 專案 | 檔案

source: Project reference
cs: Odkaz na projekt
de: Projektverweis
es: Referencia de proyecto
fr: Référence de projet
it: Riferimento al progetto
ja: プロジェクト参照
ko: 프로젝트 참조
pl: Odwołanie do projektu
pt_br: Referência do projeto
ru: Ссылка на проект
tr: Proje başvurusu
zh_hans: 项目引用
zh_hant: 專案參考

# ProjectReferenceCouldNotBeFound
source: Project reference `{0}` could not be found.
cs: Nenašel se odkaz na projekt {0}.
de: Der Projektverweis "{0}" wurde nicht gefunden.
es: No se encuentra la referencia de proyecto "{0}".
fr: La référence de projet '{0}' est introuvable.
it: Il riferimento al progetto `{0}` non è stato trovato.
ja: プロジェクト参照 `{0}` は見つかりませんでした。
ko: 프로젝트 참조 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć odwołania do projektu „{0}”.
pt_br: Não foi possível encontrar a referência de projeto ‘{0}’.
ru: Не удалось найти ссылку на проект "{0}".
tr: `{0}` proje başvurusu bulunamadı.
zh_hans: 找不到项目引用“{0}”。
zh_hant: 找不到專案參考 `{0}`。

# ProjectReferenceOneOrMore
source: Project reference(s)
cs: Odkaz(y) na projekt
de: Projektverweis(e)
es: Referencias de proyecto
fr: Référence(s) de projet
it: Riferimento/i al progetto
ja: プロジェクト参照
ko: 프로젝트 참조
pl: Odwołania do projektów
pt_br: Referências de projeto
ru: Ссылки проекта
tr: Proje başvuruları
zh_hans: 项目引用
zh_hant: 專案參考

# ProjectReferenceRemoved
source: Project reference `{0}` removed.
cs: Odkaz na projekt {0} byl odebrán.
de: Der Projektverweis "{0}" wurde entfernt.
es: La referencia de proyecto "{0}" se ha quitado.
fr: Référence de projet '{0}' supprimée.
it: Il riferimento al progetto `{0}` è stato rimosso.
ja: プロジェクト参照 `{0}` は削除されました。
ko: 프로젝트 참조 '{0}'이(가) 제거되었습니다.
pl: Odwołanie do projektu „{0}” zostało usunięte.
pt_br: Referência de projeto ‘{0}’ removida.
ru: Ссылка на проект "{0}" удалена.
tr: `{0}` proje başvurusu kaldırıldı.
zh_hans: 已删除项目引用“{0}”。
zh_hant: 專案參考 `{0}` 已移除。

# ProjectRemoved
source: Project `{0}` removed from solution.
cs: Projekt {0} byl z řešení odebrán.
de: Das Projekt "{0}" wurde aus der Projektmappe entfernt.
es: Se ha quitado el proyecto "{0}" de la solución.
fr: Projet '{0}' retiré de la solution.
it: Il progetto `{0}` è stato rimosso dalla soluzione.
ja: プロジェクト `{0}` がソリューションから削除されました。
ko: '{0}' 프로젝트가 솔루션에서 제거되었습니다.
pl: Projekt „{0}” został skasowany z rozwiązania.
pt_br: O projeto ‘{0}’ foi removido da solução.
ru: Проект "{0}" удален из решения.
tr: `{0}` projesi çözümden kaldırıldı.
zh_hans: 已从解决方案中移除项目“{0}”。
zh_hant: 專案 `{0}` 已從解決方案移除。

# ProjectRemovedFromTheSolution
source: Project `{0}` removed from the solution.
cs: Projekt {0} byl z řešení odebrán.
de: Das Projekt "{0}" wurde aus der Projektmappe entfernt.
es: Se ha quitado el proyecto "{0}" de la solución.
fr: Projet '{0}' retiré de la solution.
it: Il progetto `{0}` è stato rimosso dalla soluzione.
ja: プロジェクト `{0}` がソリューションから削除されました。
ko: '{0}' 프로젝트가 솔루션에서 제거되었습니다.
pl: Projekt „{0}” został skasowany z rozwiązania.
pt_br: O projeto `{0}` foi removido da solução.
ru: Проект "{0}" удален из решения.
tr: `{0}` projesi çözümden kaldırıldı.
zh_hans: 已从解决方案中移除项目“{0}”。
zh_hant: 專案 `{0}` 已從解決方案移除。

# RazorServer
source: Razor build server
cs: Buildovací server Razor
es: Servidor de compilación de Razor
fr: Serveur de builds Razor
it: Server di compilazione di Razor
ja: Razor ビルド サーバー
ko: Razor 빌드 서버
pl: Serwer kompilacji Razor
pt_br: Servidor de build Razor
ru: Сервер сборки Razor
tr: Razor derleme sunucusu
zh_hans: Razor 生成服务器
zh_hant: Razor 組建伺服器

source: Reference
cs: Odkaz
de: Verweis
es: Referencia
fr: Référence
it: Riferimento
ja: 参照
ko: 참조
pl: Odwołanie
pt_br: Referência
ru: Ссылка
tr: Başvuru
zh_hans: 引用
zh_hant: 參考

# ReferenceAddedToTheProject
source: Reference `{0}` added to the project.
cs: Odkaz na {0} byl přidán do projektu.
de: Der Verweis "{0}" wurde dem Projekt hinzugefügt.
es: Se ha agregado la referencia "{0}" al proyecto.
fr: Référence '{0}' ajoutée au projet.
it: Il riferimento `{0}` è stato aggiunto al progetto.
ja: 参照 `{0}` がプロジェクトに追加されました。
ko: 프로젝트에 '{0}' 참조가 추가되었습니다.
pl: Do projektu zostało dodane odwołanie „{0}”.
pt_br: A referência ‘{0}’ foi adicionada ao projeto.
ru: Ссылка "{0}" добавлена в проект.
tr: `{0}` başvurusu projeye eklendi.
zh_hans: 已将引用“{0}”添加到项目。
zh_hant: 參考 `{0}` 已新增至專案。

source: Remove
cs: Odebrat
de: Entfernen
es: Quitar
fr: Supprimer
it: Rimuovi
ja: 削除
ko: 제거
pl: Usuń
pt_br: Remover
ru: Удалить
tr: Kaldır
zh_hans: 删除
zh_hant: 移除

# RequiredCommandNotPassed
source: Required command was not provided.
cs: Požadovaný příkaz nebyl zadán.
de: Der erforderliche Befehl wurde nicht bereitgestellt.
es: No se proporcionó el comando requerido.
fr: La commande nécessaire n'a pas été fournie.
it: Il comando obbligatorio non è stato specificato.
ja: 必要なコマンドが指定されませんでした。
ko: 필수 명령을 제공하지 않았습니다.
pl: Nie podano wymaganego polecenia.
pt_br: O comando necessário não foi fornecido.
ru: Обязательная команда не указана.
tr: Gerekli komut sağlanmadı.
zh_hans: 未提供必需的命令。
zh_hant: 未提供所需的命令。

# ResolvingCommandSpec
source: {0}: resolving commandspec from {1} Tool Libraries.
cs: {0}: Řeší se specifikace příkazu commandspec z knihoven nástroje {1}.
de: {0}: commandspec aus {1} Toolbibliotheken wird aufgelöst.
es: {0}: resolviendo commandspec desde las bibliotecas de herramientas de {1}.
fr: {0} : résolution de la spécification de commande à partir des bibliothèques d'outils {1}.
it: {0}: risoluzione di commandSpec dalle librerie degli strumenti di {1}.
ja: {0}: {1} ツール ライブラリから commandspec を解決しています。
ko: {0}: {1} 도구 라이브러리에서 commandspec을 확인하는 중입니다.
pl: {0}: Rozpoznawanie elementu commandspec z bibliotek narzędzia {1}.
pt_br: {0}: resolvendo commandspec por meio das Bibliotecas de Ferramentas de {1}.
ru: {0}: разрешение спецификации команды из библиотек средств {1}.
tr: {0}: {1} Araç Kitaplıklarından commandspec çözümleniyor.
zh_hans: {0}: 正在从 {1} 工具库解析 commandspec。
zh_hant: {0}: 正在從 {1} 工具程式庫解析 commandspec。

# ResponseFileNotFound
source: Response file '{0}' does not exist.
cs: Soubor odpovědí {0} neexistuje.
de: Die Antwortdatei „{0}“ ist nicht vorhanden.
es: El archivo de respuesta '{0}' no existe.
fr: Le fichier réponse '{0}' n’existe pas.
it: Il file di risposta '{0}' non esiste.
ja: 応答ファイル '{0}' が存在しません。
ko: 지시 파일 '{0}'이(가) 없습니다.
pl: Plik odpowiedzi „{0}” nie istnieje.
pt_br: O arquivo de resposta '{0}' não existe.
ru: Файл отклика "{0}" не существует.
tr: '{0}' yanıt dosyası mevcut değil.
zh_hans: 响应文件“{0}”不存在。
zh_hant: 回應檔 '{0}' 不存在。

# RetriableNugetSearchFailure
source: Failed to search. Retry later may resolve the issue. NuGet Search API response detail: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
cs: Hledání nebylo úspěšné. Později už možná k problému nedojde. Podrobnosti odpovědi rozhraní API hledání NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}
de: Fehler bei der Suche. Durch eine spätere Wiederholung kann das Problem möglicherweise behoben werden. Ausführliche Informationen zur Antwort der NuGet-Such-API: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
es: No se pudo buscar. Puede que el problema se resuelva si lo reintenta más tarde. Detalles de la respuesta de la API de búsqueda de NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
fr: Échec de la recherche. Si vous réessayez plus tard, cela pourra éventuellement permettre de résoudre le problème. Détails de la réponse de l'API de recherche NuGet : RequestUrl : {0}. ReasonPhrase : {1}. StatusCode : {2}.
it: Non è stato possibile cercare. Per risolvere il problema, riprovare più tardi. Dettagli della risposta dell'API di Ricerca NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
ja: 検索に失敗しました。後でもう一度試すと、問題が解決する可能性があります。NuGet Search API からの応答の詳細: RequestUrl: {0}。ReasonPhrase: {1}。StatusCode: {2}。
ko: 검색하지 못했습니다. 나중에 다시 시도하면 문제가 해결될 수도 있습니다. NuGet 검색 API 응답 정보: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
pl: Nie można wyszukać. Późniejsza ponowna próba może rozwiązać problem. Szczegóły odpowiedzi interfejsu API wyszukiwania NuGet: Adres URL żądania: {0}. Fraza przyczyny: {1}. Kod stanu: {2}.
pt_br: Falha na pesquisa. Uma nova tentativa mais tarde poderá resolver o problema. Detalhe da resposta da API de Pesquisa do NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
ru: Не удалось выполнить поиск. Повторите попытку позже. Сведения об ответе API для поиска NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
tr: Arama başarısız oldu. Daha sonra yeniden denemek sorunu çözebilir. NuGet Arama API'si yanıt ayrıntısı: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
zh_hans: 搜索失败。稍后重试可能会解决此问题。NuGet 搜索 API 响应详细信息: RequestUrl: {0}。ReasonPhrase: {1}。StatusCode: {2}。
zh_hant: 無法搜尋。稍後重試可能可以解決此問題。NuGet 搜尋 API 回應詳細資料: RequestUrl: {0}。ReasonPhrase: {1}。StatusCode: {2}。

# SDKDiagnosticsCommandDefinition
source: Enable diagnostic output.
cs: Povolí diagnostický výstup.
de: Diagnoseausgabe aktivieren.
es: Habilita la salida de diagnóstico.
fr: Activez la sortie des diagnostics.
it: Abilita l'output di diagnostica.
ja: 診断出力を有効にします。
ko: 진단 출력을 사용합니다.
pl: Włącz diagnostyczne dane wyjściowe.
pt_br: Habilitar saída de diagnóstico.
ru: Включение выходных данных диагностики.
tr: Tanılama çıkışını etkinleştirir.
zh_hans: 启用诊断输出。
zh_hant: 啟用診斷輸出。

# SDKSchemaCommandDefinition
source: Display the command schema as JSON.
cs: Zobrazí schéma příkazu jako JSON.
de: Das Befehlsschema als JSON anzeigen.
es: Muestre el esquema de comandos como JSON.
fr: Affichez le schéma de commande au format JSON.
it: Visualizza lo schema del comando in formato JSON.
ja: コマンド スキーマを JSON として表示します。
ko: 명령 스키마를 JSON으로 표시합니다.
pl: Wyświetl schemat polecenia jako kod JSON.
pt_br: Exibir o esquema do comando em JSON.
ru: Отобразить схему команды в формате JSON.
tr: Komut şemasını JSON formatında görüntüle.
zh_hans: 将命令架构显示为 JSON。
zh_hant: 以 JSON 格式顯示命令結構描述。

# SelfContainAndNoSelfContainedConflict
source: The '--self-contained' and '--no-self-contained' options cannot be used together.
cs: Možnosti --self-contained a --no-self-contained nelze použít společně.
de: Die Optionen „--self-contained“ und „--no-self-contained“ können nicht gemeinsam verwendet werden.
es: Las opciones '--self-contained' y '--no-self-contained' no se pueden usar juntas.
fr: Les options '--self-contained' et '--no-self-contained' ne peuvent pas être utilisées ensemble.
it: Non è possibile usare contemporaneamente le opzioni '--self-contained' e ‘--no-self-contained'.
ja: '--self-contained' と '--no-self-contained' オプションは同時に使用できません。
ko: '--self-contained' 및 '--no-self-contained' 옵션은 함께 사용할 수 없습니다.
pl: Opcji „--self-contained” i „--no-self-contained” nie można używać razem.
pt_br: As opções '--self-contained' e '--no-self-contained' não podem ser usadas juntas.
ru: Параметры "--self-contained" и "--no-self-contained" нельзя использовать вместе.
tr: '--self-contained' ve '--no-self-contained' seçenekleri birlikte kullanılamaz.
zh_hans: "--self-contained"和 "--no-self-contained" 选项不能一起使用。
zh_hant: 不能同時使用 '--self-contained' 和 '--no-self-contained' 選項。

# SelfContainedOptionDescription
source: Publish the .NET runtime with your application so the runtime doesn't need to be installed on the target machine. The default is 'false.' However, when targeting .NET 7 or lower, the default is 'true' if a runtime identifier is specified.
cs: Publikujte se svou aplikací modul runtime pro .NET, aby ho nebylo nutné instalovat na cílovém počítači. Výchozí hodnota je false. Pokud však cílíte na .NET 7 nebo nižší a je zadán identifikátor modulu runtime, výchozí hodnota je true.
de: Hiermit wird die .NET-Runtime mit Ihrer Anwendung veröffentlicht, sodass die Runtime nicht auf dem Zielcomputer installiert werden muss. Der Standardwert lautet FALSE. Wenn sie jedoch auf .NET 7 oder niedriger abzielen, lautet der Standardwert TRUE, wenn ein Laufzeitbezeichner angegeben wird.
es: Publique el entorno de ejecución de .NET con la aplicación para que no sea necesario instalarlo en el equipo de destino. El valor predeterminado es "false." Sin embargo, cuando el destino es .NET 7 o inferior, el valor predeterminado es "true" si se especifica un identificador en tiempo de ejecución.
fr: Publiez le runtime .NET avec votre application afin que le runtime n’ait pas besoin d’être installé sur l’ordinateur cible. La valeur par défaut est « false ». Toutefois, lorsque vous ciblez .NET 7 ou une version antérieure, la valeur par défaut est « true » si un identificateur d’exécution est spécifié.
it: Pubblicare il runtime .NET con l'applicazione in modo che non sia necessario installare il runtime nel computer di destinazione. Il valore predefinito è 'false'. Tuttavia, quando la destinazione è .NET 7 o una versione inferiore, il valore predefinito è 'true' se viene specificato un identificatore di runtime.
ja: アプリケーションと一緒に .NET ランタイムを発行して、ランタイムをターゲット マシンにインストールする必要がないようにします。 既定値は 'false' です。しかし、.NET 7 以前が対象の場合、ランタイム識別子が指定されていれば、既定値は 'true' です。
ko: 대상 컴퓨터에 런타임을 설치할 필요가 없도록 애플리케이션과 함께 .NET 런타임을 게시합니다. 기본값은 'false'입니다. 그러나 .NET 7 이하를 대상으로 하고 런타임 식별자를 지정하는 경우 기본값은 'true'입니다.
pl: Opublikuj środowisko uruchomieniowe platformy .NET z aplikacją, aby nie trzeba było instalować środowiska uruchomieniowego na maszynie docelowej. Wartość domyślna to „false”. Jednak w przypadku określania wartości docelowej platformy .NET 7 lub niższej wartość domyślna to „true”, jeśli określono identyfikator środowiska uruchomieniowego.
pt_br: Publique o tempo de execução do .NET junto com sua aplicação para que o tempo de execução não precise ser instalado na máquina de destino. O padrão é 'false.' No entanto, ao direcionar para .NET 7 ou inferior, o padrão é 'true' se um identificador de tempo de execução for especificado.
ru: Публикация среды выполнения .NET вместе с вашим приложением, чтобы ее не пришлось устанавливать на целевом компьютере. Значение по умолчанию — "false". Однако для .NET 7 или более ранней версии значение по умолчанию — "true", если указан идентификатор среды выполнения.
tr: Uygulamanızla birlikte .NET çalışma zamanını yayımladığınızda hedef makinede çalışma zamanının yüklü olması gerekmez. Varsayılan değer 'false.' Ancak çalışma zamanı tanımlayıcısı belirtildiyse .NET 7 veya altı projeler hedeflenirken varsayılan değer 'true' olur.
zh_hans: 将 .NET 运行时与应用程序一起发布，从而无需在目标计算机上安装运行时。 默认值为 ‘false’。但目标为 .NET 7 或更低版本时，如果指定了运行时标识符，则默认值为 ‘true’。
zh_hant: 將 .NET 執行階段隨著您的應用程式發佈，以便您不需在目標電腦上安裝執行階段。 預設值為 'false'。不過，當目標為 .NET 7 或更低版本時，如有指定執行階段識別碼，則預設值為 'true'。

# ShellShimConflict
source: Command '{0}' conflicts with an existing command from another tool.
cs: Příkaz {0} koliduje s existujícím příkazem jiného nástroje.
de: Der Befehl "{0}" steht in Konflikt zu einem vorhandenen Befehl aus einem anderen Tool.
es: El comando "{0}" está en conflicto con un comando existente de otra herramienta.
fr: La commande '{0}' est en conflit avec une commande existante d'un autre outil.
it: Il comando '{0}' è in conflitto con un comando esistente di un altro strumento.
ja: コマンド '{0}' は、別のツールからの既存のコマンドと競合します。
ko: '{0}' 명령이 다른 도구의 기존 명령과 충돌합니다.
pl: Wystąpił konflikt między poleceniem „{0}” i istniejącym poleceniem z innego narzędzia.
pt_br: O comando '{0}' conflita com um comando existente de outra ferramenta.
ru: Команда "{0}" конфликтует с существующей командой в другом инструменте.
tr: '{0}' komutu, başka bir araçtaki mevcut bir komutla çakışıyor.
zh_hans: 命令“{0}”与另一个工具中的现有命令相冲突。
zh_hant: 命令 '{0}' 與來自另一個工具的現有命令發生衝突。

# ShortWorkloadSearchVersionDescription
source: Search for available workload versions or what comprises a workload version. Use 'dotnet workload search version --help' for more information.
cs: Vyhledejte dostupné verze úlohy nebo zjistěte, z čeho se skládá verze úlohy. Další informace získáte pomocí „dotnet workload search version --help“.
de: Suchen Sie nach verfügbaren Workloadversionen oder was eine Workloadversion umfasst. Verwenden Sie "dotnet workload search version --help", um weitere Informationen zu erhalten.
es: Busque las versiones de carga de trabajo disponibles o lo que comprende una versión de carga de trabajo. Use "dotnet workload search version --help" para obtener más información.
fr: Recherchez les versions de charge de travail disponibles ou ce qui compose une version de charge de travail. Utilisez « dotnet workload search version --help » pour plus d’informations.
it: Cerca le versioni del carico di lavoro disponibili o cosa comprende una versione del carico di lavoro. Per altre informazioni, usare 'dotnet workload search version --help'.
ja: 使用可能なワークロードのバージョン、またはワークロード バージョンを構成するものを検索します。詳細については、'dotnet workload search version --help' を使用してください。
ko: 사용 가능한 워크로드 버전 또는 워크로드 버전을 구성하는 항목을 검색합니다. 자세한 내용을 보려면 'dotnet workload search version --help'를 사용하세요.
pl: Wyszukaj dostępne wersje obciążeń lub elementy składowe poszczególnych wersji obciążeń. Aby uzyskać więcej informacji, użyj polecenia „dotnet workload search version --help”.
pt_br: Pesquisar por versões disponíveis da carga de trabalho ou pelo que compõe uma versão da carga de trabalho. Use 'dotnet workload search version --help' para mais informações.
ru: Поиск доступных версий рабочей нагрузки или составных частей версии рабочей нагрузки. Используйте "dotnet workload search version --help" для получения дополнительных сведений.
tr: Mevcut iş yükü sürümlerini veya bir iş yükü sürümünü neyin oluşturduğunu arayın. Daha fazla bilgi için 'dotnet workload search version --help' komutunu kullanın.
zh_hans: 搜索可用工作负载版本或包含工作负载版本的版本。有关详细信息，请使用 'dotnet workload search version --help'。
zh_hant: 搜尋可用的工作負載版本或工作負載版本的組成部分。如需詳細資訊，請使用 'dotnet workload search version --help'。

# ShowHelpDescription
source: Show command line help.
cs: Zobrazí nápovědu příkazového řádku.
de: Hiermit wird die Hilfe zur Befehlszeile angezeigt.
es: Muestra ayuda de la línea de comandos.
fr: Affichez l'aide de la ligne de commande.
it: Visualizza la Guida della riga di comando.
ja: コマンド ラインのヘルプを表示します。
ko: 명령줄 도움말을 표시합니다.
pl: Pokaż pomoc wiersza polecenia.
pt_br: Mostrar a ajuda da linha de comando.
ru: Показать справку командной строки.
tr: Komut satırı yardımını gösterir.
zh_hans: 显示命令行帮助。
zh_hant: 顯示命令列說明。

# ShutdownCommandFailed
source: The shutdown command failed: {0}
cs: Příkaz pro vypnutí selhal: {0}
de: Fehler beim Befehl zum Herunterfahren: {0}
es: Error del comando de apagado: {0}
fr: Échec de la commande d'arrêt : {0}
it: Il comando di arresto non è riuscito: {0}
ja: シャットダウン コマンドが失敗しました: {0}
ko: 종료 명령에 실패했습니다. {0}
pl: Polecenie zamknięcia nie powiodło się: {0}
pt_br: O comando de desligamento falhou: {0}
ru: Команда завершения работы не выполнена: {0}
tr: Kapatma komutu başarısız oldu: {0}
zh_hans: shutdown 命令失败: {0}
zh_hant: 關機命令失敗: {0}

source: Solution
cs: Řešení
de: Projektmappe
es: Solución
it: Soluzione
ja: ソリューション
ko: 솔루션
pl: Rozwiązanie
pt_br: Solução
ru: Решение
tr: Çözüm
zh_hans: 解决方案
zh_hant: 解決方案

# SolutionAlreadyContainsProject
source: Solution {0} already contains project {1}.
cs: Řešení {0} už obsahuje projekt {1}.
de: Die Projektmappe "{0}" enthält das Projekt "{1}" bereits.
es: La solución {0} ya contiene el proyecto {1}.
fr: La solution {0} contient déjà le projet {1}.
it: La soluzione {0} contiene già il progetto {1}.
ja: ソリューション {0} には既にプロジェクト {1} が含まれています。
ko: {0} 솔루션에 {1} 프로젝트가 이미 있습니다.
pl: Rozwiązanie {0} zawiera już projekt {1}.
pt_br: A solução {0} já contém o projeto {1}.
ru: Решение {0} уже содержит проект {1}.
tr: {0} çözümü zaten {1} projesini içeriyor.
zh_hans: 解决方案 {0} 已包含项目 {1}。
zh_hant: 解決方案 {0} 已經包含專案 {1}。

# SolutionArgumentMisplaced
source: Solution argument '{0}' is misplaced.
cs: Argument řešení „{0}“ je chybně umístěný.
de: Das Projektmappenargument "{0}" wurde falsch eingefügt.
es: El argumento de solución '{0}' está mal colocado.
fr: L'argument de solution '{0}' est mal placé.
it: L'argomento della soluzione '{0}' non è posizionato in modo corretto.
ja: ソリューション引数 '{0}' の位置が正しくありません。
ko: '{0}' 솔루션 인수의 위치가 잘못되었습니다.
pl: Argument rozwiązania „{0}” jest zagubiony.
pt_br: O argumento da solução '{0}' está mal colocado.
ru: Аргумент решения "{0}" размещен неправильно.
tr: '{0}' çözüm bağımsız değişkeni yanlış yerleştirilmiş.
zh_hans: 解决方案参数“{0}”位置错误。
zh_hant: 解決方案引數 '{0}' 位置錯誤。

# SolutionDoesNotExist
source: Specified solution file {0} does not exist, or there is no solution file in the directory.
cs: Zadaný soubor řešení {0} neexistuje nebo v adresáři není soubor řešení.
de: Die angegebene Projektmappendatei "{0}" ist nicht vorhanden, oder das Verzeichnis enthält keine Projektmappendatei.
es: El archivo de solución {0} especificado no existe, o bien no hay ningún archivo de solución en el directorio.
fr: Le fichier solution spécifié {0} n'existe pas ou il n'y a pas de fichier solution dans le répertoire.
it: Il file di soluzione specificato {0} non esiste oppure nella directory non è presente alcun file di soluzione.
ja: 指定したソリューション ファイル {0} が存在しないか、ディレクトリにソリューション ファイルがありません。
ko: 지정한 솔루션 파일 {0}이(가) 없거나 디렉터리에 솔루션 파일이 없습니다.
pl: Określony plik rozwiązania {0} nie istnieje bądź w katalogu nie ma żadnego pliku rozwiązania.
pt_br: O arquivo de solução {0} especificado não existe ou não há um arquivo de solução no diretório.
ru: Указанный файл решения "{0}" не существует, или в каталоге нет файла решения.
tr: Belirtilen {0} çözüm dosyası yok veya dizinde bir çözüm dosyası yok.
zh_hans: 指定的解决方案文件 {0} 不存在，或目录中没有解决方案文件。
zh_hant: 指定的方案檔 {0} 不存在，或目錄中沒有方案檔。
