Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Add
cs: Přidat
de: Hinzufügen
es: Agregar
fr: ajouter
it: Aggiungi
ja: 追加
ko: 추가
pl: Dodaj
pt_br: adicionar
ru: добавить
tr: Ekle
zh_hans: 添加
zh_hant: 加入

# AmbiguousCommandName
source: Ambiguous command name: {0}
cs: Nejednoznačný název příkazu {0}
de: Nicht eindeutiger Befehlsname: {0}
es: Nombre de comando ambiguo: {0}
fr: Nom de commande ambigu : {0}
it: Nome di comando ambiguo: {0}
ja: あいまいなコマンド名: {0}
ko: 모호한 명령 이름: {0}
pl: Niejednoznaczna nazwa polecenia: {0}
pt_br: Nome de comando ambíguo: {0}
ru: Неоднозначное имя команды: {0}
tr: Belirsiz komut adı: {0}
zh_hans: 模糊命令名: {0}
zh_hant: 不明確的命令名稱: {0}

# ArchitectureOptionDescription
source: The target architecture.
cs: Cílová architektura
de: Die Zielarchitektur.
es: La arquitectura de destino.
fr: L’architecture cible
it: Architettura di destinazione.
ja: ターゲット アーキテクチャ。
ko: 대상 아키텍처입니다.
pl: Architektura docelowa.
pt_br: A arquitetura de destino.
ru: Целевая архитектура.
tr: Hedef mimari.
zh_hans: 目标体系结构。
zh_hant: 目標結構。

# ArtifactsPathOptionDescription
source: The artifacts path. All output from the project, including build, publish, and pack output, will go in subfolders under the specified path.
cs: Cesta k artefaktům. Veškerý výstup z projektu, včetně výstupu sestavení, publikování a balíčku, se přesune do podsložek v zadané cestě.
de: Der Artefaktpfad. Die gesamte Ausgabe des Projekts, einschließlich Build-, Veröffentlichungs- und Paketausgabe, wird in Unterordnern unter dem angegebenen Pfad angezeigt.
es: Ruta de acceso de los artefactos. Todas las salidas del proyecto, incluidas las salidas de compilación, publicación y empaquetado, se incluirán en subcarpetas en la ruta de acceso especificada.
fr: Le chemin des artefacts. Toutes les sorties du projet, y compris les sorties de build, de publication et de pack, iront dans des sous-dossiers sous le chemin spécifié.
it: Percorso degli artefatti. Tutto l'output del progetto, inclusi l'output di compilazione, pubblicazione e pacchetto, verrà inserito nelle sottocartelle nel percorso specificato.
ja: 成果物のパス。ビルド、発行、パック出力などのプロジェクトからの出力はすべて、指定されたパスの下のサブフォルダーに格納されます。
ko: 아티팩트 경로입니다. 빌드, 게시 및 팩 출력을 포함한 프로젝트의 모든 출력이 지정된 경로 아래의 하위 폴더로 이동합니다.
pl: Ścieżka artefaktów. Wszystkie dane wyjściowe z projektu, w tym dane wyjściowe kompilacji, publikowania i pakowania, będą trafiać do podfolderów w określonej ścieżce.
pt_br: O caminho dos artefatos. Toda a saída do projeto, incluindo compilação, publicação e saída do pacote, irá para subpastas no caminho especificado.
ru: Путь к артефактам. Все выходные данные проекта, включая выходные данные сборки, публикации и упаковки, будут направляться во вложенные папки по указанному пути.
tr: Yapıtlar yolu. Derleme, yayımlama ve paket çıkışı dahil olmak üzere projedeki tüm çıkışlar belirtilen yol altındaki alt klasörlerde bulunur.
zh_hans: 工件路径。项目中的所有输出(包括生成、发布和打包输出)都将放到指定路径下的子文件夹中。
zh_hant: 成品路徑。來自專案的所有輸出 (包括建置、發佈和封裝輸出)，都會進入指定路徑下的子資料夾。

# AttemptingToCreateCommandSpec
source: {0}: attempting to create commandspec
cs: {0}: Pokus o vytvoření specifikace příkazu commandspec
de: {0}: Es wird versucht, commandspec zu erstellen
es: {0}: intentando crear commandspec
fr: {0} : tentative de création de la spécification de commande
it: {0}: tentativo di creare commandSpec
ja: {0}: commandspec を作成しようとしています
ko: {0}: commandspec 만들기 시도 중
pl: {0}: Próba utworzenia elementu commandspec
pt_br: {0}: tentando criar commandspec
ru: {0}: попытка создать спецификацию команды
tr: {0}: commandspec oluşturulmaya çalışılıyor
zh_hans: {0}: 尝试创建 commandspec
zh_hant: {0}: 正在嘗試建立 commandspec

# AttemptingToFindCommand
source: {0}: attempting to find command {1} in {2}
cs: {0}: Pokus o nalezení příkazu {1} v {2}
de: {0}: Nach Befehl {1} wird in {2} gesucht
es: {0}: intentando encontrar el comando {1} en {2}
fr: {0} : tentative de recherche de la commande {1} dans {2}
it: {0}: tentativo di individuazione del comando {1} in {2}
ja: {0}: {2} でコマンド {1} を検索しています
ko: {0}: {2}에서 {1} 명령을 찾으려고 시도 중
pl: {0}: Próba odnalezienia polecenia {1} w lokalizacji {2}
pt_br: {0}: tentando encontrar o comando {1} em {2}
ru: {0}: попытка найти команду {1} в {2}
tr: {0}: {2} içinde {1} komutu bulunmaya çalışılıyor
zh_hans: {0}: 尝试在 {2} 中查找命令 {1}
zh_hant: {0}: 正在嘗試於 {2} 中尋找命令 {1}

# AttemptingToResolve
source: {0}: attempting to resolve {1}
cs: {0}: Pokus o vyřešení {1}
de: {0}: Es wird versucht, {1} aufzulösen
es: {0}: intentando resolver {1}
fr: {0} : tentative de résolution de {1}
it: {0}: tentativo di risolvere {1}
ja: {0}: {1} を解決しようとしています
ko: {0}: {1} 확인을 시도 중
pl: {0}: Próba rozpoznania elementu {1}
pt_br: {0}: tentando resolver {1}
ru: {0}: попытка разрешить {1}
tr: {0}: {1} öğesi çözümlenmeye çalışılıyor
zh_hans: {0}: 尝试解析 {1}
zh_hant: {0}: 正在嘗試解析 {1}

# AttemptingToResolveCommandSpec
source: {0}: Attempting to resolve command spec from tool {1}
cs: {0}: Pokus o vyřešení specifikace příkazu nástroje {1}
de: {0}: Es wird versucht, commandspec aus Tool {1} aufzulösen.
es: {0}: intentando resolver especificaciones de comando desde la herramienta {1}
fr: {0} : tentative de résolution de la spécification de commande à partir de l'outil {1}
it: {0}: tentativo di risolvere commandSpec dallo strumento {1}
ja: {0}: ツール {1} から commandspec を解決しようとしています
ko: {0}: {1} 도구에서 command spec을 확인하려고 시도하는 중입니다.
pl: {0}: Próba rozpoznania specyfikacji polecenia z narzędzia {1}
pt_br: {0}: tentando resolver commandspec por meio da ferramenta {1}
ru: {0}: попытка разрешить спецификацию команды из средства {1}
tr: {0}: {1} aracından commandspec çözümlenmeye çalışılıyor
zh_hans: {0}: 正在尝试从工具 {1} 解析命令 spec
zh_hant: {0}: 正在嘗試從工具 {1} 解析 command spec

# BuildOutputPathDoesNotExist
source: outputpathresolver: {0} does not exist
cs: outputpathresolver: {0} neexistuje
de: outputpathresolver: {0} nicht vorhanden
es: outputpathresolver: {0} no existe
fr: outputpathresolver : {0} n'existe pas
it: outputpathresolver: {0} non esiste
ja: outputpathresolver: {0} は存在しません
ko: outputpathresolver: {0}이(가) 없습니다.
pl: Element outputpathresolver: {0} nie istnieje
pt_br: outputpathresolver: {0} não existe
ru: outputpathresolver: {0} не существует.
tr: outputpathresolver: {0} yok
zh_hans: outputpathresolver: {0} 不存在
zh_hant: outputpathresolver: {0} 不存在

# CannotCreateShimForEmptyExecutablePath
source: Cannot create shell shim for an empty executable path.
cs: Pro prázdnou cestu ke spustitelnému souboru nelze vytvořit překrytí prostředí.
de: Für einen leeren Pfad einer ausführbaren Datei kann kein Shell-Shim erstellt werden.
es: No se pueden crear las correcciones de compatibilidad (shim) de shell para una ruta ejecutable vacía.
fr: Impossible de créer un shim d'environnement pour un chemin d'exécutable vide.
it: Non è possibile creare lo shim della shell per un percorso di eseguibile vuoto.
ja: 空の実行可能パスにシェル shim を作成できませんでした。
ko: 빈 실행 파일 경로에 대해 셸 shim을 만들 수 없습니다.
pl: Nie można utworzyć podkładki powłoki dla pustej ścieżki pliku wykonywalnego.
pt_br: Não é possível criar o shim do shell para um caminho executável vazio.
ru: Невозможно создать оболочку совместимости для пустого пути к исполняемому файлу.
tr: Boş bir yürütülebilir yol için kabuk dolgusu oluşturulamaz.
zh_hans: 无法为空的可执行文件路径创建 shell 填充程序。
zh_hant: 無法為空白的可執行檔路徑建立殼層填充碼。

# CannotFindAManifestFile
source: Cannot find a manifest file. The list of searched paths: {0}
cs: Nejde najít soubor manifestu. Seznam prohledaných cest: {0}
de: Eine Manifestdatei wurde nicht gefunden. Die Liste der durchsuchten Pfade: {0}
es: No se encuentra un archivo de manifiesto. Lista de rutas de acceso buscadas: {0}
fr: Impossible de trouver un fichier manifeste. Liste des chemins de recherche : {0}
it: Non è possibile trovare un file manifesto. Elenco dei percorsi di ricerca: {0}
ja: マニフェスト ファイルが見つかりません。検索されたパスの一覧: {0}
ko: 매니페스트 파일을 찾을 수 없습니다. 검색된 경로 목록: {0}
pl: Nie można odnaleźć pliku manifestu. Lista przeszukanych ścieżek: {0}
pt_br: Não é possível localizar um arquivo de manifesto. A lista de caminhos pesquisados: {0}
ru: Не удается найти файл манифеста. Список путей поиска: {0}
tr: Bildirim dosyası bulunamadı. Aranan yolların listesi: {0}
zh_hans: 找不到清单文件。已搜索路径的列表: {0}
zh_hant: 找不到資訊清單檔。搜尋路徑清單: {0}

# CannotFindPackageIdInManifest
source: Cannot find a package with the package id {0} in the manifest file.
cs: V souboru manifestu se nepovedlo najít balíček s ID {0}.
de: In der Manifestdatei wurde kein Paket mit der Paket-ID {0} gefunden.
es: No se encuentra un paquete con el id. de paquete {0} en el archivo de manifiesto.
fr: Le package ayant l'ID de package {0} est introuvable dans le fichier manifeste.
it: Nel file manifesto non è possibile trovare un pacchetto con ID {0}.
ja: マニフェスト ファイル内でパッケージ ID {0} を持つパッケージが見つかりません。
ko: 매니페스트 파일에서 패키지 ID가 {0}인 패키지를 찾을 수 없습니다.
pl: Nie można odnaleźć pakietu o identyfikatorze {0} w pliku manifestu.
pt_br: Não é possível localizar um pacote com a ID {0} no arquivo de manifesto.
ru: Не удается найти пакет с ИД {0} в файле манифеста.
tr: Bildirim dosyasında paket kimliği {0} olan ile bir paket bulunamıyor.
zh_hans: 在清单文件中找不到包 ID 为 {0} 的包。
zh_hant: 在資訊清單檔中找不到套件識別碼為 {0} 的套件。

# CannotResolveRuntimeIdentifier
source: Resolving the current runtime identifier failed.
cs: Nepovedlo se vyřešit aktuální identifikátor modulu runtime.
de: Fehler beim Auflösen des aktuellen Runtimebezeichners.
es: No se ha podido resolver el identificador en el tiempo de ejecución actual.
fr: Échec de la résolution de l’identificateur d’exécution actuel
it: La risoluzione dell'identificatore di runtime corrente non è riuscita.
ja: 現在のランタイム識別子を解決できませんでした。
ko: 현재 런타임 식별자를 확인하지 못했습니다.
pl: Rozpoznawanie bieżącego identyfikatora środowiska uruchomieniowego nie powiodło się.
pt_br: Falha ao resolver o identificador de tempo de execução atual.
ru: Не удалось разрешить текущий идентификатор среды выполнения.
tr: Geçerli çalışma zamanı tanımlayıcısı çözümlenemedi.
zh_hans: 解决当前运行时标识符失败。
zh_hant: 解析目前執行階段識別碼失敗。

# CannotSpecifyBothRuntimeAndArchOptions
source: Specifying both the `-r|--runtime` and `-a|--arch` options is not supported.
cs: Zadání možností -r|--runtime a -a|--arch zároveň se nepodporuje.
de: Das gleichzeitige Angeben der Optionen „-r|--runtime“ und „-a|--arch“ wird nicht unterstützt.
es: No se admite la especificación de las opciones '-r|--runtime' y '-a|--arch'.
fr: La spécification des options « -r |--Runtime » et « -a |--Arch » n’est pas prise en charge.
it: La specifica di entrambe le opzioni `-r|--runtime` and `-a|--arch` non è supportata.
ja: `-r|--runtime` および `-a|--arch` オプションの両方を指定することはサポートされていません。
ko: `-r|--runtime` 및 `-a|--arch` 옵션을 모두 지정하는 것은 지원되지 않습니다.
pl: Określanie opcji „-r|--runtime” i „-a|--arch” nie jest obsługiwane.
pt_br: Não há suporte para especificar as opções '-r |--runtime ' e '-a |--arch '.
ru: Указание параметров "-r|--runtime" и "-a|--arch" не поддерживается.
tr: Hem `-r|--runtime` hem de `-a|--arch` seçeneğinin belirtilmesi desteklenmiyor.
zh_hans: 不支持同时指定“-r |--runtime”和“-a |-arch”选项。
zh_hant: 不支援同時指定 `-r|--runtime` 與 `-a|--arch` 選項。

# CannotSpecifyBothRuntimeAndOsOptions
source: Specifying both the `-r|--runtime` and `-os` options is not supported.
cs: Zadání možností -r|--runtime a -os zároveň se nepodporuje.
de: Das gleichzeitige Angeben der Optionen „-r|--runtime“ und „-os“ wird nicht unterstützt.
es: No se admite la especificación de las opciones '-r|--runtime' y '-os'.
fr: La spécification des options « -r |--Runtime » et « os » n’est pas prise en charge.
it: La specifica di entrambe le opzioni `-r|--runtime` e `-os` non è supportata.
ja: `-r|--runtime` および `-os` オプションの両方を指定することはサポートされていません。
ko: `-r|--runtime` 및 `-os` 옵션을 모두 지정하는 것은 지원되지 않습니다.
pl: Określanie opcji „-r|--runtime” i „-os” nie jest obsługiwane.
pt_br: Não há suporte para especificar as opções '-r |--runtime ' e '-a |--os '.
ru: Указание параметров "-r|--runtime" и "-os" не поддерживается.
tr: Hem `-r|--runtime` hem de `-os` seçeneğinin belirtilmesi desteklenmiyor.
zh_hans: 不支持同时指定“-r |--runtime”和“-os”选项。
zh_hant: 不支援同時指定 `-r|--runtime` 與 `-os` 選項。

# CmdEnvironmentVariableDescription
source: Sets the value of an environment variable. Creates the variable if it does not exist, overrides if it does. This argument can be specified multiple times to provide multiple variables. Examples: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
de: Legt den Wert einer Umgebungsvariablen fest. Erstellt die Variable, wenn Sie nicht vorhanden ist, und setzt sie andernfalls außer Kraft. Dieses Argument kann mehrmals angegeben werden, um mehrere Variablen bereitzustellen. Beispiele: -e VARIABLE=abc -e VARIABLE="wert mit leerzeichen" -e VARIABLE="wert;getrennt durch;semikolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
fr: Définit la valeur d'une variable d'environnement. Crée la variable si elle n'existe pas, et la remplace si elle existe. Cela entraîne l'exécution forcée des tests dans un processus isolé. Vous pouvez spécifier cet argument plusieurs fois pour fournir plusieurs variables. Examples: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
it: Imposta il valore di una variabile di ambiente. Crea la variabile se non esiste e la sostituisce se esiste. In questo modo forza l'esecuzione dei test in un processo isolato. È possibile specificare più volte questo argomento per fornire più variabili. Esempi: -e VARIABLE=abc -e VARIABLE="valore con spazi" -e VARIABLE="valore;delimitato da;punti e virgola" -e VAR1=abc -e VAR2=def -e VAR3=ghi
ja: 環境変数の値を設定します。 変数が存在しない場合は作成され、存在する場合はオーバーライドされます。 この引数は、複数の変数を指定するために複数回指定できます。 例: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
pl: Ustawia wartość zmiennej środowiskowej. Jeśli zmienna nie istnieje, tworzy ją, a jeśli istnieje, przesłania. Ten argument można określić wiele razy w celu podania wielu wartości. Przykłady: -e ZMIENNA=abc -e ZMIENNA=”wartość ze spacjami” -e ZMIENNA=”wartości;rozdzielone;średnikami” -e ZM1=abc -e ZM2=def -e ZM3=ghi
tr: Bir ortam değişkeninin değerini ayarlar. Değişken yoksa oluşturur, varsa değişkeni geçersiz kılar. Bu, testleri yalıtılmış bir işlemde çalıştırılmaya zorlar. Bu bağımsız değişken, birden çok değişken sağlamak için birden çok kez belirtilebilir. Examples: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
zh_hans: 设置环境变量的值。 如果该变量不存在，则创建它；如果它已存在，则替代它。 这将在隔离的进程中强制运行测试。 可多次指定此参数来提供多个变量。 示例: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi

# CmdEnvironmentVariableExpression
source: NAME="VALUE"
cs: NÁZEV="HODNOTA"
de: NAME="WERT"
it: NAME="VALORE"
pl: NAZWA="WARTOŚĆ"
tr: AD="DEĞER"

# CmdTestEnvironmentVariableDescription
source: Sets the value of an environment variable. Creates the variable if it does not exist, overrides if it does. This will force the tests to be run in an isolated process. This argument can be specified multiple times to provide multiple variables. Examples: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
de: Legt den Wert einer Umgebungsvariablen fest. Erstellt die Variable, wenn Sie nicht vorhanden ist, und setzt sie andernfalls außer Kraft. Dadurch wird die Ausführung der Tests in einem isolierten Prozess erzwungen. Dieses Argument kann mehrmals angegeben werden, um mehrere Variablen bereitzustellen. Beispiele: -e VARIABLE=abc -e VARIABLE="wert mit leerzeichen" -e VARIABLE="wert;getrennt durch;semikolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
ja: 環境変数の値を設定します。 変数が存在しない場合は作成され、存在する場合はオーバーライドされます。 これにより、テストは強制的に分離プロセスで実行されます。 この引数は、複数の変数を指定するために複数回指定できます。 例: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
pl: Ustawia wartość zmiennej środowiskowej. Jeśli zmienna nie istnieje, tworzy ją, a jeśli istnieje, przesłania. Wymusi to uruchamianie testów w izolowanym procesie. Ten argument można określić wiele razy w celu podania wielu wartości. Przykłady: -e ZMIENNA=abc -e ZMIENNA="wartość ze spacjami" -e ZMIENNA="wartości;rozdzielone;średnikami" -e ZM1=abc -e ZM2=def -e ZM3=ghi

# CmdVersionSuffixDescription
source: Set the value of the $(VersionSuffix) property to use when building the project.
cs: Nastavuje hodnotu vlastnosti $(VersionSuffix), která se má použít při sestavování projektu.
de: Hiermit wird der Wert der $(VersionSuffix)-Eigenschaft festgelegt, die beim Erstellen des Projekts verwendet werden soll.
es: Establece el valor de la propiedad $(VersionSuffix) que se usará al compilar el proyecto.
fr: Définissez la valeur de la propriété $(VersionSuffix) à utiliser durant la génération du projet.
it: Consente di impostare il valore della proprietà $(VersionSuffix) da usare durante la compilazione del progetto.
ja: プロジェクトをビルドするときに使用する $(VersionSuffix) プロパティの値を設定します。
ko: 프로젝트를 빌드할 때 사용할 $(VersionSuffix) 속성의 값을 설정합니다.
pl: Ustaw wartość właściwości $(VersionSuffix) do użycia podczas kompilowania projektu.
pt_br: Definir o valor da propriedade $(VersionSuffix) a ser usado ao compilar o projeto.
ru: Установка значения свойства $(VersionSuffix), используемого для сборки проекта.
tr: Projeyi derlerken kullanılacak $(VersionSuffix) özelliğinin değerini ayarlar.
zh_hans: 设置生成项目时使用的 $(VersionSuffix) 属性的值。
zh_hant: 設定建置專案時，要使用之 $(VersionSuffix) 屬性的值。

# ColumnMaxWidthMustBeGreaterThanZero
source: Column maximum width must be greater than zero.
cs: Maximální šířka sloupce musí být větší než nula.
de: Die maximale Spaltenbreite muss größer als 0 sein.
es: El ancho máximo de la columna debe ser superior a cero.
fr: La largeur maximale de colonne doit être supérieure à zéro.
it: La larghezza massima della colonna deve essere maggiore di zero.
ja: 列の最大幅はゼロより大きくなければなりません。
ko: 열 최대 너비는 0보다 커야 합니다.
pl: Maksymalna szerokość kolumny musi być większa niż zero.
pt_br: A largura máxima da coluna deve ser maior que zero.
ru: Максимальная ширина столбца должна быть больше нуля.
tr: Maksimum sütun genişliği sıfırdan büyük olmalıdır.
zh_hans: 列的最大宽度必须大于零。
zh_hant: 資料行寬度上限必須大於零。

# CommandAssembliesNotFound
source: The command executable for "{0}" was not found. The project may not have been restored or restore failed - run `dotnet restore`
cs: Spustitelný soubor příkazu {0} se nenašel. Projekt se nepodařilo obnovit nebo jeho obnovení nebylo úspěšné. Spusťte příkaz dotnet restore.
de: Der für "{0}" auszuführende Befehl wurde nicht gefunden. Das Projekt wurde möglicherweise nicht wiederhergestellt, oder bei der Wiederherstellung ist ein Fehler aufgetreten. Führen Sie "dotnet restore" aus.
es: No se encontró el comando ejecutable para "{0}". Puede que el proyecto no se haya restaurado o que la restauración no haya tenido éxito. Ejecute "dotnet restore"
fr: La commande exécutable pour "{0}" est introuvable. Le projet n'a peut-être pas été restauré, ou la restauration n'a pas fonctionné - exécutez 'dotnet restore'
it: L'eseguibile del comando per "{0}" non è stato trovato. È possibile che il progetto non sia stato ripristinato o che il ripristino non sia riuscito. Eseguire `dotnet restore`
ja: "{0}" で実行可能なコマンドが見つかりませんでした。プロジェクトが復元されていない可能性があるか、または復元に失敗しました。`dotnet restore` を実行します。
ko: "{0}"에 대해 실행 가능한 명령을 찾지 못했습니다. 프로젝트가 복원되지 않았거나 복원이 실패했을 수 있습니다. 'dotnet restore'를 실행하세요.
pl: Nie znaleziono pliku wykonywalnego polecenia dla elementu „{0}”. Projekt mógł nie zostać przywrócony lub przywracanie zakończyło się niepowodzeniem — uruchom polecenie „dotnet restore”
pt_br: O comando executável para "{0}" não foi encontrado. O projeto pode não ter sido restaurado ou a restauração falhou – execute `dotnet restore`
ru: Исполняемый файл команды для "{0}" не найден. Возможно, проект не был восстановлен или его восстановление завершилось сбоем. Запустите команду "dotnet restore".
tr: "{0}" için komut yürütülebilir dosyası bulunamadı. Proje geri yüklenmemiş veya geri yükleme başarısız olmuş olabilir - `dotnet restore` çalıştırın
zh_hans: 找不到可为“{0}”执行的命令。可能未还原项目或还原失败 - 运行 `dotnet restore`
zh_hant: 找不到 "{0}" 的命令可執行檔。該專案可能尚未還原或還原失敗 - 請執行 `dotnet restore`

# CommandInteractiveOptionDescription
source: Allows the command to stop and wait for user input or action (for example to complete authentication).
cs: Umožňuje, aby se příkaz zastavil a počkal na vstup nebo akci uživatele (například na dokončení ověření).
de: Hiermit wird zugelassen, dass der Befehl anhält und auf eine Benutzereingabe oder Aktion wartet (beispielsweise auf den Abschluss der Authentifizierung).
es: Permite que el comando se detenga y espere la entrada o acción del usuario (por ejemplo, para autenticarse).
fr: Permet à la commande de s'arrêter et d'attendre une entrée ou une action de l'utilisateur (par exemple pour effectuer une authentification).
it: Consente al comando di arrestare l'esecuzione e attendere l'input o l'azione dell'utente, ad esempio per completare l'autenticazione.
ja: コマンドを停止して、ユーザーの入力またはアクション (認証の完了など) を待機できるようにします。
ko: 명령을 중지하고 사용자 입력 또는 작업을 기다리도록 허용합니다(예: 인증 완료).
pl: Zezwala poleceniu na zatrzymanie działania i zaczekanie na wprowadzenie danych lub wykonanie akcji przez użytkownika (na przykład ukończenie uwierzytelniania).
pt_br: Permite que o comando seja interrompido e aguarde a ação ou entrada do usuário (por exemplo, para concluir a autenticação).
ru: Позволяет остановить команду и ожидать ввода или действия пользователя (например, для проверки подлинности).
tr: Komutun durup kullanıcı girişini veya eylemini (örneğin, kimlik doğrulamasının tamamlanmasını) beklemesine izin verir .
zh_hans: 允许命令停止和等待用户输入或操作(例如，用以完成身份验证)。
zh_hant: 允許命令停止並等候使用者輸入或動作 (例如: 完成驗證)。

# CommandPrereleaseOptionDescription
source: Allows prerelease packages to be installed.
cs: Umožňuje instalaci předběžných verzí balíčků.
de: Ermöglicht die Installation von Paketen mit Vorabversionen.
es: Permite que se instalen paquetes de versión preliminar.
fr: Permet d'installer les packages de préversion.
it: Consente l'installazione di pacchetti non definitivi.
ja: プレリリース パッケージのインストールを許可します。
ko: 시험판 패키지를 설치할 수 있습니다.
pl: Zezwala na instalowanie pakietów wersji wstępnych.
pt_br: Permite a instalação de pacotes de pré-lançamento.
ru: Разрешает установку пакетов предварительного выпуска.
tr: Ön sürüm paketlerinin yüklenmesini sağlar.
zh_hans: 允许安装预发行包。
zh_hant: 允許安裝發行前版本套件。

# CommandSpecIsNull
source: {0}: commandSpec is null.
cs: {0}: Specifikace příkazu commandSpec je null.
de: {0}: commandspec ist NULL.
es: {0}: commandSpec es nulo.
fr: {0} : commandSpec a une valeur null.
it: {0}: commandSpec è Null.
ja: {0}: commandSpec が null です。
ko: {0}: commandSpec이 null입니다.
pl: {0}: Element commandSpec ma wartość null.
pt_br: {0}: commandSpec é nulo.
ru: {0}: commandSpec имеет значение NULL.
tr: {0}: commandSpec null.
zh_hans: {0}: commandSpec 为 null。
zh_hant: {0}: commandSpec 為 null。

# CommonFileNotFound
source: File `{0}` not found.
cs: Soubor {0} se nenašel.
de: Die Datei "{0}" wurde nicht gefunden.
es: No se encuentra el archivo "{0}".
fr: Fichier '{0}' introuvable.
it: Il file `{0}` non è stato trovato.
ja: ファイル `{0}` が見つかりません。
ko: '{0}' 파일을 찾을 수 없습니다.
pl: Nie odnaleziono pliku „{0}”.
pt_br: Arquivo ‘{0}’ não encontrado.
ru: Файл "{0}" не найден.
tr: `{0}` dosyası bulunamadı.
zh_hans: 未找到文件“{0}”。
zh_hant: 找不到檔案 `{0}`。
