Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidRuntimeIdentifier
source: The runtime identifier {0} is invalid. Valid runtime identifiers are: {1}.
cs: Identifikátor modulu runtime {0} je neplatný. Platné identifikátory modulu runtime jsou: {1}.
de: Der Runtimebezeichner {0} ist ungültig. Gültige Runtimebezeichner sind: {1}.
es: El identificador en tiempo de ejecución {0} no es válido. Los identificadores en tiempo de ejecución válidos son: {1}.
fr: L’identificateur d’exécution {0} n’est pas valide. Les identificateurs d’exécution valides sont : {1}.
it: L'identificatore di runtime {0} non è valido. Gli identificatori di runtime validi sono: {1}.
ja: ランタイム識別子 {0} は無効です。有効なランタイム識別子は {1} です。
ko: 런타임 식별자 {0}이(가) 잘못되었습니다. 유효한 런타임 식별자는 {1}입니다.
pl: Identyfikator środowiska uruchomieniowego {0} jest nieprawidłowy. Prawidłowe identyfikatory środowiska uruchomieniowego: {1}.
pt_br: O identificador de tempo de execução {0} é inválido. Os identificadores de tempo de execução válidos são: {1}.
ru: Недопустимый идентификатор среды выполнения {0}. Допустимые идентификаторы среды выполнения: {1}.
tr: {0} çalışma zamanı tanımlayıcısı geçersiz. Geçerli çalışma zamanı tanımlayıcıları: {1}.
zh_hans: 运行时标识符 {0} 无效。有效的运行时标识符为: {1}。
zh_hant: 執行階段識別碼 {0} 無效。有效的執行階段識別碼為: {1}。

# InvalidSolutionFormatString
source: Invalid solution `{0}`. {1}.
cs: Neplatné řešení {0}. {1}.
de: Ungültige Projektmappe "{0}". {1}
es: La solución "{0}" no es válida. {1}
fr: Solution non valide '{0}'. {1}.
it: La soluzione `{0}` non è valida. {1}.
ja: 無効なソリューション `{0}`。{1}。
ko: '{0}' 솔루션이 잘못되었습니다. {1}.
pl: Nieprawidłowe rozwiązanie „{0}”. {1}.
pt_br: Solução inválida `{0}`. {1}.
ru: Недопустимое решение "{0}". {1}.
tr: `{0}` çözümü geçersiz. {1}.
zh_hans: 解决方案“{0}”无效。{1}。
zh_hant: 解決方案 `{0}` 無效。{1}。

# InvalidVersion
source: Invalid version string: {0}
cs: Neplatný řetězec verze: {0}
de: Ungültige Versionszeichenfolge: {0}
es: Cadena de versión no válida: {0}
fr: Chaîne de version non valide : {0}
it: Stringa di versione non valida: {0}
ja: バージョン文字列が無効です: {0}
ko: 잘못된 버전 문자열: {0}
pl: Nieprawidłowy ciąg wersji: {0}
pt_br: Cadeia de caracteres de versão inválida: {0}
ru: Недопустимая строка версии: {0}
tr: Geçersiz sürüm dizesi: {0}
zh_hans: 版本字符串 {0} 无效
zh_hant: 版本字串無效: {0}

# IsNotFoundInNuGetFeeds
source: {0} is not found in NuGet feeds {1}.
cs: Balíček {0} se nenašel v informačních kanálech NuGet {1}.
de: "{0}" wurde in NuGet-Feeds "{1}" nicht gefunden.
es: No se encuentra {0} en las fuentes de NuGet {1}.
fr: {0} est introuvable dans les flux NuGet {1}.
it: {0} non è stato trovato nei feed NuGet {1}.
ja: {0} が NuGet フィードに見つかりません{1}。
ko: {0}을(를) NuGet 피드 {1}에서 찾을 수 없습니다.
pl: Nie znaleziono pakietu {0} w kanałach informacyjnych pakietu NuGet {1}.
pt_br: {0} não é encontrado no NuGet feeds {1}.
ru: {0} не найдено в веб-каналах NuGet {1}.
tr: {0}, {1} NuGet akışlarında bulunamadı.
zh_hans: 在 NuGet 源 {1} 中找不到 {0}。
zh_hant: 在 NuGet 摘要 {1} 中找不到 {0}。

# JsonParsingError
source: Json parsing error in file {0} : {1}
cs: Chyba parsování JSON v souboru {0}: {1}
de: JSON-Analysefehler in der Datei "{0}": {1}
es: Error de análisis JSON en el archivo {0} : {1}
fr: Erreur d'analyse Json dans le fichier {0} : {1}
it: Errore di analisi JSON nel file {0}: {1}
ja: ファイル {0} で Json の解析エラーが発生しました。{1}
ko: {0} 파일에서 Json 구문 분석 오류 발생: {1}
pl: Błąd analizowania kodu JSON w pliku {0}: {1}
pt_br: Erro no arquivo de análise JSON {0} : {1}
ru: Ошибка анализа JSON в файле {0} : {1}
tr: {0} dosyasında Json ayrıştırma hatası : {1}
zh_hans: 文件 {0} 中存在 Json 分析错误: {1}
zh_hant: 檔案 {0} 中發生 JSON 剖析錯誤: {1}

source: Library
cs: Knihovna
de: Bibliothek
es: Biblioteca
fr: Bibliothèque
it: Libreria
ja: ライブラリ
ko: 라이브러리
pl: Biblioteka
pt_br: Biblioteca
ru: Библиотека
tr: Kitaplık
zh_hans: 库
zh_hant: 程式庫

# LibraryNotFoundInLockFile
source: {0}: library not found in lock file.
cs: {0}: Knihovna nebyla v souboru lock nalezena.
de: {0}: Bibliothek nicht in Sperrdatei gefunden.
es: {0}: no se encontró la biblioteca en el archivo de bloqueo.
fr: {0} : bibliothèque introuvable dans le fichier de verrouillage.
it: {0}: la libreria non è stata trovata nel file di blocco.
ja: {0}: ロック ファイルにライブラリが見つかりませんでした。
ko: {0}: 잠금 파일에서 라이브러리를 찾지 못했습니다.
pl: {0}: Nie odnaleziono biblioteki w pliku blokady.
pt_br: {0}: biblioteca não encontrada no arquivo de bloqueio.
ru: {0}: не найдена библиотека в файле блокировки.
tr: {0}: kitaplık, kilit dosyasında bulunamadı.
zh_hans: {0}: 在锁定文件中未找到库。
zh_hant: {0}: 鎖定檔案中找不到程式庫。

source: List
cs: Seznam
de: Liste
es: Enumerar
fr: Répertorier
it: Elenco
ja: 一覧
ko: 목록
pl: Wyświetl listę
pt_br: Listar
ru: Список
tr: Liste
zh_hans: 列表
zh_hant: 列出

# LookingForPreferCliRuntimeFile
source: {0}: Looking for prefercliruntime file at `{1}`
cs: {0}: Hledání souboru prefercliruntime v {1}
de: {0}: Suche nach prefercliruntime-Datei unter {1}
es: {0}: buscando el archivo prefercliruntime en "{1}"
fr: {0} : recherche du fichier prefercliruntime sur '{1}'
it: {0}: ricerca del file prefercliruntime in `{1}`
ja: {0}:`{1}` で prefercliruntime ファイルを検索しています
ko: {0}: '{1}'에서 prefercliruntime 파일을 찾는 중
pl: {0}: Wyszukiwanie pliku prefercliruntime w lokalizacji „{1}”
pt_br: {0}: procurando o arquivo prefercliruntime em '{1}'
ru: {0}: поиск файла prefercliruntime в "{1}"
tr: {0}: `{1}` konumunda prefercliruntime dosyası aranıyor
zh_hans: {0}: 在“{1}”查找 prefercliruntime 文件
zh_hant: {0}: 正在於 `{1}` 尋找 prefercliruntime 檔

# MSBuildAdditionalOptionTitle
source: .NET Cli Options:
cs: Možnosti rozhraní příkazového řádku .NET:
de: .NET-Cli-Optionen:
es: Opciones de la CLI de .NET:
fr: Options Cli .NET :
it: Opzioni dell'interfaccia della riga di comando di .NET:
ja: .NET CLI オプション:
ko: .NET Cli 옵션:
pl: Opcje interfejsu wiersza polecenia platformy .NET:
pt_br: Opções da CLI do .NET:
ru: Параметры CLI .NET:
tr: .NET Cli Seçenekleri:
zh_hans: .NET Cli 选项:
zh_hant: .NET CLI 選項:

# MSBuildArgs
source: MSBuild arguments: {0}
cs: Argumenty MSBuild: {0}
de: MSBuild-Argumente: {0}
es: Argumentos de MSBuild: {0}
fr: Arguments MSBuild : {0}
it: Argomenti di MSBuild: {0}
ja: MSBuild 引数: {0}
ko: MSBuild 인수: {0}
pl: Argumenty programu MSBuild: {0}
pt_br: Argumentos do MSBuild: {0}
ru: Аргументы MSBuild: {0}
tr: MSBuild bağımsız değişkenleri: {0}
zh_hans: MSBuild 参数: {0}
zh_hant: MSBuild 引數: {0}

# MSBuildExePath
source: {0}: MSBUILD_EXE_PATH = {1}
fr: {0} : CHEMIN_MSBUILD_EXE = {1}
it: {0}: PERCORSO_EXE_MSBUILD = {1}
pl: {0}: Ścieżka MSBUILD_EXE_PATH = {1}

# MSBuildProjectPath
source: {0}: MSBuild project path = {1}
cs: {0}: Cesta k projektu MSBuildu = {1}
de: {0}: MSBuild-Projektpfad = {1}
es: {0}: ruta del proyecto MSBuild = {1}
fr: {0} : chemin de projet MSBuild = {1}
it: {0}: percorso del progetto MSBuild = {1}
ko: {0}: MSBuild 프로젝트 경로 = {1}
pl: {0}: Ścieżka projektu programu MSBuild = {1}
pt_br: {0}: caminho de projeto do MSBuild = {1}
ru: {0}: путь проекта MSBuild — {1}
tr: {0}: MSBuild proje yolu = {1}
zh_hans: {0}: MSBuild 项目路径 = {1}
zh_hant: {0}: MSBuild 專案路徑 = {1}

source: MSBuild server
cs: Server MSBuild
es: Servidor de MSBuild
fr: Serveur MSBuild
it: Server di MSBuild
ja: MSBuild サーバー
ko: MSBuild 서버
pl: Serwer MSBuild
pt_br: Servidor MSBuild
ru: Сервер MSBuild
tr: MSBuild sunucusu
zh_hans: MSBuild 服务器
zh_hant: MSBuild 伺服器

# ManifestHasMarkOfTheWeb
source: File {0} came from another computer and might be blocked to help protect this computer. For more information, including how to unblock, see https://aka.ms/motw
cs: Soubor {0} pochází z jiného počítače a je možné, že se zablokoval, aby se ochránil tento počítač. Další informace včetně toho, jak soubor odblokovat, najdete na adrese https://aka.ms/motw.
de: Die Datei "{0}" stammt von einem anderen Computer und wurde möglicherweise zum Schutz dieses Computers blockiert. Weitere Informationen zum Aufheben der Sperre und zu anderen Aktionen finden Sie unter https://aka.ms/motw.
es: El archivo {0} procedía de otro equipo y podría bloquearse para ayudar a proteger este equipo. Para obtener más información, y cómo desbloquearlo, consulte https://aka.ms/motw
fr: Le fichier {0} provient d'un autre ordinateur et a éventuellement été bloqué pour protéger cet ordinateur. Pour plus d'informations, notamment sur le déblocage, consultez https://aka.ms/motw
it: Il file {0} proviene da un altro computer e potrebbe essere stato bloccato per proteggere questo computer. Per altre informazioni, incluse le istruzioni su come sbloccare il file, vedere https://aka.ms/motw
ja: ファイル {0} は別のコンピューターからのもので、このコンピューターを保護するためにブロックされている可能性があります。ブロックを解除する方法を含む詳細については、https://aka.ms/motw を参照してください
ko: {0} 파일은 다른 컴퓨터에서 제공되었으며 이 컴퓨터를 보호하기 위해 차단되었을 수 있습니다. 차단 해제 방법을 비롯한 자세한 내용은 https://aka.ms/motw를 참조하세요.
pl: Plik {0} pochodzi z innego komputera i może zostać zablokowany, aby pomóc chronić ten komputer. Aby uzyskać więcej informacji, w tym o sposobie odblokowywania, zobacz https://aka.ms/motw
pt_br: O arquivo {0} veio de outro computador e pode estar bloqueado para ajudar a proteger este computador. Para obter mais informações, incluindo como desbloquear, consulte https://aka.ms/motw
ru: Файл {0} получен с другого компьютера и может быть заблокирован для защиты этого компьютера. Дополнительные сведения, включая процедуру разблокировки, см. на странице https://aka.ms/motw
tr: {0} adlı dosya başka bir bilgisayardan geldiğinden bilgisayarı korumaya yardımcı olmak için engellenmiş olabilir. Engellemenin nasıl kaldırılacağı da dahil olmak üzere daha fazla bilgi için bkz. https://aka.ms/motw
zh_hans: 文件 {0} 来自另一台计算机，而且可能会被阻止以帮助保护此计算机。有关详细信息(包括如何解除阻止)，请参阅 https://aka.ms/motw
zh_hant: 檔案 {0} 來自另一部電腦，但此電腦可能已封鎖而加以保護。如需詳細資訊，包括如何解除封鎖，請參閱 https://aka.ms/motw

# ManifestMissingIsRoot
source: Missing 'isRoot' entry.
cs: Chybí položka isRoot.
de: Eintrag "isRoot" fehlt.
es: Falta la entrada "isRoot".
fr: Entrée 'isRoot' manquante.
it: Manca la voce 'isRoot'.
ja: 'isRoot' エントリがありません。
ko: 'isRoot' 항목이 없습니다.
pl: Brak wpisu „isRoot”.
pt_br: Entrada 'isRoot' ausente.
ru: Отсутствует запись "isRoot".
tr: 'isRoot' girişi eksik.
zh_hans: 缺少 "isRoot" 条目。
zh_hant: 遺漏 'isRoot' 項目。

# ManifestPackageIdCollision
source: Cannot add package. Manifest file already contains version {0} of the package {1}. Uninstall/install or edit manifest file {2} to specify the new version {3}.
cs: Balíček se nedá přidat. Soubor manifestu už obsahuje verzi {0} balíčku {1}. Pokud chcete zadat novou verzi {3}, odinstalujte, nainstalujte nebo upravte soubor manifestu {2}.
de: Das Paket kann nicht hinzugefügt werden. Die Manifestdatei enthält bereits Version {0} des Pakets "{1}". Deinstallieren/installieren oder bearbeiten Sie die Manifestdatei "{2}", um die neue Version {3} anzugeben.
es: No se puede agregar el paquete. El archivo de manifiesto ya contiene la versión {0} del paquete {1}. Desinstale, instale o edite el archivo de manifiesto {2} para especificar la nueva versión {3}.
fr: Impossible d'ajouter le package. Le fichier manifeste contient déjà la version {0} du package {1}. Désinstallez/installez ou modifiez le fichier manifeste {2} pour spécifier la nouvelle version {3}.
it: Non è possibile aggiungere il pacchetto. Il file manifesto contiene già la versione {0} del pacchetto {1}. Disinstallare/installare o modificare il file manifesto {2} per specificare la nuova versione {3}.
ja: パッケージを追加できません。マニフェスト ファイルにはパッケージ {1} のバージョン {0} が既に含まれています。マニフェスト ファイル {2} をアンインストールまたはインストールするか編集して、新しいバージョン {3} を指定します。
ko: 패키지를 추가할 수 없습니다. 매니페스트 파일에 이미 {1} 패키지의 {0} 버전이 포함되어 있습니다. 새 버전 {3}을(를) 지정하려면 매니페스트 파일 {2}을(를) 제거/설치하거나 편집하세요.
pl: Nie można dodać pakietu. Plik manifestu zawiera już wersję {0} pakietu {1}. Odinstaluj, zainstaluj lub edytuj plik manifestu {2}, aby określić nową wersję {3}.
pt_br: Não é possível adicionar o pacote. O arquivo de manifesto já contém a versão {0} do pacote {1}. Instale/desinstale ou edite o arquivo de manifesto {2} para especificar a nova versão {3}.
ru: Не удается добавить пакет. Файл манифеста уже содержит версию {0} пакета {1}. Удалите и установите либо измените файл манифеста {2}, чтобы указать новую версию {3}.
tr: Paket eklenemiyor. Bildirim dosyası {1} paketinin {0} sürümünü zaten içeriyor. Yeni olan {3} sürümünü belirtmek için {2} bildirim dosyasını kaldırın/yükleyin veya düzenleyin.
zh_hans: 无法添加包。清单文件已经包含版本 {0} 的包 {1}。请卸载/安装或编辑清单文件 {2} 以指定新版本 {3}。
zh_hant: 無法新增套件。資訊清單檔已包含了版本 {0} 的套件 {1}。請解除安裝/安裝資訊清單檔 {2} 或加以編輯，以指定新的版本 {3}。

# ManifestVersion0
source: Manifest version 0 is not supported.
cs: Verze manifestu 0 se nepodporuje.
de: Die Manifestversion 0 wird nicht unterstützt.
es: No se admite la versión de manifiesto 0.
fr: Le manifeste version 0 n'est pas pris en charge.
it: La versione 0 del manifesto non è supportata.
ja: マニフェスト バージョン 0 はサポートされていません。
ko: 매니페스트 버전 0은 지원되지 않습니다.
pl: Manifest w wersji 0 nie jest obsługiwany.
pt_br: Não há suporte para a versão de manifesto 0.
ru: Версия манифеста 0 не поддерживается.
tr: Bildirim sürümü 0 desteklenmez.
zh_hans: 不支持清单版本 0。
zh_hant: 不支援資訊清單版本 0。

# ManifestVersionHigherThanSupported
source: Manifest version is {0}. This manifest may not be supported in this SDK version that can support up to manifest version {1}.
cs: Verze manifestu je {0}. Je možné, že se tento manifest nebude podporovat v této verzi sady SDK, která podporuje verzi manifestu až {1}.
de: Die Manifestversion lautet {0}. Dieses Manifest wird in dieser SDK-Version möglicherweise nicht unterstützt. Das SDK unterstützt Manifestversionen bis Version {1}.
es: La versión de manifiesto es {0}. Puede que este manifiesto no se admita en esta versión del SDK que puede admitir hasta la versión de manifiesto {1}.
fr: La version du manifeste est la version {0}. Ce manifeste n'est peut-être pas pris en charge dans cette version du kit SDK, qui peut prendre en charge le manifeste jusqu'à la version {1}.
it: La versione del manifesto è {0}. Il manifesto potrebbe non essere supportato in questa versione dell'SDK che supporta manifesti fino alla versione {1}.
ja: マニフェスト バージョンは {0} です。このマニフェストは、この SDK バージョン (最大でマニフェスト バージョン {1} をサポート) でサポートされていない可能性があります。
ko: 매니페스트 버전이 {0}입니다. 이 매니페스트는 매니페스트 버전 {1}까지 지원할 수 있는 이 SDK 버전에서 지원되지 않을 수 있습니다.
pl: Wersja manifestu to {0}. Ten manifest może nie być obsługiwany w tej wersji zestawu SDK, który obsługuje manifest do wersji {1}.
pt_br: A versão de manifesto é {0}. Este manifesto pode não ter suporte nesta versão do SDK, que dá suporte até a versão de manifesto {1}.
ru: Версия манифеста имеет значение {0}. Этот манифест может не поддерживаться в этой версии пакета SDK, которая способна поддерживать версии манифеста вплоть до {1}.
tr: Bildirim sürümü {0}. Bu bildirim, en fazla {1} bildirim sürümünü destekleyebilen bu SDK sürümünde desteklenemez.
zh_hans: 清单版本为 {0}。此 SDK 版本最多支持清单版本 {1}，可能不支持此清单。
zh_hant: 資訊清單版本為 {0}。此 SDK 版本中可能不支援這個資訊清單，最高支援到資訊清單版本 {1}。

# MissingToolEntryPointFile
source: Entry point file '{0}' for command '{1}' was not found in the package.
cs: Soubor vstupního bodu {0} pro příkaz {1} nebyl v balíčku nalezen.
de: Die Einstiegspunktdatei "{0}" für den Befehl "{1}" wurde nicht im Paket gefunden.
es: El archivo de punto de entrada "{0}" para el comando "{1}" no se encontró en el paquete.
fr: Le fichier de point d'entrée '{0}' pour la commande '{1}' est introuvable dans le package.
it: Il file '{0}' del punto di ingresso per il comando '{1}' non è stato trovato nel pacchetto.
ja: コマンド '{1}' のエントリ ポイント ファイル '{0}' がパッケージで見つかりませんでした。
ko: 패키지에서 '{1}' 명령에 대한 진입점 파일 '{0}'을(를) 찾지 못했습니다.
pl: Nie znaleziono pliku punktu wejścia „{0}” polecenia „{1}” w pakiecie.
pt_br: O arquivo de ponto de entrada '{0}' do comando '{1}' não foi encontrado no pacote.
ru: Файл точки входа "{0}" для команды "{1}" не найден в пакете.
tr: '{1}' komutu için '{0}' giriş noktası dosyası pakette bulunamadı.
zh_hans: 在包中找不到命令“{1}”的入口点文件“{0}”。
zh_hant: 無法在套件中找到命令 '{1}' 的進入點檔案 '{0}'。

# MissingToolSettingsFile
source: Settings file 'DotnetToolSettings.xml' was not found in the package.
cs: Soubor s nastavením DotnetToolSettings.xml nebyl v balíčku nalezen.
de: Die Einstellungsdatei "DotnetToolSettings.xml" wurde nicht im Paket gefunden.
es: El archivo de configuración "DotnetToolSettings.xml" no se encontró en el paquete.
fr: Le fichier de paramètres 'DotnetToolSettings.xml' est introuvable dans le package.
it: Il file di impostazioni 'DotnetToolSettings.xml' non è stato trovato nel pacchetto.
ja: 設定ファイル 'DotnetToolSettings.xml' がパッケージで見つかりませんでした。
ko: 패키지에서 설정 파일 'DotnetToolSettings.xml'을 찾지 못했습니다.
pl: Nie znaleziono pliku ustawień „DotnetToolSettings.xml” w pakiecie.
pt_br: O arquivo de configurações 'DotnetToolSettings.xml' não foi encontrado no pacote.
ru: Файл параметров "DotnetToolSettings.xml" не найден в пакете.
tr: 'DotnetToolSettings.xml' ayar dosyası pakette bulunamadı.
zh_hans: 在包中找不到设置文件 "DotnetToolSettings.xml"。
zh_hant: 無法在套件中找到設定檔 'DotnetToolSettings.xml'。

# MoreThanOnePackagedShimAvailable
source: More than one packaged shim is available: {0}.
cs: Je k dispozici více než jedno zabalené překrytí: {0}.
de: Mehr als ein paketierter Shim verfügbar: {0}.
es: Hay más de una opción de correcciones de compatibilidad (shim) empaquetadas: {0}.
fr: Plusieurs shims empaquetés sont disponibles : {0}.
it: Sono disponibili più shim inclusi nel pacchetto: {0}.
ja: 複数のパッケージ化された shim が利用可能です: {0}。
ko: 패키지된 shim을 하나 이상 사용할 수 있습니다. {0}
pl: Dostępna jest więcej niż jedna spakowana podkładka: {0}.
pt_br: Há mais de um shim empacotado disponível: {0}.
ru: Доступно несколько упакованных оболочек совместимости: {0}.
tr: Birden fazla paketlenmiş dolgu var: {0}.
zh_hans: 多个包装填充码可用: {0}。
zh_hant: 有多個經過封裝的填充碼可用: {0}。

# MoreThanOneProjectInDirectory
source: Found more than one project in `{0}`. Specify which one to use.
cs: V {0} se našlo několik projektů. Vyberte, který z nich chcete použít.
de: In "{0}" wurden mehrere Projekte gefunden. Geben Sie an, welches davon verwendet werden soll.
es: Se han encontrado varios proyectos en "{0}". Especifique el que debe usarse.
fr: Plusieurs projets dans '{0}'. Spécifiez celui à utiliser.
it: Sono stati trovati più progetti in `{0}`. Specificare quello da usare.
ja: `{0}` に複数のプロジェクトが見つかりました。使用するプロジェクトを指定してください。
ko: '{0}'에서 프로젝트를 두 개 이상 찾았습니다. 사용할 프로젝트를 지정하세요.
pl: Znaleziono więcej niż jeden projekt w lokalizacji „{0}”. Określ, który ma zostać użyty.
pt_br: Foi encontrado mais de um projeto em ‘{0}’. Especifique qual deve ser usado.
ru: Найдено несколько проектов в "{0}". Выберите один.
tr: `{0}` içinde birden fazla proje bulundu. Hangisinin kullanılacağını belirtin.
zh_hans: 在“{0}”中找到多个项目。请指定使用哪一个。
zh_hant: 在 `{0}` 中找到多個專案。請指定要使用的專案。

# MoreThanOneSolutionInDirectory
source: Found more than one solution file in {0}. Specify which one to use.
cs: V {0} se našlo několik souborů řešení. Vyberte, který z nich chcete použít.
de: In "{0}" wurden mehrere Projektmappendateien gefunden. Geben Sie an, welche davon verwendet werden soll.
es: Se han encontrado varios archivos de solución en {0}. Especifique el que debe usarse.
fr: Plusieurs fichiers solution dans {0}. Spécifiez celui à utiliser.
it: Sono stati trovati più file di soluzione in {0}. Specificare quello da usare.
ja: {0} に複数のソリューション ファイルが見つかりました。使用するファイルを指定してください。
ko: {0}에서 솔루션 파일을 두 개 이상 찾았습니다. 사용할 파일을 지정하세요.
pl: Znaleziono więcej niż jeden plik rozwiązania w lokalizacji {0}. Określ, który ma zostać użyty.
pt_br: Foi encontrado mais de um arquivo de solução em {0}. Especifique qual deve ser usado.
ru: Найдено несколько файлов решений в {0}. Выберите один.
tr: {0} içinde birden fazla çözüm dosyası bulundu. Hangisinin kullanılacağını belirtin.
zh_hans: 在 {0} 中找到多个解决方案文件。请指定使用哪一个。
zh_hant: 在 {0} 中找到多個解決方案檔。請指定要使用的檔案。

# MultipleProjectFilesFound
source: Specify which project file to use because this '{0}' contains more than one project file.
cs: Zadejte, jaký soubor projektu se použije, protože {0} obsahuje více souborů projektů.
de: Geben Sie an, welche Projektdatei verwendet werden soll, weil "{0}" mehrere Projektdateien enthält.
es: Especifique el archivo de proyecto que se debe usar porque "{0}" contiene más de un archivo de proyecto.
fr: Spécifiez le fichier projet à utiliser, car '{0}' contient plusieurs fichiers projet.
it: Specificare il file di progetto da usare perché questo elemento '{0}' contiene più file di progetto.
ja: この '{0}' には複数のプロジェクト ファイルが含まれているため、使用するプロジェクト ファイルを指定します。
ko: 이 '{0}'에 둘 이상의 프로젝트 파일이 포함되어 있으므로 사용할 프로젝트 파일을 지정하세요.
pl: Określ, który plik ma zostać użyty, ponieważ w tym elemencie „{0}” podano kilka plików projektu.
pt_br: Especifique qual arquivo de projeto será usado, pois este '{0}' contém mais de um arquivo de projeto.
ru: Укажите используемый файл проекта, так как этот "{0}" содержит несколько таких файлов.
tr: Bu '{0}' birden çok proje dosyası içerdiğinden, hangi proje dosyasının kullanılacağını belirtmeniz gerekir.
zh_hans: 指定要使用的项目文件，因为此“{0}”包含多个项目文件。
zh_hant: 指定要使用的專案檔，因為這個 '{0}' 包含多個專案檔。

# MultipleSamePackageId
source: More than one entry exists for package(s): {0}.
cs: Existuje více než jedno zadání pro balíčky: {0}.
de: Für diese Pakete ist mehr als ein Eintrag vorhanden: {0}.
es: Existe más de una entrada para los paquetes: {0}.
fr: Il existe plusieurs entrées pour le ou les packages : {0}.
it: Sono presenti più voci per i pacchetti: {0}.
ja: パッケージに対して複数のエントリが存在します: {0}。
ko: 패키지 {0}에 항목이 두 개 이상 있습니다.
pl: Istnieje wiele pozycji dla pakietów: {0}.
pt_br: Existe mais de uma entrada para os pacotes: {0}.
ru: Существует несколько записей для следующих пакетов: {0}.
tr: Paketler için birden fazla giriş var: {0}.
zh_hans: 包 {0} 存在多个条目。
zh_hant: 封裝存在多個項目: {0}。

# NeedRunToolRestore
source: Run "dotnet tool restore" to make the "{0}" command available.
cs: Pokud chcete zpřístupnit příkaz {0}, spusťte dotnet tool restore.
de: Führen Sie "dotnet tool restore" aus, um den Befehl "{0}" verfügbar zu machen.
es: Ejecute "dotnet tool restore" para que esté disponible el comando "{0}".
fr: Exécutez "dotnet tool restore" pour rendre la commande "{0}" disponible.
it: Eseguire "dotnet tool restore" per rendere disponibile il comando "{0}".
ja: "dotnet tool restore" を実行して、"{0}" コマンドを利用できるようにします。
ko: "dotnet tool restore"를 실행하여 "{0}" 명령을 사용할 수 있도록 만듭니다.
pl: Uruchom polecenie „dotnet tool restore”, aby udostępnić polecenie „{0}”.
pt_br: Execute "dotnet tool restore" para tornar o comando "{0}" disponível.
ru: Запустите "dotnet tool restore", чтобы сделать команду "{0}" доступной.
tr: "{0}" komutunu kullanabilmek için "dotnet tool restore" komutunu çalıştırın.
zh_hans: 运行 "dotnet tool restore" 以使“{0}”命令可用。
zh_hant: 執行 "dotnet tool restore"，將 "{0}" 命令設為可以使用。

source: New
cs: Nový
de: Neu
es: Nuevo
fr: Nouveau
it: Nuovo
ja: 新規
ko: 새로 만들기
pl: Nowy
pt_br: Novo
ru: Новое
tr: Yeni
zh_hans: 新建
zh_hant: 新建

# NoProjectsFound
source: No projects found in the solution.
cs: V řešení se nenašly žádné projekty.
de: In der Projektmappe wurden keine Projekte gefunden.
es: No se han encontrado proyectos en la solución.
fr: Aucun projet trouvé dans la solution.
it: Non sono stati trovati progetti nella soluzione.
ja: ソリューション内にプロジェクトが見つかりません。
ko: 솔루션에서 프로젝트를 찾을 수 없습니다.
pl: Nie znaleziono żadnych projektów w tym rozwiązaniu.
pt_br: Não foi encontrado nenhum projeto na solução.
ru: Проекты не найдены в решении.
tr: Çözümde proje bulunamadı.
zh_hans: 未在解决方案中找到项目。
zh_hant: 在解決方案中找不到任何專案。

# NoReferencesFound
source: There are no {0} references in project {1}.
cs: V projektu {1} nejsou žádné odkazy na {0}.
de: Im Projekt "{1}" liegen keine {0}-Verweise vor.
es: No hay ninguna referencia {0} en el proyecto {1}.
fr: Il n'existe aucune référence {0} dans le projet {1}.
it: Non sono presenti riferimenti a {0} nel progetto {1}.
ja: プロジェクト {1} には {0} 参照がありません。
ko: {1} 프로젝트에 {0} 참조가 없습니다.
pl: Brak odwołań do elementu {0} w projekcie {1}.
pt_br: Não há nenhuma referência {0} no projeto {1}.
ru: Нет ссылок {0} в проекте {1}.
tr: {1} projesinde hiçbir {0} başvurusu yok.
zh_hans: 项目 {1} 中没有 {0} 引用。
zh_hant: 專案 {1} 中沒有任何 {0} 參考。
