Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CouldNotFindAnyProjectInDirectory
source: Could not find any project in `{0}`.
cs: V {0} se nenašel žádný projekt.
de: In "{0}" wurde kein Projekt gefunden.
es: No se encuentra ningún proyecto en "{0}".
fr: Projet introuvable dans '{0}'.
it: Non è stato trovato alcun progetto in `{0}`.
ja: `{0}` にプロジェクトが見つかりませんでした。
ko: '{0}'에서 프로젝트를 찾을 수 없습니다.
pl: Nie można odnaleźć żadnego projektu w lokalizacji „{0}”.
pt_br: Não foi possível encontrar nenhum projeto em ‘{0}’.
ru: Не удалось найти проекты в "{0}".
tr: `{0}` içinde proje bulunamadı.
zh_hans: “{0}”中找不到任何项目。
zh_hant: 在 `{0}` 中找不到任何專案。

# CouldNotFindProjectOrDirectory
source: Could not find project or directory `{0}`.
cs: Nenašel se projekt ani adresář {0}.
de: Das Projekt oder Verzeichnis "{0}" wurde nicht gefunden.
es: No se encuentra el proyecto o directorio "{0}".
fr: Projet ou répertoire '{0}' introuvable.
it: Non sono stati trovati progetti o directory `{0}`.
ja: プロジェクトまたはディレクトリ `{0}` が見つかりませんでした。
ko: 프로젝트 또는 디렉터리 {0}을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć projektu ani katalogu „{0}”.
pt_br: Não foi possível encontrar o projeto ou diretório ‘{0}’.
ru: Не удалось найти проект или каталог "{0}".
tr: `{0}` projesi veya dizini bulunamadı.
zh_hans: 找不到项目或目录“{0}”。
zh_hant: 找不到專案或目錄 `{0}`。

# CouldNotFindSolutionIn
source: Specified solution file {0} does not exist, or there is no solution file in the directory.
cs: Zadaný soubor řešení {0} neexistuje nebo v adresáři není soubor řešení.
de: Die angegebene Projektmappendatei "{0}" ist nicht vorhanden, oder das Verzeichnis enthält keine Projektmappendatei.
es: El archivo de solución {0} especificado no existe, o bien no hay ningún archivo de solución en el directorio.
fr: Le fichier solution spécifié {0} n'existe pas ou il n'y a pas de fichier solution dans le répertoire.
it: Il file di soluzione specificato {0} non esiste oppure nella directory non è presente alcun file di soluzione.
ja: 指定したソリューション ファイル {0} が存在しないか、ディレクトリにソリューション ファイルがありません。
ko: 지정한 솔루션 파일 {0}이(가) 없거나 디렉터리에 솔루션 파일이 없습니다.
pl: Określony plik rozwiązania {0} nie istnieje bądź w katalogu nie ma żadnego pliku rozwiązania.
pt_br: O arquivo de solução {0} especificado não existe ou não há um arquivo de solução no diretório.
ru: Указанный файл решения "{0}" не существует, или в каталоге нет файла решения.
tr: Belirtilen {0} çözüm dosyası yok veya dizinde bir çözüm dosyası yok.
zh_hans: 指定的解决方案文件 {0} 不存在，或目录中没有解决方案文件。
zh_hant: 指定的方案檔 {0} 不存在，或目錄中沒有方案檔。

# CouldNotFindSolutionOrDirectory
source: Could not find solution or directory `{0}`.
cs: Nenašlo se řešení ani adresář {0}.
de: Die Projektmappe oder das Verzeichnis "{0}" wurde nicht gefunden.
es: No se encuentra la solución o el directorio "{0}".
fr: La solution ou le répertoire '{0}' est introuvable.
it: Non sono state trovate soluzioni o directory `{0}`.
ja: ソリューションまたはディレクトリ `{0}` が見つかりませんでした。
ko: 솔루션 또는 디렉터리 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć rozwiązania ani katalogu „{0}”.
pt_br: Não foi possível encontrar a solução ou o diretório ‘{0}’.
ru: Не удалось найти решение или каталог "{0}".
tr: `{0}` çözümü veya dizini bulunamadı.
zh_hans: 找不到解决方案或目录“{0}”。
zh_hant: 找不到解決方案或目錄 `{0}`。

# CouldNotFindToolRuntimeConfigFile
source: {0}: Could not find runtimeconfig.json file for tool {1}
cs: {0}: Soubor runtimeconfig.json nástroje {1} se nenašel.
de: {0}: Die Datei "runtimeconfig.json" wurde für das Tool {1} nicht gefunden.
es: {0}: no se pudo encontrar el archivo runtimeconfig.json para la herramienta {1}
fr: {0} : le fichier runtimeconfig.json est introuvable pour l'outil {1}
it: {0}: il file runtimeconfig.json per lo strumento {1} non è stato trovato
ja: {0}: ツール {1} で runtimeconfig.json ファイルが見つかりませんでした
ko: {0}: 도구 {1}에 대한 runtimeconfig.json 파일을 찾을 수 없음
pl: {0}: nie można odnaleźć pliku runtimeconfig.json dla narzędzia {1}
pt_br: {0}: não foi possível localizar o arquivo runtimeconfig.json para a ferramenta {1}
ru: {0}: не удалось найти файл runtimeconfig.json для средства {1}
tr: {0}: {1} aracı için runtimeconfig.json dosyası bulunamadı
zh_hans: {0}: 找不到工具 {1} 的 runtimeconfig.json 文件
zh_hant: {0}: 找不到工具 {1} 的 runtimeconfig.json 檔案

source: Delete
cs: Odstranit
de: löschen
es: Eliminar
fr: supprimer
it: Elimina
ja: 削除
ko: 삭제
pl: Usuń
pt_br: Excluir
ru: Удалить
tr: Sil
zh_hans: 删除
zh_hant: 刪除

# DepsJsonGeneratorProjectNotSet
source: Unable to find deps.json generator project.
cs: Projekt generátoru deps.json se nenašel.
de: Das deps.json-Generatorprojekt wurde nicht gefunden.
es: No se puede encontrar el proyecto de generador deps.json.
fr: Le projet de générateur deps.json est introuvable.
it: Il progetto del generatore deps.json non è stato trovato.
ja: deps.json ジェネレーター プロジェクトが見つかりません。
ko: deps.json 생성기 프로젝트를 찾을 수 없습니다.
pl: Nie można odnaleźć projektu generatora deps.json.
pt_br: Não é possível localizar o projeto do gerador deps.json.
ru: Не удалось найти проект генератора deps.json.
tr: deps.json oluşturucu projesi bulunamıyor.
zh_hans: 找不到 deps.json 生成器项目。
zh_hant: 找不到 deps.json 產生器專案。

# DidNotFindAMatchingProject
source: {0}: Did not find a matching project {1}.
cs: {0}: Nepodařilo se najít shodný projekt {1}.
de: {0}: Kein passendes Projekt {1} gefunden.
es: {0}: no se encontró un proyecto coincidente {1}.
fr: {0} : projet correspondant introuvable {1}.
it: {0}: non è stato trovato alcun progetto {1} corrispondente.
ja: {0}: 一致するプロジェクト {1}.が見つかりませんでした。
ko: {0}: 일치하는 프로젝트 {1}을(를) 찾지 못했습니다.
pl: {0}: Nie znaleziono pasującego projektu {1}.
pt_br: {0}: não encontrou um projeto {1} correspondente.
ru: {0}: не найден подходящий проект {1}.
tr: {0}: Eşleşen {1} projesi bulunamadı.
zh_hans: {0}: 未能找到匹配的项目 {1}。
zh_hant: {0}: 未找到相符的專案 {1}。

# DidNotFindProject
source: {0}: ProjectFactory did not find Project.
cs: {0}: Objekt pro vytváření projektů ProjectFactory nenašel projekt.
de: {0}: ProjectFactory hat das Projekt nicht gefunden.
es: {0}: ProjectFactory no encontró el proyecto.
fr: {0} : ProjectFactory n'a pas trouvé le projet.
it: {0}: ProjectFactory non ha trovato l'elemento Project.
ja: {0}:ProjectFactory でプロジェクトが見つかりませんでした。
ko: {0}: ProjectFactory에서 프로젝트를 찾지 못했습니다.
pl: {0}: Element ProjectFactory nie odnalazł projektu.
pt_br: {0}: ProjectFactory não encontrou o Projeto.
ru: {0}: фабрика проектов не нашла проект.
tr: {0}: ProjectFactory, Projeyi bulamadı.
zh_hans: {0}: ProjectFactory 未找到项目。
zh_hant: {0}: ProjectFactory 未找到專案。

# DidYouMean
source: Did you mean the following command?
cs: Měli jste na mysli následující příkaz?
de: Meinten Sie den folgenden Befehl?
es: ¿Quería decir el siguiente comando?
fr: Vouliez-vous dire la commande suivante ?
it: Si intendeva il comando seguente?
ja: 次のコマンドを意図していましたか?
ko: 다음 명령을 의미했나요?
pl: Czy chodziło Ci o następujące polecenie?
pt_br: Você quis dizer o seguinte comando?
ru: Вы имели в виду следующую команду?
tr: Aşağıdaki komutu mu kullanmak istediniz?
zh_hans: 你是否是指以下命令?
zh_hant: 您是指下列命令嗎?

source: Directory
cs: Adresář
de: Verzeichnis
es: Directorio
fr: Répertoire
ja: ディレクトリ
ko: 디렉터리
pl: Katalog
pt_br: Diretório
ru: Каталог
tr: Dizin
zh_hans: 目录
zh_hant: 目錄

# DisableBuildServersOptionDescription
source: Force the command to ignore any persistent build servers.
cs: Vynuťte, aby příkaz ignoroval všechny trvalé buildovací servery.
de: Erzwingen Sie, dass der Befehl alle persistenten Buildserver ignoriert.
es: Fuerce el comando para omitir los servidores de compilación persistentes.
fr: Forcez la commande à ignorer tous les serveurs de build persistants.
it: Forza il comando a ignorare tutti i server di compilazione persistenti.
ja: 永続的なビルド サーバーがそのコマンドで無視されるようにします。
ko: 모든 영구 빌드 서버를 무시하도록 명령을 강제 실행합니다.
pl: Wymuś polecenie, aby zignorować wszystkie trwałe serwery kompilacji.
pt_br: Force o comando a ignorar quaisquer servidores de compilação persistentes.
ru: Принудительно игнорировать все постоянные серверы сборки.
tr: Komutu kalıcı derleme sunucularını yoksaymaya zorla.
zh_hans: 强制命令忽略任何永久性生成服务器。
zh_hant: 強制命令略過任何持續性組建伺服器。

# DoesNotExist
source: {0}: {1} does not exist
cs: {0}: {1} neexistuje.
de: {0}: {1} nicht vorhanden
es: {0}: {1} no existe
fr: {0} : {1} n'existe pas
it: {0}: {1} non esiste
ja: {0}: {1} は存在しません
ko: {0}: {1}이(가) 없습니다.
pl: {0}: Element {1} nie istnieje
pt_br: {0}: {1} não existe
ru: {0}: {1} не существует.
tr: {0}: {1} yok
zh_hans: {0}: {1} 不存在
zh_hant: {0}: {1} 不存在

# EnvironmentPathLinuxManualInstructions
source: Tools directory '{0}' is not currently on the PATH environment variable. If you are using bash, you can add it to your profile by running the following command: cat << \EOF >> ~/.bash_profile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF You can add it to the current session by running the following command: export PATH="$PATH:{0}"
cs: Adresář nástrojů {0} se aktuálně nenachází v proměnné prostředí PATH. Pokud používáte bash, můžete ho přidat do profilu tak, že spustíte následující příkaz: cat << \EOF >> ~/.bash_profile # Přidejte nástroje .NET Core SDK export PATH="$PATH:{0}" EOF Pokud ho chcete přidat do aktuální relace, slouží k tomuto tento příkaz: export PATH="$PATH:{0}"
de: Das Toolverzeichnis "{0}" ist aktuell nicht in der PATH-Umgebungsvariable enthalten. Wenn Sie Bash verwenden, können Sie es Ihrem Profil durch Ausführen des folgenden Befehls hinzufügen: cat << \EOF >> ~007E;/.bash_profile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF Sie können es der aktuellen Sitzung hinzufügen, indem Sie den folgenden Befehl ausführen: export PATH="$PATH:{0}"
es: El directorio de herramientas "{0}" no está en la variable de entorno PATH. Si usa Bash, puede agregarlo a su perfil mediante la ejecución del comando siguiente: cat << \EOF >> ~/.bash_profile # Agregue las herramientas del SDK de .NET Core export PATH="$PATH:{0}" EOF Agréguelo a la sesión actual mediante la ejecución del comando siguiente: export PATH="$PATH:{0}"
fr: Le répertoire d'outils « {0} » n'est pas dans la variable d'environnement PATH. Si vous utilisez bash, vous pouvez l'ajouter à votre profil en exécutant la commande suivante : cat << \EOF >> ~/.bash_profile # Ajouter les outils du kit SDK .NET Core export PATH="$PATH:{0}" EOF Vous pouvez l'ajouter à la session active en exécutant la commande suivante : export PATH="$PATH:{0}"
it: La directory '{0}' degli strumenti non si trova attualmente nella variabile di ambiente PATH. Se si usa bash, è possibile aggiungerla al profilo eseguendo il comando seguente: cat << \EOF >> ~007E;/.bash_profile # Aggiungi strumenti .NET Core SDK export PATH="$PATH:{0}" EOF Per aggiungerla alla sessione corrente, eseguire il comando seguente: export PATH="$PATH:{0}"
ja: ツール ディレクトリ '{0}' は現在、PATH 環境変数にありません。 Bash を使用している場合、次のコマンドを実行してプロファイルに追加できます: cat << \EOF >> ~/.bash_profile # .NET Core SDK tools export PATH="$PATH:{0}" EOF 次のコマンドを実行して現在のセッションに追加できます: export PATH="$PATH:{0}"
ko: 도구 디렉터리 '{0}'이(가) 현재 PATH 환경 변수에 없습니다. Bash를 사용하는 경우 다음 명령을 실행하여 프로필에 Bash를 추가할 수 있습니다. cat << \EOF >> ~/.bash_profile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF 다음 명령을 실행하여 현재 세션에 Bash를 추가할 수 있습니다. export PATH="$PATH:{0}"
pl: Katalog narzędzi „{0}” nie znajduje się obecnie w zmiennej środowiskowej PATH. Jeśli używasz powłoki Bash, możesz dodać ją do swojego profilu, uruchamiając następujące polecenie: cat << \EOF >> ~/.bash_profile # Dodaj zestaw .NET Core SDK Tools export PATH="$PATH:{0}" EOF Aby dodać go na potrzeby bieżącej sesji, uruchom następujące polecenie: export PATH="$PATH:{0}"
pt_br: O diretório de ferramentas '{0}' não está atualmente na variável de ambiente PATH. Se você estiver usando bash, pode adicioná-lo ao seu perfil executando o seguinte comando: gato << \EOF >> ~/.bash_profile # Adicionar ferramentas do SDK do .NET Core exportar PATH="$PATH:{0}" EOF Você pode adicioná-lo à sessão atual executando o seguinte comando: exportar PATH="$PATH:{0}"
ru: Каталог инструментов "{0}" сейчас не входит в переменную среды PATH. Если вы используете Bash, можете добавить его в свой профиль, выполнив следующую команду: cat << \EOF >> ~/.bash_profile # Добавление инструментов пакета SDK для .NET Core export PATH="$PATH:{0}" EOF Вы можете добавить его в текущий сеанс, выполнив следующую команду: export PATH="$PATH:{0}"
tr: '{0}' araçlar dizini şu anda PATH ortam değişkeninde değil. Bash kullanıyorsanız, şu komutu çalıştırarak profilinize ekleyebilirsiniz: cat << \EOF >> ~/.bash_profile # .NET Core SDK araçları ekleyin export PATH="$PATH:{0}" EOF Şu komutu çalıştırarak geçerli komuta ekleyebilirsiniz: export PATH="$PATH:{0}"
zh_hans: 工具目录 '{0}' 当前不在 PATH 环境变量上。 如果使用的是 bash，则可通过运行以下命令将其添加到配置文件: cat << \EOF >> ~/.bash_profile # 添加 .NET Core SDK 工具 导出 PATH="$PATH:{0}" EOF 可通过运行以下命令将其添加到当前会话: 导出 PATH="$PATH:{0}"
zh_hant: 工具目錄 '{0}' 目前不在 PATH 環境變數上。 若目前使用 bash，可執行下列命令將其新增至您的設定檔: cat << \EOF >> ~/.bash_profile # 新增 .NET Core SDK 工具 export PATH="$PATH:{0}" EOF 您可執行下列命令，將其新增至目前的工作階段: export PATH="$PATH:{0}"

# EnvironmentPathLinuxNeedLogout
source: Since you just installed the .NET SDK, you will need to logout or restart your session before running the tool you installed.
cs: Právě jste nainstalovali sadu .NET SDK, před spuštěním nainstalovaného nástroje proto bude nutné se odhlásit nebo restartovat relaci.
de: Da Sie gerade das .NET SDK installiert haben, müssen Sie sich abmelden oder Ihre Sitzung neu starten, bevor Sie das installierte Tool ausführen.
es: Dado que acaba de instalar el SDK de .NET, tendrá que cerrar la sesión o reiniciarla antes de ejecutar la herramienta instalada.
fr: Dans la mesure où vous venez d'installer le kit SDK .NET, vous devez vous déconnecter ou redémarrer votre session avant d'exécuter l'outil que vous avez installé.
it: Dal momento che è stato appena installato .NET SDK, è necessario disconnettersi o riavviare la sessione prima di eseguire lo strumento installato.
ja: .NET SDK をインストールしたばかりなので、インストールしたツールを実行する前に、ログアウトするか、セッションを再起動する必要があります。
ko: .NET SDK를 방금 설치했기 때문에 설치한 도구를 실행하기 전에 로그아웃하거나 세션을 다시 시작해야 합니다.
pl: Właśnie zainstalowano zestaw .NET SDK, dlatego należy wylogować się lub uruchomić ponownie sesję przed uruchomieniem zainstalowanego narzędzia.
pt_br: Já que você acabou de instalar o SDK do .NET, ainda precisará fazer logoff ou reiniciar a sessão antes de executar a ferramenta instalada.
ru: Так как вы только что установили пакет SDK для .NET, перед его запуском нужно выйти из системы или перезапустить сеанс.
tr: .NET SDK’sını yüklediğinizden, yüklediğiniz aracı çalıştırmadan önce oturumunuzu kapatmanız veya oturumu yeniden başlatmanız gerekiyor.
zh_hans: 由于刚安装了 .NET SDK，因此在运行安装的工具之前，需要注销或重启会话。
zh_hant: 因為您剛才安裝了 .NET SDK，所以必須先登出或重新啟動工作階段，才能執行所安裝的工具。

# EnvironmentPathOSXBashManualInstructions
source: Tools directory '{0}' is not currently on the PATH environment variable. If you are using bash, you can add it to your profile by running the following command: cat << \EOF >> ~/.bash_profile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF You can add it to the current session by running the following command: export PATH="$PATH:{0}"
cs: Adresář nástrojů {0} se aktuálně nenachází v proměnné prostředí PATH. Pokud používáte bash, můžete ho přidat do profilu tak, že spustíte následující příkaz: cat << \EOF >> ~/.bash_profile # Přidejte nástroje .NET Core SDK export PATH="$PATH:{0}" EOF Pokud ho chcete přidat do aktuální relace, slouží k tomuto tento příkaz: export PATH="$PATH:{0}"
de: Das Toolverzeichnis "{0}" ist aktuell nicht in der PATH-Umgebungsvariable enthalten. Wenn Sie Bash verwenden, können Sie es Ihrem Profil durch Ausführen des folgenden Befehls hinzufügen: cat << \EOF >> ~007E;/.bash_profile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF Sie können es der aktuellen Sitzung hinzufügen, indem Sie den folgenden Befehl ausführen: export PATH="$PATH:{0}"
es: El directorio de herramientas "{0}" no está en la variable de entorno PATH. Si usa Bash, puede agregarlo a su perfil mediante la ejecución del comando siguiente: cat << \EOF >> ~/.bash_profile # Agregue las herramientas del SDK de .NET Core export PATH="$PATH:{0}" EOF Agréguelo a la sesión actual mediante la ejecución del comando siguiente: export PATH="$PATH:{0}"
fr: Le répertoire d'outils « {0} » n'est pas dans la variable d'environnement PATH. Si vous utilisez bash, vous pouvez l'ajouter à votre profil en exécutant la commande suivante : cat << \EOF >> ~/.bash_profile # Ajouter les outils du kit SDK .NET Core export PATH="$PATH:{0}" EOF Vous pouvez l'ajouter à la session active en exécutant la commande suivante : export PATH="$PATH:{0}"
it: La directory '{0}' degli strumenti non si trova attualmente nella variabile di ambiente PATH. Se si usa bash, è possibile aggiungerla al profilo eseguendo il comando seguente: cat << \EOF >> ~007E;/.bash_profile # Aggiungi strumenti .NET Core SDK export PATH="$PATH:{0}" EOF Per aggiungerla alla sessione corrente, eseguire il comando seguente: export PATH="$PATH:{0}"
ja: ツール ディレクトリ '{0}' は現在、PATH 環境変数にありません。 Bash を使用している場合、次のコマンドを実行してプロファイルに追加できます: cat << \EOF >> ~/.bash_profile # .NET Core SDK tools export PATH="$PATH:{0}" EOF 次のコマンドを実行して現在のセッションに追加できます: export PATH="$PATH:{0}"
ko: 도구 디렉터리 '{0}'이(가) 현재 PATH 환경 변수에 없습니다. Bash를 사용하는 경우 다음 명령을 실행하여 프로필에 Bash를 추가할 수 있습니다. cat << \EOF >> ~/.bash_profile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF 다음 명령을 실행하여 현재 세션에 Bash를 추가할 수 있습니다. export PATH="$PATH:{0}"
pl: Katalog narzędzi „{0}” nie znajduje się obecnie w zmiennej środowiskowej PATH. Jeśli używasz powłoki Bash, możesz dodać ją do swojego profilu, uruchamiając następujące polecenie: cat << \EOF >> ~/.bash_profile # Dodaj zestaw .NET Core SDK Tools export PATH="$PATH:{0}" EOF Aby dodać go na potrzeby bieżącej sesji, uruchom następujące polecenie: export PATH="$PATH:{0}"
pt_br: O diretório de ferramentas '{0}' não está atualmente na variável de ambiente PATH. Se você estiver usando bash, pode adicioná-lo ao seu perfil executando o seguinte comando: gato << \EOF >> ~/.bash_profile # Adicionar ferramentas do SDK do .NET Core exportar PATH="$PATH:{0}" EOF Você pode adicioná-lo à sessão atual executando o seguinte comando: exportar PATH="$PATH:{0}"
ru: Каталог инструментов "{0}" сейчас не входит в переменную среды PATH. Если вы используете Bash, можете добавить его в свой профиль, выполнив следующую команду: cat << \EOF >> ~/.bash_profile # Добавление инструментов пакета SDK для .NET Core export PATH="$PATH:{0}" EOF Вы можете добавить его в текущий сеанс, выполнив следующую команду: export PATH="$PATH:{0}"
tr: '{0}' araçlar dizini şu anda PATH ortam değişkeninde değil. Bash kullanıyorsanız, şu komutu çalıştırarak profilinize ekleyebilirsiniz: cat << \EOF >> ~/.bash_profile # .NET Core SDK araçları ekleyin export PATH="$PATH:{0}" EOF Şu komutu çalıştırarak geçerli komuta ekleyebilirsiniz: export PATH="$PATH:{0}"
zh_hans: 工具目录 '{0}' 当前不在 PATH 环境变量上。 如果使用的是 bash，则可通过运行以下命令将其添加到配置文件: cat << \EOF >> ~/.bash_profile # 添加 .NET Core SDK 工具 导出 PATH="$PATH:{0}" EOF 可通过运行以下命令将其添加到当前会话: 导出 PATH="$PATH:{0}"
zh_hant: 工具目錄 '{0}' 目前不在 PATH 環境變數上。 若目前使用 bash，可執行下列命令將其新增至您的設定檔: cat << \EOF >> ~/.bash_profile # 新增 .NET Core SDK 工具 export PATH="$PATH:{0}" EOF 您可執行下列命令，將其新增至目前的工作階段: export PATH="$PATH:{0}"

# EnvironmentPathOSXNeedReopen
source: Since you just installed the .NET SDK, you will need to reopen terminal before running the tool you installed.
cs: Právě jste nainstalovali sadu .NET SDK, před spuštěním nainstalovaného nástroje proto bude nutné znovu otevřít terminál.
de: Da Sie gerade das .NET SDK installiert haben, müssen Sie das Terminal neu öffnen, bevor Sie das installierte Tool ausführen.
es: Dado que acaba de instalar el SDK de .NET, tendrá que volver a abrir el terminal antes de ejecutar la herramienta instalada.
fr: Dans la mesure où vous venez d'installer le kit SDK .NET, vous devez rouvrir le terminal avant d'exécuter l'outil que vous avez installé.
it: Dal momento che è stato appena installato .NET SDK, è necessario riaprire il terminale prima di eseguire lo strumento installato.
ja: .NET SDK をインストールしたばかりなので、インストールしたツールを実行する前に、端末を再び開く必要があります。
ko: .NET SDK를 방금 설치했기 때문에 설치한 도구를 실행하기 전에 터미널을 다시 열어야 합니다.
pl: Właśnie zainstalowano zestaw .NET SDK, dlatego należy ponownie otworzyć terminal przed uruchomieniem zainstalowanego narzędzia.
pt_br: Já que você acabou de instalar o SDK do .NET, ainda precisará reabrir o terminal antes de executar a ferramenta instalada.
ru: Так как вы только что установили пакет SDK для .NET, перед его запуском нужно заново открыть терминал.
tr: .NET SDK’sını yüklediğinizden, yüklediğiniz aracı çalıştırmadan önce terminali yeniden açmanız gerekiyor.
zh_hans: 由于刚安装了 .NET SDK，因此在运行安装的工具之前，需要重新打开终端。
zh_hant: 因為您剛才安裝了 .NET SDK，所以必須先重新開啟終端，才能執行所安裝的工具。
