Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# EnvironmentPathOSXZshManualInstructions
source: Tools directory '{0}' is not currently on the PATH environment variable. If you are using zsh, you can add it to your profile by running the following command: cat << \EOF >> ~/.zprofile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF And run `zsh -l` to make it available for current session. You can only add it to the current session by running the following command: export PATH="$PATH:{0}"
cs: Adresář nástrojů {0} se aktuálně nenachází v proměnné prostředí PATH. Pokud používáte zsh, můžete si ho přidat do profilu tak, že spustíte následující příkaz: cat << \EOF >> ~/.zprofile # Přidejte nástroje .NET Core SDK export PATH="$PATH:{0}" EOF Pak ho spuštěním příkazu zsh -l zpřístupněte pro aktuální relaci. Pokud ho chcete přidat do aktuální relace, slouží k tomuto tento příkaz: export PATH="$PATH:{0}"
de: Das Toolverzeichnis "{0}" ist aktuell nicht in der PATH-Umgebungsvariable enthalten. Wenn Sie zsh verwenden, können Sie es Ihrem Profil hinzufügen, indem Sie folgenden Befehl ausführen: cat << \EOF >> ~007E;/.zprofile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF Führen Sie anschließend "zsh -l" aus, um das Tool für die aktuelle Sitzung verfügbar zu machen. Um es nur der aktuellen Sitzung hinzuzufügen, führen Sie den folgenden Befehl aus: export PATH="$PATH:{0}"
es: El directorio de herramientas "{0}" no está en la variable de entorno PATH. Si usa zsh, puede agregarlo a su perfil mediante la ejecución del comando siguiente: cat << \EOF >> ~/.zprofile # Agregue las herramientas del SDK de .NET Core export PATH="$PATH:{0}" EOF Y ejecute "zsh -l" para que esté disponible para la sesión actual. Solo puede agregarlo a la sesión actual ejecutando el comando siguiente: export PATH="$PATH:{0}"
fr: Le répertoire d'outils « {0} » n'est pas dans la variable d'environnement PATH. Si vous utilisez zsh, vous pouvez l'ajouter à votre profil en exécutant la commande suivante : cat << \EOF >> ~/.zprofile # Ajouter les outils du kit SDK .NET Core export PATH="$PATH:{0}" EOF Exécutez ensuite 'zsh -l' afin de le rendre disponible pour la session active. Vous pouvez uniquement l'ajouter à la session active en exécutant la commande suivante : export PATH="$PATH:{0}"
it: La directory '{0}' degli strumenti non si trova attualmente nella variabile di ambiente PATH. Se si usa zsh, è possibile aggiungerla al profilo eseguendo il comando seguente: cat << \EOF >> ~007E;/.zprofile # Aggiungi strumenti .NET Core SDK export PATH="$PATH:{0}" EOF Eseguire `zsh -l` per renderla disponibile per la sessione corrente. Per aggiungerla solo alla sessione corrente, eseguire il comando seguente: export PATH="$PATH:{0}"
ja: ツール ディレクトリ '{0}' は現在、PATH 環境変数にありません。 zsh を使用している場合、次のコマンドを実行してプロファイルに追加できます: cat << \EOF >> ~/.zprofile # .NET Core SDK tools export PATH="$PATH:{0}" EOF zsh -l を実行して現在のセッションで利用できるようにします。 これは、次のコマンドを実行することによってのみ、現行のセッションに追加できます: export PATH="$PATH:{0}"
ko: 도구 디렉터리 '{0}'이(가) 현재 PATH 환경 변수에 없습니다. zsh를 사용하는 경우 다음 명령을 실행하여 프로필에 zsh를 추가할 수 있습니다. cat << \EOF >> ~/.zprofile # Add .NET Core SDK tools export PATH="$PATH:{0}" EOF 또한 'zsh -l'을 실행하여 현재 세션에 zsh를 사용하도록 설정합니다. 현재 세션에 추가하려면 다음 명령을 실행해야 합니다. export PATH="$PATH:{0}"
pl: Katalog narzędzi „{0}” nie znajduje się obecnie w zmiennej środowiskowej PATH. Jeśli używasz powłoki zsh, możesz ją dodać do swojego profilu, uruchamiając następujące polecenie: cat << \EOF >> ~/.zprofile # Dodaj zestaw .NET Core SDK Tools export PATH="$PATH:{0}" EOF Aby udostępnić ją w bieżącej sesji, uruchom polecenie `zsh -l`. Możesz ją dodać tylko do bieżącej sesji, uruchamiając następujące polecenie: export PATH="$PATH:{0}"
pt_br: O diretório de ferramentas '{0}' não está atualmente na variável de ambiente PATH. Se você estiver usando zsh, pode adicioná-lo ao seu perfil executando o seguinte comando: gato << \EOF >> ~/.zprofile # Adicionar ferramentas do SDK do .NET Core exportar PATH="$PATH:{0}" EOF E execute `zsh -l` para torná-lo disponível na sessão atual. Você só pode adicioná-lo à sessão atual executando o seguinte comando: exportar PATH="$PATH:{0}"
ru: Каталог инструментов "{0}" сейчас не входит в переменную среды PATH. Если вы используете zsh, можете добавить его в свой профиль, выполнив следующую команду: cat << \EOF >> ~/.zprofile # Добавление инструментов пакета SDK для .NET Core export PATH="$PATH:{0}" EOF И выполните команду "zsh -l", чтобы сделать его доступным для текущего сеанса. Вы можете добавить его только в текущий сеанс, выполнив следующую команду: export PATH="$PATH:{0}"
tr: '{0}' araçlar dizini şu anda PATH ortam değişkeninde değil. zsh kullanıyorsanız, aşağıdaki komutu çalıştırarak bunu profilinize ekleyebilirsiniz: cat << \EOF >> ~/.zprofile # .NET Core SDK araçları ekleyin export PATH="$PATH:{0}" EOF Geçerli oturum için kullanılabilir hale getirmek üzere `zsh -l` komutunu çalıştırın. Aşağıdaki komutu çalıştırarak araçlar dizinini yalnızca geçerli oturuma ekleyebilirsiniz: export PATH="$PATH:{0}"
zh_hans: 工具目录 '{0}' 当前不在 PATH 环境变量上。 如果使用的是 zsh，则可通过运行以下命令将其添加到配置文件: cat << \EOF >> ~/.zprofile # 添加 .NET Core SDK 工具 导出 PATH="$PATH:{0}" EOF 并运行 `zsh -l` 以使其可用于当前会话。 只能通过运行以下命令将其添加到当前会话: 导出 PATH="$PATH:{0}"
zh_hant: 工具目錄 '{0}' 目前不在 PATH 環境變數上。 如果您在使用 zsh，可以執行以下命令將其新增至您的設定檔: cat << \EOF >> ~/.zprofile # 新增 .NET Core SDK 工具 export PATH="$PATH:{0}" EOF 並執行 zsh -l 讓其可用於目前的工作階段。 您只能執行以下命令將其新增至目前的工作階段: export PATH="$PATH:{0}"

# EnvironmentPathWindowsManualInstructions
source: Tools directory '{0}' is not currently on the PATH environment variable. You can add the directory to the PATH by running the following command: setx PATH "%PATH%;{0}"
cs: Adresář nástrojů {0} není momentálně v proměnné prostředí PATH. Tento adresář přidáte do proměnné PATH spuštěním následujícího příkazu: setx PATH "%PATH%;{0}"
de: Das Toolverzeichnis "{0}" ist aktuell nicht in der PATH-Umgebungsvariable angegeben. Um das Verzeichnis zu PATH hinzuzufügen, können Sie den folgenden Befehl ausführen: setx PATH "%PATH%;{0}"
es: El directorio de herramientas "{0}" no está actualmente en la variable de entorno PATH. Puede agregar el directorio a PATH mediante la ejecución del comando siguiente: setx PATH "%PATH%;{0}"
fr: Le répertoire d'outils '{0}' se ne trouve pas actuellement sur la variable d'environnement PATH. Vous pouvez ajouter le répertoire à PATH en exécutant la commande suivante : setx PATH "%PATH%;{0}"
it: La directory '{0}' degli strumenti non si trova attualmente nella variabile di ambiente PATH. Per aggiungere la directory a PATH, eseguire il comando seguente: setx PATH "%PATH%;{0}"
ja: Tools ディレクトリ '{0}' は現在、PATH 環境変数に含まれていません。 次のコマンドを実行して、PATH にディレクトリを追加できます: setx PATH "%PATH%;{0}"
ko: 도구 디렉터리 '{0}'이(가) 현재 PATH 환경 변수에 없습니다. 다음 명령을 실행하여 디렉터리를 PATH에 추가할 수 있습니다. setx PATH "%PATH%;{0}"
pl: Katalogu narzędzi „{0}” nie ma obecnie w zmiennej środowiskowej PATH. Możesz dodać katalog do zmiennej PATH przez uruchomienie następującego polecenia: setx PATH "%PATH%;{0}"
pt_br: O diretório de ferramentas '{0}' não está na variável de ambiente PATH no momento. Você pode adicionar o diretório à variável PATH executando o seguinte comando: setx PATH "%PATH%;{0}"
ru: Каталог инструментов "{0}" сейчас отсутствует в переменной среды PATH. Вы можете добавить каталог в PATH, выполнив следующую команду: setx PATH "%PATH%;{0}"
tr: '{0}' araç dizini şu anda PATH ortam değişkeni üzerinde değil. Aşağıdaki komutu çalıştırarak dizini PATH öğesine ekleyebilirsiniz: setx PATH "%PATH%;{0}"
zh_hans: 工具目录“{0}”目前不在 PATH 环境变量中。 可运行以下命令将目录添加到 PATH: setx PATH "%PATH%;{0}"
zh_hant: 工具目錄 '{0}' 目前不在 PATH 環境變數上。 您可執行下列命令將目錄新增至 PATH: setx PATH "%PATH%;{0}"

# EnvironmentPathWindowsNeedReopen
source: Since you just installed the .NET SDK, you will need to reopen the Command Prompt window before running the tool you installed.
cs: Právě jste nainstalovali sadu .NET SDK, před spuštěním nainstalovaného nástroje proto bude nutné znovu otevřít okno příkazového řádku.
de: Da Sie gerade das .NET SDK installiert haben, müssen Sie das Eingabeaufforderungsfenster neu öffnen, bevor Sie das installierte Tool ausführen.
es: Dado que acaba de instalar el SDK de .NET, tendrá que volver a abrir la ventana del símbolo del sistema antes de ejecutar la herramienta instalada.
fr: Dans la mesure où vous venez d'installer le kit SDK .NET, vous devez rouvrir la fenêtre d'invite de commandes avant d'exécuter l'outil que vous avez installé.
it: Dal momento che è stato appena installato .NET SDK, è necessario riaprire la finestra del prompt dei comandi prima di eseguire lo strumento installato.
ja: .NET SDK をインストールしたばかりなので、インストールしたツールを実行する前に、コマンド プロンプト ウィンドウを再び開く必要があります。
ko: .NET SDK를 방금 설치했기 때문에 설치한 도구를 실행하기 전에 명령 프롬프트 창을 다시 열어야 합니다.
pl: Właśnie zainstalowano zestaw .NET SDK, dlatego należy ponownie otworzyć okno wiersza polecenia przed uruchomieniem zainstalowanego narzędzia.
pt_br: Já que você acabou de instalar o SDK do .NET, ainda precisará reabrir a janela do Prompt de Comando antes de executar a ferramenta instalada.
ru: Так как вы только что установили пакет SDK для .NET, перед его запуском нужно заново открыть окно командной строки.
tr: .NET SDK’sını yüklediğinizden, yüklediğiniz aracı çalıştırmadan önce Komut İstemi penceresini yeniden açmanız gerekiyor.
zh_hans: 由于刚安装了 .NET SDK，因此在运行安装的工具之前，需要重新打开命令提示符窗口。
zh_hant: 因為您剛才安裝了 .NET SDK，所以必須先重新開啟 [命令提示字元] 視窗，才能執行所安裝的工具。

source: Error
cs: Chyba
de: Fehler
fr: Erreur
it: Errore
ja: エラー
ko: 오류
pl: Błąd
pt_br: Erro
ru: Ошибка
tr: Hata
zh_hans: 错误
zh_hant: 錯誤

# Error_NU1302_HttpSourceUsed
source: You are running the 'tool install' operation with an 'HTTP' source: {0}. NuGet requires HTTPS sources. To use an HTTP source, you must explicitly set 'allowInsecureConnections' to true in your NuGet.Config file. Refer to https://aka.ms/nuget-https-everywhere for more information.
de: Sie führen den Toolinstallationsvorgang mit einer HTTP-Quelle aus: {0}. NuGet erfordert HTTPS-Quellen. Um eine HTTP-Quelle zu verwenden, müssen Sie „allowInsecureConnections“ in Ihrer NuGet.Config-Datei explizit auf TRUE festlegen. Weitere Informationen finden Sie unter https://aka.ms/nuget-https-everywhere.
ja: 'tool install' 操作を、HTTP ソース {0} を使用して実行しています。NuGet には HTTPS ソースが必要です。HTTP ソースを使用するには、NuGet.Config ファイルで 'allowInsecureConnections' を true に明示的に設定する必要があります。詳しくは、https://aka.ms/nuget-https-everywhere を参照してください。
pl: Operację „instalacji narzędzia” wykonujesz ze źródłem „HTTP”: {0}. Menedżer NuGet wymaga źródeł HTTPS. Aby użyć źródła HTTP, musisz wyraźnie ustawić właściwość „allowInsecureConnections” na wartość true w pliku NuGet.Config. Aby uzyskać więcej informacji, sprawdź witrynę https://aka.ms/nuget-https-everywhere.

# ExpectDepsJsonAt
source: {0}: expect deps.json at: {1}
cs: {0}: Soubor deps.json se očekává v: {1}
de: {0}: "deps.json" vermutet unter: {1}
es: {0}: se espera deps.json en: {1}
fr: {0} : deps.json attendu sur {1}
it: {0}: è previsto deps.json in: {1}
ja: {0}: {1} で deps.json が必要です
ko: {0}: {1}에서 deps.json 필요
pl: {0}: Oczekiwano pliku deps.json w lokalizacji: {1}
pt_br: {0}: espera de deps.json em: {1}
ru: {0}: ожидается deps.json в: {1}.
tr: {0}: şu konumda deps.json bekleniyor: {1}
zh_hans: {0}: 需要 deps.json: {1}
zh_hant: {0}: 於 {1} 需要 deps.json

# FailedSettingShimPermissions
source: Failed to set user executable permissions for shell shim: {0}
cs: Pro překrytí prostředí se nepodařilo nastavit oprávnění uživatele ke spouštění: {0}.
de: Fehler beim Festlegen der Benutzerberechtigungen der ausführbaren Datei für den Shell-Shim: {0}
es: No se pudieron establecer los permisos ejecutables del usuario para las correcciones de compatibilidad (shim) de shell: {0}
fr: Échec de définition des autorisations utilisateur d'exécutable pour le shim d'environnement : {0}
it: Non è stato possibile impostare le autorizzazioni dell'eseguibile per lo shim della shell: {0}
ja: シェル shim で実行可能なユーザー アクセス許可を設定できませんでした: {0}
ko: 셸 shim에 대해 사용자 실행 파일 권한을 설정하지 못했습니다. {0}
pl: Nie można ustawić uprawnień pliku wykonywalnego użytkownika dla podkładki powłoki: {0}
pt_br: Falha ao definir as permissões do executável do usuário para o shim do shell: {0}
ru: Не удалось задать разрешения исполняемого файла пользователя для оболочки совместимости: {0}
tr: Kabuk dolgusu için kullanıcı yürütülebilir dosya izinleri ayarlanamadı: {0}
zh_hans: 未能为 shell 填充程序设置用户可执行文件权限: {0}
zh_hant: 無法為殼層填充碼設定使用者可執行檔權限: {0}

# FailedToCreateShellShim
source: Failed to create tool shim for command '{0}': {1}
cs: Pro příkaz {0} se nepodařilo vytvořit překrytí nástroje: {1}.
de: Fehler beim Erstellen des Tool-Shims für den Befehl "{0}": {1}
es: No se pudieron crear correcciones de compatibilidad (shim) de herramientas para el comando "{0}": {1}
fr: Échec de création d'un shim d'outil pour la commande '{0}' : {1}
it: Non è stato possibile creare lo shim dello strumento per il comando '{0}': {1}
ja: コマンド '{0}' でツール shim を作成できませんでした: {1}
ko: '{0}' 명령에 대해 도구 shim을 만들지 못했습니다. {1}
pl: Nie można utworzyć podkładki narzędzia dla polecenia „{0}”: {1}
pt_br: Falha ao criar o shim da ferramenta para o comando '{0}': {1}
ru: Не удалось создать оболочку совместимости инструмента для команды "{0}": {1}
tr: '{0}' komutu için araç dolgusu oluşturulamadı: {1}
zh_hans: 未能为命令“{0}”创建工具填充程序: {1}
zh_hant: 無法為命令 '{0}' 建立工具填充碼: {1}

# FailedToFindCommandPath
source: {0}: failed to find commandPath {1}
cs: {0}: Nepodařilo se najít commandPath {1}
de: {0}: commandPath für {1} nicht gefunden
es: {0}: no se pudo encontrar commandPath {1}
fr: {0} : échec de la recherche de commandPath {1}
it: {0}: commandPath {1} non trovato
ja: {0}: commandPath {1} が見つかりませんでした
ko: {0}: commandPath {1} 찾기 실패
pl: {0}: Nie udało się odnaleźć ścieżki commandPath {1}
pt_br: {0}: falha ao encontrar commandPath {1}
ru: {0}: не удалось найти commandPath {1}.
tr: {0}: {1} commandPath bulunamadı
zh_hans: {0}: 未能找到 commandPath {1}
zh_hant: {0}: 找不到 commandPath {1}

# FailedToFindLibraryInAssetsFile
source: Failed to find library in NuGet assets file for tool package '{0}': {1}
cs: Nepovedlo se najít knihovnu v souboru prostředků NuGet pro balíček nástroje {0}: {1}
de: Fehler beim Suchen der Bibliothek in der NuGet-Ressourcendatei für das Toolpaket "{0}": {1}
es: No se pudo encontrar la biblioteca en el archivo de recursos de NuGet para el paquete de herramientas '{0}': {1}
fr: Bibliothèque introuvable dans le fichier de ressources NuGet pour le package d’outils « {0} » : {1}
it: Non è possibile trovare la libreria nel file di asset NuGet per il pacchetto di strumenti '{0}': {1}
ja: ツール パッケージ '{0}' の NuGet アセット ファイルにライブラリが見つかりませんでした: {1}
ko: 도구 패키지 '{0}'의 NuGet 자산 파일에서 라이브러리를 찾지 못했습니다. {1}
pl: Nie można odnaleźć biblioteki w pliku zasobów NuGet dla pakietu narzędzi „{0}”: {1}
pt_br: Falha ao encontrar a biblioteca no arquivo de ativos do NuGet para o pacote de ferramenta '{0}': {1}
ru: Не удалось найти библиотеку в файле ресурсов NuGet для пакета инструмента "{0}": {1}
tr: '{0}' araç paketi için NuGet varlıkları dosyasında kitaplık bulunamadı: {1}
zh_hans: 在工具包“{0}”的 NuGet 资产文件中找不到库: {1}
zh_hant: 在 NuGet 資產檔案中找不到工具套件 '{0}' 的程式庫: {1}

# FailedToFindSourceUnderPackageSourceMapping
source: Package Source Mapping is enabled, but no source found under the specified package ID: {0}. See the documentation for Package Source Mapping at https://aka.ms/nuget-package-source-mapping for more details.
cs: Mapování zdroje balíčku je povoleno, ale pod zadaným ID balíčku nebyl nalezen žádný zdroj: {0}. Další podrobnosti najdete v dokumentaci k mapování zdrojů balíčků na https://aka.ms/nuget-package-source-mapping.
de: Die Paketquellzuordnung ist aktiviert, aber unter der angegebenen Paket-ID wurde keine Quelle gefunden: {0}. Weitere Informationen finden Sie in der Dokumentation zur Paketquellzuordnung unter https://aka.ms/nuget-package-source-mapping.
es: La asignación de origen del paquete está habilitada, pero no se encontró ningún origen en el id. de paquete especificado: {0}. Consulte la documentación de asignación de origen del paquete en https://aka.ms/nuget-package-source-mapping para obtener más detalles.
fr: Le mappage de source de package est activé, mais aucune source n’a été trouvée sous l’ID de package spécifié : {0}. Pour plus d’informations, consultez la documentation relative au mappage de source de package sur https://aka.ms/nuget-package-source-mapping.
it: Mapping origine pacchetto abilitato, ma non è stata trovata alcuna origine nell'ID pacchetto specificato: {0}{0}. Per altri dettagli, vedere la documentazione relativa al mapping dell'origine dei pacchetti in https://aka.ms/nuget-package-source-mapping.
ja: パッケージ ソース マッピングが有効になっていますが、指定されたパッケージ ID {0} にソースが見つかりません。詳細については、https://aka.ms/nuget-package-source-mapping にあるパッケージ ソース マッピングのドキュメントを参照してください。
ko: 패키지 원본 매핑을 사용하도록 설정된 상태이나 지정된 패키지 ID {0}에서 원본을 찾을 수 없습니다. 자세한 내용은 https://aka.ms/nuget-package-source-mapping에 있는 패키지 원본 매핑에 대한 설명서를 참조하세요.
pl: Mapowanie źródła pakietu jest włączone, ale nie znaleziono źródła w ramach określonego identyfikatora pakietu: {0}. Aby uzyskać więcej informacji, zapoznaj się z dokumentacją mapowania źródła pakietu w witrynie https://aka.ms/nuget-package-source-mapping.
pt_br: O Mapeamento de Origem do Pacote está habilitado, mas nenhuma origem foi encontrada na ID de pacote especificada: {0}. Consulte a documentação do Mapeamento de Origem do Pacote em https://aka.ms/nuget-package-source-mapping para obter mais detalhes.
ru: Сопоставление источников пакетов включено, но не найден источник для указанного идентификатора пакета: {0}. Дополнительные сведения см. в документации по сопоставлению источников пакетов: https://aka.ms/nuget-package-source-mapping.
tr: Paket Kaynak Eşlemesi etkinleştirildi ancak belirtilen paket kimliği altında kaynak bulunamadı: {0}. Paket Kaynak Eşlemesi hakkında daha fazla ayrıntı için https://aka.ms/nuget-package-source-mapping belgelerine bakın.
zh_hans: 已启用包源映射，但在指定的包 ID 下找不到源: {0}。有关详细信息，请参阅包源映射文档(https://aka.ms/nuget-package-source-mapping)。
zh_hant: 已啟用封裝來源對應，但在指定的封裝識別碼下找不到來源: {0}。如需詳細資料，請參閱位於 https://aka.ms/nuget-package-source-mapping 的封裝來源對應文件。

# FailedToFindStagedToolPackage
source: Failed to find staged tool package '{0}'.
cs: Nepodařilo se najít připravený balíček nástroje {0}.
de: Das gestagete Toolpaket "{0}" wurde nicht gefunden.
es: No se pudo encontrar el paquete de herramientas almacenado provisionalmente "{0}".
fr: Package d'outils indexé '{0}' introuvable.
it: Non è stato possibile trovare il pacchetto '{0}' dello strumento preparato per il commit.
ja: ステージ済みのツール パッケージ '{0}' が見つかりませんでした。
ko: 스테이징된 도구 패키지 '{0}'을(를) 찾지 못했습니다.
pl: Nie można odnaleźć przygotowanego pakietu narzędzia „{0}”.
pt_br: Falha ao encontrar o pacote de ferramentas preparado '{0}'.
ru: Не удалось найти промежуточный пакет инструментов "{0}".
tr: '{0}' adlı hazırlanmış araç paketi bulunamadı.
zh_hans: 无法找到暂存工具包“{0}”。
zh_hant: 無法找到暫存工具套件 '{0}'。

# FailedToFindToolAssembly
source: {0}: failed to find toolAssembly for {1}
cs: {0}: Nepodařilo se najít toolAssembly pro {1}
de: {0}: toolAssembly für {1} nicht gefunden
es: {0}: no se pudo encontrar toolAssembly para {1}
fr: {0} : échec de la recherche de toolAssembly pour {1}
it: {0}: toolAssembly per {1} non trovato
ja: {0}: {1} の toolAssembly が見つかりませんでした
ko: {0}: {1}용 toolAssembly 찾기 실패
pl: {0}: Nie udało się odnaleźć elementu toolAssembly dla elementu {1}
pt_br: {0}: falha ao encontrar toolAssembly para {1}
ru: {0}: не удалось найти toolAssembly для {1}.
tr: {0}: {1} için toolAssembly bulunamadı
zh_hans: {0}: 未能找到 {1} 的 toolAssembly
zh_hant: {0}: 找不到 {1} 的 toolAssembly

# FailedToLoadNuGetSource
source: Failed to load NuGet source {0}
cs: Nepovedlo se načíst zdroj NuGet {0}.
de: Fehler beim Laden der NuGet-Quelle {0}
es: No se pudo cargar el origen de NuGet {0}
fr: Échec du chargement de la source DeNget {0}
it: Non è stato possibile caricare l'origine NuGet {0}
ja: NuGet ソース {0} の読み込みに失敗しました
ko: NuGet 원본 {0}을(를) 로드하지 못했습니다.
pl: Nie można załadować źródła pakietu NuGet {0}
pt_br: Falha no carregamento da fonte NuGet {0}
ru: Не удалось загрузить источник NuGet {0}
tr: {0} NuGet kaynağı yüklemesi yüklenemedi
zh_hans: 无法加载 NuGet 源 {0}
zh_hant: 無法載入 NuGet 來源{0}

# FailedToMapSourceUnderPackageSourceMapping
source: Package Source Mapping is enabled, but no source mapped under the specified package ID: {0}. See the documentation for Package Source Mapping at https://aka.ms/nuget-package-source-mapping for more details.
cs: Mapování zdroje balíčku je povoleno, ale pod zadaným ID balíčku není namapován žádný zdroj: {0}. Další podrobnosti najdete v dokumentaci k mapování zdrojů balíčků na https://aka.ms/nuget-package-source-mapping.
de: Die Paketquellzuordnung ist aktiviert, aber unter der angegebenen Paket-ID ist keine Quelle zugeordnet: {0}. Weitere Informationen finden Sie in der Dokumentation zur Paketquellzuordnung unter https://aka.ms/nuget-package-source-mapping.
es: La asignación de origen del paquete está habilitada, pero no hay ningún origen asignado en el id. de paquete especificado: {0}. Consulte la documentación de asignación de origen del paquete en https://aka.ms/nuget-package-source-mapping para obtener más detalles.
fr: Le mappage de source de package est activé, mais aucune source n’est mappée sous l’ID de package spécifié : {0}. Pour plus d’informations, consultez la documentation relative au mappage de source de package sur https://aka.ms/nuget-package-source-mapping.
it: Il mapping dell'origine del pacchetto è abilitato, ma non è stato eseguito il mapping dell'origine nell'ID pacchetto specificato: {0}. Per altri dettagli, vedere la documentazione relativa al mapping dell'origine dei pacchetti in https://aka.ms/nuget-package-source-mapping.
ja: パッケージ ソース マッピングが有効になっていますが、指定されたパッケージ ID {0} にソースがマッピングされていません。詳細については、https://aka.ms/nuget-package-source-mapping にあるパッケージ ソース マッピングのドキュメントを参照してください。
ko: 패키지 원본 매핑을 사용하도록 설정된 상태이나 지정된 패키지 ID {0}에 매핑된 원본이 없습니다. 자세한 내용은 https://aka.ms/nuget-package-source-mapping에 있는 패키지 원본 매핑에 대한 설명서를 참조하세요.
pl: Mapowanie źródła pakietu jest włączone, ale nie zamapowano źródła w ramach określonego identyfikatora pakietu: {0}. Aby uzyskać więcej informacji, zapoznaj się z dokumentacją mapowania źródła pakietu w witrynie https://aka.ms/nuget-package-source-mapping.
pt_br: O Mapeamento de Origem do Pacote está habilitado, mas nenhuma origem foi mapeada na ID de pacote especificada: {0}. Consulte a documentação do Mapeamento de Origem do Pacote em https://aka.ms/nuget-package-source-mapping para obter mais detalhes.
ru: Сопоставление источников пакетов включено, но не сопоставлен источник для указанного идентификатора пакета: {0}. Дополнительные сведения см. в документации по сопоставлению источников пакетов: https://aka.ms/nuget-package-source-mapping.
tr: Paket Kaynak Eşlemesi etkinleştirildi ancak belirtilen paket kimliği altında eşlenen kaynak bulunamadı: {0}. Paket Kaynak Eşlemesi hakkında daha fazla ayrıntı için https://aka.ms/nuget-package-source-mapping belgelerine bakın.
zh_hans: 已启用包源映射，但在指定的包 ID 下未映射源: {0}。有关详细信息，请参阅包源映射文档(https://aka.ms/nuget-package-source-mapping)。
zh_hant: 已啟用封裝來源對應，但在指定的封裝識別碼下沒有對應的來源: {0}。如需詳細資料，請參閱位於 https://aka.ms/nuget-package-source-mapping 的封裝來源對應文件。
