Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NoRestoreDescription
source: Do not restore the project before building.
cs: Neobnoví projekt před sestavením.
de: Hiermit wird das Projekt nicht vor der Erstellung wiederhergestellt.
es: No restaure el proyecto antes de la compilación.
fr: Ne restaurez pas le projet avant la génération.
it: Non ripristina il progetto prima della compilazione.
ja: ビルドする前にプロジェクトを復元しません。
ko: 빌드하기 전에 프로젝트를 복원하지 마세요.
pl: Nie przywracaj projektu przed kompilowaniem.
pt_br: Não restaurar o projeto antes de compilar.
ru: Не восстанавливать проект перед сборкой.
tr: Projeyi derlemeden önce geri yüklemeyin.
zh_hans: 生成前请勿还原项目。
zh_hant: 建置前請勿還原該專案。

# NonRetriableNugetSearchFailure
source: Failed to search. NuGet Search API response detail: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
cs: Hledání nebylo úspěšné. Podrobnosti odpovědi rozhraní API hledání NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}
de: Fehler bei der Suche. Ausführliche Informationen zur Antwort der NuGet-Such-API: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
es: No se pudo buscar. Detalles de la respuesta de la API de búsqueda de NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
fr: Échec de la recherche. Détails de la réponse de l'API de recherche NuGet : RequestUrl : {0}. ReasonPhrase : {1}. StatusCode : {2}.
it: Non è stato possibile cercare. Dettagli della risposta dell'API di Ricerca NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
ja: 検索に失敗しました。NuGet Search API からの応答の詳細: RequestUrl: {0}。ReasonPhrase: {1}。StatusCode: {2}。
ko: 검색하지 못했습니다. NuGet 검색 API 응답 정보: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
pl: Nie można wyszukać. Szczegóły odpowiedzi interfejsu API wyszukiwania NuGet: Adres URL żądania: {0}. Fraza przyczyny: {1}. Kod stanu: {2}.
pt_br: Falha na pesquisa. Detalhe da resposta da API de Pesquisa do NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
ru: Не удалось выполнить поиск. Сведения об ответе API для поиска NuGet: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
tr: Arama başarısız oldu. NuGet Arama API'si yanıt ayrıntısı: RequestUrl: {0}. ReasonPhrase: {1}. StatusCode: {2}.
zh_hans: 搜索失败。NuGet 搜索 API 响应详细信息: RequestUrl: {0}。ReasonPhrase: {1}。StatusCode: {2}。
zh_hant: 無法搜尋。NuGet 搜尋 API 回應詳細資料: RequestUrl: {0}。ReasonPhrase: {1}。StatusCode: {2}。

# NuGetPackageShouldNotBeSigned
source: Skipping signature verification for NuGet package "{0}" because it comes from a source that does not require signature validation.
cs: Přeskakuje se ověření podpisu pro balíček NuGet {0}, protože pochází ze zdroje, který nevyžaduje ověření podpisu.
de: Die Signaturüberprüfung für das NuGet-Paket „{0}“ wird übersprungen, da sie aus einer Quelle stammt, für die keine Signaturüberprüfung erforderlich ist.
es: Omitiendo la comprobación de firma para el paquete NuGet "{0}" porque procede de un origen que no requiere validación de firma.
fr: La vérification de signature pour le package NuGet « {0} » est ignorée, car elle provient d’une source qui ne nécessite pas de validation de signature.
it: La verifica della firma per il pacchetto NuGet "{0}" viene ignorata in quanto la firma proviene da un'origine che non richiede la convalida della firma.
ja: NuGet パッケージ "{0}" は署名の検証を必要としないソースから取得されたものなので、このパッケージの署名検証をスキップしています。
ko: NuGet 패키지 "{0}"은(는) 서명 유효성 검사가 필요하지 않은 원본에서 제공되었으므로 서명 확인을 건너뜁니다.
pl: Pomijanie weryfikacji podpisu dla pakietu NuGet „{0}”, ponieważ pochodzi ona ze źródła, które nie wymaga weryfikacji podpisu.
pt_br: Ignorando a verificação de assinatura para o pacote NuGet "{0}" porque ele vem de uma origem que não requer validação de assinatura.
ru: Пропуск проверки подписи для пакета NuGet "{0}", так как он получен из источника, который не требует проверки подписи.
tr: "{0}"NuGet paketinin imza doğrulaması atlandı, çünkü imza doğrulaması gerektirmeyen bir kaynaktan geliyor.
zh_hans: 正在跳过 NuGet 包“{0}”的签名验证，因为该包来自不需要签名验证的源。
zh_hant: 正在略過 NuGet 套件的簽章驗證「{0}」，因為它的來源不需要簽章驗證。

# NuGetPackageSignatureVerificationSkipped
source: Skipping NuGet package signature verification.
cs: Přeskakuje se ověření podpisu balíčku NuGet.
de: Die Überprüfung der NuGet-Paketsignatur wird übersprungen.
es: Omitiendo la comprobación de la firma del paquete NuGet.
fr: La vérification de la signature du package NuGet est ignorée.
it: La verifica della firma del pacchetto NuGet verrà ignorata.
ja: NuGet パッケージ署名の認証をスキップしています。
ko: NuGet 패키지 서명 확인을 건너뛰는 중입니다.
pl: Pomijanie weryfikacji podpisu pakietu NuGet.
pt_br: Ignorando a verificação de assinatura do pacote NuGet.
ru: Пропуск проверки подписи пакета NuGet.
tr: NuGet paket imzası doğrulaması atlanıyor.
zh_hans: 正在跳过 NuGet 包签名验证。
zh_hant: 正在略過 NuGet 套件簽章驗證。

# NuGetPackagesRoot
source: {0}: nuget packages root: {1}
cs: {0}: Kořen balíčků NuGet: {1}
de: {0}: NuGet-Paketstamm: {1}
es: {0}: raíz de paquetes NuGet: {1}
fr: {0} : racine des packages NuGet : {1}
it: {0}: radice dei pacchetti NuGet: {1}
ja: {0}: NuGet パッケージ ルート: {1}
ko: {0}: nuget 패키지 루트: {1}
pl: {0}: Katalog główny pakietów NuGet: {1}
pt_br: {0}: raiz de pacotes NuGet: {1}
ru: {0}: корень пакетов nuget: {1}
tr: {0}: NuGet paketleri kökü: {1}
zh_hans: {0}: nuget 包根目录: {1}
zh_hant: {0}: NuGet 套件根: {1}

# OSArgumentName
source: OS
cs: Operační systém
de: Betriebssystem
es: SO
fr: Système d'exploitation
it: Sistema operativo
pl: System operacyjny
pt_br: SO
ru: ОС
tr: İS
zh_hant: 作業系統

# OnlyOneProjectAllowed
source: Only one project can be specified at a time using the -p option.
cs: Pomocí možnosti -p je možné v jednu chvíli zadat pouze jeden projekt.
de: Nur jeweils ein Projekt kann mithilfe der Option „-p“ angegeben werden.
es: Solo se puede especificar un proyecto a la vez mediante la opción -p.
fr: Vous ne pouvez spécifier qu’un seul projet à la fois à l’aide de l’option -p.
it: È possibile specificare un solo progetto alla volta utilizzando l'opzione -p.
ja: -p オプションを使用して一度に指定できるプロジェクトは 1 つだけです。
ko: -p 옵션을 사용하여 한 번에 하나의 프로젝트만 지정할 수 있습니다.
pl: Jednocześnie można określić tylko jeden projekt przy użyciu opcji -p.
pt_br: Somente um projeto pode ser especificado por vez usando a opção -p.
ru: С помощью параметра -p можно указать только один проект за раз.
tr: -p seçeneği kullanılarak tek seferde yalnızca bir proje belirtilebilir.
zh_hans: 使用 -p 选项时一次只能指定一个项目。
zh_hant: 使用 -p 選項時，一次只能指定一個專案。

# OperatingSystemOptionDescription
source: The target operating system.
cs: Cílový operační systém
de: Das Zielbetriebssystem.
es: El sistema operativo de destino.
fr: Le système d'exploitation cible
it: Sistema operativo di destinazione.
ja: ターゲット オペレーティング システム。
ko: 대상 운영 체제입니다.
pl: Docelowy system operacyjny.
pt_br: O sistema operacional de destino.
ru: Целевая операционная система.
tr: Hedef işletim sistemi.
zh_hans: 目标操作系统。
zh_hant: 目標作業系統。

# P2P
source: Project to Project
cs: Z projektu na projekt
de: Projekt zu Projekt
es: Proyecto a proyecto
fr: Projet à projet
it: P2P (da progetto a progetto)
ja: プロジェクト間
ko: 프로젝트 간
pl: Między projektami
pt_br: Projeto para Projeto
ru: Проект — проект
tr: Projeden Projeye
zh_hans: 项目到项目
zh_hant: 專案對專案

# PackCmd_OneNuspecAllowed
source: Only one .nuspec file can be packed at a time
cs: Lze zabalit pouze jeden .nuspec soubor najednou.
de: Es kann immer nur eine .nuspec-Datei gepackt werden.
fr: Vous ne pouvez empaqueter qu’un seul fichier .nuspec à la fois
it: È creare un pacchetto di un solo file .nuspec alla volta
ja: 一度にパックできる .nuspec ファイルは 1 つだけです
ko: 한 번에 하나의 .nuspec 파일만 압축할 수 있습니다.
pl: Jednocześnie można spakować tylko jeden plik nuspec
pt_br: Somente um arquivo .nuspec pode ser empacotado por vez
ru: Одновременно можно упаковать только один файл .nuspec
tr: Tek seferde yalnızca bir .nuspec dosyası paketlenebilir
zh_hans: 一次只能打包一个 .nuspec 文件
zh_hant: 一次只能封裝一個 .nuspec 檔案

source: Package
cs: Balíček
de: Paket
es: Paquete
it: Pacchetto
ja: パッケージ
ko: 패키지
pl: Pakiet
pt_br: Pacote
ru: Пакет
tr: Paket
zh_hans: 打包
zh_hant: 套件

# PackageIdentityArgumentDescription
source: Package reference in the form of a package identifier like 'Newtonsoft.Json' or package identifier and version separated by '@' like 'Newtonsoft.Json@13.0.3'.
cs: Odkaz na balíček ve formě identifikátoru balíčku, jako je Newtonsoft.Json, nebo identifikátor balíčku a verze oddělené znakem @, například Newtonsoft.Json@13.0.3.
es: Referencia de paquete en forma de identificador de paquete como "Newtonsoft.Json" o identificador de paquete y versión separados por "@", como "Newtonsoft.Json@13.0.3".
fr: Référence de package sous la forme d’un identificateur de package tel que « Newtonsoft.Json » ou d’un identificateur de package et d’une version séparés par « @ », comme « Newtonsoft.Json@13.0.3 ».
it: Riferimento al pacchetto sotto forma di identificatore di pacchetto, ad esempio 'Newtonsoft.Json', oppure identificatore e versione di pacchetto separati da '@', ad esempio 'Newtonsoft.Json@13.0.3'.
ko: 'Newtonsoft.Json'과 같은 패키지 식별자 또는 'Newtonsoft.Json@13.0.3'과 같이 '@'로 구분된 패키지 식별자 및 버전 형식의 패키지 참조입니다.
pl: Odwołanie do pakietu w postaci identyfikatora pakietu, takiego jak „Newtonsoft.Json” lub identyfikator pakietu i wersja rozdzielone znakiem „@”, na przykład „Newtonsoft.Json@13.0.3”.
pt_br: Referência do pacote na forma de um identificador de pacote como 'Newtonsoft.Json' ou identificador e versão do pacote separados por '@', como 'Newtonsoft.Json\@13.0.3'.
ru: Ссылка на пакет в виде идентификатора пакета, например "Newtonsoft.Json", или идентификатора пакета и версии, разделенных "@", например "Newtonsoft.Json@13.0.3".
tr: 'Newtonsoft.Json' gibi bir paket tanımlayıcısı veya 'Newtonsoft.Json@13.0.3' gibi '@' ile ayrılmış paket tanımlayıcısı ve sürümü şeklinde paket referansı.
zh_hans: 包引用采用包标识符形式，如 'Newtonsoft.Json'，或采用以 ‘@’ 分隔包标识符和版本的形式，如 ‘Newtonsoft.Json@13.0.3’。
zh_hant: 套件參考的格式為套件識別碼，例如 'Newtonsoft.Json'，或是以 '@' 分隔的套件識別碼和版本，例如 'Newtonsoft.Json@13.0.3'。

# PackageIdentityArgumentIdOrVersionIsNull
source: Package reference id and version must not be null.
cs: ID a verze odkazu na balíček nesmí být prázdné.
de: Die Paketverweis-ID und die -version dürfen nicht null sein.
es: El id. de referencia y la versión del paquete no deben ser nulos.
fr: L’ID et la version de référence du package ne doivent pas être nuls.
it: L'ID e la versione del riferimento al pacchetto non possono essere null.
ja: パッケージ参照 ID とバージョンを null 値にすることはできません。
ko: 패키지 참조 ID와 버전은 null이 아니어야 합니다.
pl: Identyfikator odwołania i wersja pakietu nie mogą mieć wartości null.
pt_br: O ID e a versão da referência do pacote não podem ser nulos.
ru: Идентификатор ссылки на пакет и версия не могут быть равны null.
tr: Paket referans kimliği ve sürümü null olmamalıdır.
zh_hans: 包引用 ID 和版本不得为 null。
zh_hant: 套件參考識別碼和版本不得為空。

# PackageIdentityArgumentVersionOptionConflict
source: Cannot specify --version when the package argument already contains a version.
cs: Nejde zadat --version, pokud argument balíčku již obsahuje verzi.
de: --version kann nicht angegeben werden, wenn das Paketargument bereits eine Version enthält.
es: No se puede especificar --version cuando el argumento del paquete ya contiene una versión.
fr: Impossible de spécifier --version lorsque l’argument de package contient déjà une version.
it: Non è possibile specificare --version se l'argomento del pacchetto contiene già una versione.
ja: パッケージ引数が既にバージョンを含んでいる場合は、--version を指定できません。
ko: 패키지 인수에 이미 버전이 포함되어 있을 때는 --version을 지정할 수 없습니다.
pl: Nie można określić parametru --version, jeśli argument pakietu zawiera już wersję.
pt_br: Não é possível especificar --version quando o argumento do pacote já contém uma versão.
ru: Невозможно указать --version, если аргумент пакета уже содержит версию.
tr: Paket bağımsız değişkeni zaten bir sürüm içeriyorsa --version belirtilemez.
zh_hans: 当包参数已包含版本时，无法指定 --version。
zh_hant: 當套件引數已包含版本時，無法指定 --version。

source: Package reference
cs: Odkaz na balíček
de: Paketverweis
es: Referencia de paquete
fr: Référence de package
it: Riferimento al pacchetto
ja: パッケージ参照
ko: 패키지 참조
pl: Odwołanie do pakietu
pt_br: Referência do pacote
ru: Ссылка на пакет
tr: Paket başvurusu
zh_hans: 包引用
zh_hant: 套件參考

# PackageVersionDescriptionDefault
source: A version of {0} of package {1}
cs: Verze {0} balíčku {1}
de: Eine Version von "{0}" des Pakets "{1}"
es: Versión de {0} del paquete {1}
fr: Une version de {0} du package {1}
it: Versione di {0} del pacchetto {1}
ja: パッケージ {1} の {0} のバージョン
ko: {0}의 버전의 패키지 {1}
pl: Wersja {0} pakietu {1}
pt_br: Uma versão do {0} do pacote {1}
ru: Версия {0} пакета {1}
tr: {1} paketinin bir {0} sürümü
zh_hans: 包 {1} 的版本 {0}
zh_hant: 封裝 {1} 的版本 {0}

# PackageVersionDescriptionForExactVersionMatch
source: Version {0} of package {1}
cs: Verze {0} balíčku {1}
de: Version "{0}" des Pakets "{1}"
es: Versión {0} del paquete {1}
fr: Une version {0} du package {1}
it: Versione {0} del pacchetto {1}
ja: パッケージ {1} のバージョン {0}
ko: 버전 {0}의 패키지 {1}
pl: Wersja {0} pakietu {1}
pt_br: Versão {0} do pacote {1}
ru: Версия {0} пакета {1}
tr: {1} paketinin {0} sürümü
zh_hans: 包 {1} 的版本 {0}
zh_hant: 封裝 {1} 的版本 {0}

# PackageVersionDescriptionForVersionWithLowerAndUpperBounds
source: A version between {0} and {1} of package {2}
cs: Verze mezi {0} a {1} balíčku {2}
de: Eine Version zwischen "{0}" und "{1}" des Pakets "{2}"
es: Una versión entre {0} y {1} del paquete {2}
fr: Une version comprise entre {0} et {1} du package {2}
it: Versione compresa tra {0} e {1} del pacchetto {2}
ja: パッケージ {2} の {0} と {1} の間のバージョン
ko: {0} 및 {1} 사이의 버전의 패키지 {2}
pl: Wersja między {0} i {1} pakietu {2}
pt_br: Uma versão entre {0} e {1} do pacote {2}
ru: Версия от {0} до {1} пакета {2}
tr: {2} paketinin {0} ve {1} arasındaki bir sürümü
zh_hans: 包 {2} 的 {0} 和 {1} 之间的版本
zh_hant: 封裝 {2} 的 {0} 與 {1} 之間的版本

# PackageVersionDescriptionForVersionWithLowerBound
source: A version higher than {0} of package {1}
cs: Verze vyšší než {0} balíčku {1}
de: Eine Version, die höher als "{0}" des Pakets "{1}" ist.
es: Una versión superior a {0} del paquete {1}
fr: Une version supérieure à {0} du package {1}
it: Versione superiore a {0} del pacchetto {1}
ja: パッケージ {1} の {0} より上位のバージョン
ko: {0}보다 높은 버전의 패키지 {1}
pl: Wersja nowsza niż {0} pakietu {1}
pt_br: Uma versão superior a {0} do pacote {1}
ru: Версия пакета {1} выше {0}
tr: {1} paketinin {0} sürümünden yüksek bir sürümü
zh_hans: 包 {1} 的高于 {0} 的版本
zh_hant: 封裝 {1} 高於 {0} 的版本

# PackageVersionDescriptionForVersionWithUpperBound
source: A version less than {0} of package {1}
cs: Verze menší než {0} balíčku {1}
de: Eine Version, die niedriger als "{0}" des Pakets "{1}" ist.
es: Versión anterior a la {0} del paquete {1}
fr: Une version inférieure à {0} du package {1}
it: Versione inferiore a {0} del pacchetto {1}
ja: パッケージ {1} の {0} 未満のバージョン
ko: {0}보다 낮은 버전의 패키지 {1}
pl: Wersja mniejsza niż {0} pakietu {1}
pt_br: Uma versão anterior a {0} do pacote {1}
ru: Версия пакета {1} ниже {0}
tr: {1} paketinin {0} sürümünden düşük bir sürümü
zh_hans: 包 {1} 的低于 {0} 的版本
zh_hant: 封裝 {1} 小於 {0} 的版本

source: Project
cs: Projekt
de: Projekt
es: Proyecto
fr: Projet
it: Progetto
ja: プロジェクト
ko: 프로젝트
pl: Projekt
pt_br: Projeto
ru: Проект
tr: Proje
zh_hans: 项目
zh_hant: 專案

# ProjectAddedToTheSolution
source: Project `{0}` added to the solution.
cs: Projekt {0} byl přidán do řešení.
de: Das Projekt "{0}" wurde der Projektmappe hinzugefügt.
es: Se ha agregado el proyecto "{0}" a la solución.
fr: Projet '{0}' ajouté à la solution.
it: Il progetto `{0}` è stato aggiunto alla soluzione.
ja: プロジェクト `{0}` をソリューションに追加しました。
ko: '{0}' 프로젝트가 솔루션에 추가되었습니다.
pl: Dodano projekt „{0}” do rozwiązania.
pt_br: O projeto ‘{0}’ foi adicionado à solução.
ru: Проект "{0}" добавлен в решение.
tr: `{0}` projesi çözüme eklendi.
zh_hans: 已将项目“{0}”添加到解决方案中。
zh_hant: 專案 `{0}` 已新增至解決方案。

# ProjectAlreadyHasAreference
source: Project already has a reference to `{0}`.
cs: Projekt už obsahuje odkaz na {0}.
de: Für das Projekt ist bereits ein Verweis auf "{0}" vorhanden.
es: El proyecto ya tiene una referencia a "{0}".
fr: Le projet a déjà une référence à '{0}'.
it: Per il progetto esiste già un riferimento a `{0}`.
ja: プロジェクトには既に `{0}` への参照が指定されています。
ko: 프로젝트에 이미 '{0}'에 대한 참조가 있습니다.
pl: Projekt zawiera już odwołanie do elementu „{0}”.
pt_br: O projeto já tem uma referência a ‘{0}’.
ru: Проект уже содержит ссылку на "{0}".
tr: Projede `{0}` başvurusu zaten var.
zh_hans: 项目已经具有对“{0}”的引用。
zh_hant: 專案已經有 `{0}` 的參考。

# ProjectArgumentDescription
source: The project file to operate on. If a file is not specified, the command will search the current directory for one.
cs: Soubor projektu, s kterým se má pracovat. Pokud soubor není zadaný, příkaz ho bude hledat v aktuálním adresáři.
de: Die zu verwendende Projektdatei. Wenn keine Datei angegeben ist, sucht der Befehl im aktuellen Verzeichnis nach einer Datei.
es: Archivo del proyecto sobre el que se va a operar. Si no se especifica un archivo, el comando buscará uno en el directorio actual.
fr: Fichier projet à traiter. Si aucun fichier n'est spécifié, la commande en recherche un dans le répertoire actif.
it: File di progetto su cui intervenire. Se non si specifica un file, il comando ne cercherà uno nella directory corrente.
ja: 操作するプロジェクト ファイル。ファイルを指定しない場合、コマンドによって現在のディレクトリから検索されます。
ko: 수행할 프로젝트 파일입니다. 파일을 지정하지 않으면 명령이 현재 디렉터리에서 파일을 검색합니다.
pl: Plik projektu, na którym ma zostać wykonana operacja. Jeśli nie określono pliku, polecenie przeszuka bieżący katalog pod jego kątem.
pt_br: O arquivo de projeto no qual operar. Se um arquivo não for especificado, o comando pesquisará um no diretório atual.
ru: Обрабатываемый файл проекта. Если файл не указан, команда будет искать его в текущем каталоге.
tr: Üzerinde işlem yapılacak proje dosyası. Bir dosya belirtilmezse, komut geçerli dizinde böyle bir dosya arar.
zh_hans: 要操作的项目文件。如果未指定文件，则命令会在当前目录下搜索一个文件。
zh_hant: 要進行作業的專案檔。若未指定檔案，此命令將會搜尋目前的目錄以取得一個檔案。

# ProjectCouldNotBeEvaluated
source: Project `{0}` could not be evaluated. Evaluation failed with following error: {1}.
cs: Projekt {0} se nepodařilo vyhodnotit. Vyhodnocení selhalo s následující chybou: {1}.
de: Das Projekt "{0}" konnte nicht ausgewertet werden. Fehler bei der Auswertung: {1}.
es: El proyecto "{0}" no se puede evaluar. Se produjo el siguiente error en la evaluación: {1}
fr: Impossible d'évaluer le projet '{0}'. Échec de l'évaluation en raison de l'erreur suivante : {1}.
it: Non è stato possibile valutare il progetto `{0}`. La valutazione non è riuscita. Errore: {1}.
ja: プロジェクト `{0}` を評価できませんでした。評価は次のエラーにより失敗しました: {1}。
ko: '{0}' 프로젝트를 평가할 수 없습니다. 다음 오류로 인해 평가가 실패했습니다. {1}.
pl: Nie można ocenić projektu „{0}”. Ocena nie powiodła się z powodu następującego błędu: {1}.
pt_br: O projeto '{0}' não pôde ser avaliado. A avaliação falhou com o seguinte erro: {1}.
ru: Не удалось оценить проект "{0}". Произошел сбой оценки со следующей ошибкой: {1}.
tr: `{0}` projesi değerlendirilemedi. Değerlendirme şu hatayla başarısız oldu: {1}.
zh_hans: 无法评估项目“{0}”。评估失败，出现以下错误: {1}。
zh_hant: 無法評估專案 `{0}`。評估失敗，發生下列錯誤: {1}。

# ProjectDoesNotExist
source: Project `{0}` does not exist.
cs: Projekt {0} neexistuje.
de: Das Projekt "{0}" ist nicht vorhanden.
es: El proyecto "{0}" no existe.
fr: Le projet '{0}' n'existe pas.
it: Il progetto `{0}` non esiste.
ja: プロジェクト `{0}` は存在しません。
ko: '{0}' 프로젝트가 없습니다.
pl: Projekt „{0}” nie istnieje.
pt_br: O projeto ‘{0}’ não existe.
ru: Проект "{0}" не существует.
tr: `{0}` projesi yok.
zh_hans: 项目“{0}”不存在。
zh_hant: 專案 `{0}` 不存在。

# ProjectDoesNotTargetFramework
source: Project `{0}` does not target framework `{1}`.
cs: Projekt {0} není určený pro cílovou architekturu {1}.
de: "{1}" ist kein Zielframework von Projekt "{0}" .
es: El proyecto "{0}" no tiene como destino la plataforma "{1}".
fr: Le projet '{0}' ne cible pas le framework '{1}'.
it: Il progetto `{0}` non è destinato al framework `{1}`.
ja: プロジェクト `{0}` はフレームワーク `{1}` をターゲットとしていません。
ko: '{0}' 프로젝트의 대상 프레임워크가 '{1}'이(가) 아닙니다.
pl: „{1}” nie jest platformą docelową projektu „{0}”.
pt_br: O projeto '{0}' não tem como destino a estrutura '{1}'.
ru: Проект "{0}" не нацелен на платформу "{1}".
tr: `{0}` projesi `{1}` çerçevesini hedeflemiyor.
zh_hans: 项目“{0}”不以框架“{1}”为目标。
zh_hant: 專案 `{0}` 未將架構 `{1}` 設為目標。

# ProjectIsInvalid
source: Project `{0}` is invalid.
cs: Projekt {0} není platný.
de: Das Projekt "{0}" ist ungültig.
es: El proyecto "{0}" no es válido.
fr: Le projet '{0}' n'est pas valide.
it: Il progetto `{0}` non è valido.
ja: プロジェクト `{0}` は無効です。
ko: '{0}' 프로젝트가 잘못되었습니다.
pl: Projekt „{0}” jest nieprawidłowy.
pt_br: O projeto ‘{0}’ é inválido.
ru: Проект "{0}" недопустим.
tr: `{0}` projesi geçersiz.
zh_hans: 项目“{0}”无效。
zh_hant: 專案 `{0}` 無效。

# ProjectNotCompatibleWithFrameworks
source: Project `{0}` cannot be added due to incompatible targeted frameworks between the two projects. Review the project you are trying to add and verify that is compatible with the following targets:
cs: Projekt {0} není možné přidat, protože cílové platformy obou projektů nejsou kompatibilní. Zkontrolujte projekt, který se pokoušíte přidat, a ověřte jeho kompatibilitu s následujícími cíli:
de: Das Projekt "{0}" kann nicht hinzugefügt werden, weil die Zielframeworks der beiden Projekte nicht kompatibel sind. Überprüfen Sie das Projekt, das Sie hinzuzufügen möchten, und stellen Sie sicher, dass es mit folgenden Zielen kompatibel ist:
es: El proyecto "{0}" no se puede agregar debido a que hay plataformas de destino no compatibles entre los dos proyectos. Revise el proyecto que intenta agregar y compruebe que sea compatible con las plataformas siguientes:
fr: Impossible d'ajouter le projet '{0}' en raison de l'incompatibilité des frameworks ciblés entre les deux projets. Passez en revue le projet que vous essayez d'ajouter, puis vérifiez sa compatibilité avec les cibles suivantes :
it: Non è possibile aggiungere il progetto `{0}` a causa di framework di destinazione incompatibili tra i due progetti. Esaminare il progetto che si sta provando ad aggiungere e verificare che sia compatibile con le destinazioni seguenti:
ja: 2 つのプロジェクト間のターゲット フレームワークに互換性がないため、プロジェクト `{0}` を追加できません。追加しようとしているプロジェクトを確認し、次のターゲットと互換性があることを確認してください:
ko: 두 프로젝트 간에 호환되지 않는 대상 프레임워크 때문에 '{0}' 프로젝트를 추가할 수 없습니다. 추가하려는 프로젝트를 검토하고 다음 대상과 호환되는지 확인하세요.
pl: Nie można dodać projektu „{0}” z powodu niezgodnych platform docelowych dwóch projektów. Sprawdź projekt, który próbujesz dodać, i zweryfikuj, czy jest zgodny z następującymi platformami docelowymi:
pt_br: O projeto '{0}' não pode ser adicionado por causa de estruturas de destino incompatíveis entre os dois projetos. Examine o projeto que você está tentando adicionar e verifique se ele é compatível com os seguintes destinos:
ru: Не удается добавить проект "{0}" из-за несовместимости целевых платформ этих двух проектов. Просмотрите добавляемый проект и убедитесь, что он совместим со следующими целевыми платформами:
tr: `{0}` projesi, iki projede hedeflenen Framework'lerin birbiriyle uyumsuz olması nedeniyle eklenemiyor. Eklemeye çalıştığınız projeyi inceleyin ve aşağıdaki hedeflerle uyumlu olduğunu doğrulayın:
zh_hans: 由于两个项目之间的目标框架不兼容，无法添加项目“{0}”。请检查要添加的项目，并验证是否与以下目标兼容:
zh_hant: 因為兩個專案間的目標 Framework 不相容，所以無法新增專案 `{0}`。請檢閱您嘗試新增的專案，並驗證其與下列目標相容:

# ProjectNotFoundInTheSolution
source: Project `{0}` could not be found in the solution.
cs: Projekt {0} se v řešení nenašel.
de: Das Projekt "{0}" wurde in der Projektmappe nicht gefunden.
es: No se encuentra el proyecto "{0}" en la solución.
fr: Projet '{0}' introuvable dans la solution.
it: Il progetto `{0}` non è stato trovato nella soluzione.
ja: プロジェクト `{0}` がソリューション内に見つかりませんでした。
ko: 솔루션에서 '{0}' 프로젝트를 찾을 수 없습니다.
pl: Nie można odnaleźć projektu „{0}” w rozwiązaniu.
pt_br: Não foi possível encontrar o projeto ‘{0}’ na solução.
ru: Проект "{0}" не удалось найти в решении.
tr: `{0}` projesi çözümde bulunamadı.
zh_hans: 未能在解决方案中找到项目“{0}”。
zh_hant: 在解決方案中找不到專案 `{0}`。
