Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FailedToReadNuGetLockFile
source: Failed to read NuGet assets file for tool package '{0}': {1}
cs: Nepovedlo se přečíst soubor prostředků NuGet pro balíček nástroje {0}: {1}
de: Fehler beim Lesen der NuGet-Ressourcendatei für Toolpaket "{0}": {1}
es: No se pudo leer el archivo de recursos de NuGet para el paquete de herramientas '{0}': {1}
fr: Échec de la lecture du fichier de ressources NuGet pour le paquetage d'outils « {0} » : {1}
it: Non è possibile leggere il file di asset NuGet per il pacchetto di strumenti '{0}': {1}
ja: ツール パッケージ '{0}' の NuGet アセット ファイルを読み取ることができませんでした: {1}
ko: '{0}' 도구 패키지의 NuGet 자산 파일을 읽지 못했습니다. {1}
pl: Nie można odczytać pliku zasobów NuGet dla pakietu narzędzi „{0}”: {1}
pt_br: Falha ao ler o arquivo de ativos do NuGet para o pacote de ferramenta '{0}': {1}
ru: Не удалось прочитать файл ресурсов NuGet для пакета инструмента "{0}": {1}
tr: '{0}' araç paketi için NuGet varlık dosyası okunamadı: {1}
zh_hans: 无法读取工具包 '{0}' 的 NuGet 资产文件: {1}
zh_hant: 無法讀取工具套件 '{0}' 的 NuGet 資產檔案: {1}

# FailedToReadPidFile
source: Failed to read pid file '{0}': {1}
cs: Nepodařilo se přečíst soubor s identifikátorem PID {0}: {1}
de: Fehler beim Lesen der PID-Datei "{0}": {1}
es: No se pudo leer el archivo pid "{0}": {1}
fr: Échec de lecture du fichier pid '{0}' : {1}
it: Non è stato possibile leggere il file '{0}' del PID: {1}
ja: pid ファイル '{0}' の読み取りに失敗しました: {1}
ko: pid 파일 '{0}'을(를) 읽지 못했습니다. {1}
pl: Nie można odczytać pliku pid „{0}”: {1}
pt_br: Falha ao ler o arquivo PID '{0}': {1}
ru: Не удалось считать файл идентификатора процесса "{0}": {1}
tr: '{0}' adlı pid dosyası okunamadı: {1}
zh_hans: 未能读取 pid 文件“{0}”: {1}
zh_hant: 無法讀取 pid 檔案 '{0}': {1}

# FailedToRemoveShellShim
source: Failed to remove tool shim for command '{0}': {1}
cs: Pro příkaz {0} se nepodařilo odebrat překrytí nástroje: {1}.
de: Fehler beim Entfernen des Tool-Shims für den Befehl "{0}": {1}
es: No se pudieron quitar correcciones de compatibilidad (shim) de herramientas para el comando "{0}": {1}
fr: Échec de retrait d'un shim d'outil pour la commande '{0}' : {1}
it: Non è stato possibile rimuovere lo shim dello strumento per il comando '{0}': {1}
ja: コマンド '{0}' でツール shim を削除できませんでした: {1}
ko: '{0}' 명령에 대해 도구 shim을 제거하지 못했습니다. {1}
pl: Nie można usunąć podkładki narzędzia dla polecenia „{0}”: {1}
pt_br: Falha ao remover o shim da ferramenta para o comando '{0}': {1}
ru: Не удалось удалить оболочку совместимости инструмента для команды "{0}": {1}
tr: '{0}' komutu için araç dolgusu kaldırılamadı: {1}
zh_hans: 未能为命令“{0}”删除工具填充程序: {1}
zh_hant: 無法為命令 '{0}' 移除工具填充碼: {1}

# FailedToResolveCommandSpec
source: {0}: failed to resolve commandspec from library.
cs: {0}: Specifikaci příkazu commandspec z knihovny se nepodařilo vyřešit.
de: {0}: commandspec aus Bibliothek konnte nicht aufgelöst werden.
es: {0}: no se pudo resolver commandspec desde la biblioteca.
fr: {0} : échec de la résolution de la spécification de commande à partir de la bibliothèque.
it: {0}: non è stato possibile risolvere commandSpec dalla libreria.
ja: {0}: ライブラリから commandspec を解決できませんでした。
ko: {0}: 라이브러리에서 commandspec을 확인하지 못했습니다.
pl: {0}: Nie udało się rozpoznać elementu commandspec z biblioteki.
pt_br: {0}: falha ao resolver commandspec por meio da biblioteca.
ru: {0}: не удалось разрешить спецификацию команды из библиотеки.
tr: {0}: kitaplıktan commandspec çözümlenemedi.
zh_hans: {0}: 未能从库解析 commandspec。
zh_hant: {0}: 無法從程式庫解析 commandspec。

# FailedToRetrieveToolConfiguration
source: Failed to retrieve tool configuration: {0}
cs: Nepodařilo se načíst konfiguraci nástroje: {0}.
de: Fehler beim Abrufen der Toolkonfiguration: {0}
es: Error al recuperar la configuración de la herramienta: {0}
fr: Échec de récupération de la configuration de l'outil : {0}
it: Non è stato possibile recuperare la configurazione dello strumento: {0}
ja: ツールの構成を取得できませんでした: {0}
ko: 도구 구성을 검색하지 못했습니다. {0}
pl: Nie można pobrać konfiguracji narzędzia: {0}
pt_br: Falha ao recuperar a configuração da ferramenta: {0}
ru: Не удалось получить конфигурацию инструмента: {0}
tr: Araç yapılandırması alınamadı: {0}
zh_hans: 无法检索工具配置: {0}
zh_hant: 無法擷取工具組態: {0}

# FailedToSetToolsPathEnvironmentVariable
source: Failed to add '{0}' to the PATH environment variable. Add this directory to your PATH to use tools installed with 'dotnet tool install'.
cs: Nepovedlo se přidat adresář {0} do proměnné prostředí PATH. Přidejte tento adresář do proměnné PATH, abyste mohli používat nástroje nainstalované pomocí dotnet tool install.
de: Fehler beim Hinzufügen von "{0}" zur PATH-Umgebungsvariable. Fügen Sie dieses Verzeichnis Ihrem PATH hinzu, um mit "dotnet tool install" installierte Tools zu verwenden.
es: No se pudo agregar "{0}" a la variable de entorno PATH. Agregue este directorio a PATH para usar las herramientas instaladas con "dotnet tool install".
fr: L'ajout de '{0}' à la variable d'environnement PATH a échoué. Ajoutez ce répertoire à votre variable PATH pour pouvoir utiliser les outils installés avec 'dotnet tool install'.
it: Non è stato possibile aggiungere '{0}' alla variabile di ambiente PATH. Aggiungere questa directory a PATH per usare gli strumenti installati con 'dotnet tool install'.
ja: '{0}' を PATH 環境変数に追加できませんでした。'dotnet tool install' でインストールしたツールを使用するには、このディレクトリを PATH に追加します。
ko: PATH 환경 변수에 '{0}'을(를) 추가하지 못했습니다. 'dotnet tool install'로 설치한 도구를 사용하려면 이 디렉터리를 PATH에 추가하세요.
pl: Nie można dodać katalogu „{0}” do zmiennej środowiskowej PATH. Dodaj ten katalog do zmiennej PATH, aby używać narzędzi zainstalowanych za pomocą polecenia „dotnet tool install”.
pt_br: Falha ao adicionar '{0}' à variável de ambiente PATH. Adicione este diretório ao seu PATH para usar as ferramentas instaladas com 'dotnet tool install'.
ru: Не удалось добавить "{0}" в переменную среды PATH. Добавьте этот каталог в PATH, чтобы использовать средства, установленные с помощью команды dotnet tool install.
tr: '{0}' dizini PATH ortam değişkenine eklenemedi. 'dotnet tool install' ile yüklenen araçları kullanmak için bu dizini PATH değişkeninize ekleyin.
zh_hans: 未能将“{0}”添加到 PATH 环境变量。请将此目录添加到 PATH，以使用通过 "dotnet tool install" 安装的工具。
zh_hant: 無法將 '{0}' 新增到 PATH 環境變數。請將此目錄新增到您的 PATH，以使用由 'dotnet tool install' 所安裝的工具。

# FailedToUninstallToolPackage
source: Failed to uninstall tool package '{0}': {1}
cs: Nepodařilo se odinstalovat balíček nástroje {0}: {1}.
de: Fehler beim Deinstallieren des Toolpakets "{0}": {1}
es: No se pudo desinstalar el paquete de herramientas "{0}": {1}
fr: Échec de désinstallation du package d'outils '{0}' : {1}
it: Non è stato possibile disinstallare il pacchetto '{0}' dello strumento: {1}
ja: ツール パッケージ '{0}' をアンインストールできませんでした: {1}
ko: 도구 패키지 '{0}'을(를) 제거하지 못했습니다. {1}
pl: Nie można odinstalować pakietu narzędzia „{0}”: {1}
pt_br: Falha ao desinstalar o pacote da ferramenta '{0}': {1}
ru: Не удалось удалить пакет инструментов "{0}": {1}
tr: '{0}' araç paketi kaldırılamadı: {1}
zh_hans: 未能卸载工具包“{0}”: {1}
zh_hant: 無法將工具套件 '{0}' 解除安裝: {1}

# FailedToValidatePackageSigning
source: Failed to validate package signing. {0}
cs: Nepodařilo se ověřit podepisování balíčku. {0}
de: Fehler bei der Überprüfung der Paketsignierung. {0}
es: No se pudo validar la firma del paquete. {0}
fr: Nous n’avons pas pu valider la signature de package. {0}
it: Non è possibile convalidare la firma del pacchetto. {0}
ja: パッケージ署名を検証できませんでした。 {0}
ko: 패키지 서명을 확인하지 못했습니다. {0}
pl: Nie można zweryfikować podpisywania pakietu. {0}
pt_br: Falha na validação da assinatura do pacote. {0}
ru: Не удалось проверить подпись пакета. {0}
tr: Paket imzası doğrulanamadı. {0}
zh_hans: 未能验证包签名。 {0}
zh_hant: 無法驗證套件簽署。 {0}

# FieldCommandsIsMissing
source: Missing 'commands' entry.
cs: Chybí položka commands.
de: Eintrag "commands" fehlt.
es: Falta la entrada "commands".
fr: Entrée 'commands' manquante.
it: Manca la voce 'commands'.
ja: 'commands' エントリがありません。
ko: 'commands' 항목이 없습니다.
pl: Brak wpisu „commands”.
pt_br: Entrada 'commands' ausente.
ru: Отсутствует запись "commands".
tr: 'commands' girişi eksik.
zh_hans: 缺少 "commands" 条目。
zh_hant: 遺漏 'commands' 項目。

source: File
cs: Soubor
de: Datei
es: archivo
fr: fichier
ja: ファイル
ko: 파일
pl: Plik
pt_br: Arquivo
ru: Файл
tr: Dosya
zh_hans: 文件
zh_hant: 檔案

# FileArgumentDescription
source: The file-based app to operate on.
cs: Souborová aplikace, se kterou se má pracovat.
de: Die dateibasierte App, die verwendet werden soll.
es: La aplicación basada en archivos en la que se va a operar.
fr: Application basée sur des fichiers sur laquelle effectuer des opérations.
it: L'app basata su file su cui eseguire operazioni.
ja: 操作するファイル ベースのアプリ。
ko: 작동할 파일 기반 앱입니다.
pl: Aplikacja oparta na plikach, na której ma działać.
pt_br: O aplicativo baseado no arquivo a ser operado.
ru: Приложение на основе файла для работы.
tr: İşlem yapılacak dosya tabanlı uygulama.
zh_hans: 要操作的基于文件的应用。
zh_hant: 要執行的檔案型應用程式。

# FormatVersionIsHigher
source: Format version is higher than supported. This tool may not be supported in this SDK version. Update your SDK.
cs: Verze formátu je vyšší, než se podporuje. Tento nástroj se možná v této verzi SDK nepodporuje. Aktualizujte sadu SDK.
de: Die Formatversion ist höher als unterstützt. Dieses Tool wird in dieser SDK-Version möglicherweise nicht unterstützt. Aktualisieren Sie Ihr SDK.
es: La versión de formato es superior a la admitida. Puede que la herramienta no sea compatible con esta versión del SDK. Actualice el SDK.
fr: Version de format supérieure à la version prise en charge. Cet outil risque de ne pas être pris en charge dans cette version de SDK. Mettez à jour votre SDK.
it: La versione di Format è successiva a quella supportata. È possibile che questo strumento non sia supportato in questa versione dell'SDK. Aggiornare l'SDK.
ja: 形式のバージョンがサポートされているものを超えています。このツールはこのバージョンの SDK ではサポートされていない可能性があります。SDK を更新します。
ko: 형식 버전이 지원되는 버전보다 높습니다. 이 SDK 버전에서 이 도구를 지원하지 않을 수 있습니다. SDK를 업데이트하세요.
pl: Wersja formatu jest nowsza niż obsługiwana. To narzędzie może nie być obsługiwane w tej wersji zestawu SDK. Zaktualizuj zestaw SDK.
pt_br: A versão do formato é superior à versão compatível. Pode não haver suporte para esta ferramenta nesta versão do SDK. Atualize o SDK.
ru: Версия формата выше поддерживаемой. Возможно, средство не поддерживается в этой версии пакета SDK. Обновите пакет SDK.
tr: Biçim sürümü desteklenenden daha yüksek. Bu araç bu SDK sürümünde desteklenmeyebilir. SDK’nızı güncelleştirin.
zh_hans: 格式版本高于受支持的版本。该 SDK 版本可能不支持此工具。请更新 SDK。
zh_hant: 格式版本高於支援的版本。此 SDK 版本可能不支援這項工具。請更新您的 SDK。

# FormatVersionIsMalformed
source: Format version is malformed. This tool may not be supported in this SDK version. Contact the author of the tool.
cs: Verze formátu je chybně vytvořená. Tento nástroj se možná v této verzi SDK nepodporuje. Obraťte se na autora nástroje.
de: Die Formatversion ist fehlerhaft. Dieses Tool wird in dieser SDK-Version möglicherweise nicht unterstützt. Wenden Sie sich an den Autor des Tools.
es: La versión de formato es incorrecta. Puede que la herramienta no sea compatible con esta versión del SDK. Póngase en contacto con el autor de la herramienta.
fr: Version de format incorrecte. Cet outil risque de ne pas être pris en charge dans cette version du SDK. Contactez l'auteur de l'outil.
it: La versione di Format non è corretta. È possibile che questo strumento non sia supportato in questa versione dell'SDK. Contattare l'autore dello strumento.
ja: 形式のバージョンが無効です。このツールはこのバージョンの SDK ではサポートされていない可能性があります。ツールの作成者にお問い合わせください。
ko: 형식 버전의 형식이 잘못되었습니다. 이 SDK 버전에서 이 도구를 지원하지 않을 수 있습니다. 도구 작성자에게 문의하세요.
pl: Wersja formatu jest nieprawidłowo sformułowana. To narzędzie może nie być obsługiwane w tej wersji zestawu SDK. Skontaktuj się z autorem narzędzia.
pt_br: A versão do formato está malformada. Pode não haver suporte para esta ferramenta nesta versão do SDK. Entre em contato com o autor da ferramenta.
ru: Версия формата имеет неправильный формат. Возможно, средство не поддерживается в этой версии пакета SDK. Обратитесь к автору средства.
tr: Biçim sürümü hatalı biçimlendirilmiş. Bu araç bu SDK sürümünde desteklenmeyebilir. Aracın yazarına başvurun.
zh_hans: 格式版本格式不正确。该 SDK 版本可能不支持此工具。请联系工具作者。
zh_hant: 格式版本的格式不正確。此 SDK 版本可能不支援這項工具。請連絡該工具的作者。

# FormatVersionIsMissing
source: Format version is missing. This tool may not be supported in this SDK version. Contact the author of the tool.
cs: Verze formátu chybí. Tento nástroj se možná v této verzi SDK nepodporuje. Obraťte se na autora nástroje.
de: Die Formatversion fehlt. Dieses Tool wird in dieser SDK-Version möglicherweise nicht unterstützt. Wenden Sie sich an den Autor des Tools.
es: Falta la versión de formato. Puede que la herramienta no sea compatible con esta versión del SDK. Póngase en contacto con el autor de la herramienta.
fr: Version de format manquante. Cet outil risque de ne pas être pris en charge dans cette version du SDK. Contactez l'auteur de l'outil.
it: La versione di Format non è presente. È possibile che questo strumento non sia supportato in questa versione dell'SDK. Contattare l'autore dello strumento.
ja: 形式のバージョンが見つかりません。このツールはこのバージョンの SDK ではサポートされていない可能性があります。ツールの作成者にお問い合わせください。
ko: 형식 버전이 누락되었습니다. 이 SDK 버전에서 이 도구를 지원하지 않을 수 있습니다. 도구 작성자에게 문의하세요.
pl: Brak wersji formatu. To narzędzie może nie być obsługiwane w tej wersji zestawu SDK. Skontaktuj się z autorem narzędzia.
pt_br: A versão do formato está ausente. Pode não haver suporte para esta ferramenta nesta versão do SDK. Entre em contato com o autor da ferramenta.
ru: Версия формата отсутствует. Возможно, средство не поддерживается в этой версии пакета SDK. Обратитесь к автору средства.
tr: Biçim sürümü eksik. Bu araç bu SDK sürümünde desteklenmeyebilir. Aracın yazarına başvurun.
zh_hans: 缺少格式版本。该 SDK 版本可能不支持此工具。请联系工具作者。
zh_hant: 遺漏格式版本。此 SDK 版本可能不支援這項工具。請連絡該工具的作者。

# FoundInvalidProject
source: Found a project `{0}` but it is invalid.
cs: Projekt {0} se našel, ale není platný.
de: Ein Projekt "{0}" wurde gefunden, ist aber ungültig.
es: Se ha encontrado el proyecto "{0}", pero no es válido.
fr: Projet '{0}' trouvé, mais il n'est pas valide.
it: È stato trovato un progetto `{0}`, che però non è valido.
ja: プロジェクト `{0}` が見つかりましたが、有効ではありません。
ko: '{0}' 프로젝트가 있지만 잘못되었습니다.
pl: Znaleziono projekt „{0}”, ale jest on nieprawidłowy.
pt_br: Foi encontrado um projeto ‘{0}’, mas ele é inválido.
ru: Найден проект "{0}", однако он недопустим.
tr: Bir `{0}` projesi bulundu ancak geçersiz.
zh_hans: 找到项目“{0}”但无效。
zh_hant: 找到專案 `{0}` 但無效。

# FoundToolLockFile
source: {0}: found tool lockfile at : {1}
cs: {0}: Zjištěný lockfile nástroje na: {1}
de: {0}: Toolsperrdatei gefunden unter: {1}
es: {0}: se encontró el archivo de bloqueo de herramienta en: {1}
fr: {0} : fichier de verrouillage d'outil trouvé sur : {1}
it: {0}: il file di blocco dello strumento è stato trovato in: {1}
ja: {0}: {1} でツールのロックファイルが見つかりました
ko: {0}: {1}에서 도구 잠금 파일을 찾았습니다.
pl: {0}: Odnaleziono plik blokady narzędzia w lokalizacji: {1}
pt_br: {0}: arquivo de bloqueio de ferramenta encontrado em: {1}
ru: {0}: найден файл блокировки средства в: {1}.
tr: {0}: araç kilit dosyası şurada bulundu : {1}
zh_hans: {0}: 在 {1} 中找到工具 lockfile
zh_hant: {0}: 於 {1} 找到工具鎖定檔案

# FrameworkDependentOptionDescription
source: Publish your application as a framework dependent application. A compatible .NET runtime must be installed on the target machine to run your application.
cs: Publikujte svoji aplikaci jako aplikaci závislou na architektuře. Aby bylo možné vaši aplikaci spustit, musí být na cílovém počítači nainstalovaný kompatibilní modul runtime .NET.
de: Veröffentlichen Sie Ihre Anwendung als eine von einem Framework abhängige Anwendung. Eine kompatible .NET-Runtime muss auf dem Zielcomputer installiert sein, um Ihre Anwendung ausführen zu können.
es: Publique la aplicación como una aplicación dependiente del marco de trabajo. para ejecutar la aplicación debe instalarse un entorno de ejecución de .NET compatible en el equipo de destino.
fr: Publiez votre application en tant qu'application dépendante du framework. Un runtime .NET compatible doit être installé sur la machine cible pour exécuter votre application.
it: Pubblicare l'applicazione come applicazione dipendente dal framework. Per eseguire l'applicazione, è necessario installare un runtime .NET compatibile nel computer di destinazione.
ja: アプリケーションをフレームワーク依存アプリケーションとして公開します。アプリケーションを実行するには、対象のコンピューターで互換性のある .NET ランタイムをインストールする必要があります。
ko: 애플리케이션을 프레임워크 종속 애플리케이션으로 게시합니다. 애플리케이션을 실행하려면 호환되는 .NET 런타임이 대상 시스템에 설치되어 있어야 합니다.
pl: Opublikuj aplikację jako aplikację zależną od frameworku. Aby można było uruchomić aplikację, na maszynie docelowej musi być zainstalowane zgodne środowisko uruchomieniowe platformy .NET.
pt_br: Publique o seu aplicativo como um aplicativo dependente de estrutura. Um runtime do .NET compatível precisa ser instalado no computador de destino para executar o aplicativo.
ru: Опубликуйте приложение как зависимое от платформы. Для запуска приложения на целевом компьютере должна быть установлена совместимая среда выполнения .NET.
tr: Uygulamanızı çerçeveye bağımlı bir uygulama olarak yayımlayın. Uygulamanızı çalıştırmak için hedef makineye uyumlu bir .NET çalışma zamanı yüklenmelidir.
zh_hans: 将应用程序发布为依赖框架的应用程序。目标计算机上必须安装兼容的 .NET 运行时才能运行该应用程序。
zh_hant: 將您的應用程式發佈為架構相依的應用程式。必須在目標機器上安裝相容的 .NET 執行階段，才能執行您的應用程式。

# GeneratingDepsJson
source: Generating deps.json at: {0}
cs: Generování souboru deps.json do: {0}
de: "deps.json" wird erzeugt unter: {0}
es: Generando deps.json en: {0}
fr: Génération de deps.json sur : {0}
it: Generazione del file deps.json in: {0}
ja: {0} で deps.json を生成しています
ko: {0}에서 deps.json 생성 중
pl: Generowanie pliku deps.json w lokalizacji: {0}
pt_br: Gerando deps.json em: {0}
ru: Выполняется создание deps.json в: {0}.
tr: Şu konumda deps.json oluşturuluyor: {0}
zh_hans: 即将生成 deps.json: {0}
zh_hant: 正在於 {0} 產生 deps.json

# IgnoringPreferCLIRuntimeFile
source: {0}: Ignoring prefercliruntime file as the tool target framework ({1}) has a different major version than the current CLI runtime ({2})
cs: {0}: Soubor prefercliruntime se ignoruje, protože cílová architektura nástroje ({1}) má jinou hlavní verzi než aktuální modul runtime rozhraní příkazového řádku ({2}).
de: {0}: Die Datei "prefercliruntime" wird ignoriert, da das Tool-Ziellaufwerk ({1}) eine andere Hauptversion aufweist als die aktuelle CLI-Runtime ({2}).
es: {0}: se ignorará el archivo prefercliruntime dado que la plataforma de destino de la herramienta ({1}) tiene una versión mayor que el entorno de tiempo de ejecución actual de la CLI ({2})
fr: {0} : fichier prefercliruntime ignoré, car le framework cible de l'outil ({1}) a une autre version principale que celle du runtime CLI actuel ({2})
it: {0}: il file prefercliruntime verrà ignorato perché la versione principale del framework di destinazione dello strumento ({1}) è diversa rispetto a quella del runtime corrente dell'interfaccia della riga di comando ({2})
ja: {0}: ツール ターゲット フレームワーク ({1}) のメジャー バージョンが現在の CLI ランタイム ({2}) と異なるため、prefercliruntime ファイルは無視されます。
ko: {0}: 도구 대상 프레임워크({1})에 현재 CLI 런타임({2})과 다른 주 버전이 있으므로 prefercliruntime 파일 무시
pl: {0}: plik prefercliruntime zostanie zignorowany, ponieważ wersja platforma docelowa narzędzia ({1}) różni się od wersji bieżącego środowiska uruchomieniowego interfejsu wiersza polecenia ({2})
pt_br: {0}: ignorando o arquivo prefercliruntime, uma vez que a estrutura de destino da ferramenta ({1}) tem uma versão principal diferente daquela do tempo de execução atual da CLI ({2})
ru: {0}: файл prefercliruntime игнорируется, так как основные номера версии целевой платформы средства ({1}) и текущей среды выполнения CLI ({2}) различаются
tr: {0}: Araç hedef çerçevesi ({1}), geçerli CLI çalışma zamanından farklı bir ana sürüme ({2}) sahip olduğundan prefercliruntime dosyası yok sayılıyor
zh_hans: {0}: 忽略 prefercliruntime 文件，因为工具目标框架({1})的主要版本不是当前 CLI 运行时({2})
zh_hant: {0}: 因為工具目標架構 ({1}) 的主要版本與目前的 CLI 執行階段 ({2}) 不同，所以將忽略 prefercliruntime 檔案

# InPackage
source: In package {0}: {1}
cs: V balíčku {0}: {1}
de: Im Paket "{0}": {1}
es: En el paquete {0}: {1}
fr: Dans le package {0} : {1}
it: Nel pacchetto {0}: {1}
ja: パッケージ {0} で: {1}
ko: 패키지 {0}: {1}
pl: W pakiecie {0}: {1}
pt_br: No pacote {0}: {1}
ru: В пакете {0}: {1}
tr: {0} paketinde: {1}
zh_hans: 在包 {0} 中: {1}
zh_hant: 位於套件 {0} 中: {1}

# IncorrectlyFormattedEnvironmentVariables
source: Incorrectly formatted environment variables: {0}
cs: Nesprávně formátované proměnné prostředí: {0}
de: Falsch formatierte Umgebungsvariablen: {0}
es: Variables de entorno con formato incorrecto: {0}
fr: Mise en forme incorrecte des variables d’environnement : {0}
it: Variabili di ambiente formattate in modo non corretto: {0}
ja: 不適切な形式の環境変数です: {0}
ko: 형식이 잘못된 환경 변수: {0}
pl: Niepoprawnie sformatowane zmienne środowiskowe: {0}
pt_br: Variáveis de ambiente formatadas incorretamente: {0}
ru: Неправильный формат переменных среды: {0}
tr: Yanlış biçimlendirilmiş ortam değişkenleri: {0}
zh_hans: 环境变量格式不正确: {0}
zh_hant: 環境變數格式不正確: {0}

# InvalidCommandResolverArguments
source: {0}: invalid commandResolverArguments
cs: {0}: Neplatné hodnoty commandResolverArguments
de: {0}: ungültige commandResolverArguments
es: {0}: commandResolverArguments no válidos
fr: {0} : commandResolverArguments non valide
it: {0}: commandResolverArguments non valido
ja: {0}: 無効な commandResolverArguments
ko: {0}: 잘못된 commandResolverArguments
pl: {0}: Nieprawidłowa wartość elementu commandResolverArguments
pt_br: {0}: commandResolverArguments inválido
ru: {0}: недопустимый commandResolverArguments
tr: {0}: geçersiz commandResolverArguments
zh_hans: {0}: 无效的 commandResolverArguments
zh_hant: {0}: commandResolverArguments 無效

# InvalidInputTypeInteger
source: {0} should be an integer
cs: {0} by mělo být celé číslo.
de: {0} muss eine ganze Zahl sein.
es: {0} debe ser un entero
fr: {0} doit être un entier
it: {0} deve essere un numero intero
ja: {0} は整数でなければなりません
ko: {0}은(는) 정수여야 합니다.
pl: Wartość {0} powinna być liczbą całkowitą
pt_br: {0} deve ser um inteiro
ru: {0} должно быть целым числом.
tr: {0} bir tamsayı olmalıdır
zh_hans: {0} 应为整数
zh_hant: {0} 應為整數

# InvalidManifestFilePrefix
source: Invalid manifest file. Path {0}: {1}
cs: Neplatný soubor manifestu. Cesta {0}: {1}
de: Ungültige Manifestdatei. Pfad "{0}": {1}
es: Archivo de manifiesto no válido. Ruta de acceso {0}: {1}
fr: Fichier manifeste non valide. Chemin {0} : {1}
it: Il file manifesto non è valido. Percorso: {0}: {1}
ja: マニフェスト ファイルが無効です。パス {0}: {1}
ko: 매니페스트 파일이 잘못되었습니다. 경로 {0}: {1}
pl: Nieprawidłowy plik manifestu. Ścieżka {0}: {1}
pt_br: Arquivo de manifesto inválido. Caminho de {0}: {1}
ru: Недопустимый файл манифеста. Путь {0}: {1}
tr: Geçersiz bildirim dosyası. Yol {0}: {1}
zh_hans: 清单文件无效。路径 {0}: {1}
zh_hant: 資訊清單檔無效。路徑 {0}: {1}

# InvalidProject
source: Invalid project `{0}`.
cs: Projekt {0} není platný.
de: Ungültiges Projekt "{0}".
es: El proyecto "{0}" no es válido.
fr: Projet '{0}' non valide.
it: Il progetto `{0}` non è valido.
ja: 無効なプロジェクト `{0}`。
ko: '{0}' 프로젝트가 잘못되었습니다.
pl: Nieprawidłowy projekt „{0}”.
pt_br: Projeto ‘{0}’ inválido.
ru: Недопустимый проект "{0}".
tr: `{0}` projesi geçersiz.
zh_hans: 项目“{0}”无效。
zh_hant: 專案 `{0}` 無效。

# InvalidProjectWithExceptionMessage
source: Invalid project `{0}`. {1}.
cs: Neplatný projekt {0}. {1}.
de: Ungültiges Projekt "{0}". {1}.
es: El proyecto "{0}" no es válido. {1}.
fr: Projet non valide : '{0}'. {1}.
it: Il progetto `{0}` non è valido. {1}.
ja: 無効なプロジェクト `{0}`。{1}。
ko: '{0}' 프로젝트가 잘못되었습니다. {1}.
pl: Nieprawidłowy projekt „{0}”. {1}.
pt_br: Projeto inválido `{0}`. {1}.
ru: Недопустимый проект "{0}". {1}.
tr: `{0}` projesi geçersiz. {1}.
zh_hans: 项目“{0}”无效。{1}。
zh_hant: 專案 `{0}` 無效。{1}。
