Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

source: Update
cs: Aktualizovat
de: Aktualisieren
es: Actualizar
fr: Mettre à jour
it: Aggiorna
ja: 更新
ko: 업데이트
pl: Aktualizuj
pt_br: Atualização
ru: Обновить
tr: Güncelleştir
zh_hans: 更新
zh_hant: 更新

# VBCSCompilerServer
source: VB/C# compiler server
cs: Server kompilátoru VB/C#
es: Servidor del compilador de VB o C#
fr: Serveur de compilation VB/C#
it: Server del compilatore VB/C#
ja: VB/C# コンパイラ サーバー
ko: VB/C# 컴파일러 서버
pl: Serwer kompilatora VB/C#
pt_br: Servidor do compilador VB/C#
ru: Сервер компилятора VB или C#
tr: VB/C# derleyici sunucusu
zh_hans: VB/C# 编译器服务器
zh_hant: VB/C# 編譯器伺服器

source: Value
cs: Hodnota
de: Wert
es: Valor
fr: Valeur
it: Valore
ja: 値
ko: 값
pl: Wartość
pt_br: Valor
ru: Значение
tr: Değer
zh_hans: 值
zh_hant: 值

# VerbosityOptionDescription
source: Set the MSBuild verbosity level. Allowed values are q[uiet], m[inimal], n[ormal], d[etailed], and diag[nostic].
cs: Nastavuje úroveň podrobností MSBuild. Povolené hodnoty jsou q [tichý], m [minimální], n [normální], d [podrobný] a diag [diagnostický].
de: Hiermit wird der Ausführlichkeitsgrad von MSBuild festgelegt. Zulässige Werte sind "q[uiet]", "m[inimal]", "n[ormal]", "d[etailed]" und "diag[nostic]".
es: Establece el nivel de detalle de MSBuild. Los valores permitidos son q[uiet], m[inimal], n[ormal], d[etailed] y diag[nostic].
fr: Définissez le niveau de verbosité MSBuild. Les valeurs autorisées sont q[uiet], m[inimal], n[ormal], d[etailed] et diag[nostic].
it: Consente di impostare il livello di dettaglio di MSBuild. I valori consentiti sono q[uiet], m[inimal], n[ormal], d[etailed] e diag[nostic].
ja: MSBuild の詳細レベルを設定します。使用可能な値: q[uiet]、m[inimal]、n[ormal]、d[etailed]、diag[nostic]。
ko: MSBuild 세부 정보 표시 수준을 설정합니다. 허용되는 값은 q[uiet], m[inimal], n[ormal], d[etailed] 및 diag[nostic]입니다.
pl: Ustaw poziom szczegółowości programu MSBuild. Dopuszczalne wartości to: q[uiet], m[inimal], n[ormal], d[etailed] i diag[nostic].
pt_br: Definir o nível de detalhamento do MSBuild. Os valores permitidos são q[uiet], m[inimal], n[ormal], d[etailed] e diag[nostic].
ru: Установка уровня детализации MSBuild. Допустимые значения: q[uiet], m[inimal], n[ormal], d[etailed] и diag[nostic].
tr: MSBuild ayrıntı düzeyini ayarlar. İzin verilen değerler: q[uiet], m[inimal], n[ormal], d[etailed] ve diag[nostic].
zh_hans: 设置 MSBuild 详细程度。允许值为 q[uiet]、m[inimal]、n[ormal]、d[etailed] 和 diag[nostic]。
zh_hant: 設定 MSBuild 的詳細程度層級。允許的值為 q[uiet]、m[inimal]、n[ormal]、d[etailed] 及 diag[nostic]。

# VerifyingNuGetPackageSignature
source: Verified that the NuGet package "{0}" has a valid signature.
cs: Ověřilo se, že balíček NuGet {0} má platný podpis.
de: Es wurde überprüft, ob das NuGet-Paket „{0}“ über eine gültige Signatur verfügt.
es: Se comprobó que el paquete NuGet "{0}" tiene una firma válida.
fr: Nous avons vérifié que le package NuGet « {0} » a une signature valide.
it: Verifica della validità della firma del pacchetto NuGet "{0}" eseguita.
ja: NuGet パッケージ "{0}" に有効な署名があることを確認しました。
ko: NuGet 패키지 "{0}"에 유효한 서명이 있음을 확인했습니다.
pl: Zweryfikowano, że pakiet NuGet „{0}” ma prawidłowy podpis.
pt_br: Verificado que o pacote NuGet "{0}" tem uma assinatura válida.
ru: Проверено, что пакет NuGet "{0}" содержит допустимую подпись.
tr: "{0}" NuGet paketinin geçerli imzaya sahip olduğu doğrulandı.
zh_hans: 已验证 NuGet 包“{0}”具有有效签名。
zh_hant: 已驗證 NuGet 套件「{0}」具備有效簽章。

# VersionForPackageCouldNotBeResolved
source: Version for package `{0}` could not be resolved.
cs: Verzi balíčku {0} se nepodařilo vyřešit.
de: Version für Paket "{0}" konnte nicht aufgelöst werden.
es: No se pudo resolver la versión del paquete "{0}".
fr: La version du package '{0}' n'a pas pu être résolue.
it: Non è stato possibile risolvere la versione per il pacchetto `{0}`.
ja: パッケージ `{0}` のバージョンを解決できませんでした。
ko: '{0}' 패키지의 버전을 확인할 수 없습니다.
pl: Nie można rozpoznać wersji pakietu „{0}”.
pt_br: A versão do pacote '{0}' não pôde ser resolvida.
ru: Не удалось разрешить версию для пакета "{0}".
tr: `{0}` paketi için sürüm çözümlenemedi.
zh_hans: 无法解析包“{0}”的版本。
zh_hant: 無法解析套件 `{0}` 的版本。

# VersionIsInvalid
source: Version {0} is invalid.
cs: Verze {0} není platná.
de: Version {0} ist ungültig.
es: La versión {0} no es válida.
fr: La version {0} est non valide.
it: La versione {0} non è valida.
ja: バージョン {0} は無効です。
ko: 버전 {0}이(가) 잘못되었습니다.
pl: Wersja {0} jest nieprawidłowa.
pt_br: A versão {0} não é válida.
ru: Версия {0} не является допустимой.
tr: {0} sürümü geçersiz.
zh_hans: 版本 {0} 无效。
zh_hant: 版本 {0} 不正確。

# WorkloadIntegrityCheckError
source: An issue was encountered verifying workloads. For more information, run "dotnet workload update".
cs: Při ověřování úloh došlo k problému. Další informace získáte spuštěním příkazu „dotnet workload update“.
de: Problem beim Verifizieren der Workloads. Führen Sie "dotnet workload update" aus, um weitere Informationen zu erhalten.
es: Se encontró un problema al comprobar las cargas de trabajo. Para obtener más información, ejecute "dotnet workload update".
fr: Un problème s’est produit lors de la vérification des charges de travail. Pour plus d’informations, exécutez « dotnet workload update ».
it: Si è verificato un problema nella verifica dei carichi di lavoro. Per altre informazioni, eseguire "dotnet workload update".
ja: ワークロードの検証中に問題が発生しました。詳細については、"dotnet workload update" を実行してください。
ko: 워크로드를 확인하는 동안 문제가 발생했습니다. 자세한 내용을 확인하려면 "dotnet workload update"를 실행하세요.
pl: Napotkano problem podczas weryfikowania obciążeń. Aby uzyskać więcej informacji, uruchom polecenie „dotnet workload update”.
pt_br: Foi encontrado um problema ao verificar as cargas de trabalho. Para obter mais informações, execute "dotnet workload update".
ru: При проверке рабочих нагрузок возникла проблема. Для получения дополнительных сведений выполните команду "dotnet workload update".
tr: İş yükleri doğrulanırken bir sorunla karşılaşıldı. Daha fazla bilgi için "dotnet workload update" komutunu çalıştırın.
zh_hans: 验证工作负载时遇到问题。有关详细信息，请运行 "dotnet workload update"。
zh_hant: 驗證工作負載時發生問題。如需詳細資訊，請執行 "dotnet workload update"。

# YesOptionDescription
source: Accept all confirmation prompts using "yes."
cs: Přijměte všechny výzvy k potvrzení kliknutím „ano“.
de: Alle Bestätigungsaufforderungen mit "Ja" akzeptieren.
es: Acepte todas las solicitudes de confirmación mediante "sí."
fr: Acceptez toutes les invites de confirmation en utilisant « oui ».
it: Accetta tutte le richieste di conferma con "yes".
ja: [はい] を使用して、すべての確認プロンプトを受け入れます。
ko: "예"를 사용하여 모든 확인 프롬프트를 수락합니다.
pl: Zaakceptuj wszystkie monity o potwierdzenie, używając słowa „tak”.
pt_br: Aceite todas as solicitações de confirmação usando "sim."
ru: Принимать все запросы подтверждения с помощью "да".
tr: "Evet" seçeneğini kullanarak tüm onay istemlerini kabul edin.
zh_hans: 使用“是”接受所有确认提示。
zh_hant: 使用「是」，以接受所有確認提示。

# CmdEnvironmentVariableDescription
source: Sets the value of an environment variable. Creates the variable if it does not exist, overrides if it does. This will force the tests to be run in an isolated process. This argument can be specified multiple times to provide multiple variables. Examples: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
es: Establece el valor de una variable de entorno. Crea la variable si no existe o la reemplaza en caso de que exista. Esto forzará la ejecución de las pruebas en un proceso aislado. Este argumento se puede especificar varias veces para proporcionar múltiples variables. Ejemplos: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
ko: 환경 변수의 값을 설정합니다. 변수가 없는 경우 변수를 만들고, 변수가 있으면 재정의합니다. 이는 테스트가 격리된 프로세스에서 강제로 실행되도록 합니다. 이 인수를 여러 번 지정하여 여러 변수를 제공할 수 있습니다. 예: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi
pt_br: Define o valor de uma variável de ambiente. Criará a variável quando ela não existir e a substituirá quando existir. Isso forçará a execução dos testes em um processo isolado. Esse argumento pode ser especificado várias vezes para fornecer várias variáveis. Exemplos: -e VARIABLE=abc -e VARIABLE="valor com espaços" -e VARIABLE="valor;separado com;ponto e vírgula" -e VAR1=abc -e VAR2=def -e VAR3=ghi
ru: Устанавливает значение переменной среды. Если переменной среды не существует, она создается. Если переменная среды существует, она переопределяется. Этот аргумент подразумевает принудительное выполнение тестов в изолированном процессе. Этот аргумент может быть указан несколько раз для нескольких переменных среды. Примеры: -e VARIABLE=abc -e VARIABLE="значение с пробелами" -e VARIABLE="значение;разделенное;точками;с;запятыми" -e VAR1=abc -e VAR2=def -e VAR3=ghi
zh_hant: 設定環境變數的值。 若變數不存在，則加以建立; 若有，則予以覆寫。 這會強制在隔離流程中執行測試。 此引數可多次指定，以提供多項變數。 範例: -e VARIABLE=abc -e VARIABLE="value with spaces" -e VARIABLE="value;seperated with;semicolons" -e VAR1=abc -e VAR2=def -e VAR3=ghi

# CommonCmdFramework
source: FRAMEWORK
es: MARCO DE DIRECTIVA
pt_br: ESTRUTURA
zh_hant: 架構

# PackageIdentityArgumentDescription
source: Package reference in the form of a package identifier like '{0}' or package identifier and version separated by '@' like '{0}@{1}'.
de: Paketverweis in Form eines Paketbezeichners wie {0} oder Paketbezeichner und -version getrennt durch „@“ wie „{0}@{1}“.
ja: '{0}' のようなパッケージ ID の形式のパッケージ参照、または '{0}@{1}' のように '@' で区切られたパッケージ ID とバージョンです。

# ArchArgumentName
source: ARCH
es: ARCO
fr: ARC
