Repository: dotnet/sdk
Catalog: src/Cli/dotnet/xlf/CliStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SolutionOrProjectArgumentDescription
source: The project or solution file to operate on. If a file is not specified, the command will search the current directory for one.
cs: Soubor projektu nebo řešení, se kterým se má operace provést. Pokud soubor není zadaný, příkaz ho bude hledat v aktuálním adresáři.
de: Das Projekt oder die Projektmappendatei, die verwendet werden soll. Wenn keine Datei angegeben ist, durchsucht der Befehl das aktuelle Verzeichnis nach einer Datei.
es: El archivo de proyecto o solución donde operar. Si no se especifica un archivo, el comando buscará uno en el directorio actual.
fr: Fichier projet ou solution à utiliser. Si vous ne spécifiez pas de fichier, la commande en recherche un dans le répertoire actuel.
it: File di progetto o di soluzione su cui intervenire. Se non si specifica un file, il comando ne cercherà uno nella directory corrente.
ja: 利用するプロジェクト ファイルまたはソリューション ファイル。指定しない場合、コマンドは現在のディレクトリを検索します。
ko: 수행할 프로젝트 또는 솔루션 파일입니다. 파일을 지정하지 않으면 명령이 현재 디렉토리에서 파일을 검색합니다.
pl: Plik projektu lub rozwiązania, dla którego ma zostać wykonana operacja. Jeśli plik nie zostanie podany, polecenie wyszuka go w bieżącym katalogu.
pt_br: O arquivo de solução ou projeto para operar. Se um arquivo não for especificado, o comando pesquisará um no diretório atual.
ru: Файл проекта или решения. Если файл не указан, команда будет искать его в текущем каталоге.
tr: Üzerinde işlem yapılacak proje veya çözüm dosyası. Bir dosya belirtilmezse komut geçerli dizinde dosya arar.
zh_hans: 要操作的项目或解决方案文件。如果没有指定文件，则命令将在当前目录里搜索一个文件。
zh_hant: 要操作的專案或解決方案。若未指定檔案，命令就會在目前的目錄中搜尋一個檔案。

# SolutionOrProjectOrFileArgumentDescription
source: The project or solution or C# (file-based program) file to operate on. If a file is not specified, the command will search the current directory for a project or solution.
cs: Projekt nebo řešení nebo soubor C# (souborový program), se kterým se má pracovat. Pokud soubor není zadaný, příkaz bude hledat projekt nebo řešení v aktuálním adresáři.
de: Die Projekt- oder Projektmappe- oder C#-Datei (dateibasiertes Programm), auf die zugegriffen werden soll. Wenn keine Datei angegeben ist, durchsucht der Befehl das aktuelle Verzeichnis nach einem Projekt oder einer Projektmappe.
es: Proyecto o solución o archivo de C# (programa basado en archivos) en el que se va a operar. Si no se especifica un archivo, el comando buscará en el directorio actual un proyecto o una solución.
fr: Le fichier projet ou solution ou fichier C# (programme basé sur un fichier) à utiliser. Si aucun fichier n'est spécifié, la commande recherche un projet ou une solution dans le répertoire actuel.
it: Il progetto o la soluzione o il file C# (programma basato su file) su cui eseguire operazioni. Se non si specifica un file, il comando cercherà un progetto o una soluzione nella directory corrente.
ja: 操作するプロジェクトまたはソリューションまたは C# (ファイル ベースのプログラム) ファイル。ファイルが指定されていない場合、コマンドは現在のディレクトリでプロジェクトまたはソリューションを検索します。
ko: 작업할 프로젝트 또는 솔루션 또는 C#(파일 기반 프로그램) 파일입니다. 파일을 지정하지 않으면 명령이 현재 디렉터리에서 프로젝트 또는 솔루션을 검색합니다.
pl: Projekt lub rozwiązanie albo plik C# (program oparty na plikach), na którym ma być wykonana operacja. Jeśli plik nie zostanie określony, polecenie wyszuka bieżący katalog w poszukiwaniu projektu lub rozwiązania.
pt_br: O projeto, solução ou arquivo C# (programa baseado em arquivo) para operar. Se um arquivo não for especificado, o comando buscará na pasta atual por um projeto ou solução.
ru: Файл проекта, решения или файл C# (программа на основе файла) для работы. Если файл не указан, команда будет искать его в текущем каталоге для проекта или решения.
tr: Üzerinde işlem yapılacak proje veya çözüm veya C# (dosya tabanlı program) dosyası. Bir dosya belirtilmezse, komut geçerli dizinde bir proje veya çözüm arayacaktır.
zh_hans: 要操作的项目或解决方案或 C# (基于文件的程序)文件。如果未指定文件，则该命令将在当前目录中搜索项目或解决方案。
zh_hant: 要執行的專案或解決方案或 C# (基於檔案的程式) 檔案。若未指定檔案，命令就會在目前的目錄中搜尋專案或解決方案。

# SolutionOrProjectOrFileArgumentName
source: PROJECT | SOLUTION | FILE
cs: PROJEKT | ŘEŠENÍ | SOUBOR
de: PROJEKT | PROJEKTMAPPE | DATEI
es: PROYECTO | SOLUCIÓN | ARCHIVO
fr: PROJECT | SOLUTION | FICHIER
ja: プロジェクト | 解決策 | ファイル
pl: PROJEKT | ROZWIĄZANIE | PLIK
pt_br: PROJETO | SOLUÇÃO | ARQUIVO
tr: PROJE | ÇÖZÜM | DOSYA
zh_hant: 專案 | 解決方案 | 檔案

# SpecifyAtLeastOne
source: Specify at least one {0}.
cs: Zadejte aspoň jednu položku {0}.
de: Geben Sie mindestens ein Element "{0}" an.
es: Especifique al menos un {0}.
fr: Spécifiez au moins un {0}.
it: Specificare almeno un elemento {0}.
ja: 少なくとも 1 つの {0} を指定してください。
ko: {0}을(를) 하나 이상 지정하세요.
pl: Określ co najmniej jeden element {0}.
pt_br: Especifique pelo menos um {0}.
ru: Укажите хотя бы один "{0}".
tr: En az bir {0} belirtin.
zh_hans: 请至少指定一个 {0}。
zh_hant: 請至少指定一個 {0}。

# SpecifyAtLeastOneProjectToAdd
source: You must specify at least one project to add.
cs: Musíte zadat aspoň jeden projekt, který chcete přidat.
de: Geben Sie mindestens ein hinzuzufügendes Projekt an.
es: Debe especificar al menos un proyecto para agregarlo.
fr: Vous devez spécifier au moins un projet à ajouter.
it: È necessario specificare almeno un progetto da aggiungere.
ja: 追加するプロジェクトを少なくとも 1 つ指定する必要があります。
ko: 추가할 프로젝트를 하나 이상 지정해야 합니다.
pl: Musisz określić co najmniej jeden projekt do dodania.
pt_br: É necessário especificar pelo menos um projeto a ser adicionado.
ru: Необходимо указать по крайней мере один добавляемый проект.
tr: Eklemek için en az bir proje belirtmeniz gerekir.
zh_hans: 必须至少指定一个要添加的项目。
zh_hant: 您必須指定至少一個要新增的專案。

# SpecifyAtLeastOneProjectToRemove
source: You must specify at least one project to remove.
cs: Musíte zadat aspoň jeden projekt, který chcete odebrat.
de: Geben Sie mindestens ein zu entfernendes Projekt an.
es: Debe especificar al menos un proyecto para quitarlo.
fr: Vous devez spécifier au moins un projet à retirer.
it: È necessario specificare almeno un progetto da rimuovere.
ja: 削除するプロジェクトを少なくとも 1 つ指定する必要があります。
ko: 제거할 프로젝트를 하나 이상 지정해야 합니다.
pl: Musisz określić co najmniej jeden projekt do skasowania.
pt_br: É necessário especificar pelo menos um projeto para ser removido.
ru: Необходимо указать по крайней мере один удаляемый проект.
tr: Kaldırmak için en az bir proje belirtmeniz gerekir.
zh_hans: 必须至少指定一个要删除的项目。
zh_hant: 您必須至少指定一個要移除的專案。

# SpecifyAtLeastOneReferenceToRemove
source: You must specify at least one reference to remove.
cs: Musíte zadat aspoň jeden odkaz, který chcete odebrat.
de: Geben Sie mindestens einen zu löschenden Verweis an.
es: Debe especificar al menos una referencia para quitarla.
fr: Vous devez spécifier au moins une référence à retirer.
it: È necessario specificare almeno un riferimento da rimuovere.
ja: 削除する参照を少なくとも 1 つ指定する必要があります。
ko: 제거할 참조를 하나 이상 지정해야 합니다.
pl: Musisz określić co najmniej jedno odwołanie do usunięcia.
pt_br: É necessário especificar pelo menos uma referência a ser removida.
ru: Необходимо указать по крайней мере одну удаляемую ссылку.
tr: Kaldırmak için en az bir başvuru belirtmeniz gerekir.
zh_hans: 必须至少指定一个要删除的引用。
zh_hant: 您必須指定至少一個要刪除的參考。

# ToolLibraryFound
source: {0}: tool library found {1}
cs: {0}: Nalezena knihovna nástrojů {1}
de: {0}: Toolbibliothek gefunden: {1}
es: {0}: se encontró biblioteca de herramientas {1}
fr: {0} : bibliothèque d'outils trouvée {1}
it: {0}: libreria degli strumenti {1} trovata
ja: {0}: ツール ライブラリで {1} が見つかりました
ko: {0}: 도구 라이브러리가 발견됨({1})
pl: {0}: Znaleziono bibliotekę narzędzia {1}
pt_br: {0}: a biblioteca de ferramentas encontrou {1}
ru: {0}: найдена библиотека средств {1}.
tr: {0}: araç kitaplığı bulundu {1}
zh_hans: {0}: 找到工具库 {1}
zh_hant: {0}: 找到工具程式庫 {1}

# ToolMissingVersion
source: Missing 'version' entry.
cs: Chybí položka version.
de: Eintrag "version" fehlt.
es: Falta la entrada "version".
fr: Entrée 'version' manquante.
it: Manca la voce 'version'.
ja: 'version' エントリがありません。
ko: 'version' 항목이 없습니다.
pl: Brak wpisu „version”.
pt_br: Entrada 'version' ausente.
ru: Отсутствует запись "version".
tr: 'version' girişi eksik.
zh_hans: 缺少 "version" 条目。
zh_hant: 遺漏 'version' 項目。

# ToolPackageConflictPackageId
source: Tool '{0}' (version '{1}') is already installed.
cs: Nástroj {0} (verze {1}) je už nainstalovaný.
de: Das Tool "{0}" (Version "{1}") ist bereits installiert.
es: La herramienta "{0}" (versión "{1}") ya está instalada.
fr: L'outil '{0}' (version '{1}') est déjà installé.
it: Lo strumento '{0}' (versione '{1}') è già installato.
ja: ツール '{0}' (バージョン '{1}') は既にインストールされています。
ko: '{0}' 도구(버전 '{1}')가 이미 설치되어 있습니다.
pl: Narzędzie „{0}” (wersja: „{1}”) jest już zainstalowane.
pt_br: A ferramenta '{0}' (versão '{1}') já está instalada.
ru: Инструмент "{0}" (версия "{1}") уже установлен.
tr: '{0}' aracı (sürüm '{1}') zaten yüklü.
zh_hans: 已安装工具“{0}”(版本“{1}”).
zh_hant: 工具 '{0}' ('{1}' 版) 已經安裝。

# ToolPackageNotATool
source: Package {0} is not a .NET tool.
cs: Balíček {0} není nástroj .NET.
de: Paket {0} ist kein .NET-Tool.
es: El paquete {0} no es una herramienta de .NET.
fr: Le package {0} n’est pas un outil .NET.
it: Il pacchetto {0} non è uno strumento .NET.
ja: パッケージ {0} は .NET ツールではありません。
ko: {0} 패키지는 .NET 도구가 아닙니다.
pl: Pakiet {0} nie jest narzędziem platformy .NET.
pt_br: O pacote {0} não é uma ferramenta .NET.
ru: Пакет {0} не является средством .NET.
tr: {0} paketi bir .NET aracı değil.
zh_hans: 包 {0} 不是 .NET 工具。
zh_hant: 套件 {0} 不是 .NET 工具。

# ToolSettingsInvalidCommandName
source: Command '{0}' contains one or more of the following invalid characters: {1}.
cs: Příkaz {0} obsahuje minimálně jeden neplatný znak: {1}.
de: Der Befehl "{0}" enthält mindestens eines der folgenden ungültigen Zeichen: {1}.
es: El comando "{0}" contiene uno o varios de los siguientes caracteres no válidos: {1}.
fr: La commande '{0}' contient un ou plusieurs caractères non valides suivants : {1}.
it: Il comando '{0}' contiene uno o più dei caratteri seguenti non validi: {1}.
ja: コマンド '{0}' には次の無効な文字が 1 つまたは複数含まれています: {1}。
ko: '{0}' 명령에 다음과 같은 잘못된 문자가 하나 이상 포함되어 있습니다. {1}.
pl: Polecenie „{0}” zawiera co najmniej jeden nieprawidłowy znak: {1}.
pt_br: O comando '{0}' contém um ou mais dos seguintes caracteres inválidos: {1}.
ru: Команда "{0}" содержит следующие недопустимы символы: {1}.
tr: '{0}' komutu şu geçersiz karakterlerden birini veya daha fazlasını içeriyor: {1}.
zh_hans: 命令“{0}”包含一个或多个以下无效字符: {1}。
zh_hant: 命令 '{0}' 包含下列一或多個無效的字元: {1}。

# ToolSettingsInvalidLeadingDotCommandName
source: The command name '{0}' cannot begin with a leading dot (.).
cs: Název příkazu {0} nemůže začínat úvodní tečkou (.).
de: Der Befehlsname "{0}" kann nicht mit einem vorangestellten Punkt (.) beginnen.
es: El nombre del comando "{0}" no puede estar precedido de un punto (.).
fr: Le nom de commande '{0}' ne peut pas commencer par un point (.).
it: Il nome del comando '{0}' non può iniziare con un punto (.).
ja: コマンド名 '{0}' の先頭にドット (.) を使用することはできません。
ko: 명령 이름 '{0}'은(는) 앞에 점(.)으로 시작할 수 없습니다.
pl: Nazwa polecenia „{0}” nie może zaczynać się od kropki (.).
pt_br: O nome do comando '{0}' não pode começar com ponto final (.) à esquerda.
ru: Имя команды "{0}" не может начинаться с точки (.).
tr: '{0}' komut adının başında bir nokta (.) olamaz.
zh_hans: 命令名称“{0}”不能以前导点(.)开头。
zh_hant: 命令名稱 '{0}' 的開頭不能為點 (.)。

# ToolSettingsInvalidXml
source: Invalid XML: {0}
cs: Neplatné XML: {0}
de: Ungültiges XML: {0}
es: XML no válido: {0}
fr: XML non valide : {0}
it: XML non valido: {0}
ja: XML が無効です: {0}
ko: 잘못된 XML: {0}
pl: Nieprawidłowy kod XML: {0}
pt_br: XML inválido: {0}
ru: Недопустимый XML: {0}
tr: Geçersiz XML: {0}
zh_hans: 无效的 XML: {0}
zh_hant: XML 無效: {0}

# ToolSettingsMissingCommandName
source: Tool defines a command with a missing name setting.
cs: Nástroj definuje příkaz s chybějícím nastavením názvu.
de: Das Tool definiert einen Befehl mit fehlender Namenseinstellung.
es: La herramienta define un comando en el que falta un valor de nombre.
fr: L'outil définit une commande avec un paramètre de nom manquant.
it: Lo strumento definisce un comando con un'impostazione di nome mancante.
ja: ツールは、名前設定がないコマンドを定義します。
ko: 도구에서 이름 설정 없이 명령을 정의합니다.
pl: Narzędzie definiuje polecenie z brakującym ustawieniem nazwy.
pt_br: A ferramenta define um comando com uma configuração de nome ausente.
ru: Инструмент определяет команду, для которой не задано имя.
tr: Araçta ad ayarı eksik bir komut tanımlanıyor.
zh_hans: 工具使用缺失的名称设置定义命令。
zh_hant: 工具使用了缺少的名稱設定定義命令。

# ToolSettingsMissingEntryPoint
source: Command '{0}' is missing an entry point setting.
cs: V příkazu {0} chybí nastavení vstupního bodu.
de: Dem Befehl "{0}" fehlt eine Einstiegspunkteinstellung.
es: En el comando "{0}", falta un valor de punto de entrada.
fr: La commande '{0}' a un paramètre de point d'entrée manquant.
it: Nel comando '{0}' manca un'impostazione di punto di ingresso.
ja: コマンド '{0}' にエントリ ポイント設定がありません。
ko: '{0}' 명령에 진입점 설정이 없습니다.
pl: W poleceniu „{0}” brakuje ustawienia punktu wejścia.
pt_br: Há uma configuração de ponto de entrada ausente no comando '{0}'.
ru: В команде "{0}" не задана точка входа.
tr: '{0}' komutunda giriş noktası ayarı eksik.
zh_hans: 命令“{0}”缺少入口点设置。
zh_hant: 命令 '{0}' 缺少進入點設定。

# ToolSettingsMoreThanOneCommand
source: More than one command is defined for the tool.
cs: Pro nástroj je definovaných více příkazů.
de: Für das Tool wurden mehrere Befehle definiert.
es: Se ha definido más de un comando para la herramienta.
fr: Plusieurs commandes sont définies pour l'outil.
it: Per lo strumento è definito più di un comando.
ja: ツールに対して複数のコマンドが定義されています。
ko: 도구에 대해 두 개 이상의 명령이 등록되어 있습니다.
pl: Dla narzędzia zdefiniowano więcej niż jedno polecenie.
pt_br: Há mais de um comando definido para a ferramenta.
ru: Для инструмента определено больше одной команды.
tr: Araç için birden fazla komut tanımlı.
zh_hans: 为工具定义了多个命令。
zh_hant: 為工具定義了多個命令。

# ToolSettingsUnsupportedRunner
source: Tool '{0}' uses unsupported runner '{1}'."
cs: Nástroj {0} používá nepodporovaný spouštěč {1}.
de: Das Tool "{0}" verwendet die nicht unterstützte Ausführung "{1}".
es: La herramienta "{0}" usa un ejecutor no compatible. "{1}".
fr: La commande « {0} » utilise un exécuteur non pris en charge « {1} ».
it: Lo strumento '{0}' usa il runner non supportato '{1}'."
ja: ツール '{0}' では、サポートされていないランナー '{1}' が使用されています。"
ko: 도구 '{0}'에서 지원되지 않는 실행기 '{1}'을(를) 사용합니다."
pl: Narzędzie „{0}” używa nieobsługiwanego modułu uruchamiającego „{1}”.”
pt_br: A ferramenta '{0}' usa o executor '{1}' que não é suportado."
ru: Инструмент "{0}" использует неподдерживаемое средство выполнения тестов "{1}"."
tr: '{0}' aracı, desteklenmeyen '{1}' çalıştırıcısını kullanıyor
zh_hans: 工具 '{0}' 使用的是不受支持的运行器 ‘{1}’。
zh_hant: 工具 '{0}' 使用不支援的執行器 '{1}'。"

# ToolUnsupportedRuntimeIdentifier
source: The tool does not support the current architecture or operating system ({0}). Supported runtimes: {1}
cs: Nástroj nepodporuje aktuální architekturu nebo operační systém ({0}). Podporované moduly runtime: {1}
de: Das Tool unterstützt die aktuelle Architektur oder das Betriebssystem ({0}) nicht. Unterstützte Laufzeiten: {1}
es: La herramienta no es compatible con la arquitectura o el sistema operativo actual ({0}). Entornos de ejecución compatibles: {1}
fr: L’outil ne prend pas en charge l’architecture ou le système d’exploitation actuel ({0}). Runtimes pris en charge : {1}
it: Lo strumento non supporta l'architettura o il sistema operativo corrente ({0}). Runtime supportati: {1}
ja: このツールは、現在のアーキテクチャまたはオペレーティング システム ({0}) をサポートしていません。サポートされているランタイム: {1}
ko: 도구가 현재 아키텍처 또는 운영 체제({0})를 지원하지 않습니다. 지원되는 런타임: {1}
pl: Narzędzie nie obsługuje bieżącej architektury ani systemu operacyjnego ({0}). Obsługiwane środowiska uruchomieniowe: {1}
pt_br: A ferramenta não suporta a arquitetura ou sistema operacional atual ({0}). Runtimes com suporte: {1}
ru: Инструмент не поддерживает текущую архитектуру или операционную систему ({0}). Поддерживаемые среды выполнения: {1}
tr: Araç, geçerli mimariyi veya işletim sistemini ({0}) desteklemiyor. Desteklenen çalışma zamanları: {1}
zh_hans: 该工具不支持当前体系结构或操作系统({0})。支持的运行时: {1}
zh_hant: 該工具不支援目前的結構或作業系統 ({0})。支援的執行階段: {1}

source: Type
cs: Typ
de: Typ
es: Tipo
it: Tipo
ja: 種類
ko: 형식
pl: Typ
pt_br: Tipo
ru: Тип
tr: Tür
zh_hans: 类型
zh_hant: 類型

# UnableToCheckCertificateChainPolicy
source: The requested certificate chain policy could not be checked: {0}
cs: Požadované zásady řetězu certifikátů nebylo možné zkontrolovat: {0}
de: Die angeforderte Zertifikatkettenrichtlinie konnte nicht überprüft werden: {0}
es: No se pudo comprobar la directiva de cadena de certificados solicitada: {0}
fr: Impossible de vérifier la stratégie de chaîne de certificats demandée : {0}
it: Non è stato possibile controllare il criterio della catena di certificati richiesto: {0}
ja: 要求された証明書チェーン ポリシーを確認できませんでした: {0}
ko: 요청한 인증서 체인 정책을 확인할 수 없습니다: {0}
pl: Nie można sprawdzić żądanych zasad łańcucha certyfikatów: {0}
pt_br: Não foi possível verificar a política de cadeia de certificados solicitada: {0}
ru: Не удалось проверить запрошенную политику цепочки сертификатов {0}
tr: İstenen sertifika zinciri ilkesi denetlenemedi: {0}
zh_hans: 无法检查请求的证书链策略: {0}
zh_hant: 無法檢查要求的憑證鏈結原則: {0}

# UnableToDeleteTemporaryDepsJson
source: unable to delete temporary deps.json file: {0}
cs: nepodařilo se odstranit dočasný soubor deps.json: {0}
de: Temporäre deps.json-Datei kann nicht gelöscht werden: {0}
es: no se puede eliminar el archivo deps.json temporal: {0}
fr: impossible de supprimer le fichier temporaire deps.json : {0}
it: non è possibile eliminare il file deps.json temporaneo: {0}
ja: deps.json 一時ファイルを削除できません: {0}
ko: 임시 deps.json 파일을 삭제할 수 없습니다. {0}
pl: nie można usunąć tymczasowego pliku deps.json: {0}
pt_br: não é possível excluir o arquivo temporário deps.json: {0}
ru: не удается удалить временный файл deps.json: {0}
tr: geçici deps.json dosyası silinemedi: {0}
zh_hans: 无法删除临时 deps.json 文件: {0}
zh_hant: 無法刪除暫存 deps.json 檔: {0}

# UnableToGenerateDepsJson
source: Unable to generate deps.json, it may have been already generated. You can specify the "-d" option option after "dotnet" for diagnostic output (for example, "dotnet -d <toolname>": {0}
cs: Nepovedlo se vygenerovat soubor deps.json, je možné, že se už vygeneroval. Pokud chcete získat výstup pro diagnostiku, můžete zadat možnost „-d“ za „dotnet“ (například dotnet -d <toolname>): {0}
de: „deps.json“ konnte nicht generiert werden, möglicherweise wurde die Datei bereits generiert. Sie können die Option „-d“ nach „dotnet“ angeben, um eine Diagnoseausgabe zu erhalten (Beispiel: „dotnet -d <toolname>“: {0}
es: No se puede generar deps.json, es posible que ya se haya generado. Puede especificar la opción "-d" después de "dotnet" para la salida de diagnóstico (por ejemplo, "dotnet -d <toolname>": {0}
fr: Impossible de générer deps.json, il a peut-être déjà été généré. Vous pouvez spécifier l'option "-d" après "dotnet" pour une sortie de diagnostic (par exemple, "dotnet -d <toolname>" : {0}
it: Non è possibile generare deps.json. Potrebbe essere stato già generato. Per ottenere l'output diagnostico, è possibile specificare l'opzione "-d" dopo "dotnet", ad esempio "dotnet-d <toolname>": {0}
ja: deps.json を生成できません。既に生成されている可能性があります。診断出力の "dotnet" オプションの後に、"-d" オプションを指定できます (例: "dotnet -d <toolname>": {0}
ko: deps.json을 생성할 수 없습니다. 이미 생성되었을 수 있습니다. 진단 출력에 대해 “dotnet” 다음에 "-d" 옵션을 지정할 수 있습니다(예: "dotnet-d <toolname>": {0}).
pl: Nie można wygenerować pliku deps.json. Plik mógł zostać już wygenerowany. Możesz określić opcję opcji „-d" po poleceniu „dotnet" dla danych wyjściowych diagnostyki (na przykład polecenie: „dotnet -d <toolname>": {0}
pt_br: Não é possível gerar deps.json, ele pode já ter sido gerado. Você pode especificar a opção "-d" após "dotnet" para a saída de diagnóstico (por exemplo, "dotnet -d <toolname>": {0}
ru: Не удалось создать deps.json, возможно, он уже создан. Параметр "-d" можно указать после "dotnet" для диагностических выходных данных (например, "dotnet -d <toolname>": {0}
tr: deps.json oluşturulamıyor, dosya önceden oluşturulmuş olabilir. Tanılama çıkışının "dotnet"ten sonra "-d" seçeneğini belirtebilirsiniz (örneğin, "dotnet -d <toolname>": {0}
zh_hans: 无法生成 deps.json，可能已生成。可在诊断输出之后指定“-d”选项(例如，“dotnet-d <toolname>”: {0}
zh_hant: Deps.json 可能已經產生，因此無法再產生。您可於診斷輸出 "dotnet" 之後， 指定 "-d" 選項 (例如 "dotnet-d <toolname>": {0})

source: Unable to locate dotnet multiplexer
cs: Nepodařilo se najít multiplexor dotnetu.
de: Dotnetmultiplexer nicht gefunden
es: No se puede ubicar el multiplexor dotnet
fr: Le multiplexeur dotnet est introuvable
it: Il multiplexer dotnet non è stato trovato
ja: dotnet マルチプレクサーが見つかりません
ko: dotnet multiplexer를 찾을 수 없음
pl: Nie można zlokalizować multipleksera dotnet
pt_br: Não é possível localizar o multiplexador do dotnet
ru: Не удается найти мультиплексор dotnet.
tr: Dotnet çoğullayıcısı bulunamadı
zh_hans: 找不到 dotnet 多路复用器
zh_hant: 找不到 dotnet multiplexer

# UnexpectedTypeInJson
source: Expected a {0} for property '{1}'.
cs: Očekává se {0} pro vlastnost {1}.
de: Erwartet wurde "{0}" für die Eigenschaft "{1}".
es: Se esperaba un {0} para la propiedad "{1}".
fr: {0} attendu pour la propriété '{1}'.
it: È previsto un tipo {0} per la proprietà '{1}'.
ja: プロパティ '{1}' には {0} が必要です。
ko: '{1}' 속성에는 {0}이(가) 필요합니다.
pl: Oczekiwano wartości {0} dla właściwości „{1}”.
pt_br: Um {0} era esperado para a propriedade '{1}'.
ru: Ожидается {0} для свойства "{1}".
tr: '{1}' özelliği için bir {0} bekleniyordu.
zh_hans: 属性“{1}”需要 {0}。
zh_hant: 對屬性 '{1}' 來說應為 {0}。

# UnrecognizedCommandOrArgument
source: Unrecognized command or argument '{0}'
cs: Nerozpoznaný příkaz nebo argument: {0}
de: Befehl oder Argument "{0}" nicht erkannt
es: No se reconoce el comando o el argumento "{0}"
fr: Commande ou argument non reconnu : '{0}'
it: Il comando o l'argomento '{0}' non è stato riconosciuto
ja: 認識されないコマンドまたは引数 '{0}'
ko: 인식할 수 없는 명령 또는 인수 '{0}'
pl: Nierozpoznane polecenie lub argument „{0}”
pt_br: Comando ou argumento '{0}' não reconhecido
ru: Нераспознанная команда или аргумент "{0}"
tr: Tanınmayan komut veya bağımsız değişken: '{0}'
zh_hans: 未识别命令或参数“{0}”
zh_hant: 無法辨識的命令或引數 '{0}'

# UnsupportedProjectType
source: Project '{0}' has an unknown project type and cannot be added to the solution file. Contact your SDK provider for support.
cs: Projekt {0} má neznámý typ projektu a nelze ho přidat do souboru řešení. O podporu požádejte poskytovatele sady SDK.
de: Das Projekt "{0}" weist einen unbekannten Projekttyp auf und kann der Projektmappendatei nicht hinzugefügt werden. Wenden Sie sich an Ihren SDK-Anbieter, um Unterstützung zu erhalten.
es: El proyecto "{0}" tiene un tipo de proyecto desconocido y no se puede agregar al archivo de solución. Póngase en contacto con el proveedor de SDK para obtener asistencia
fr: Le projet '{0}' correspond à un type de projet inconnu. Il ne peut pas être ajouté au fichier solution. Contactez le fournisseur de votre SDK pour obtenir de l'aide.
it: Il progetto '{0}' ha un tipo di progetto sconosciuto e non può essere aggiunto al file di soluzione. Per assistenza, contattare il fornitore dell'SDK.
ja: プロジェクト '{0}' のプロジェクト タイプは不明であるため、ソリューション ファイルに追加することができません。サポートが必要な場合は、SDK プロバイダーにお問い合わせください。
ko: '{0}' 프로젝트는 알 수 없는 프로젝트 형식이고 솔루션 파일에 추가할 수 없습니다. SDK 공급자에 문의하여 지원을 받으세요.
pl: Projekt „{0}” ma nieznany typ projektu i nie można go dodać do pliku rozwiązania. Skontaktuj się z dostawcą zestawu SDK w celu uzyskania pomocy technicznej.
pt_br: O projeto '{0}' tem um tipo de projeto desconhecido e não pode ser adicionado ao arquivo da solução. Entre em contato com o provedor do SDK para obter suporte.
ru: Проект "{0}" имеет неизвестный тип и не может быть добавлен в файл решения. За поддержкой обратитесь к поставщику пакета SDK.
tr: '{0}' projesi bilinmeyen bir proje türüne sahip ve çözüm dosyasına eklenemiyor. Destek için SDK sağlayıcınıza başvurun.
zh_hans: 项目“{0}”包含未知的项目类型，且无法添加到解决方案文件。请联系 SDK 提供商获取支持。
zh_hant: 專案 '{0}' 的專案類型不明，因而無法新增至解決方案檔。請連絡 SDK 提供者，以取得支援。
