Repository: dotnet/sdk
Catalog: src/Cli/dotnet/commands/dotnet-workload/uninstall/xlf/LocalizableStrings.*.xlf
Languages: cs, ja, ko, tr, zh_hans

# PackageIdArgumentDescription
source: The NuGet Package Id of the workload to uninstall.
cs: ID balíčku NuGet úlohy, která se má odinstalovat
ja: アンインストールするワークロードの NuGet パッケージ ID。
ko: 제거할 워크로드의 NuGet 패키지 ID입니다.
tr: Kaldırılacak iş yükünün NuGet Paket Kimliği.
zh_hans: 要卸载的工作负载的 NuGet 包 ID。

# CommandDescription
source: Uninstall a workload.
cs: Odinstalujte úlohu.
ja: ワークロードをアンインストールします。
ko: 워크로드를 제거합니다.
tr: İş yükünü kaldırın.
zh_hans: 卸载工作负载。

# SpecifyExactlyOnePackageId
source: Specify one workload Package Id to uninstall.
cs: Zadejte jedno ID balíčku úlohy, která se má odinstalovat.
ja: アンインストールするワークロード パッケージの ID を 1 つ指定してください。
ko: 제거할 워크로드 패키지 ID를 하나 지정하세요.
tr: Kaldırılacak tek bir iş yükünün Paket Kimliğini belirtin.
zh_hans: 请指定一个要卸载的工作负载包 ID。

# UninstallLocalWorkloadSucceeded
source: Workload '{0}' was successfully uninstalled and removed from manifest file {1}.
cs: Úloha {0} se úspěšně odinstalovala a odebrala ze souboru manifestu {1}.
ja: ワークロード '{0}' が正常にアンインストールされ、マニフェスト ファイル {1} から削除されました。
ko: 워크로드 '{0}'이(가) 제거되었으며 매니페스트 파일 {1}에서 제거되었습니다.
tr: '{0}' iş yükü başarıyla kaldırıldı ve {1} bildirim dosyasından çıkarıldı.
zh_hans: 工作负载“{0}”已成功卸载且已从清单文件 {1} 中移除。

# UninstallSucceeded
source: Workload '{0}' (version '{1}') was successfully uninstalled.
cs: Úloha {0} (verze {1}) byla úspěšně odinstalována.
ja: ワークロード '{0}' (バージョン '{1}') は正常にアンインストールされました。
ko: 워크로드 '{0}'(버전 '{1}')을(를) 제거했습니다.
tr: '{0}' iş yükü (sürüm '{1}') başarıyla kaldırıldı.
zh_hans: 已成功卸载工作负载“{0}”(版本“{1}”)。

# WorkloadNotInstalled
source: A workload with the package Id '{0}' could not be found.
cs: Nepovedlo se najít úlohu s ID balíčku {0}.
ja: パッケージ ID '{0}' のワークロードが見つかりませんでした。
ko: 패키지 ID가 '{0}'인 워크로드를 찾을 수 없습니다.
tr: '{0}' paket kimliğine sahip bir iş yükü bulunamadı.
zh_hans: 找不到包 ID 为“{0}”的工作负载。

# FailedToUninstallWorkload
source: Failed to uninstall workload '{0}': {1}
cs: Nepovedlo se odinstalovat úlohu {0}: {1}
ja: ワークロード '{0}' をアンインストールできませんでした: {1}
ko: 워크로드 '{0}'을(를) 제거하지 못함: {1}
tr: '{0}' iş yükü kaldırılamadı: {1}
zh_hans: 未能卸载工作负载“{0}”: {1}

# InvalidWorkloadPathOption
source: Workload path '{0}' does not exist.
cs: Cesta úlohy {0} neexistuje.
ja: ワークロード パス '{0}' が存在しません。
ko: 워크로드 경로 '{0}'이(가) 없습니다.
tr: '{0}' iş yükü yolu yok.
zh_hans: 工作负载路径“{0}”不存在。

# WorkloadPathOptionName
source: PATH
cs: CESTA
ja: パス
ko: 경로
tr: YOL
zh_hans: 路径

# WorkloadPathOptionDescription
source: The directory containing the workload to uninstall.
cs: Adresář obsahující úlohu, která se má odinstalovat
ja: アンインストールするワークロードが入っているディレクトリ。
ko: 제거할 워크로드를 포함하는 디렉터리입니다.
tr: Kaldırılacak iş yükünü içeren dizin.
zh_hans: 包含要卸载的工作负载的目录。
