Repository: dotnet/sdk
Catalog: src/Tasks/Microsoft.NET.Build.Tasks/Resources/Strings.*.resx
Languages: pl, pt_br

# AtLeastOneTargetFrameworkMustBeSpecified
source: At least one possible target framework must be specified.
pl: Należy określić co najmniej jedną możliwą platformę docelową.
pt_br: É necessário especificar pelo menos uma estrutura de destino possível.

# NoCompatibleTargetFramework
source: Project '{0}' has no target framework compatible with '{1}'.
pl: Projekt „{0}” nie ma platformy docelowej kompatybilnej z „{1}”.
pt_br: O projeto '{0}' não tem nenhuma estrutura de destino compatível com '{1}'.

# InvalidFrameworkName
source: Invalid framework name: '{0}'.
pl: Nieprawidłowa nazwa platformy: „{0}”.
pt_br: Nome de estrutura inválido: '{0}'.

# AssetsFileNotFound
source: Assets file '{0}' not found. Run a NuGet package restore to generate this file.
pl: Nie odnaleziono pliku zasobów „{0}”. Uruchom przywracanie pakietu NuGet, aby wygenerować ten plik.
pt_br: Arquivo de ativos '{0}' não encontrado. Execute uma restauração de pacote NuGet para gerar esse arquivo.

# AssetsFileMissingTarget
source: Assets file '{0}' doesn't have a target for '{1}'. Ensure you have restored this project for TargetFramework='{2}' and RuntimeIdentifier='{3}'.
pl: Plik zasobów „{0}” nie ma obiektu docelowego dla „{1}”. Upewnij się, że projekt został przywrócony dla elementu TargetFramework=„{2}” i RuntimeIdentifier=„{3}”.
pt_br: O arquivo de ativos '{0}' não tem um destino para '{1}'. Certifique-se de ter restaurado esse projeto para TargetFramework='{2}' e RuntimeIdentifier='{3}'.

# AssetsFilePathNotRooted
source: Assets file path '{0}' is not rooted. Only full paths are supported.
pl: Ścieżka pliku zasobów „{0}” nie prowadzi do katalogu głównego. Tylko pełne ścieżki są obsługiwane.
pt_br: O caminho de arquivo de ativos '{0}' não tem raiz. Apenas caminhos completos têm suporte.

# CannotFindProjectInfo
source: Cannot find project info for '{0}'. This can indicate a missing project reference.
pl: Nie odnaleziono informacji o projekcie dla elementu „{0}”. Może to wskazywać na brakujące odwołanie do projektu.
pt_br: Não é possível localizar informações de projeto para '{0}'. Isso pode indicar uma referência de projeto ausente.

# ContentFileDoesNotContainExpectedParentPackageInformation
source: Content file '{0}' does not contain expected parent package information.
pl: Plik zawartości „{0}” nie zawiera oczekiwanych informacji o pakiecie nadrzędnym.
pt_br: O arquivo de conteúdo '{0}' não contém as informações de pacote pai esperadas.

# MissingItemMetadata
source: Missing '{0}' metadata on '{1}' item '{2}'.
pl: Brak metadanych „{0}” w elemencie „{1}” „{2}”.
pt_br: Metadados '{0}' ausentes no item '{1}' '{2}'.

# UnrecognizedPreprocessorToken
source: Unrecognized preprocessor token '{0}' in '{1}'.
pl: Nierozpoznany token preprocesora „{0}” w elemencie „{1}”.
pt_br: Token de pré-processador não reconhecido '{0}' no '{1}'.

# ContentPreproccessorParameterRequired
source: The '{0}' task must be given a value for parameter '{1}' in order to consume preprocessed content.
pl: Dla zadania „{0}” musi zostać podana wartość parametru „{1}” w celu użycia wstępnie przetworzonej zawartości.
pt_br: A tarefa '{0}' deve receber um valor para o parâmetro '{1}' para consumir o conteúdo pré-processado.

# ProjectAssetsConsumedWithoutMSBuildProjectPath
source: Assets are consumed from project '{0}', but no corresponding MSBuild project path was found in '{1}'.
pl: Zasoby są używane z projektu „{0}”, ale w elemencie „{1}” nie odnaleziono odpowiadającej ścieżki projektu MSBuild.
pt_br: Os ativos são consumidos de um projeto '{0}', mas não foi encontrado nenhum caminho de projeto do MSBuild correspondente em '{1}'.

# UnexpectedFileType
source: Unexpected file type for '{0}'. Type is both '{1}' and '{2}'.
pl: Nieoczekiwany typ pliku dla „{0}”. Typ to „{1}” oraz „{2}”.
pt_br: Tipo de arquivo inesperado para '{0}'. O tipo é '{1}' e '{2}'.

# CannotInferTargetFrameworkIdentiferAndVersion
source: Cannot infer TargetFrameworkIdentifier and/or TargetFrameworkVersion from TargetFramework='{0}'. They must be specified explicitly.
pl: Nie można wywnioskować elementu TargetFrameworkIdentifier i/lub TargetFrameworkVersion z elementu TargetFramework=„{0}”. Należy jawnie je określić.
pt_br: Não é possível inferir TargetFrameworkIdentifier e/ou TargetFrameworkVersion de TargetFramework='{0}'. Eles devem ser especificados explicitamente.

# ContentItemDoesNotProvideOutputPath
source: Content item for '{0}' sets '{1}', but does not provide '{2}' or '{3}'.
pl: Element zawartości dla elementu „{0}” ustawia „{1}”, ale nie zapewnia „{2}” ani „{3}”.
pt_br: O item de conteúdo para '{0}' define '{1}', mas não fornece '{2}' ou '{3}'.

# DuplicatePreprocessorToken
source: The preprocessor token '{0}' has been given more than one value. Choosing '{1}' as the value.
pl: Dla tokenu preprocesora „{0}” podano więcej niż jedną wartość. Wybieranie elementu „{1}” jako wartości.
pt_br: O token de pré-processador '{0}' recebeu mais de um valor. Escolhendo '{1}' como o valor.

# ErrorsOccurredWhenEmittingSatelliteAssembly
source: Errors occured when emitting satellite assembly '{0}'.
pl: Podczas emitowania zestawu satelickiego „{0}” wystąpiły błędy.
pt_br: Ocorreram erros ao emitir o assembly satélite '{0}'.

# UnableToFindResolvedPath
source: Unable to find resolved path for '{0}'.
pl: Nie można odnaleźć rozpoznanej ścieżki dla elementu „{0}”.
pt_br: Não foi possível localizar o caminho resolvido para '{0}'.

# UnexpectedDependencyWithNoVersionNumber
source: Unexpected dependency '{0}' with no version number.
pl: Nieoczekiwana zależność „{0}” bez numeru wersji.
pt_br: Dependência inesperada '{0}' sem número de versão.

# RuntimeIdentifierMustBeSetForNETFramework
source: RuntimeIdentifier must be set for .NETFramework executables. Consider RuntimeIdentifier=win7-x86 or RuntimeIdentifier=win7-x64.
pl: Element RuntimeIdentifier musi być ustawiony dla plików wykonywalnych programu .NETFramework. Rozważ element RuntimeIdentifier=win7-x86 lub RuntimeIdentifier=win7-x64.

# AssetPreprocessorMustBeConfigured
source: Asset preprocessor must be configured before assets are processed.
pl: Preprocesor zasobów musi być skonfigurowany przed przetworzeniem zasobów.
pt_br: O pré-processador de ativos deve ser configurado antes de os ativos serem processados.

# InvalidNuGetVersionString
source: Invalid NuGet version string: '{0}'.
pl: Nieprawidłowy ciąg wersji NuGet: „{0}”.
pt_br: Cadeia de caracteres de versão do NuGet inválida: '{0}'.

# DOTNET1011
source: Framework not installed: {0} in {1}
pl: Nie zainstalowano platformy: {0} w lokalizacji {1}
pt_br: Estrutura não instalada: {0} em {1}

# DOTNET1012
source: The reference assemblies directory was not specified. You can set the location using the DOTNET_REFERENCE_ASSEMBLIES_PATH environment variable.
pl: Nie określono katalogu zestawów referencyjnych. Aby ustawić jego lokalizację, użyj zmiennej środowiskowej DOTNET_REFERENCE_ASSEMBLIES_PATH.
pt_br: O diretório de assemblies de referência não foi especificado. É possível definir o local usando a variável de ambiente DOTNET_REFERENCE_ASSEMBLIES_PATH.

# DOTNET1013
source: The following dependencies are marked with type 'platform', however only one dependency can have this type: {0}
pl: Następujące zależności oznaczono za pomocą typu „platform”, jednak tylko jedna zależność może mieć ten typ: {0}
pt_br: As seguintes dependências estão marcadas com o tipo 'platform'; no entanto, apenas uma dependência pode ter esse tipo: {0}

# DOTNET1014
source: Failed to read lock file
pl: Nie można odczytać pliku blokady
pt_br: Falha ao ler arquivo de bloqueio

# DOTNET1017
source: Project file does not exist '{0}'.
pl: Plik projektu nie istnieje „{0}”.
pt_br: O arquivo de projeto não existe: '{0}'.

# NU1001
source: The dependency '{0}' could not be resolved.
pl: Nie można rozpoznać zależności „{0}”.
pt_br: A dependência '{0}' não pôde ser resolvida.

# NU1002
source: The dependency '{0}' in project '{1}' does not support framework '{2}'.
pl: Zależność „{0}” w projekcie „{1}” nie obsługuje platformy „{2}”.
pt_br: A dependência '{0}' do projeto '{1}' não dá suporte à estrutura '{2}'.

# NU1006
source: {0}. Please run 'dotnet restore' to generate a new asset file.
pl: {0}. Uruchom polecenie „dotnet restore”, aby wygenerować nowy plik zasobów.
pt_br: {0}. Execute 'dotnet restore' para gerar um novo arquivo de ativo.

# NU1007
source: Dependency specified was '{0}' but ended up with '{1}'.
pl: Określono zależność „{0}”, ale ostatecznie otrzymano zależność „{1}”.
pt_br: A dependência especificada era '{0}', mas terminou com '{1}'.

# NU1008
source: {0} is an unsupported framework.
pl: {0} to nieobsługiwana platforma.
pt_br: {0} é uma estrutura sem suporte.

# NU1009
source: The expected asset file does not exist. Please run 'dotnet restore' to generate a new asset file.
pl: Oczekiwany plik zasobów nie istnieje. Uruchom polecenie „dotnet restore”, aby wygenerować nowy plik zasobów.
pt_br: O arquivo de ativo esperado não existe. Execute 'dotnet restore' para gerar um novo arquivo de ativo.

# NU1010
source: The dependency type was changed
pl: Zmieniono typ zależności
pt_br: O tipo de dependência foi alterado

# NU1011
source: The dependency target '{0}' is unsupported.
pl: Element docelowy zależności „{0}” jest nieobsługiwany.
pt_br: Não há suporte para o destino de dependência '{0}'.

# NU1012
source: Dependency conflict. '{0}' expected '{1}' but received '{2}'
pl: Konflikt zależności. Element „{0}” oczekiwał elementu „{1}”, ale otrzymał element „{2}”
pt_br: Conflito de dependência. '{0}' esperava '{1}', mas recebeu '{2\}'

# DuplicateItemsError
source: Duplicate '{0}' items were included. The .NET SDK includes '{0}' items from your project directory by default. You can either remove these items from your project file, or set the '{1}' property to '{2}' if you want to explicitly include them in your project file. For more information, see {4}. The duplicate items were: {3}
pl: Zostały uwzględnione zduplikowane elementy „{0}”. Zestaw .NET SDK dołącza domyślnie elementy „{0}” z katalogu projektu. Możesz usunąć te elementy z pliku projektu lub ustawić właściwość „{1}” na wartość „{2}”, aby jawnie uwzględnić je w pliku projektu. Zduplikowane elementy: {3}
pt_br: Os itens '{0}' duplicados foram incluídos. O .NET SDK inclui '{0}' itens do seu diretório de projeto por padrão. Você poderá remover esses itens do seu arquivo de projeto ou configurar a propriedade '{1}' para '{2}', se desejar os incluir explicitamente no arquivo de projeto. Os itens duplicados são: {3}

# PackageReferenceOverrideWarning
source: A PackageReference for '{0}' was included in your project. This package is implicitly referenced by the .NET SDK and you do not typically need to reference it from your project. For more information, see {1}
pl: Odwołanie do pakietu dla „{0}” zostało uwzględnione w projekcie. Ten pakiet jest jawnie przywoływany przez zestaw .NET SDK i zwykle nie ma potrzeby tworzenia odwołania do niego z projektu. Aby uzyskać więcej informacji, zobacz {1}
pt_br: Um PackageReference para '{0}' foi incluído no seu projeto. Esse pacote é referenciado implicitamente pelo .NET SDK e normalmente você não precisa referenciá-lo no seu projeto. Para obter mais informações, consulte {1}
