Repository: dotnet/sdk
Catalog: src/Cli/Microsoft.DotNet.FileBasedPrograms/xlf/FileBasedProgramsResources.*.xlf
Languages: de, es, ja, pl, pt_br, zh_hans

# CannotConvertDirective
source: Some directives cannot be converted. Run the file to see all compilation errors. Specify '--force' to convert anyway.
de: Einige Anweisungen können nicht konvertiert werden. Führen Sie die Datei aus, um alle Kompilierungsfehler anzuzeigen. Geben Sie „--force“ an, um das Umwandeln trotzdem auszuführen.
es: Algunas directivas no se pueden convertir. Ejecute el archivo para ver todos los errores de compilación. Especifique "--force" para convertir de todos modos.
ja: 一部のディレクティブは変換できません。ファイルを実行して、すべてのコンパイル エラーを表示します。それでも変換する場合は '--force' を指定してください。
pl: Nie można przekonwertować niektórych dyrektyw. Uruchom plik, aby wyświetlić wszystkie błędy kompilacji. Określ element „--force”, aby mimo to przekonwertować.
pt_br: Algumas diretivas não podem ser convertidas. Execute o arquivo para ver todos os erros de compilação. Especifique '--force' para converter mesmo assim.
zh_hans: 一些指令无法转换。运行该文件以查看所有编译错误。请指定 '--force' 以进行转换。

# CouldNotFindAnyProjectInDirectory
source: Could not find any project in `{0}`.
de: In "{0}" wurde kein Projekt gefunden.
es: No se encuentra ningún proyecto en "{0}".
ja: `{0}` にプロジェクトが見つかりませんでした。
pl: Nie można odnaleźć żadnego projektu w lokalizacji „{0}”.
pt_br: Não foi possível encontrar nenhum projeto em ‘{0}’.
zh_hans: “{0}”中找不到任何项目。

# CouldNotFindProjectOrDirectory
source: Could not find project or directory `{0}`.
de: Das Projekt oder Verzeichnis "{0}" wurde nicht gefunden.
es: No se encuentra el proyecto o directorio "{0}".
ja: プロジェクトまたはディレクトリ `{0}` が見つかりませんでした。
pl: Nie można odnaleźć projektu ani katalogu „{0}”.
pt_br: Não foi possível encontrar o projeto ou diretório ‘{0}’.
zh_hans: 找不到项目或目录“{0}”。

# DirectiveError
source: error
de: Fehler
ja: エラー
pl: błąd
pt_br: erro
zh_hans: 错误

# DuplicateDirective
source: Duplicate directives are not supported: {0}
de: Doppelte Anweisungen werden nicht unterstützt: {0}
es: No se admiten directivas duplicadas: {0}
ja: 重複するディレクティブはサポートされていません: {0}
pl: Zduplikowane dyrektywy nie są obsługiwane: {0}
pt_br: Diretivas duplicadas não são suportadas:{0}
zh_hans: 不支持重复指令: {0}

# InvalidDirectiveName
source: The directive should contain a name without special characters and an optional value separated by '{1}' like '#:{0} Name{1}Value'.
de: Die Anweisung sollte einen Namen ohne Sonderzeichen und einen optionalen Wert enthalten, die durch „{1}“ getrennt sind, wie „#:{0} Name{1}Wert“.
es: La directiva debe contener un nombre sin caracteres especiales y un valor opcional separado por "{1}" como "#:{0} Nombre{1}Valor".
ja: ディレクティブには、特殊文字を含まない名前と、'#:{0} Name{1}Value' などの '{1}' で区切られた省略可能な値を含める必要があります。
pl: Dyrektywa powinna zawierać nazwę bez znaków specjalnych i opcjonalną wartość rozdzieloną znakiem "{1}#:{0} Name{1}Value".
pt_br: A diretiva deve conter um nome sem caracteres especiais e um valor opcional separado por '{1}' como '#:{0} Nome{1}Valor'.
zh_hans: 该指令应包含一个不带特殊字符的名称，以及一个以 '#:{0} Name{1}Value' 等 ‘{1}’ 分隔的可选值。

# InvalidProjectDirective
source: The '#:project' directive is invalid: {0}
de: Die Anweisung „#:p roject“ ist ungültig: {0}
es: La directiva "#:project" no es válida: {0}
ja: '#:p roject' ディレクティブが無効です: {0}
pl: Dyrektywa „#:project” jest nieprawidłowa: {0}
pt_br: A diretiva '#:project' é inválida:{0}
zh_hans: '#:project' 指令无效: {0}

# MissingDirectiveName
source: Missing name of '{0}'.
de: Fehlender Name der Anweisung „{0}“.
es: Falta el nombre de "{0}".
ja: '{0}' の名前がありません。
pl: Brak nazwy „{0}”.
pt_br: Nome de '{0}' ausente.
zh_hans: 缺少 '{0}' 的名称。

# MoreThanOneProjectInDirectory
source: Found more than one project in `{0}`. Specify which one to use.
de: In "{0}" wurden mehrere Projekte gefunden. Geben Sie an, welches davon verwendet werden soll.
es: Se han encontrado varios proyectos en "{0}". Especifique el que debe usarse.
ja: `{0}` に複数のプロジェクトが見つかりました。使用するプロジェクトを指定してください。
pl: Znaleziono więcej niż jeden projekt w lokalizacji „{0}”. Określ, który ma zostać użyty.
pt_br: Foi encontrado mais de um projeto em ‘{0}’. Especifique qual deve ser usado.
zh_hans: 在“{0}”中找到多个项目。请指定使用哪一个。

# PropertyDirectiveInvalidName
source: Invalid property name: {0}
de: Ungültiger Eigenschaftenname: {0}
es: Nombre de propiedad no válido {0}
ja: 無効なプロパティ名: {0}
pl: Nieprawidłowa nazwa właściwości: {0}
pt_br: Nome de propriedade inválido: {0}
zh_hans: 属性名无效: {0}

# PropertyDirectiveMissingParts
source: The property directive needs to have two parts separated by '=' like '#:property PropertyName=PropertyValue'.
de: Die Eigenschaftsanweisung muss zwei durch „=“ getrennte Teile aufweisen, z. B. „#:property PropertyName=PropertyValue“.
es: La directiva de propiedad debe tener dos partes separadas por "=", como "#:property PropertyName=PropertyValue".
ja: プロパティ ディレクティブには、'#:property PropertyName=PropertyValue' のように '=' で区切られた 2 つの部分が必要です。
pl: Dyrektywa właściwości musi mieć dwie części oddzielone znakiem „=”, na przykład „#:property PropertyName=PropertyValue”.
pt_br: A diretiva de propriedade precisa ter duas partes separadas por '=' como '#:property PropertyName=PropertyValue'.
zh_hans: 属性指令需要包含两个由 ‘=’ 分隔的部件，例如 '#:property PropertyName=PropertyValue'。

# QuoteInDirective
source: Directives currently cannot contain double quotes (").
de: Direktiven dürfen derzeit keine doppelten Anführungszeichen (") enthalten.
es: Las directivas no pueden contener comillas dobles ("), por ahora.
ja: ディレクティブには二重引用符 (") を含めることはできません。
pl: Dyrektywy nie mogą obecnie zawierać podwójnych cudzysłowów (").
pt_br: No momento, as diretivas não podem conter aspas duplas (").
zh_hans: 指令当前不能包含双引号(")。

# StaticGraphRestoreNotSupported
source: Static graph restore is not supported for file-based apps. Remove the '#:property'.
de: Die Statische Graphwiederherstellung wird für dateibasierte Apps nicht unterstützt. Entfernen Sie '#:property'.
es: No se admite la restauración de gráficos estáticos para aplicaciones basadas en archivos. Elimine "#:property".
ja: 静的グラフの復元はファイルベースのアプリではサポートされていません。'#:property' を削除します。
pl: Przywracanie statycznego grafu nie jest obsługiwane w przypadku aplikacji opartych na plikach. Usuń element „#:property”.
pt_br: A restauração de grafo estático não é suportada para aplicativos baseados em arquivos. Remova '#:property'.
zh_hans: 基于文件的应用不支持静态图形还原。移除 '#:property'。

# UnrecognizedDirective
source: Unrecognized directive '{0}'.
de: Unbekannte Anweisung „{0}“.
es: Directiva no reconocida "{0}".
ja: 認識されないディレクティブ '{0}' です。
pl: Nierozpoznana dyrektywa „{0}”.
pt_br: Diretiva não reconhecida '{0}'.
zh_hans: 无法识别的指令 ‘{0}’。
