Repository: dotnet/sdk
Catalog: src/BuiltInTools/dotnet-watch/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Warning_ProjectAbbreviationDeprecated
source: Warning NETSDK1174: The abbreviation of -p for --project is deprecated. Please use --project.
cs: Upozornění NETSDK1174: Zkratka -p pro --project je zastaralá. Použijte prosím --project.
de: Warnung NETSDK1174: Die Abkürzung von „-p“ für „--project“ ist veraltet. Verwenden Sie „--project“.
es: Advertencia NETSDK1174: La abreviatura de -p para --project está en desuso. Use --project.
fr: AVERTISSEMENT NETSDK1174 : l’abréviation de-p pour--project est déconseillée. Veuillez utiliser--project.
it: Avviso NETSDK1174: l'abbreviazione di -p per --project è deprecata. Usare --project.
ja: 警告 NETSDK1174: --project の省略形である -p は推奨されていません。--project を使用してください。
ko: 경고 NETSDK1174: --project에 대한 약어 -p는 더 이상 사용되지 않습니다. --project를 사용하세요.
pl: Ostrzeżenie NETSDK1174: Skrót -p dla polecenia --project jest przestarzały. Użyj polecenia --project.
pt_br: Aviso NETSDK1174: a abreviação de-p para--project é preterida. Use --project.
ru: Предупреждение NETSDK1174: сокращение "-p" для "--project" не рекомендуется. Используйте "--project".
tr: Uyarı NETSDK1174: --project için -p kısaltması kullanımdan kaldırıldı. Lütfen --project kullanın.
zh_hans: 警告 NETSDK1174: 已弃用使用缩写“-p”来代表“--project”。请使用“--project”。
zh_hant: 警告 NETSDK1174: --project 已取代縮寫 -p。請使用 --project。
