Repository: dotnet/sdk
Catalog: src/BuiltInTools/dotnet-watch/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Error_MultipleProjectsFound
source: Multiple MSBuild project files found in '{0}'. Specify which to use with the --project option.
cs: {0} obsahuje více souborů projektů MSBuild. Pomocí parametru --project zadejte, který soubor chcete použít.
de: In "{0}" wurden mehrere MSBuild-Projektdateien gefunden. Geben Sie über die Option "--project" an, welche verwendet werden soll.
es: Se encontraron múltiples archivos del proyecto MSBuild en "{0}". Especifique cuál debe usarse con la opción --project.
fr: Plusieurs fichiers projet MSBuild trouvés dans '{0}'. Spécifiez celui qui doit être utilisé avec l'option --project.
it: In '{0}' sono stati trovati più file di progetto MSBuild. Per specificare quello desiderato, usare l'opzione --project.
ja: 複数の MSBuild プロジェクト ファイルが '{0}' で見つかりました。使用するものを --project オプションで指定してください。
ko: '{0}'에서 여러 MSBuild 프로젝트 파일을 찾았습니다. --project 옵션을 사용하여 사용할 파일을 지정하세요.
pl: W elemencie „{0}” znaleziono wiele plików projektów MSBuild. Określ projekt do użycia za pomocą opcji --project.
pt_br: Foram encontrados vários arquivos de projeto do MSBuild em '{0}'. Especifique qual deve ser usado com a opção --project.
ru: В "{0}" обнаружено несколько файлов проекта MSBuild. Укажите файл, который нужно использовать, с помощью параметра --project.
tr: '{0}' içinde birden fazla MSBuild proje dosyası bulundu. --project seçeneği ile kullanılacak proje dosyalarını belirtin.
zh_hans: 在“{0}”中找到多个 MSBuild 项目文件。请指定要将哪一个文件用于 --project 选项。
zh_hant: 在 '{0}' 中找到多個 MSBuild 專案檔。請指定要搭配 --project 選項使用的專案檔。

# Error_NoProjectsFound
source: Could not find a MSBuild project file in '{0}'. Specify which project to use with the --project option.
cs: V {0} se nepovedlo najít soubor projektu MSBuild. Pomocí parametru --project zadejte, který projekt chcete použít.
de: In "{0}" wurde keine MSBuild-Projektdatei gefunden. Geben Sie das zu verwendende Projekt über die Option "--project" an.
es: No se encontró ningún archivo del proyecto MSBuild en "{0}". Especifique qué proyecto debe utilizarse con la opción --project.
fr: Fichier projet MSBuild introuvable dans '{0}'. Spécifiez le projet à utiliser avec l'option --project.
it: In '{0}' non è stato possibile trovare alcun file di progetto MSBuild. Per specificare quello desiderato, usare l'opzione --project.
ja: '{0}' で MSBuild プロジェクト ファイルが見つかりませんでした。使用するプロジェクトを --project オプションで指定してください。
ko: '{0}'에서 MSBuild 프로젝트 파일을 찾을 수 없습니다. --project 옵션을 사용하여 사용할 파일을 지정하세요.
pl: Nie można znaleźć pliku projektu MSBuild w elemencie „{0}”. Określ projekt do użycia za pomocą opcji --project.
pt_br: Não foi possível encontrar um arquivo de projeto do MSBuild em '{0}'. Especifique qual projeto deve ser usado com a opção --project.
ru: Не удалось найти файл проекта MSBuild в "{0}". Укажите проект, который нужно использовать, с помощью параметра --project.
tr: '{0}' içinde MSBuild proje dosyası bulunamadı. --project seçeneği ile kullanılacak projeyi belirtin.
zh_hans: 无法在“{0}”中找到 MSBuild 项目文件。请指定要用于 --project 选项的项目。
zh_hant: 在 '{0}' 中找不到 MSBuild 專案檔。請指定要搭配 --project 選項使用的專案。

# Error_ProjectPath_NotFound
source: The project file '{0}' does not exist.
cs: Soubor projektu {0} neexistuje.
de: Die Projektdatei "{0}" ist nicht vorhanden.
es: El archivo de proyecto "{0}" no existe.
fr: Le fichier projet '{0}' n'existe pas.
it: Il file di progetto '{0}' non esiste.
ja: プロジェクト ファイル '{0}' が存在しません。
ko: 프로젝트 파일 '{0}'이(가) 없습니다.
pl: Plik projektu „{0}” nie istnieje.
pt_br: O arquivo de projeto '{0}' não existe.
ru: Файл проекта "{0}" не существует.
tr: Proje dosyası '{0}' yok.
zh_hans: 项目文件“{0}” 不存在。
zh_hant: 專案檔 '{0}' 不存在。

# Error_QuietAndVerboseSpecified
source: Cannot specify both '--quiet' and '--verbose' options.
cs: Možnosti --quiet a --verbose se nedají zadat spolu.
de: Die Optionen "--quiet" und "--verbose" können nicht gleichzeitig angegeben werden.
es: No se pueden especificar ambas opciones, "--quiet" y "--verbose".
fr: Impossible de spécifier les options '--quiet' et '--verbose'.
it: Non è possibile specificare entrambe le opzioni '--quiet' e '--verbose'.
ja: '--quiet' と '--verbose' の両方のオプションを指定することはできません。
ko: '--quiet' 옵션과 '--verbose' 옵션을 둘 다 지정할 수는 없습니다.
pl: Nie można jednocześnie określić opcji „--quiet” i „--verbose”.
pt_br: Não é possível especificar as opções '--quiet' e '--verbose'.
ru: Невозможно одновременно указать параметры "--quiet" и "--verbose".
tr: Hem '--quiet' hem de '--verbose' seçenekleri belirtilemez.
zh_hans: 不能同时指定 "--quiet" 和 "--verbose" 选项。
zh_hant: 無法同時指定 '--quiet' 和 '--verbose' 選項。

# Help
source: Environment variables: DOTNET_USE_POLLING_FILE_WATCHER When set to '1' or 'true', dotnet-watch will poll the file system for changes. This is required for some file systems, such as network shares, Docker mounted volumes, and other virtual file systems. DOTNET_WATCH dotnet-watch sets this variable to '1' on all child processes launched. DOTNET_WATCH_ITERATION dotnet-watch sets this variable to '1' and increments by one each time a file is changed and the command is restarted. DOTNET_WATCH_SUPPRESS_EMOJIS When set to '1' or 'true', dotnet-watch will not show emojis in the console output. Remarks: The special option '--' is used to delimit the end of the options and the beginning of arguments that will be passed to the child dotnet process. For example: dotnet watch -- --verbose run Even though '--verbose' is an option dotnet-watch supports, the use of '--' indicates that '--verbose' should be treated instead as an argument for dotnet-run. Examples: dotnet watch run dotnet watch test
cs: Proměnné prostředí: DOTNET_USE_POLLING_FILE_WATCHER Pokud je nastavená hodnota 1 nebo true, dotnet-watch se bude dotazovat systému souborů na změny. To je potřeba pro některé systémy souborů, jako jsou sdílené síťové složky, svazky připojené k Dockeru a další virtuální systémy souborů. DOTNET_WATCH dotnet-watch nastaví tuto proměnnou na hodnotu 1 u všech spuštěných podřízených procesů. DOTNET_WATCH_ITERATION dotnet-watch nastaví tuto proměnnou na hodnotu 1 a pokaždé ji zvýší o jedna pokaždé, když je soubor změněn a příkaz je restartován. DOTNET_WATCH_SUPPRESS_EMOJIS Pokud je nastavená hodnota 1 nebo true, dotnet-watch nebude zobrazovat emoji ve výstupu konzoly. Poznámky: Speciální možnost -- se používá k ohraničení konce možností a začátku argumentů, které budou předány podřízenému procesu dotnet. Příklad: dotnet watch -- --verbose run Přestože --verbose je možnost, kterou dotnet-watch podporuje, použití -- označuje, že --verbose by mělo být považováno za argument pro dotnet-run. Příklady: dotnet watch run dotnet watch test
de: Umgebungsvariablen: DOTNET_USE_POLLING_FILE_WATCHER Wenn „1“ oder „true“ festgelegt ist, fragt dotnet-watch das Dateisystem nach Änderungen ab. Dies ist für einige Dateisysteme erforderlich, wie Netzwerkfreigaben, Docker eingebundene Volumes und andere virtuelle Dateisysteme. DOTNET_WATCH dotnet-watch legt diese Variable für alle gestarteten untergeordneten Prozesse auf „1“ fest. DOTNET_WATCH_ITERATION dotnet-watch legt diese Variable auf „1“ fest und erhöht sich jedes Mal um eins, wenn eine Datei geändert und der Befehl neu gestartet wird. DOTNET_WATCH_SUPPRESS_EMOJIS Wenn „1“ oder „true“ festgelegt ist, zeigt dotnet-watch keine Emojis in der Konsolenausgabe an. Hinweise: Die spezielle Option „--“ wird verwendet, um das Ende der Optionen und den Anfang der Argumente, die an den untergeordneten dotnet-Prozess übergeben werden, zu begrenzen. Zum Beispiel: dotnet watch -- --verbose run Obwohl „--verbose“ eine Option ist, die von dotnet-watch unterstützt wird, gibt die Nutzung von „--“ an, dass „--verbose“ stattdessen als Argument für dotnet-run behandelt werden soll. Beispiele: dotnet watch run dotnet watch test
es: Variables de entorno: DOTNET_USE_POLLING_FILE_WATCHER Cuando se establece en "1" o "true", dotnet-watch sondeará el sistema de archivos en busca de cambios. Esto es necesario para algunos sistemas de archivos, como recursos compartidos de red, Volúmenes montados de Docker y otros sistemas de archivos virtuales. DOTNET_WATCH dotnet-watch establece esta variable en "1" en todos los procesos secundarios iniciados. DOTNET_WATCH_ITERATION dotnet-watch establece esta variable en "1" y se incrementa en uno cada vez que se cambia un archivo y se reinicia el comando. DOTNET_WATCH_SUPPRESS_EMOJIS Cuando se establece en "1" o "true", dotnet-watch no mostrará emojis en la salida de la consola. Notas: La opción especial "--" se usa para delimitar el final de las opciones y el principio de los argumentos que se pasarán al proceso dotnet secundario. Por ejemplo: dotnet watch -- --verbose run Aunque "--verbose" es una opción compatible con dotnet-watch, el uso de "--" indica que "--verbose" se debe tratar en su lugar como argumento para dotnet-run. Ejemplos: ejecución de watch dotnet prueba de watch dotnet
fr: Variables d’environnement : DOTNET_USE_POLLING_FILE_WATCHER Lorsqu’il est défini sur « 1 » ou « true », dotnet-watch interroge le système de fichiers à la recherche des modifications. Cela est nécessaire pour certains systèmes de fichiers, tels que les partages réseau, les volumes montés par Docker et d’autres systèmes de fichiers virtuels. DOTNET_WATCH dotnet-watch définit cette variable sur « 1 » sur tous les processus enfants lancés. DOTNET_WATCH_ITERATION dotnet-watch définit cette variable sur « 1 » et incrémente chaque fois qu’un fichier est modifié et que la commande est redémarrée. DOTNET_WATCH_SUPPRESS_EMOJIS Lorsque la valeur est « 1 » ou « true », dotnet-watch n’affiche pas d’emojis dans la sortie de la console. Remarques : L’option spéciale « -- » est utilisée pour délimiter la fin des options et le début des arguments qui seront transmis au processus dotnet enfant. Par exemple : dotnet watch -- --verbose run Même si « --verbose » est une option prise en charge par dotnet-watch, l’utilisation de « -- » indique que « --verbose » doit être traité à la place comme un argument pour dotnet-run. Exemples : dotnet watch run dotnet watch test
it: Variabili di ambiente: DOTNET_USE_POLLING_FILE_WATCHER Se impostato su '1' o 'true', dotnet-watch eseguirà il polling del file system per modifiche. Questa operazione è necessaria per alcuni file system, ad esempio condivisioni di rete, Volumi montati docker e altri file system virtuali. DOTNET_WATCH dotnet-watch imposta questa variabile su '1' in tutti i processi figlio avviati. DOTNET_WATCH_ITERATION dotnet-watch imposta questa variabile su '1' e incrementa di uno ogni volta un file viene modificato e il comando viene riavviato. DOTNET_WATCH_SUPPRESS_EMOJIS Se impostato su '1' o 'true', dotnet-watch non mostrerà emoji nel output della console. Note: L'opzione speciale '--' viene usata per delimitare la fine delle opzioni e l'inizio degli argomenti che verranno passati al processo dotnet figlio. Ad esempio: dotnet watch -- --verbose run Anche se '--verbose' è un'opzione supportata da dotnet-watch, l'uso di '--' indica che '--verbose' deve essere considerato invece come argomento per dotnet-run. Esempi: dotnet watch run dotnet watch test
ja: 環境変数: DOTNET_USE_POLLING_FILE_WATCHER '1' または 'true' に設定すると、dotnet-watch はファイル システムの変更をポーリング します。これは、ネットワーク共有、Docker でマウントされたボリューム、その他の 仮想ファイル システムなど、一部のファイル システムで必要です。 DOTNET_WATCH dotnet-watch は、起動されたすべての子プロセスでこの変数を '1' に設定します。 DOTNET_WATCH_ITERATION dotnet-watch は、この変数を '1' に設定し、ファイルが変更され、コマンドが 再起動されるたびに 1 ずつインクリメントします。 DOTNET_WATCH_SUPPRESS_EMOJIS '1' または 'true' に設定すると、dotnet-watch はコンソール出力に絵文字を 表示しません。 注釈: 特殊オプション '--' は、子 dotnet プロセスに渡される オプションの終了と引数の開始を区切るために使用されます。 例: dotnet watch -- --verbose run '--verbose' は dotnet-watch がサポートするオプションですが、'--' を使用すると、 '--verbose' を代わりに dotnet-run の引数として扱う必要があることを 示します。 例: dotnet watch run dotnet watch test
ko: 환경 변수: DOTNET_USE_POLLING_FILE_WATCHER '1' 또는 'true'로 설정하면 dotnet-watch는 파일 시스템에서 변경 내용을 폴링합니다. 이는 네트워크 공유, Docker 탑재 볼륨 및 기타 가상 파일 시스템 등 일부 파일 시스템에 필요합니다. DOTNET_WATCH dotnet-watch는 시작된 모든 자식 프로세스에서 이 변수를 '1'로 설정합니다. DOTNET_WATCH_ITERATION dotnet-watch는 이 변수를 '1'로 설정하고 파일이 변경되고 명령이 다시 시작될 때마다 1씩 증가합니다. DOTNET_WATCH_SUPPRESS_EMOJIS '1' 또는 'true'로 설정하면 dotnet-watch는 콘솔 출력에 이모지를 표시하지 않습니다. 설명: 특수 옵션 '--'는 자식 dotnet 프로세스에 전달될 옵션의 끝과 인수의 시작을 구분하는 데 사용됩니다. 예: dotnet watch -- --verbose run '--verbose'는 dotnet-watch가 지원하는 옵션이지만, '--' 사용은 '--verbose'를 dotnet-run의 인수로 대신 처리해야 함을 나타냅니다. 예: dotnet watch run dotnet watch test
pl: Zmienne środowiskowe: DOTNET_USE_POLLING_FILE_WATCHER Po ustawieniu wartości „1” lub „true” program dotnet-watch sonduje system plików pod kątem zmian. Jest to wymagane w przypadku niektórych systemów plików, takich jak udziały sieciowe, woluminy zainstalowane na platformie Docker i inne wirtualne systemy plików. DOTNET_WATCH Program dotnet-watch ustawia tę zmienną na wartość „1” we wszystkich uruchomionych procesach podrzędnych. DOTNET_WATCH_ITERATION Program dotnet-watch ustawia tę zmienną na wartość „1” i zwiększa się o jeden za każdym razem, gdy plik zostanie zmieniony i polecenie zostanie uruchomione ponownie. DOTNET_WATCH_SUPPRESS_EMOJIS Po ustawieniu wartości „1” lub „true” program dotnet-watch nie będzie wyświetlać ikon emoji w danych wyjściowych konsoli. Uwagi: Specjalna opcja „--” służy do rozdzielania końca opcji i początku argumentów, które zostaną przekazane do podrzędnego procesu dotnet. Na przykład: dotnet watch -- --verbose run Mimo że polecenie „--verbose” jest opcją obsługiwaną przez program dotnet-watch, użycie polecenia „--” wskazuje, że polecenie „--verbose” powinno być traktowane jako argument dla dotnet-run. Przykłady: przebieg programu dotnet-watch test programu dotnet-watch
pt_br: Variáveis de ambiente: DOTNET_USE_POLLING_FILE_WATCHER Quando definido como '1' ou 'true', dotnet-watch sondará o sistema de arquivos para alterações. Isso é necessário para alguns sistemas de arquivos, como compartilhamentos de rede, Volumes montados do Docker e outros sistemas de arquivos virtuais. DOTNET_WATCH dotnet-watch define essa variável como '1' em todos os processos filho iniciados. DOTNET_WATCH_ITERATION dotnet-watch define essa variável como '1' e incrementa em uma cada vez um arquivo é alterado e o comando é reiniciado. DOTNET_WATCH_SUPPRESS_EMOJIS Quando definido como '1' ou 'true', dotnet-watch não mostrará emojis no saída do console. Comentários: A opção especial '--' é usada para delimitar o final das opções e o início dos argumentos que serão passados para o processo dotnet filho. Por exemplo: dotnet watch -- --verbose executar Embora '--verbose' seja uma opção compatível com dotnet-watch, o uso de '--' indica que '--verbose' deve ser tratado como um argumento para dotnet-run. Exemplos: execução do dotnet watch teste do dotnet watch
ru: Переменные среды: DOTNET_USE_POLLING_FILE_WATCHER Если установлено значение "1" или "true", dotnet-watch будет опрашивать файловую систему на наличие изменений. Это необходимо для некоторых файловых систем, таких как сетевые папки, подключенные тома Docker и другие виртуальные файловые системы. DOTNET_WATCH dotnet-watch устанавливает для этой переменной значение "1" во всех запущенных дочерних процессах. DOTNET_WATCH_ITERATION dotnet-watch устанавливает для этой переменной значение "1" и увеличивает его на единицу при каждом изменении файла и перезапуске команды. DOTNET_WATCH_SUPPRESS_EMOJIS Если установлено значение "1" или "true", dotnet-watch не будет показывать эмодзи при выводе на консоль. Примечания: Специальный параметр "--" используется для разграничения конца параметров и начала аргументов, которые будут переданы в дочерний процесс dotnet. Например: dotnet watch -- --verbose run Хотя параметр "--verbose" поддерживается в dotnet-watch, использование "--" указывает, что "--verbose" следует рассматривать как аргумент для dotnet-run. Примеры: dotnet watch run dotnet watch test
tr: Ortam değişkenleri: DOTNET_USE_POLLING_FILE_WATCHER '1' veya 'true' olarak ayarlandığında dotnet-watch, değişiklikleri için dosya sistemini yoklar. Bu, ağ paylaşımları, Docker'a bağlı birimler ve diğer sanal dosya sistemleri gibi bazı dosya sistemleri için gereklidir. DOTNET_WATCH dotnet-watch, başlatılan tüm alt işlemlerde bu değişkeni '1' olarak ayarlar. DOTNET_WATCH_ITERATION dotnet-watch bu değişkeni '1' olarak ayarlar ve bir dosya her değiştirildiğinde ve komut yeniden başlatıldığında bir artırır. DOTNET_WATCH_SUPPRESS_EMOJIS '1' veya 'true' olarak ayarlandığında dotnet-watch, konsol çıkışında emoji göstermez. Açıklamalar: '--' özel seçeneği, seçeneklerin sonunu ve alt dotnet işlemine geçirilecek bağımsız değişkenlerin başlangıcını sınırlandırmak için kullanılır. Örneğin: dotnet watch -- --verbose run '--verbose', dotnet-watch'un desteklediği bir seçenek olsa da '--' '--verbose' öğesinin dotnet-run için bir bağımsız değişken olarak değerlendirilmesi gerektiğini gösterir. Örnekler: dotnet watch run dotnet watch test
zh_hans: 环境变量: DOTNET_USE_POLLING_FILE_WATCHER 设置为 "1" 或 "true" 时，dotnet-watch 将轮询文件系统 更改。对于某些文件系统来说(如网络共享， Docker 装载的卷和其他虚拟文件系统)，这是必需的。 DOTNET_WATCH dotnet-watch 在启动的所有子进程上将此变量设置为 "1"。 DOTNET_WATCH_ITERATION dotnet-watch 将此变量设置为 "1"，每次递增一 一个文件已更改，并且命令已重新启动。 DOTNET_WATCH_SUPPRESS_EMOJIS 当设置为 "1" 或 "true" 时，dotnet-watch 不会在 中显示表情符号 控制台输出。 备注: 特殊选项 "--" 用于分隔选项的末尾和 将传递给子 dotnet 进程的参数的开头。 例如: dotnet watch -- --verbose run 尽管 dotnet-watch 支持 "--verbose" 选项，但 "--" 的使用 指示应将 "--verbose" 转而视为 dotnet-run 的参数。 示例: dotnet watch run dotnet watch test
zh_hant: 環境變數: DOTNET_USE_POLLING_FILE_WATCHER 設定為 '1' 或 'true' 時，dotnet-watch 會輪詢檔案系統以取得 變更。某些檔案系統所需，例如網路共用、 Docker 掛載的磁碟區和其他虛擬檔案系統。 DOTNET_WATCH dotnet-watch 會在啟動的所有子程序上，將此變數設定為 '1'。 DOTNET_WATCH_ITERATION dotnet-watch 會將此變數設定為 '1'，且每次 檔案變更並重新啟動命令時遞增一。 DOTNET_WATCH_SUPPRESS_EMOJIS 設定為 '1' 或 'true' 時，dotnet-watch 不會在將表情圖示顯示在 主控台輸出。 備註: 特殊選項 '--' 會用來分隔選項的結尾 與將傳遞至子 .NET 程序的引數的開頭。 例如: dotnet watch -- --verbose run 即使 '--verbose' 是 dotnet-watch 支援的選項，使用 '--' 表示應該使用 '--verbose'，而不是作為 dotnet-run 的引數。 範例: dotnet watch run dotnet watch test

# Help_List
source: Lists all discovered files without starting the watcher.
cs: Vypíše všechny zjištěné soubory bez spuštění sledovacího procesu.
de: Listet alle ermittelten Dateien auf, ohne den Watcher zu starten.
es: Enumera todos los archivos detectados sin iniciar el monitor.
fr: Répertorie tous les fichiers découverts sans démarrer le Watcher.
it: Elenca tutti i file individuati senza avviare il watcher.
ja: ウォッチャーを起動せずに検出されたすべてのファイルを一覧表示します。
ko: 감시자를 시작하지 않고 검색된 모든 파일을 나열합니다.
pl: Wyświetla listę wszystkich odnalezionych plików bez uruchamiania obserwatora.
pt_br: Lista todos os arquivos descobertos sem iniciar o observador.
ru: Выводит список всех обнаруженных файлов без запуска наблюдателя.
tr: İzleyiciyi başlatmadan bulunan tüm dosyaları listeler.
zh_hans: 列出所有发现的文件，而不启动观察程序。
zh_hant: 列出所有探索到的檔案，而不啟動監看員。

# Help_NoHotReload
source: Suppress hot reload for supported apps.
cs: Potlačit opětovné načítání za provozu pro podporované aplikace.
de: Hot Reload für unterstützte Apps unterdrücken.
es: Suprime la recarga activa para las aplicaciones compatibles.
fr: Supprime le rechargement à chaud pour les applications prises en charge.
it: Elimina il ricaricamento rapido per le app supportate.
ja: サポートされているアプリのホット リロードを抑制します。
ko: 지원되는 앱에 대해 핫 다시 로드를 표시하지 않습니다.
pl: Pomiń przeładowywanie na gorąco dla obsługiwanych aplikacji.
pt_br: Suprimir recarga dinâmica para aplicativos com suporte.
ru: Подавление горячей перезагрузки для поддерживаемых приложений.
tr: Desteklenen uygulamalar için çalışırken yeniden yüklemeyi gizleyin.
zh_hans: 抑制支持的应用的热重载。
zh_hant: 抑制支援的應用程式的熱重新載入。

# Help_NonInteractive
source: Runs dotnet-watch in non-interactive mode. This option is only supported when running with Hot Reload enabled. Use this option to prevent console input from being captured.
cs: Spustí dotnet-watch v neinteraktivním režimu. Tato možnost je podporována pouze při spuštění s povoleným opětovným načítáním za provozu. Tuto možnost použijte, pokud chcete zabránit zachycení vstupu konzoly.
de: Führt dotnet-watch im nicht interaktiven Modus aus. Diese Option wird nur unterstützt, wenn sie mit aktiviertem Hot Reload ausgeführt wird. Verwenden Sie diese Option, um zu verhindern, dass Konsoleneingaben erfasst werden.
es: Ejecuta dotnet-watch en modo no interactivo. Esta opción solo se admite cuando se ejecuta con la Recarga activa habilitada. Use esta opción para evitar que se capture la entrada de la consola.
fr: Exécute dotnet-watch en mode non interactif. Cette option est prise en charge uniquement lors de l’exécution avec Rechargement à chaud activé. Utilisez cette option pour empêcher la capture de l’entrée de console.
it: Esegue dotnet-watch in modalità non interattiva. Questa opzione è supportata solo quando si esegue con Ricaricamento rapido abilitata. Usare questa opzione per impedire l'acquisizione dell'input della console.
ja: dotnet-watch を非対話型モードで実行します。このオプションは、ホット リロードを有効にして実行する場合にのみサポートされます。 コンソール入力がキャプチャされないようにするには、このオプションを使用します。
ko: 대화형이 아닌 모드에서 dotnet-watch를 실행합니다. 이 옵션은 핫 다시 로드가 사용하도록 설정된 상태에서 실행하는 경우에만 지원됩니다. 콘솔 입력이 캡처되지 않도록 하려면 이 옵션을 사용합니다.
pl: Uruchamia program dotnet-watch w trybie nieinterakcyjnym. Ta opcja jest obsługiwana tylko w przypadku uruchamiania z włączoną funkcją przeładowywania na gorąco. Użyj tej opcji, aby uniemożliwić przechwytywanie danych wejściowych konsoli.
pt_br: Executa dotnet-watch no modo não interativo. Essa opção só tem suporte ao executar com Recarga Dinâmica habilitada. Use esta opção para impedir que a entrada do console seja capturada.
ru: Запускает dotnet-watch в неинтерактивном режиме. Этот параметр поддерживается только при запуске с включенной горячей перезагрузкой. Используйте этот параметр, чтобы предотвратить перехват входных данных консоли.
tr: dotnet-watch'u etkileşimli olmayan modda çalıştırır. Bu seçenek yalnızca Çalışırken Yeniden Yükleme etkinken çalıştırıldığında desteklenir. Konsol girişinin yakalanmasını önlemek için bu seçeneği kullanın.
zh_hans: 在非交互模式下运行 dotnet-watch。只有在启用了热重载的情况下运行时，才支持此选项。 使用此选项可防止捕获控制台输入。
zh_hant: 在非互動式模式中執行 dotnet-watch。只有在啟用熱重新載入功能執行時，才支援此選項。 使用此選項來防止主機輸入被擷取。

# Help_Quiet
source: Suppresses all output except warnings and errors
cs: Potlačí všechny výstupy kromě upozornění a chyb
de: Unterdrückt alle Ausgaben außer Warnungen und Fehlern
es: Suprime todas las salidas excepto las advertencias y los errores
fr: Supprime toutes les sorties à l’exception des avertissements et des erreurs
it: Elimina tutti gli output tranne gli avvisi e gli errori
ja: 警告とエラーを除くすべての出力を抑制します
ko: 경고 및 오류를 제외한 모든 출력을 표시하지 않습니다.
pl: Pomija wszystkie dane wyjściowe z wyjątkiem ostrzeżeń i błędów
pt_br: Suprime todas as saídas, exceto avisos e erros
ru: Подавляет все выходные данные, кроме предупреждений и ошибок
tr: Uyarılar ve hatalar dışında tüm çıkışı gizler
zh_hans: 抑制所有输出(警告和错误除外)
zh_hant: 抑制所有輸出，但警告和錯誤除外

# Help_Verbose
source: Show verbose output
cs: Zobrazit podrobní výstup
de: Ausführliche Ausgabe anzeigen
es: Mostrar salida detallada
fr: Afficher la sortie détaillée
it: Mostra l'output di verbose
ja: 詳細出力を表示します
ko: 자세한 출력 표시
pl: Pokaż pełne dane wyjściowe
pt_br: Mostrar a saída detalhada
ru: Показать подробный вывод
tr: Ayrıntılı çıkışı göster
zh_hans: 显示详细输出
zh_hant: 顯示詳細資訊輸出
