Repository: dotnet/sdk
Catalog: src/BuiltInTools/dotnet-format/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, pl, pt_br, ru, zh_hans, zh_hant

source: Formats code to match editorconfig settings.
cs: Formátuje kód, aby odpovídal nastavení editorconfig.
de: Formatiert Code so, dass er den EditorConfig-Einstellungen entspricht.
es: Da formato al código para que coincida con la configuración de editorconfig.
fr: Met en forme le code pour qu’il corresponde aux paramètres editorconfig.
it: Formatta il codice in modo che corrisponda alle impostazioni di editorconfig.
ja: EditorConfig 設定に一致するようにコードの書式を設定します。
pl: Formatuje kod, aby był zgodny z ustawieniami editorconfig.
pt_br: Formata o código para corresponder as configurações de editorconfig.
ru: Форматирование кода для соответствия параметрам editorconfig.
zh_hant: 將程式碼格式化為符合 editorconfig 設定。

source: Formats files without saving changes to disk. Terminates with a non-zero exit code if any files were formatted.
cs: Formátuje soubory bez toho, aby se změny ukládaly na disk. Pokud se nějaké soubory naformátovaly, ukončí se s nenulovým ukončovacím kódem.
de: Formatiert Dateien ohne Speichern der Änderungen auf dem Datenträger. Wird mit einem Exitcode ungleich Null beendet, wenn Dateien formatiert wurden.
es: Da formato a los archivos sin guardar los cambios en el disco. Termina con un código de salida distinto de cero si se ha dado formato a algún archivo.
fr: Met en forme les fichiers sans enregistrer les changements sur le disque. Se termine par un code de sortie non nul si des fichiers ont été mis en forme.
it: Formatta i file senza salvare le modifiche nel disco. Termina con un codice di uscita diverso da zero se sono stati formattati file.
ja: 変更をディスクに保存せずにファイルを書式設定します。いずれかのファイルが書式設定されている場合、0 以外の終了コードで終了します。
pl: Formatuje pliki bez zapisywania zmian na dysku. Kończy się niezerowym kodem zakończenia, jeśli zostały sformatowane jakiekolwiek pliki.
pt_br: Formata arquivos sem salvar as alterações no disco. Termina com um código de saída diferente de zero se algum arquivo foi formatado.
ru: Форматирует файлы без сохранения изменений на диск. Завершается с ненулевым кодом завершения, если были отформатированы какие-либо файлы.
zh_hans: 将文件格式化且不将所作更改保存到磁盘中。如果有文件进行了格式化处理，则以非零退出代码终止。
zh_hant: 將檔案格式化，但不將變更儲存到磁碟。如果有任何檔案已格式化，則作業會終止，並產生非零的結束代碼。

source: Formatted {0} of {1} files.
cs: Naformátovali jsme {0} z {1} souborů.
de: {0} von {1} Dateien wurden formatiert.
es: {0} de {1} archivos con formato aplicado.
fr: {0} fichiers mis en forme sur {1}.
it: Sono stati formattati {0} di {1} file.
ja: {1} 個中 {0} 個のファイルがフォーマットされました。
pl: Sformatowano {0} z {1} plików.
pt_br: {0} de {1} arquivos formatados.
ru: Отформатировано файлов: {0} из {1}.
zh_hans: 已将 {0} 个文件格式化(共 {1} 个)。
zh_hant: 已將 {0}/{1} 個檔案格式化。

source: Formatting code file '{0}'.
cs: Formátuje se soubor kódu {0}.
de: Codedatei "{0}" wird formatiert.
es: Formato de archivo de código "{0}".
fr: Mise en forme du fichier de code '{0}'.
it: Formattazione del file di codice '{0}'.
ja: コード ファイル '{0}' をフォーマットしています。
pl: Formatowanie pliku kodu „{0}”.
pt_br: Arquivo de código de formatação '{0}'.
ru: Форматирование файла кода "{0}".
zh_hans: 正在设置代码文件“{0}”的格式。
zh_hant: 正在將程式碼檔案 '{0}' 格式化。

source: Formatting code files in workspace '{0}'.
cs: Formátují se soubory kódu v pracovním prostoru {0}.
de: Codedateien im Arbeitsbereich "{0}" werden formatiert.
es: Aplicar formato a archivos de código en espacio de trabajo "{0}".
fr: Mise en forme des fichiers de code dans l'espace de travail '{0}'.
it: Formattazione del file di codice nell'area di lavoro '{0}'.
ja: ワークスペース '{0}' でコード ファイルを書式設定します。
pl: Formatowanie plików kodu w obszarze roboczym „{0}”.
pt_br: Formatação de arquivos de código no espaço de trabalho '{0}'.
ru: Форматирование кода файлов в рабочей области "{0}".
zh_hans: 正在设置工作区“{0}”中代码文件的格式。
zh_hant: 正在將工作區 '{0}' 中的程式碼檔案格式化。

source: Include generated code files in formatting operations.
cs: Zahrňte do operací formátování vygenerované soubory kódu.
de: Hiermit werden generierte Codedateien in Formatierungsvorgänge einbezogen.
es: Incluya los archivos de código generados en las operaciones de formato.
fr: Ajoutez des fichiers de code générés dans les opérations de mise en forme.
it: Includere i file del codice generato nelle operazioni di formattazione.
ja: 生成されたコード ファイルを書式設定操作に含めます。
pl: Uwzględnij wygenerowane pliki kodu w operacjach formatowania.
pt_br: Incluir arquivos de código gerados em operações de formatação.
ru: Включить созданные файлы кода в операции форматирования.
zh_hans: 在格式化操作中包含所生成的代码文件。
zh_hant: 在格式化作業中包含產生的程式碼檔案。

source: Insert '{0}'.
cs: Vložit {0}
de: "{0}" einfügen.
es: Inserte "{0}".
fr: Insérer '{0}'.
it: Inserisci '{0}'.
ja: {0} の挿入
pl: Wstaw element {0}.
pt_br: Inserir "{0}".
ru: Вставка "{0}"
zh_hant: 插入 '{0}'。

source: Loading workspace.
cs: Načítá se pracovní prostor.
de: Arbeitsbereich wird geladen.
es: Cargando área de trabajo.
fr: Chargement de l'espace de travail.
it: Caricamento dell'area di lavoro.
ja: ワークスペースを読み込んでいます。
pl: Ładowanie obszaru roboczego.
pt_br: Carregando espaço de trabalho.
ru: Загрузка рабочей области.
zh_hans: 正在加载工作区。
zh_hant: 正在載入工作區。

source: Log all project or solution load information to a binary log file.
cs: Protokoluje všechny informace o načtení projektu nebo řešení do souboru binárního protokolu.
de: Protokollieren Sie alle Projekt- oder Lösungsladeinformationen in eine binäre Protokolldatei.
es: Registre toda la información de carga de proyecto o solución en un archivo de registro binario.
fr: Consignez toutes les informations de chargement du projet ou de la solution dans un fichier journal binaire.
it: Registrare tutte le informazioni di caricamento del progetto o della soluzione in un file di log binario.
ja: すべてのプロジェクトまたはソリューション読み込み情報をバイナリ ログ ファイルに記録します。
pl: Zarejestruj wszystkie informacje o ładowaniu projektu lub rozwiązania do pliku dziennika binarnego.
pt_br: Registrar em log todas as informações de carregamento do projeto ou da solução em um arquivo de log binário.
ru: Запись всех сведений о загрузке проекта или решения в двоичный файл журнала.
zh_hant: 將所有專案或解決方案載入資訊記錄到二進位記錄檔。

source: Multiple MSBuild project files found in '{0}'. Specify which to use with the <workspace> argument.
cs: {0} obsahuje více souborů projektů MSBuild. Určete, který soubor chcete použít, pomocí argumentu <workspace>.
de: In "{0}" wurden mehrere MSBuild-Projektdateien gefunden. Geben Sie die zu verwendende Datei mit dem <workspace>-Argument an.
es: Se encontraron varios archivos del proyecto MSBuild en "{0}". Especifique cuál debe usarse con el argumento <workspace>.
fr: Plusieurs fichiers projet MSBuild trouvés dans '{0}'. Spécifiez celui qui doit être utilisé avec l'argument <espace de travail>.
it: In '{0}' sono stati trovati più file di progetto MSBuild. Per specificare quello desiderato, usare l'argomento <workspace>.
ja: 複数の MSBuild プロジェクト ファイルが '{0}' で見つかりました。使用するものを <workspace> 引数で指定してください。
pl: W elemencie „{0}” znaleziono wiele plików projektów MSBuild. Określ, którego użyć, za pomocą argumentu <workspace>.
pt_br: Foram encontrados vários arquivos de projeto do MSBuild em '{0}'. Especifique qual será usado com o argumento <workspace>.
ru: В "{0}" обнаружено несколько файлов проекта MSBuild. Укажите используемый файл с помощью аргумента <workspace>.
zh_hans: 在“{0}”中找到多个 MSBuild 项目文件。请指定要用于 <workspace> 参数的文件。
zh_hant: 在 '{0}' 中找到多個 MSBuild 專案檔。請指定要用於 <workspace> 引數的檔案。

source: Multiple MSBuild solution files found in '{0}'. Specify which to use with the <workspace> argument.
cs: {0} obsahuje více souborů řešení MSBuild. Určete, který soubor chcete použít, pomocí argumentu <workspace>.
de: In "{0}" wurden mehrere MSBuild-Projektmappendateien gefunden. Geben Sie die zu verwendende Datei mit dem <workspace>-Argument an.
es: Se encontraron varios archivos de solución MSBuild en "{0}". Especifique cuál debe usarse con el argumento <workspace>.
fr: Plusieurs fichiers solution MSBuild trouvés dans '{0}'. Spécifiez celui qui doit être utilisé avec l'argument <espace de travail>.
it: In '{0}' sono stati trovati più file di soluzione MSBuild. Per specificare quello desiderato, usare l'argomento <workspace>.
ja: 複数の MSBuild ソリューション ファイルが '{0}' で見つかりました。使用するものを <workspace> 引数で指定してください。
pl: W elemencie „{0}” znaleziono wiele plików rozwiązań MSBuild. Określ plik do użycia za pomocą argumentu <workspace>.
pt_br: Foram encontrados vários arquivos de solução do MSBuild em '{0}'. Especifique qual será usado com o argumento <workspace>.
ru: В "{0}" обнаружено несколько файлов решения MSBuild. Укажите используемый файл с помощью аргумента <workspace>.
zh_hans: 在“{0}”中找到多个 MSBuild 解决方案文件。请指定要用于 <workspace> 参数的文件。
zh_hant: 在 '{0}' 中找到多個 MSBuild 解決方案檔。請指定要用於 <workspace> 引數的檔案。

source: Project {0} is using configuration from '{1}'.
cs: Projekt {0} používá konfiguraci z {1}.
de: Projekt {0} verwendet die Konfiguration von „{1}“.
es: El proyecto {0} está usando la configuración de "{1}".
fr: Project {0} utilise la configuration de «{1}».
it: Il progetto {0} usa la configurazione da '{1}'.
ja: プロジェクト {0} は、'{1}' からの構成を使用しています。
pl: Projekt {0} używa konfiguracji z lokalizacji „{1}”.
pt_br: O projeto {0} está usando a configuração de '{1}'.
ru: Проект {0} использует конфигурацию из "{1}".
zh_hant: 專案 {0} 正在使用來自 '{1}' 的設定。

source: Replace {0} characters with '{1}'.
cs: Znaky {0} nahraďte {1}.
de: Ersetzen Sie {0} Zeichen durch „{1}“.
es: Reemplazar {0} caracteres por "{1}".
fr: Remplacez {0} caractères par '{1}'.
it: Sostituire {0} caratteri con '{1}'.
ja: {0} 文字を '{1}' に置き換えます。
pl: Zamień znaki {0} na „{1}”.
pt_br: Substituir {0} caracteres por '{1}'.
ru: Замените символы {0} на "{1}".
zh_hant: 將 {0} 字元取代為 '{1}'。

source: Required references did not load for {0} or referenced project. Run `dotnet restore` prior to formatting.
cs: Požadované odkazy nebyly načteny pro {0} nebo pro projekt, na který se odkazuje. Před formátováním spusťte dotnet restore.
de: Erforderliche Verweise wurden für {0} oder das referenzierte Projekt nicht geladen. Führen Sie vor der Formatierung „dotnet restore“ aus.
es: No se cargaron las referencias necesarias para {0} o el proyecto al que se hace referencia. Ejecute "dotnet restore" antes de formatear.
fr: Les références requises n’ont pas été chargées pour {0} ou projet référencé. Exécutez « dotnet restore » avant la mise en forme.
it: I riferimenti obbligatori non sono stati caricati per {0} o per il progetto a cui si fa riferimento. Eseguire 'dotnet restore' prima della formattazione.
ja: 必要な参照が、{0} または参照されたプロジェクトに対して読み込まれませんでした。書式設定の前に `dotnet restore` を実行してください。
pl: Wymagane odwołania nie zostały załadowane dla projektu {0} lub projektu, do którego istnieje odwołanie. Uruchom polecenie `dotnet restore` przed formatowaniem.
pt_br: As referências necessárias não foram carregadas para {0} ou projeto referenciado. Execute o `dotnet restore` antes de formatar.
ru: Обязательные ссылки не загружены для {0} или проекта, на который указывает ссылка. Запуск "dotnet restore" перед форматированием.
zh_hant: {0} 或參考的專案所需的參考未載入。在格式化之前執行 `dotnet restore`。

source: Remove unnecessary import.
cs: Odebrat nepotřebný import.
de: Unnötige Import-Direktiven entfernen.
es: Quitar la importación innecesaria.
fr: Supprimez l’importation inutile.
it: Rimuovere l'importazione non necessaria.
ja: 不要なインポートを削除します。
pl: Usuń niepotrzebne importy.
pt_br: Remover a importação desnecessária.
ru: Удалить ненужные операцию импорта.
zh_hant: 移除不必要的匯入。

source: Run 3rd party analyzers and apply fixes.
cs: Spustit analyzátory třetích stran a použít opravy
de: Führen Sie Drittanbieter-Analysetools aus, und wenden Sie Korrekturen an.
es: Ejecute analizadores de terceros y aplique las correcciones.
fr: Exécutez des analyseurs tiers et appliquez des correctifs.
it: Esegue gli analizzatori di terze parti e applica le correzioni.
ja: サード パーティのアナライザーを実行し、修正プログラムを適用します。
pl: Uruchom analizatory innych firm i zastosuj poprawki.
pt_br: Executar analisadores de terceiros e aplicar correções.
ru: Запустите сторонние анализаторы и примените исправления.
zh_hant: 執行協力廠商分析器並套用修正。

source: Run 3rd party analyzers and apply fixes.
cs: Spustit analyzátory třetích stran a použít opravy
de: Führen Sie Drittanbieter-Analysetools aus, und wenden Sie Korrekturen an.
es: Ejecute analizadores de terceros y aplique las correcciones.
fr: Exécutez des analyseurs tiers et appliquez des correctifs.
it: Esegue gli analizzatori di terze parti e applica le correzioni.
ja: サード パーティのアナライザーを実行し、修正プログラムを適用します。
pl: Uruchom analizatory innych firm i zastosuj poprawki.
pt_br: Executar analisadores de terceiros e aplicar correções.
ru: Запустите сторонние анализаторы и примените исправления.
zh_hans: 运行第三方分析器并应用修补程序。
zh_hant: 執行協力廠商分析器並套用修正。

source: Run code style analyzers and apply fixes.
cs: Spustit analyzátory stylu kódu a použít opravy
de: Führen Sie Codeformat-Analysetools aus, und wenden Sie Korrekturen an.
es: Ejecute analizadores de estilo de código y aplique las correcciones.
fr: Exécutez des analyseurs de style de code et appliquez des correctifs.
it: Esegue gli analizzatori degli stili di codice e applica le correzioni.
ja: コード スタイル アナライザーを実行し、修正プログラムを適用します。
pl: Uruchom analizatory stylu kodu i zastosuj poprawki.
pt_br: Executar analisadores de estilo de código e aplicar correções.
ru: Запустите анализаторы стиля кода и примените исправления.
zh_hans: 运行代码样式分析器并应用修补程序。
zh_hant: 執行程式碼樣式分析器並套用修正。

source: Run whitespace formatting.
cs: Spusťte formátování prázdných znaků.
de: Führen Sie die Leerzeichenformatierung aus.
es: Ejecute el formato de espacio en blanco.
fr: Exécute la mise en forme des espaces blancs.
it: Eseguire la formattazione degli spazi vuoti.
ja: 空白の書式を設定します。
pl: Uruchom formatowanie odstępów.
pt_br: Corrigir a formatação de espaço em branco.
ru: Запуск форматирования пустого пространства.
zh_hant: 執行空白字元格式化。

source: Run whitespace formatting. Run by default when not applying fixes.
cs: Spusťte formátování prázdných znaků. Spustit ve výchozím nastavení, pokud se nepoužívají opravy.
de: Führen Sie die Leerzeichenformatierung aus. Wird standardmäßig ausgeführt, wenn keine Korrekturen angewendet werden.
es: Ejecutar el formato de espacio en blanco. Ejecutar de forma predeterminada cuando no se apliquen correcciones.
fr: Exécute la mise en forme des espaces blancs. Exécuter par défaut quand aucun correctif n’est appliqué.
it: Eseguire la formattazione degli spazi vuoti. Viene eseguito per impostazione predefinita quando non si applicano correzioni.
ja: 空白の書式を設定します。修正を適用しない場合に既定で実行します。
pl: Uruchom formatowanie odstępów. Uruchamiaj domyślnie, gdy poprawki nie są stosowane.
pt_br: Executar formatação de espaços em branco. Executado por padrão quando não aplicando correções.
ru: Запуск форматирования пустого пространства. Запуск по умолчанию, если исправления не применяются.
zh_hant: 執行空白字元格式化。未套用修正時預設執行。

source: Running {0} analysis.
cs: Probíhá analýza {0}.
de: Die Analyse für "{0}" wird ausgeführt.
es: Ejecutando el análisis de {0}.
fr: Exécution de l'analyse de {0}.
it: Esecuzione dell'analisi {0}.
ja: {0} 分析を実行しています。
pl: Uruchamianie analizy {0}.
pt_br: Executando a análise de {0}.
ru: Выполнение анализа {0}.
zh_hans: 正在运行 {0} 分析。
zh_hant: 正在執行 {0} 分析。

source: Running {0} analyzers on {1}.
cs: Spouští se analyzátory {0} na {1}.
de: Ausführen von {0}-Analysetools auf {1}.
es: Ejecutando {0} analizadores en {1}.
fr: Exécution des analyseurs {0} sur {1}.
it: Esecuzione degli analizzatori {0} in {1}.
ja: {1} で {0} アナライザーを実行しています。
pl: Uruchamianie {0} analizatorów na {1}.
pt_br: Executando {0} analisadores em {1}.
ru: Запуск анализаторов ({0}) в {1}.
zh_hant: 正在在 {1} 上執行 {0} 分析器。

source: Running formatters.
cs: Spouští se formátování.
de: Formatierer werden ausgeführt.
es: Ejecutando los formateadores.
fr: Exécution des formateurs.
it: Esecuzione dei formattatori.
ja: フォーマッタを実行しています。
pl: Uruchamianie elementów formatujących.
pt_br: Executando formatadores.
ru: Запуск средств форматирования.
zh_hans: 正在运行格式化程序。
zh_hant: 正在執行格式器。

source: Set the verbosity level. Allowed values are q[uiet], m[inimal], n[ormal], d[etailed], and diag[nostic]
cs: Nastavte úroveň podrobností. Povolené hodnoty jsou: q[uiet], m[inimal], n[ormal], d[etailed] a diag[nostic]
de: Legen Sie den Ausführlichkeitsgrad fest. Zulässige Werte sind "q[uiet]", "m[inimal]", "n[ormal]", "d[etailed]" und "diag[nostic]".
es: Establecer el nivel de detalle. Los valores permitidos son q[uiet], m[inimal], n[ormal], d[etailed]c y diag[nostic]
fr: Définissez le niveau de détail. Les valeurs autorisées sont q[uiet], m[inimal], n[ormal], d[etailed] et diag[nostic]
it: Consente di impostare il livello di dettaglio. I valori consentiti sono q[uiet], m[inimal], n[ormal], d[etailed] e diag[nostic]
ja: 詳細レベルを設定します。許可されている値: q[uiet]、m[inimal]、n[ormal]、d[etailed]、diag[nostic]
pl: Ustaw poziom szczegółowości. Dozwolone wartości to q[uiet] (cicha), m[inimal] (minimalna), n[ormal] (normalna), d[etailed] (szczegółowa) i diag[nostic] (diagnostyczna)
pt_br: Defina o nível de detalhes. Os valores permitidos são q[uiet], m[inimal], n[ormal], d[etailed], e diag[nostic]
ru: Задает уровень детализации. Допустимые значения: q (без вывода подробных сведений), m (минимальный), n (нормальный), d (подробный) и diag (диагностика)
zh_hans: 设置详细级别。允许的值为 q[uiet]、m[inimal]、n[ormal]、d[etailed] 和 diag[nostic]
zh_hant: 設定詳細資訊層級。允許的值為 q[uiet]、m[inimal]、n[ormal]、d[etailed] 和 diag[nostic]

source: Skipping referenced project '{0}'.
cs: Přeskočí se odkazovaný projekt {0}.
de: Überspringen von referenziertem Projekt "{0}".
es: Omitiendo projecto al que se hace referencia "{0}".
fr: Saut du projet référencé '{0}'.
it: Il progetto di riferimento '{0}' verrà ignorato.
ja: 参照プロジェクト '{0}' をスキップしています。
pl: Pomijanie przywoływanego projektu „{0}”.
pt_br: Ignorando o projeto referenciado '{0}'.
ru: Пропуск указанного проекта "{0}".
zh_hans: 正在跳过引用的项目“{0}”。
zh_hant: 跳過參考的專案 '{0}’。

# SolutionOrProjectArgumentDescription
source: The project or solution file to operate on. If a file is not specified, the command will search the current directory for one.
cs: Soubor projektu nebo řešení, se kterým se má operace provést. Pokud soubor není zadaný, příkaz ho bude hledat v aktuálním adresáři.
de: Das Projekt oder die Projektmappendatei, die verwendet werden soll. Wenn keine Datei angegeben ist, durchsucht der Befehl das aktuelle Verzeichnis nach einer Datei.
es: El archivo de proyecto o solución donde operar. Si no se especifica un archivo, el comando buscará uno en el directorio actual.
fr: Fichier projet ou solution à utiliser. Si vous ne spécifiez pas de fichier, la commande en recherche un dans le répertoire actuel.
it: File di progetto o di soluzione su cui intervenire. Se non si specifica un file, il comando ne cercherà uno nella directory corrente.
ja: 利用するプロジェクト ファイルまたはソリューション ファイル。指定しない場合、コマンドは現在のディレクトリを検索します。
pl: Plik projektu lub rozwiązania, dla którego ma zostać wykonana operacja. Jeśli plik nie zostanie podany, polecenie wyszuka go w bieżącym katalogu.
pt_br: O arquivo de solução ou projeto para operar. Se um arquivo não for especificado, o comando pesquisará um no diretório atual.
ru: Файл проекта или решения. Если файл не указан, команда будет искать его в текущем каталоге.
zh_hans: 要操作的项目或解决方案文件。如果没有指定文件，则命令将在当前目录里搜索一个文件。
zh_hant: 要操作的專案或解決方案。若未指定檔案，命令就會在目前的目錄中搜尋一個檔案。

source: Solution {0} has no projects
cs: Řešení {0} nemá žádné projekty.
de: Die Projektmappe "{0}" enthält keine Projekte.
es: La solución {0} no tiene ningún proyecto.
fr: La solution {0} n'a aucun projet
it: La soluzione {0} non contiene progetti
ja: ソリューション {0} にプロジェクトがありません
pl: Rozwiązanie {0} nie zawiera projektów
pt_br: A solução {0} não tem nenhum projeto
ru: Решение {0} не содержит проектов.
zh_hans: 解决方案 {0} 不包含任何项目
zh_hant: 解決方案 {0} 沒有任何專案

# Standard_input_used_multiple_times
source: Standard input markers ('/dev/stdin', '-') can only be used either with `--include` or `--exclude`, but not both.
cs: Standardní vstupní značky ('/dev/stdin', '-') se dají použít pouze s --include nebo --exclude, ale ne s oběma.
de: Standardeingabemarker („/dev/stdin“, „-“) können nur mit „--einschließlich“ oder „--ausschließlich“ verwendet werden, aber nicht mit beiden.
es: Los marcadores de entrada estándar ("/dev/stdin", "-") solo se pueden usar con "--include" o "--exclude", pero no con ambos.
fr: Les marqueurs d’entrée standard ('/dev/stdin', '-') ne peuvent être utilisés qu’avec '--include' ou '--exclude', mais pas les deux.
it: I marcatori di standard input ('/dev/stdin', '-') possono essere usati solo con '--include' o '--exclude', ma non con entrambi.
ja: 標準入力マーカー ('/dev/stdin'、'-') は、`--include` または `--exclude` とのみ使用できますが、両方は使用できません。
pl: Znaczniki wejścia standardowego („/dev/stdin”, „-”) mogą być używane tylko z elementem „--include” lub „--exclude”, ale nie z obydwoma jednocześnie.
pt_br: Marcadores de entrada padrão ('/dev/stdin', '-') só podem ser usados com --include ou --exclude, mas não com ambos.
ru: Стандартные входные маркеры ("/dev/stdin", "-") можно использовать только с "--include" или "--exclude", но не с обоими параметрами одновременно.
zh_hant: 標準輸入標記 ('/dev/stdin', '-') 只能搭配 `--include` 或 `--exclude` 使用，但不能同時使用。

source: The '--diagnostics' option only applies when fixing style or running analyzers.
cs: Možnost --diagnostics se použije jenom při opravě stylu nebo spuštění analyzátorů.
de: Die Option „--Diagnose“ gilt nur beim Korrigieren der Formatvorlage oder beim Ausführen von Analysetools.
es: La opción "--diagnostics" solo se aplica al corregir el estilo o al ejecutar analizadores.
fr: L’option « --diagnostics » s’applique uniquement lors de la correction du style ou de l’exécution d’analyseurs.
it: L'opzione '--diagnostics' si applica solo quando si corregge lo stile o si eseguono gli analizzatori.
ja: '--diagnostics' オプションは、スタイルを修正する場合、またはアナライザーを実行している場合にのみ適用されます。
pl: Opcja „--diagnostics” ma zastosowanie tylko w przypadku naprawiania stylu lub uruchamiania analizatorów.
pt_br: A opção '--diagnostics' só se aplica ao corrigir estilo ou executar analisadores.
ru: Параметр "--diagnostics" применяется только при исправлении стиля или запуске анализаторов.
zh_hant: '--diagnostics' 選項僅於修正樣式或執行分析器時適用。

source: The dotnet CLI version is '{0}'.
cs: Verze .NET CLI je {0}.
de: Die dotnet-CLI-Version ist "{0}".
es: La versión de la CLI de dotnet es "{0}".
fr: La version de l'interface CLI dotnet est '{0}'.
it: La versione dell'interfaccia della riga di comando di dotnet è '{0}'.
ja: dotnet CLI バージョンは '{0}' です。
pl: Wersja interfejsu wiersza polecenia dotnet to „{0}”.
pt_br: A versão do CLI do dotnet é '{0}'.
ru: Версия CLI dotnet: "{0}".
zh_hans: dotnet CLI 版本为“{0}”。
zh_hant: dotnet CLI 版本為 '{0}'。

source: The dotnet format version is '{0}'.
cs: Verze formátu dotnet je {0}.
de: Die Dotnet-Formatversion ist „{0}“.
es: La versión del formato dotnet es "{0}".
fr: La version du format dotnet est «{0}».
it: La versione del formato dotnet è '{0}'.
ja: dotnet 形式のバージョンは '{0}' です。
pl: Wersja formatu dotnet to „{0}”.
pt_br: A versão do dotnet format é '{0}'.
ru: Версия формата dotnet: "{0}".
zh_hant: .NET 格式版本為 '{0}'。

source: The dotnet runtime version is '{0}'.
cs: Verze modulu runtime dotnet je {0}.
de: Die Dotnet-Laufzeitversion ist „{0}“.
es: La versión del entorno de ejecución de dotnet es "{0}".
fr: La version du runtime dotnet est «{0}».
it: La versione del runtime dotnet è '{0}'.
ja: dotnet ランタイム バージョンは '{0}' です。
pl: Wersja środowiska uruchomieniowego dotnet to „{0}”.
pt_br: A versão do dotnet runtime é '{0}'.
ru: Версия среды выполнения dotnet: "{0}".
zh_hant: .NET 執行階段版本為 '{0}'。
