Repository: dotnet/sdk
Catalog: src/BuiltInTools/dotnet-format/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, pl, pt_br, ru, zh_hans, zh_hant

source: The file '{0}' does not appear to be a valid project or solution file.
cs: Soubor {0} zřejmě není platný soubor projektu nebo řešení.
de: Die Datei "{0}" ist weder ein gültiges Projekt noch eine Projektmappendatei.
es: El archivo "{0}" no parece ser un proyecto o archivo de solución válido.
fr: Le fichier '{0}' ne semble pas être un fichier projet ou solution valide.
it: Il file '{0}' non sembra essere un file di progetto o di soluzione valido.
ja: ファイル '{0}' が、有効なプロジェクト ファイルまたはソリューション ファイルではない可能性があります。
pl: Plik „{0}” prawdopodobnie nie jest prawidłowym plikiem projektu lub rozwiązania.
pt_br: O arquivo '{0}' parece não ser um projeto válido ou o arquivo de solução.
ru: Файл "{0}" не является допустимым файлом проекта или решения.
zh_hans: 文件“{0}”似乎不是有效的项目或解决方案文件。
zh_hant: 檔案 '{0}' 似乎不是有效的專案或解決方案檔。

source: The project file '{0}' does not exist.
cs: Soubor projektu {0} neexistuje.
de: Die Projektdatei "{0}" ist nicht vorhanden.
es: El archivo de proyecto "{0}" no existe.
fr: Le fichier projet '{0}' n'existe pas.
it: Il file di progetto '{0}' non esiste.
ja: プロジェクト ファイル '{0}' が存在しません。
pl: Plik projektu „{0}” nie istnieje.
pt_br: O arquivo de projeto '{0}' não existe.
ru: Файл проекта "{0}" не существует.
zh_hans: 项目文件“{0}” 不存在。
zh_hant: 專案檔 '{0}' 不存在。

source: The severity of diagnostics to fix. Allowed values are info, warn, and error.
cs: Závažnost diagnostiky, která se má opravit. Povolené hodnoty jsou info, warn a error.
de: Der Schweregrad der zu korrigierenden Diagnose. Zulässige Werte sind Info, Warnung und Fehler.
es: La gravedad de los diagnósticos que se van a corregir. Los valores permitidos son información, advertencia y error.
fr: Gravité des diagnostics à résoudre. Les valeurs autorisées sont info, Warn et Error.
it: Gravità della diagnostica da correggere. I valori consentiti sono info, avvisi ed errori.
ja: 修正する診断の重大度。許可されている値は、info、warn、および error です。
pl: Ważność diagnostyki do naprawienia. Dozwolone wartości to informacje, ostrzeżenia i błędy.
pt_br: A gravidade do diagnóstico a ser corrigida. Os valores permitidos são info, aviso e erro.
ru: Серьезность диагностики для исправления. Допустимые значения: info, warn и error.
zh_hant: 要修正的診斷嚴重性。允許的值為資訊、警告和錯誤。

source: The solution file '{0}' does not exist.
cs: Soubor řešení {0} neexistuje.
de: Die Projektmappendatei "{0}" ist nicht vorhanden.
es: El archivo de solución "{0}" no existe.
fr: Le fichier solution '{0}' n'existe pas.
it: Il file di soluzione '{0}' non esiste.
ja: ソリューション ファイル '{0}' が存在しません。
pl: Plik rozwiązania „{0}” nie istnieje.
pt_br: O arquivo de solução '{0}' não existe.
ru: Файл решения "{0}" не существует.
zh_hans: 解决方案文件“{0}”不存在。
zh_hant: 解決方案檔 '{0}' 不存在。

source: Formatted code file '{0}'.
cs: Naformátoval se soubor kódu {0}.
de: Codedatei "{0}" wurde formatiert.
es: Archivo de código "{0}" con formato aplicado.
fr: Fichier de code '{0}' mis en forme.
it: Il file di codice '{0}' è stato formattato.
ja: コード ファイル '{0}' がフォーマットされました。
pl: Sformatowano plik kodu „{0}”.
pt_br: Arquivo de código '{0}' formatado.
ru: Отформатированный файл кода "{0}".
zh_hans: 已将代码文件“{0}”格式化。
zh_hant: 正在將程式碼檔案 '{0}' 格式化。

source: Unable to fix {0}. Code fix {1} didn't return a Fix All action.
cs: Nepovedlo se opravit {0}. Oprava kódu {1} nevrátila akci Opravit vše.
de: {0} kann nicht behoben werden. Codefix {1} hat keine Aktion „Alle korrigieren“ zurückgegeben.
es: No se puede corregir {0}. La corrección de código {1} no devolvió ninguna acción Corregir todo.
fr: Impossible de corriger {0}. Le correctif de code {1} n’a pas retourné d’action Corriger tout.
it: Impossibile correggere {0}. La correzione del codice {1} non ha restituito un'azione Correggi tutto.
ja: {0} を修正できません。コード修正 {1} は、[すべて修正] アクションを返しませんでした。
pl: Nie można naprawić kodu {0}. Poprawka kodu {1} nie zwróciła akcji Napraw wszystko.
pt_br: Não é possível corrigir {0}. A correção de código {1} não retornou uma ação "Corrigir tudo".
ru: Не удалось исправить {0}. Исправление кода {1} не возвратило действие "Исправить все".
zh_hant: 無法修正 {0}。程式碼修正 {1} 未傳回全部修正動作。

source: Unable to fix {0}. Code fix {1} doesn't support Fix All in Solution.
cs: Nepovedlo se opravit {0}. Oprava kódu {1} nepodporuje možnost Opravit vše v řešení.
de: "{0}" kann nicht korrigiert werden. Die Codekorrektur "{1}" unterstützt nicht das Korrigieren aller Fehler in einer Projektmappe.
es: No se puede corregir {0}. La corrección de código {1} no es compatible con la opción para corregir todo en la solución.
fr: Impossible de corriger {0}. Le correctif de code {1} ne prend pas en charge la fonctionnalité Tout corriger dans la solution.
it: Non è possibile correggere {0}. La correzione del codice {1} non supporta l'opzione Correggi tutti nella soluzione.
ja: {0} を修復できません。コード修正プログラム {1} は、ソリューションでの [すべて修正] をサポートしていません。
pl: Nie można naprawić elementu {0}. Poprawka kodu {1} nie obsługuje opcji naprawiania wszystkich wystąpień w rozwiązaniu.
pt_br: Não é possível corrigir {0}. A correção de código {1} não dá suporte à opção Corrigir Tudo na Solução.
ru: Не удалось исправить {0}. Исправление кода {1} не поддерживает функцию "Исправить все в решении".
zh_hans: 无法修复 {0}。代码修补程序 {1} 不支持修复解决方案中的所有内容。
zh_hant: 無法修正 {0}。程式碼修正 {1} 不支援 [在解決方案中全部修正]。

source: Unable to fix {0}. Code fix {1} returned an unexpected operation.
cs: Nepovedlo se opravit {0}. Oprava kódu {1} vrátila neočekávanou operaci.
de: {0} kann nicht behoben werden. Codefix {1} hat einen unerwarteten Vorgang zurückgegeben.
es: No se puede corregir {0}. La corrección de código {1} devolvió una operación inesperada.
fr: Impossible de corriger {0}. Le correctif de code {1} a retourné une opération inattendue.
it: Impossibile correggere {0}. La correzione del codice {1} ha restituito un'operazione imprevista.
ja: {0} を修正できません。コード修正プログラム {1} で予期しない操作が返されました。
pl: Nie można naprawić kodu {0}. Poprawka kodu {1} zwróciła nieoczekiwaną operację.
pt_br: Não é possível corrigir {0}. A correção de código {1} retornou uma operação inesperada.
ru: Не удалось исправить {0}. Исправление кода {1} вернуло неожиданную операцию.
zh_hant: 無法修正 {0}。程式碼修正 {1} 傳回未預期的作業。

source: Unable to fix {0}. No associated code fix found.
cs: Nepovedlo se opravit {0}. Nenašla se žádná přidružená oprava kódu.
de: {0} kann nicht behoben werden. Es wurde kein zugeordneter Codefix gefunden.
es: No se puede corregir {0}. No se encontró ninguna corrección de código asociada.
fr: Impossible de corriger {0}. Aucun correctif de code associé trouvé.
it: Impossibile correggere {0}. Non è stata trovata alcuna correzione del codice associata.
ja: {0} を修正できません。関連付けられたコード修正プログラムが見つかりませんでした。
pl: Nie można naprawić kodu {0}. Nie znaleziono skojarzonej poprawki kodu.
pt_br: Não é possível corrigir {0}. Nenhuma correção de código associada encontrada.
ru: Не удалось исправить {0}. Не найдено связанное исправление кода.
zh_hant: 無法修正 {0}。找不到相關聯的程式碼修正。

source: Unable to locate MSBuild. Ensure the .NET SDK was installed with the official installer.
cs: Nepovedlo se najít MSBuild. Ujistěte se, že se sada .NET SDK nainstalovala pomocí oficiálního instalačního programu.
de: MSBuild wurde nicht gefunden. Stellen Sie sicher, dass das .NET SDK mit dem offiziellen Installationsprogramm installiert wurde.
es: No se encuentra MSBuild. Asegúrese de que el SDK de .NET se haya instalado con el instalador oficial.
fr: Impossible de localiser MSBuild. Vérifiez que le SDK .NET a été installé avec le programme d'installation officiel.
it: Non è possibile individuare MSBuild. Assicurarsi che .NET SDK sia stato installato con il programma di installazione ufficiale.
ja: MSBuild が見つかりません。.NET SDK が正式なインストーラーでインストールされたことを確認してください。
pl: Nie można zlokalizować programu MSBuild. Upewnij się, że zestaw .NET SDK został zainstalowany przy użyciu oficjalnego instalatora.
pt_br: Não é possível localizar o MSBuild. Verifique se o SDK do .NET foi instalado com o instalador oficial.
ru: Не удается найти MSBuild. Убедитесь, что пакет SDK для .NET был установлен с официальным установщиком.
zh_hans: 无法找到 MSBuild。请确保 .NET SDK 是与官方安装程序一起安装的。
zh_hant: 找不到 MSBuild。請確認已使用正式安裝程式安裝了 .NET SDK。

source: Unable to locate dotnet CLI. Ensure that it is on the PATH.
cs: Nepovedlo se najít .NET CLI. Ujistěte se, že se nachází v proměnné PATH.
de: Die dotnet-CLI wurde nicht gefunden. Stellen Sie sicher, dass sie sich im Pfad befindet.
es: No se encuentra la CLI de dotnet. Asegúrese de que esté en la ruta de acceso (PATH).
it: Non è possibile individuare l'interfaccia della riga di comando di dotnet. Assicurarsi che sia indicata in PATH.
pl: Nie można zlokalizować wiersza polecenia dotnet. Upewnij się, że znajduje się on w ścieżce.
ru: Не удалось найти CLI dotnet. Убедитесь, что путь к нему добавлен в переменную среды PATH.
zh_hans: 找不到 dotnet CLI。请确保它在路径上。

source: Unable to organize imports for '{0}'. The document is too complex.
cs: Nepovedlo se uspořádat importy pro {0}. Dokument je příliš složitý.
de: Importe für "{0}" können nicht organisiert werden. Das Dokument ist zu komplex.
es: No se pueden organizar las importaciones para "{0}". El documento es demasiado complejo.
fr: Impossible d'organiser les importations pour '{0}'. Le document est trop complexe.
it: Non è possibile organizzare le importazioni per '{0}'. Il documento è troppo complesso.
ja: '{0}' のインポートを整理できません。ドキュメントが複雑すぎます。
pl: Nie można zorganizować importów dla elementu „{0}”. Dokument jest zbyt złożony.
pt_br: Não é possível organizar importações para '{0}'. O documento é muito complexo.
ru: Не удается организовать импорты для "{0}". Слишком сложный документ.
zh_hans: 无法整理“{0}”的导入项。文档太复杂。
zh_hant: 無法組織 '{0}' 的匯入。文件太複雜。

source: Using MSBuild.exe located in '{0}'.
cs: Používá se MSBuild.exe umístěný v {0}.
de: MSBuild.exe in "{0}" wird verwendet.
es: Se está usando el archivo MSBuild.exe ubicado en "{0}".
fr: Utilisation de MSBuild.exe dans '{0}'.
it: Verrà usata la versione di MSBuild.exe disponibile in '{0}'.
ja: '{0}' にある MSBuild.exe を使用しています。
pl: Używanie pliku MSBuild.exe znajdującego się w lokalizacji „{0}”.
pt_br: Usando MSBuild.exe localizado em '{0}'.
ru: Используется файл MSBuild.exe, расположенный в каталоге "{0}".
zh_hans: 使用“{0}”中的 MSBuild.exe。
zh_hant: 正在使用位於 '{0}' 的 MSBuild.exe。

source: Verify no formatting changes would be performed. Terminates with a non-zero exit code if any files would have been formatted.
cs: Ověřte, že se neprovedou žádné změny formátování. Ukončí se s nenulovým ukončovacím kódem, pokud by byly nějaké soubory naformátovány.
de: Vergewissern Sie sich, dass keine Formatierungsänderungen vorgenommen würden. Wird mit einem Exitcode ungleich 0 beendet, wenn Dateien formatiert worden wären.
es: Compruebe que no se vayan a realizar cambios de formato. Termina con un código de salida distinto de cero si se hubiera formateado algún archivo.
fr: Vérifiez qu’il n’y a aucune modification de mise en forme effectuée. Se termine par un code de sortie différent de zéro si des fichiers auraient été mis en forme.
it: Verificare che non siano state eseguite modifiche di formattazione. Termina con un codice di uscita diverso da zero se sono stati formattati file.
ja: 書式設定の変更が実行されないことを確認します。いずれかのファイルが書式設定された場合は、0 以外の終了コードで終了します。
pl: Sprawdź, czy nie zostaną wprowadzone żadne zmiany formatowania. Kończy się kodem zakończenia innym niż zero, jeśli jakiekolwiek pliki zostałyby sformatowane.
pt_br: Verifique se nenhuma alteração de formatação será executada. Termina com um código de saída diferente de zero se algum arquivo tiver sido formatado.
ru: Убедитесь, что изменения форматирования не будут выполнены. Завершается ненулевым кодом завершения, если какие-либо файлы были отформатированы.
zh_hant: 確認不會執行任何格式化變更。如果有任何檔案已格式化，請以非零的結束代碼終止。

source: Warnings were encountered while loading the workspace. Set the verbosity option to the 'diagnostic' level to log warnings.
cs: Při načítání pracovního prostoru se vygenerovala upozornění. Pokud chcete upozornění protokolovat, nastavte možnost verbosity na úroveň diagnostic.
de: Beim Laden des Arbeitsbereichs sind Warnungen aufgetreten. Legen Sie die Ausführlichkeitsoption auf "Diagnose" fest, um Warnungen zu protokollieren.
es: Se encontraron advertencias al cargar el área de trabajo. Establezca la opción de nivel de detalle en "diagnóstico" para registrar las advertencias.
fr: Des avertissements ont été rencontrés pendant le chargement de l'espace de travail. Définissez l'option verbosity sur le niveau « diagnostic » pour journaliser les avertissements.
it: Sono stati rilevati avvisi durante il caricamento dell'area di lavoro. Impostare l'opzione del livello di dettaglio su 'diagnostic' per registrare gli avvisi.
ja: ワークスペースの読み込み中に警告が発生しました。詳細オプションを '診断' レベルに設定して、警告をログに記録してください。
pl: Podczas ładowania obszaru roboczego napotkano ostrzeżenia. Ustaw opcję poziomu szczegółowości na wartość „diagnostyka”, aby rejestrować ostrzeżenia.
pt_br: Foram encontrados avisos ao carregar o workspace. Defina a opção de detalhamento para o nível de 'diagnóstico' para registrar avisos.
ru: При загрузке рабочей области были обнаружены предупреждения. Задайте для параметра уровня детализации значение "Диагностика", чтобы вести журнал предупреждений.
zh_hans: 加载工作区时遇到警告。要记录警告，请将“详细级别”选项设置为“诊断”级别。
zh_hant: 載入工作區時發生警告。請將詳細程度選項設定為 [診斷] 層級以記錄警告。

source: Whether to treat the `<workspace>` argument as a simple folder of files.
cs: Určuje, jestli se má argument <workspace> považovat za jednoduchou složku souborů.
de: Gibt an, ob das <workspace>-Argument als einfacher Dateiordner behandelt werden soll.
es: Indica si el argumento "<workspace>" debe tratarse como una simple carpeta de archivos.
fr: Indique si l'argument '<espace de travail>' doit être traité en tant que simple dossier de fichiers.
it: Indica se considerare l'argomento `<workspace>` come una semplice cartella di file.
ja: '<workspace>' 引数をファイルの単純なフォルダーとして扱うかどうかを指定します。
pl: Określa, czy traktować argument „<workspace>” jako prosty folder plików.
pt_br: Se o argumento `<workspace>` será tratado como uma simples pasta de arquivos.
ru: Следует ли рассматривать аргумент "<workspace>" как простую папку с файлами.
zh_hans: 是否将 "<workspace>" 参数视为文件的简单文件夹。
zh_hant: 是否要將 `<workspace>` 引數視為檔案的簡易資料夾。

source: Writing formatting report to: '{0}'.
cs: Sestava formátování se zapisuje do {0}.
de: Formatierungsbericht wird in "{0}" geschrieben.
es: Escribiendo el informe de formato en "{0}".
fr: Écriture du rapport de mise en forme dans '{0}'.
it: Scrittura del report di formattazione in: '{0}'.
ja: フォーマット レポートを '{0}' に書き込んでいます。
pl: Zapisywanie raportu formatowania w: „{0}”...
pt_br: Gravando relatório de formatação em '{0}'.
ru: Запись отчета о форматировании в "{0}".
zh_hans: 正在将格式报表写入:“{0}”。
zh_hant: 正在將格式化報告寫入: '{0}'。
