Repository: dotnet/sdk
Catalog: src/BuiltInTools/dotnet-format/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, pl, pt_br, ru, zh_hans, zh_hant

source: A list of relative file or folder paths to exclude from formatting.
cs: Seznam relativních cest k souborům nebo složkám, které se nemají formátovat
de: Eine Liste der relativen Datei- oder Ordnerpfade, die von der Formatierung ausgeschlossen werden sollen.
es: Lista de rutas de acceso de carpeta o archivo relativas que se van a excluir del formato.
fr: Liste des chemins relatifs de fichier ou de dossier à exclure de la mise en forme.
it: Elenco di percorsi relativi di file o cartelle da escludere dalla formattazione.
ja: 書式設定から除外するファイルまたはフォルダーの相対パスの一覧。
pl: Lista względnych ścieżek plików lub folderów, które mają zostać wykluczone z formatowania.
pt_br: Uma lista de caminhos de arquivo ou pasta relativos para excluir da formatação.
ru: Список относительных путей к файлам и папкам, исключаемым из форматирования.
zh_hans: 不进行格式化的相对文件或文件夹路径的列表。
zh_hant: 要從格式化作業中排除的檔案或資料夾相對路徑清單。

source: A list of relative file or folder paths to include in formatting. All files are formatted if empty.
cs: Seznam relativních cest k souborům nebo složkám, které se mají formátovat. Pokud bude seznam prázdný, budou se formátovat všechny soubory.
de: Eine Liste der relativen Datei- oder Ordnerpfade, die in die Formatierung einbezogen werden sollen. Wenn diese Liste leer ist, werden alle Dateien formatiert.
es: Lista de rutas de acceso de carpeta o archivo relativas que se van a incluir en el formato. Se da formato a todos los archivos, si están vacíos.
fr: Liste des chemins relatifs de fichier ou de dossier à inclure dans la mise en forme. Si non renseigné, tous les fichiers sont mis en forme.
it: Elenco di percorsi relativi di file o cartelle da includere nella formattazione. Se è vuoto, tutti i file vengono formattati.
ja: 書式設定に含めるファイルまたはフォルダーの相対パスの一覧。空の場合、すべてのファイルが書式設定されます。
pl: Lista względnych ścieżek plików lub folderów do uwzględnienia w formatowaniu. Wszystkie pliki są formatowane, jeśli wartość jest pusta.
pt_br: Uma lista de caminhos de arquivo ou pasta relativos para incluir na formatação. Todos os arquivos serão formatados se estiverem vazios.
ru: Список относительных путей к файлам и папкам, включаемым в форматирование. Если список пуст, форматируются все файлы.
zh_hans: 要进行格式化的相对文件或文件夹路径的列表。如果为空，则格式化所有文件。
zh_hant: 要包含在格式化作業中的檔案或資料夾相對路徑清單。若保留空白，則會將所有檔案格式化。

source: A path to a solution file, a project file, or a folder containing a solution or project file. If a path is not specified then the current directory is used.
cs: Cesta k souboru řešení, souboru projektu nebo složce obsahující soubor řešení nebo projektu. Pokud cesta není zadaná, použije se aktuální adresář.
de: Ein Pfad zu einer Projektmappendatei, einer Projektdatei oder einem Ordner, die bzw. der eine Projektmappe oder Projektdatei enthält. Wenn kein Pfad angegeben wird, wird das aktuelle Verzeichnis verwendet.
es: Ruta de acceso a un archivo de solución, a un archivo del proyecto o a una carpeta que contiene archivo de proyecto o solución. Si no se especifica ninguna ruta de acceso, se usa el directorio actual.
fr: Chemin d'un fichier solution, d'un fichier projet ou d'un dossier contenant un fichier solution ou un fichier projet. Si aucun chemin n'est spécifié, le répertoire actif est utilisé.
it: Percorso di un file di soluzione, un file di progetto o una cartella contenente una soluzione o un file di progetto. Se non si specifica alcun percorso, viene usata la directory corrente.
ja: ソリューション ファイル、プロジェクト ファイル、またはソリューションかプロジェクト ファイルを含むフォルダーへのパス。パスが指定されていない場合は、現在のディレクトリが使用されます。
pl: Ścieżka do pliku rozwiązania, pliku projektu albo folderu zawierającego plik rozwiązania lub plik projektu. Jeśli ścieżka nie zostanie określona, zostanie użyty bieżący katalog.
pt_br: Um caminho para um arquivo de solução, um arquivo de projeto ou uma pasta contendo um arquivo de solução ou de projeto. Se não for especificado um caminho, o diretório atual será usado.
ru: Путь к файлу решения, файлу проекта или папке, содержащей файл решения или проекта. Если путь не указан, используется текущий каталог.
zh_hans: 指向解决方案文件、项目文件或包含解决方案或项目文件的文件夹的路径。如果未指定路径，则使用当前目录。
zh_hant: 解決方案檔、專案檔，或包含解決方案或專案檔之資料夾的路徑。若未指定路徑，就會使用目前的目錄。

source: A space separated list of diagnostic ids to ignore when fixing code style or 3rd party issues.
cs: Seznam ID diagnostiky oddělených mezerami, který se má ignorovat při opravě stylu kódu nebo problémů třetích stran.
de: Eine durch Leerzeichen getrennte Liste von Diagnose-IDs, die beim Beheben von Codeformat- oder Drittanbieterproblemen ignoriert werden kann.
es: Lista separada por espacios de identificadores de diagnóstico que se deben omitir al corregir problemas de estilo de código o de terceros.
fr: Liste séparée par des espaces d’ID de diagnostic à ignorer lors de la résolution du style de code ou des problèmes tiers.
it: Elenco di ID di diagnostica separati da spazi da ignorare per la correzione dello stile del codice o di problemi di terze parti.
ja: コード スタイルやサードパーティの問題を修正するときに無視するする診断 ID のスペース区切りの一覧。
pl: Rozdzielana spacjami lista identyfikatorów diagnostycznych, którą mają być ignorowane podczas naprawiania stylu kodu lub rozwiązywania problemów dotyczących innych firm.
pt_br: Uma lista separada por espaços de IDs de diagnóstico a serem ignorados ao corrigir estilo de código ou problemas de terceiros.
ru: Список идентификаторов диагностики, разделенных пробелами, который будет игнорироваться при исправлении стиля кода или сторонних проблем.
zh_hant: 修正程式碼樣式或第三方問題時，要略過的診斷識別碼的清單 (以空格分隔)。

source: A space separated list of diagnostic ids to use as a filter when fixing code style or 3rd party issues.
cs: Seznam ID diagnostiky oddělených mezerami, který se má použít jako filtr při opravě stylu kódu nebo problémů třetích stran
de: Eine durch Leerzeichen getrennte Liste von Diagnose-IDs, die beim Beheben von Codeformat- oder Drittanbieterproblemen als Filter verwendet werden sollen.
es: Lista separada por espacios de identificadores de diagnóstico que se van a usar como filtro al corregir problemas de estilo de código o de terceros.
fr: Liste d’ID de diagnostic séparés par des espaces à utiliser comme filtre lors de la correction du style de code ou des problèmes tiers.
it: Elenco di ID di diagnostica separati da spazi da usare come filtro per la correzione dello stile del codice o di problemi di terze parti.
ja: コード スタイルやサードパーティの問題を修正する場合にフィルターとして使用する診断 ID のスペース区切りの一覧。
pl: Rozdzielana spacjami lista identyfikatorów diagnostycznych do użycia jako filtr podczas rozwiązywania problemów ze stylem kodu lub innych firm.
pt_br: Uma lista separada por espaço de IDs de diagnóstico para usar como um filtro ao corrigir o estilo de código ou problemas de terceiros.
ru: Список идентификаторов диагностики, разделенных пробелами, который будет использоваться в качестве фильтра при исправлении стиля кода или сторонних проблем.
zh_hant: 修正程式碼樣式或協力廠商問題時，用來做為篩選的診斷識別碼清單 (以空格分隔)。

source: Accepts a file path, which if provided, will produce a json report in the given directory.
cs: Přijímá cestu k souboru. Pokud se zadá, vytvoří se v daném adresáři sestava JSON.
de: Akzeptiert einen Dateipfad, der bei Bereitstellung einen JSON-Bericht im angegebenen Verzeichnis erstellt.
es: Acepta una ruta de acceso de archivo que, si se proporciona, generará un informe JSON en el directorio dado.
fr: Accepte un chemin de fichier, qui, s'il est fourni, produit un rapport JSON dans le répertoire donné.
it: Accetta un percorso file che, se specificato, produrrà un report JSON nella directory specificata.
ja: ファイル パスを受け入れると (指定されている場合)、指定されたディレクトリに JSON レポートが生成されます。
pl: Akceptuje ścieżkę pliku, która, jeśli zostanie podana, wygeneruje raport JSON w danym katalogu.
pt_br: Aceita um caminho de arquivo, que, se fornecido, produzirá um relatório JSON no diretório especificado.
ru: Принимает путь к файлу. Если путь к файлу указан, создает отчет JSON в указанном каталоге.
zh_hans: 接受文件路径(若提供)将在给定目录中生成 json 报表。
zh_hant: 接受檔案路徑 (如果有提供) 將在指定的目錄中產生 json 報告。

source: Accepts a file path which if provided will produce a json report in the given directory.
cs: Přijímá cestu k souboru, který po zadání vytvoří sestavu JSON v daném adresáři.
de: Akzeptiert einen Dateipfad, der, sofern angegeben, einen JSON-Bericht im angegebenen Verzeichnis erstellt.
es: Acepta una ruta de acceso de archivo que, si se proporciona, generará un informe JSON en el directorio dado.
fr: Accepte un chemin de fichier, qui, s'il est fourni, produit un rapport JSON dans le répertoire donné.
it: Accetta un percorso file che, se specificato, produrrà un report JSON nella directory specificata.
ja: ファイル パスを受け入れると (指定されている場合)、指定されたディレクトリに JSON レポートが生成されます。
pl: Akceptuje ścieżkę pliku, która wygeneruje raport w formacie JSON w danym katalogu, jeśli zostanie podana.
pt_br: Aceita um caminho de arquivo que, se fornecido, produzirá um relatório json no diretório fornecido.
ru: Принимает путь к файлу. Если путь к файлу указан, создает отчет JSON в указанном каталоге.
zh_hant: 接受檔案路徑 (如果有提供) 將在指定的目錄中產生 json 報告。

source: Analysis complete in {0}ms.
cs: Analýza se dokončila za {0} ms.
de: Die Analyse wurde in {0} ms abgeschlossen.
es: Análisis completado en {0} ms.
fr: Analyse effectuée en {0} ms.
it: L'analisi è stata completata in {0} ms.
ja: {0} ミリ秒で分析が完了します。
pl: Analizę ukończono w {0} ms.
pt_br: Análise concluída em {0} ms.
ru: Анализ завершен. Время анализа: {0} мс.
zh_hans: 将在 {0} 毫秒后完成分析。
zh_hant: 分析將於 {0} 毫秒後完成。

source: Analyzer Reference
cs: Odkaz na analyzátor
de: Analysereferenz
es: Referencia de analizador
fr: Référence de l'analyseur
it: Riferimento ad analizzatore
ja: アナライザー参照
pl: Odwołanie do analizatora
pt_br: Referência do Analisador
ru: Ссылка на анализатор
zh_hans: 分析器引用
zh_hant: 分析器參考

source: Both a MSBuild project file and solution file found in '{0}'. Specify which to use with the <workspace> argument.
cs: {0} obsahuje jak soubor projektu MSBuild, tak soubor řešení. Určete, který soubor chcete použít, pomocí argumentu <workspace>.
de: In „{0}“ wurden eine MSBuild-Projektdatei und eine Projektmappendatei gefunden. Geben Sie die zu verwendende Datei mit dem <workspace>-Argument an.
es: Se encontró un archivo del proyecto y un archivo de solución MSBuild en "{0}". Especifique cuál debe usarse con el argumento <workspace>.
fr: Fichier projet et fichier solution MSBuild trouvés dans '{0}'. Spécifiez celui qui doit être utilisé avec l'argument <espace de travail>.
it: In '{0}' sono stati trovati sia un file di progetto che un file di soluzione MSBuild. Per specificare quello desiderato, usare l'argomento <workspace>.
ja: MSBuild のプロジェクト ファイルとソリューション ファイルの両方が '{0}' で見つかりました。使用するファイルを <workspace> 引数で指定してください。
pl: W elemencie „{0}” znaleziono zarówno plik projektu platformy MSBuild, jak i plik rozwiązania. Określ, którego elementu użyć z argumentem <workspace>.
pt_br: Foram encontrados um arquivo de solução e um arquivo de projeto do MSBuild em '{0}'. Especifique qual usar com o argumento <workspace>.
ru: В "{0}" обнаружены как файл проекта, так и файл решения MSBuild. Укажите используемый файл с помощью аргумента <workspace>.
zh_hans: 在“{0}”中同时找到 MSBuild 项目文件和解决方案文件。请指定要用于 <workspace> 参数的文件。
zh_hant: 在 '{0}' 中同時找到 MSBuild 專案檔與解決方案檔。指定要與 <workspace> 引數搭配的檔案。

source: Cannot specify the '--folder' option when fixing style.
cs: Při opravě stylu není možné zadat možnost --folder.
de: Die Option „--Ordner“ kann beim Korrigieren der Formatvorlage nicht angegeben werden.
es: No se puede especificar la opción "--folder" al corregir el estilo.
fr: Impossible de spécifier l’option « --folder » lors de la correction du style.
it: Impossibile specificare l'opzione '--folder' durante la correzione dello stile.
ja: スタイルを修正するときに '--folder' オプションを指定することはできません。
pl: Nie można określić opcji „--folder” podczas naprawiania stylu.
pt_br: Não é possível especificar a opção '--folder' ao corrigir estilo.
ru: Невозможно указать параметр "--folder" при исправлении стиля.
zh_hant: 修正樣式時無法指定 '--folder' 選項。

source: Cannot specify the '--folder' option when running analyzers.
cs: Při spouštění analyzátorů není možné zadat možnost --folder.
de: Die Option „--Ordner“ kann beim Ausführen von Analysetools nicht angegeben werden.
es: No se puede especificar la opción "--folder" al ejecutar analizadores.
fr: Impossible de spécifier l’option « --folder » lors de l’exécution des analyseurs.
it: Impossibile specificare l'opzione '--folder' durante l'esecuzione degli analizzatori.
ja: アナライザーの実行時に '--folder' オプションを指定することはできません。
pl: Nie można określić opcji „--folder” podczas uruchamiania analizatorów.
pt_br: Não é possível especificar a opção '--folder' ao executar analisadores.
ru: Невозможно указать параметр "--folder" при запуске анализаторов.
zh_hant: 執行分析器時無法指定 '--folder' 選項。

source: Cannot specify the '--folder' option with '--no-restore'.
cs: Není možné zadat možnost --folder s parametrem --no-restore.
de: Die Option „--Ordner“ kann nicht mit „--keine-Wiederherstellung“ angegeben werden.
es: No se puede especificar la opción "--folder" con "--no-restore".
fr: Impossible de spécifier l’option « --folder » avec « --no-restore ».
it: Non è possibile specificare l'opzione '--folder' con '--no-restore'.
ja: '--folder' オプションを '--no-restore' と共に指定することはできません。
pl: Nie można określić opcji „--folder” z parametrem „--no-restore”.
pt_br: Não é possível especificar a opção '--folder' com '--no-restore'.
ru: Невозможно указать параметр "--folder" с "--no-restore".
zh_hant: 無法指定 '--folder' 選項搭配 '--no-restore'。

source: Cannot specify the '--folder' option when writing a binary log.
cs: Při zápisu binárního protokolu není možné zadat možnost --folder.
de: Die Option „--Ordner“ kann beim Schreiben eines Binärprotokolls nicht angegeben werden.
es: No se puede especificar la opción "--folder" al escribir un registro binario.
fr: Impossible de spécifier l’option « --folder » lors de l’écriture d’un journal binaire.
it: Impossibile specificare l'opzione '--folder' durante la scrittura di un log binario.
ja: バイナリ ログを書き込むときに '--folder' オプションを指定することはできません。
pl: Nie można określić opcji „--folder” podczas zapisywania dziennika binarnego.
pt_br: Não é possível especificar a opção '--folder' ao gravar um log binário.
ru: Невозможно указать параметр "--folder" при записи двоичного журнала.
zh_hant: 寫入二進位記錄時無法指定 '--folder' 選項。

source: Code Style
cs: Styl kódu
de: Codeformat
es: Estilo de código
fr: Style de code
it: Stile codice
ja: コード スタイル
pl: Styl kodu
pt_br: Estilo do Código
ru: Стиль кода
zh_hans: 代码样式
zh_hant: 程式碼樣式

source: Complete in {0}ms.
cs: Dokončeno za {0} ms
de: Abgeschlossen in {0} ms.
es: Completar en {0} ms.
fr: Effectué en {0} ms.
it: Completata in {0} ms.
ja: {0} ミリ秒で完了します。
pl: Wykonaj w {0} ms.
pt_br: Concluir em {0} ms.
ru: Завершено. Время выполнения: {0} мс.
zh_hans: 在 {0} 毫秒后完成。
zh_hant: {0} 毫秒後完成。

source: Could not find a MSBuild project file or solution file in '{0}'. Specify which to use with the <workspace> argument.
cs: V adresáři {0} nešlo najít soubor projektu MSBuild nebo soubor řešení. Určete, který soubor chcete použít, pomocí argumentu <workspace>.
de: In "{0}" wurde weder eine MSBuild-Projektdatei noch eine Projektmappendatei gefunden. Geben Sie die zu verwendende Datei mit dem <workspace>-Argument an.
es: No se encontró ningún archivo del proyecto ni archivo de solución MSBuild en "{0}". Especifique cuál debe usarse con el argumento <workspace>.
fr: Le fichier projet ou le fichier solution MSBuild est introuvable dans '{0}'. Spécifiez celui qui doit être utilisé avec l'argument <espace de travail>.
it: In '{0}' non è stato possibile trovare alcun file di progetto o di soluzione MSBuild. Per specificare quello desiderato, usare l'argomento <workspace>.
ja: '{0}' で MSBuild のプロジェクト ファイルもソリューション ファイルも見つかりませんでした。使用するものを <workspace> 引数で指定してください。
pl: Nie można znaleźć pliku rozwiązania lub projektu MSBuild w elemencie „{0}”. Określ plik do użycia za pomocą argumentu <workspace>.
pt_br: Não foi possível encontrar um arquivo de solução nem um arquivo de projeto do MSBuild em '{0}'. Especifique qual será usado com o argumento <workspace>.
ru: Не удалось найти файл проекта или решения MSBuild в "{0}". Укажите используемый файл с помощью аргумента <workspace>.
zh_hans: 无法在“{0}”中找到 MSBuild 项目文件或解决方案文件。请指定要用于 <workspace> 参数的文件。
zh_hant: 在 '{0}' 中找不到 MSBuild 專案檔或解決方案檔。請指定要用於 <workspace> 引數的檔案。

source: Could not format '{0}'. Format currently supports only C# and Visual Basic projects.
cs: {0} nejde formátovat. Formátovat jde v současné době jenom projekty v jazycích C# a Visual Basic.
de: "{0}" konnte nicht formatiert werden. Derzeit wird die Formatierung nur für C#- und Visual Basic-Projekte unterstützt.
es: No se pudo dar formato a "{0}". El formato admite solo proyectos de C# y Visual Basic en este momento.
fr: Impossible de mettre en forme '{0}'. L'opération Mettre en forme prend uniquement en charge les projets C# et Visual Basic pour le moment.
it: Non è stato possibile formattare '{0}'. Il formato supporta attualmente solo progetti C# e Visual Basic.
ja: '{0}' をフォーマットできませんでした。フォーマットは、C# および Visual Basic のプロジェクトでのみサポートされています。
pl: Nie można sformatować elementu „{0}”. Obecnie format obsługuje tylko projekty C# i Visual Basic.
pt_br: Não foi possível formatar '{0}'. O formato atualmente suporta apenas projetos do Visual Basic e C#.
ru: Не удалось отформатировать "{0}". Форматирование сейчас поддерживается только для проектов C# и Visual Basic.
zh_hans: 无法设置“{0}”的格式。该格式当前仅支持 C# 和 Visual Basic 项目。
zh_hant: 無法將 '{0}' 格式化。格式化目前只支援 C# 和 Visual Basic 專案。

source: Delete {0} characters.
cs: Odstraní {0} znaky/-ů.
de: Löschen Sie {0} Zeichen.
es: Eliminar {0} caracteres.
fr: Supprimez {0} caractères.
it: Elimina {0} caratteri.
ja: {0} 文字を削除します。
pl: Usuń znaki {0}.
pt_br: Excluir {0} caracteres.
ru: Удалить символы ({0}).
zh_hant: 刪除 {0} 字元。

source: Determining diagnostics...
cs: Zjišťuje se diagnostika...
de: Diagnose wird ermittelt...
es: Determinando los diagnósticos...
fr: Détermination des diagnostics...
it: Determinazione della diagnostica...
ja: 診断を決定しています...
pl: Trwa określanie diagnostyki...
pt_br: Determinando os diagnósticos...
ru: Определение диагностики…
zh_hans: 正在确定诊断…
zh_hant: 正在判斷診斷...

source: Determining formattable files.
cs: Určují se soubory, které se dají formátovat.
de: Formatierbare Dateien werden ermittelt.
es: Determinando los archivos formateables.
fr: Identification des fichiers pouvant être mis en forme.
it: Determinazione dei file formattabili.
ja: 書式設定可能なファイルを判定しています。
pl: Określanie plików, które można formatować.
pt_br: Determinando arquivos formatáveis.
ru: Определение форматируемых файлов.
zh_hans: 正在确定可格式化的文件。
zh_hant: 正在判斷可格式化的檔案。

source: Doesn't execute an implicit restore before formatting.
cs: Před formátováním nespustí implicitní obnovení.
de: Führt vor der Formatierung keine implizite Wiederherstellung aus.
es: No ejecuta una restauración implícita antes de formatear.
fr: N’exécute pas de restauration implicite avant la mise en forme.
it: Non esegue un ripristino implicito prima della formattazione.
ja: 書式設定前に暗黙的な復元を実行しません。
pl: Nie wykonuje niejawnego przywracania przed formatowaniem.
pt_br: Não executa uma restauração implícita antes da formatação.
ru: Не выполняет неявное восстановление перед форматированием.
zh_hant: 格式化前未執行隱含還原。

source: Failed to apply code fix {0} for {1}: {2}
cs: Nepovedlo se použít opravu kódu {0} pro {1}: {2}
de: Fehler beim Anwenden der Codekorrektur "{0}" für "{1}": {2}
es: No se pudo aplicar la corrección de código {0} para {1}: {2}
fr: Échec de l'application du correctif de code {0} pour {1} : {2}
it: Non è stato possibile applicare la correzione del codice {0} per {1}: {2}
ja: {1} のコード修正プログラム {0} を適用できませんでした: {2}
pl: Nie można zastosować poprawki kodu {0} dla elementu {1}: {2}
pt_br: Falha ao aplicar a correção de código {0} para {1}: {2}
ru: Не удалось применить исправление кода {0} для {1}: {2}
zh_hans: 未能对 {1} 应用代码修复 {0}: {2}
zh_hant: 無法為 {1} 套用程式碼修正 {0}: {2}

source: Failed to save formatting changes.
cs: Nepodařilo se uložit změny formátování.
de: Fehler beim Speichern von Formatierungsänderungen.
es: Error al guardar cambios de formato.
fr: L'enregistrement des changements de mise en forme a échoué.
it: Non è stato possibile salvare le modifiche di formattazione.
ja: 書式変更を保存できませんでした。
pl: Nie można zapisać zmian formatowania.
pt_br: Falha ao salvar alterações de formatação.
ru: Не удалось сохранить изменения форматирования.
zh_hans: 未能保存格式更改。
zh_hant: 無法儲存格式化變更。

source: Fix end of line marker.
cs: Opravte značku konce řádku.
de: Korrigieren Sie den Zeilenendemarker.
es: Corrija el marcador de fin de línea.
fr: Corrigez le marqueur de fin de ligne.
it: Correggere il marcatore di fine riga.
ja: 行末マーカーを修正します。
pl: Napraw znacznik końca wiersza.
pt_br: Corrigir o final do marcador de linha.
ru: Исправить маркер конца строки.
zh_hans: 修复行尾标记。
zh_hant: 修正行結尾標記。

source: Fix file encoding.
cs: Opravte kódování souboru.
de: Korrigieren Sie die Dateicodierung.
es: Corrija la codificación del archivo.
fr: Corrigez l'encodage de fichier.
it: Correggere la codifica dei file.
ja: ファイルのエンコードを修正します。
pl: Napraw kodowanie pliku.
pt_br: Corrigir a codificação de arquivo.
ru: Исправить кодировку файла.
zh_hans: 修复文件编码。
zh_hant: 修正檔案編碼。

source: Fix final newline.
cs: Opravte odřádkování na konci.
de: Korrigieren Sie den letzten Zeilenumbruch.
es: Corrija la nueva línea final.
fr: Corrigez la nouvelle ligne de fin.
it: Correggere il carattere di nuova riga finale.
ja: 最後の改行を修正します。
pl: Napraw końcowy nowy wiersz.
pt_br: Corrigir a nova linha final.
ru: Исправить завершающий символ новой строки.
zh_hans: 修复最后一个换行符。
zh_hant: 修正結尾換行。

source: Fix imports ordering.
cs: Opravte pořadí importů.
de: Korrigieren Sie die Importreihenfolge.
es: Corrija el orden de las importaciones.
fr: Corrigez le classement des importations.
it: Correggere l'ordinamento delle importazioni.
ja: インポートの順序を修正します。
pl: Napraw kolejność importowania.
pt_br: Corrigir a ordenação de importações.
ru: Исправить порядок импорта.
zh_hans: 修复导入顺序。
zh_hant: 修正匯入排序。

source: Fix whitespace formatting.
cs: Opravte formátování prázdných znaků.
de: Korrigieren Sie die Leerraumformatierung.
es: Corrija el formato de espacio en blanco.
fr: Corrigez la mise en forme des espaces blancs.
it: Correggere la formattazione degli spazi vuoti.
ja: 空白の書式設定を修正します。
pl: Napraw formatowanie odstępów.
pt_br: Corrigir a formatação de espaço em branco.
ru: Исправить форматирование пробелов.
zh_hans: 修复空格格式。
zh_hant: 修正空白字元格式化。

source: Fixing diagnostics...
cs: Opravuje se diagnostika...
de: Diagnose wird korrigiert...
es: Corrigiendo los diagnósticos...
fr: Correction des diagnostics...
it: Correzione della diagnostica...
ja: 診断を修正しています...
pl: Trwa naprawianie diagnostyki...
pt_br: Corrigindo os diagnósticos...
ru: Исправление диагностики…
zh_hans: 正在修复诊断…
zh_hant: 正在修正診斷...

source: Format complete in {0}ms.
cs: Formátování se dokončilo za {0} ms.
de: Die Formatierung wurde in {0} ms abgeschlossen.
es: Formato completado en {0} ms.
fr: Mise en forme effectuée en {0} ms.
it: La formattazione è stata completata in {0} ms.
ja: {0} ms でフォーマットが完了します。
pl: Formatowanie zakończono w {0} ms.
pt_br: Formatação concluída em {0} ms.
ru: Форматирование завершено. Время выполнения: {0} мс.
zh_hans: 将在 {0} 毫秒后完成格式化。
zh_hant: 格式化作業於 {0} 毫秒後完成。

source: Format files generated by the SDK.
cs: Soubory formátu generované sadou SDK
de: Formatieren Sie vom SDK generierte Dateien.
es: Formatee los archivos generados por el SDK.
fr: Fichiers de format générés par le kit de développement logiciel (SDK).
it: Formattare i file generati dall'SDK.
ja: SDK で生成されたフォーマット ファイル。
pl: Formatuj pliki wygenerowane przez zestaw SDK.
pt_br: Arquivos de formato gerados pelo SDK.
ru: Файлы форматирования, созданные пакетом SDK.
zh_hant: SDK 產生的格式檔案。
