Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetFramework.Analyzers/xlf/MicrosoftNetFrameworkAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseInsecureDtdProcessingDescription
source: Using XmlTextReader.Load(), creating an insecure XmlReaderSettings instance when invoking XmlReader.Create(), setting the InnerXml property of the XmlDocument and enabling DTD processing using XmlUrlResolver insecurely can lead to information disclosure. Replace it with a call to the Load() method overload that takes an XmlReader instance, use XmlReader.Create() to accept XmlReaderSettings arguments or consider explicitly setting secure values. The DataViewSettingCollectionString property of DataViewManager should always be assigned from a trusted source, the DtdProcessing property should be set to false, and the XmlResolver property should be changed to XmlSecureResolver or null.
cs: Používání metody XmlTextReader.Load(), vytváření nezabezpečené instance XmlReaderSettings při volání metody XmlReader.Create(), nastavování vlastnosti InnerXml dokumentu XmlDocument a zapínání nezabezpečeného zpracování DTD pomocí nástroje XmlUrlResolver může vést k odhalení informací. Nahraďte je voláním přetížení metody Load(), která přijímá instanci XmlReader, pomocí metody XmlReader.Create() přijměte argumenty XmlReaderSettings nebo zvažte možnost explicitně nastavit bezpečné hodnoty. Vlastnost DataViewSettingCollectionString třídy DataViewManager by se vždy měla přiřazovat z důvěryhodného zdroje, vlastnost DtdProcessing by měla být nastavená na false a vlastnost XmlResolver by se měla změnit na XmlSecureResolver nebo null.
de: Die Verwendung von "XmlTextReader.Load()", das Erstellen einer unsicheren XmlReaderSettings-Instanz beim Aufruf von "XmlReader.Create()", das Festlegen der InnerXml-Eigenschaft von XmlDocument und das Aktivieren der DTD-Verarbeitung durch unsichere Verwendung von XmlUrlResolver können zur Veröffentlichung von Informationen führen. Ersetzen Sie diesen Vorgang durch einen Aufruf der Load()-Methodenüberladung, die eine XmlReader-Instanz akzeptiert, verwenden Sie "XmlReader.Create()" zum Akzeptieren von XmlReaderSettings-Argumenten, oder erwägen Sie die explizite Festlegung sicherer Werte. Die DataViewSettingCollectionString-Eigenschaft von DataViewManager muss immer von einer vertrauenswürdigen Quelle aus zugewiesen werden, die DtdProcessing-Eigenschaft muss auf FALSE festgelegt werden, und die XmlResolver-Eigenschaft muss in "XmlSecureResolver" oder NULL geändert werden.
es: El uso de XmlTextReader.Load(), la creación de una instancia no segura de XmlReaderSettings al invocar XmlReader.Create(), el establecimiento de la propiedad InnerXml de XmlDocument y la habilitación del procesamiento de DTD usando XmlUrlResolver de manera no segura puede conducir a la divulgación de información. Reemplácelo por una llamada a la sobrecarga del método Load() que toma una instancia de XmlReader, use XmlReader.Create() para aceptar argumentos de XmlReaderSettings o considere el establecimiento explícito de valores seguros. La propiedad DataViewSettingCollectionString de DataViewManager siempre debe asignarse desde un origen confiable, la propiedad DtdProcessing debe establecerse en false y la propiedad XmlResolver debe cambiarse a XmlSecureResolver o a un valor nulo.
fr: L'utilisation de XmlTextReader.Load(), la création d'une instance non sécurisée de XmlReaderSettings durant l'appel de XmlReader.Create(), la définition de la propriété InnerXml de XmlDocument et l'activation du traitement DTD via XmlUrlResolver de manière non sécurisée peuvent entraîner une divulgation d'informations. Utilisez à la place un appel à la surcharge de la méthode Load() qui accepte une instance de XmlReader, utilisez XmlReader.Create() pour accepter les arguments de XmlReaderSettings, ou définissez des valeurs sécurisées de manière explicite. La propriété DataViewSettingCollectionString de DataViewManager doit toujours être affectée à partir d'une source approuvée, la propriété DtdProcessing doit avoir la valeur false, et la propriété XmlResolver doit être changée en XmlSecureResolver ou une valeur null.
it: L'uso di XmlTextReader.Load(), la creazione di un'istanza non sicura di XmlReaderSettings quando si richiama XmlReader.Create(), l'impostazione della proprietà InnerXml di XmlDocument e l'abilitazione dell'elaborazione DTD usando XmlUrlResolver in modo non sicuro possono causare la diffusione di informazioni. Sostituirlo con una chiamata all'overload del metodo Load() che accetta un'istanza di XmlReader, usare XmlReader.Create() per accettare gli argomenti di XmlReaderSettings o provare a impostare valori sicuri in modo esplicito. La proprietà DataViewSettingCollectionString di DataViewManager deve sempre essere assegnata da un'origine attendibile, la proprietà DtdProcessing deve essere impostata su false e la proprietà XmlResolver deve essere impostata su XmlSecureResolver o su Null.
ja: XmlTextReader.Load() を使用する場合、XmlReader.Create() の呼び出し時にセキュリティで保護されていない XmlReaderSettings インスタンスを作成し、XmlDocument の InnerXml プロパティを設定して、セキュリティで保護されていない XmlUrlResolver を使用した DTD 処理を有効にすると、情報漏えいにつながる可能性があります。これを XmlReader インスタンスを受け取る Load() メソッド オーバーロードの呼び出しに置き換えるか、XmlReader.Create() を使用して XmlReaderSettings 引数を受け付けるか、安全な値の明示的な設定を検討してください。DataViewManager の DataViewSettingCollectionString プロパティは常に信頼できる発行元から割り当てられる必要があります。また、DtdProcessing プロパティは false に設定し、XmlResolver プロパティは XmlSecureResolver または null に変更する必要があります。
ko: XmlTextReader.Load()를 사용하고, XmlReader.Create()를 호출할 때 안전하지 않은 XmlReaderSettings 인스턴스를 만들고, XmlDocument의 InnerXml 속성을 설정하고, 안전하지 않은 방법으로 XmlUrlResolver를 사용하여 DTD를 처리하면 정보가 공개될 수 있습니다. XmlReader 인스턴스를 사용하는 Load() 메서드 오버로드에 대한 호출로 바꾸고, XmlReader.Create()를 사용하여 XmlReaderSettings 인수를 사용하거나 보안 값을 명시적으로 설정하세요. DataViewManager의 DataViewSettingCollectionString 속성은 항상 신뢰할 수 있는 출처에서 할당되어야 하며, DtdProcessing 속성은 false로 설정되어야 하고, XmlResolver 속성은 XmlSecureResolver 또는 null로 변경되어야 합니다.
pl: Użycie klasy XmlTextReader.Load(), utworzenie niezabezpieczonego wystąpienia klasy XmlReaderSettings podczas przywoływania elementu XmlReader.Create(), ustawienie właściwości InnerXml dokumentu XmlDocument i włączenie przetwarzania elementu DTD przy użyciu elementu XmlUrlResolver w niezabezpieczony sposób może prowadzić do ujawnienia informacji. Zamiast tego użyj wywołania przeciążenia metody Load(), które przyjmuje wystąpienie elementu XmlReader, użyj metody XmlReader.Create(), aby zaakceptować argumenty XmlReaderSettings, lub rozważ jawne ustawienie bezpiecznych wartości. Właściwość DataViewSettingCollectionString elementu DataViewManager powinna zawsze być przypisywana z zaufanego źródła, właściwość DtdProcessing powinna być ustawiona na wartość false, a właściwość XmlResolver powinna być zmieniona na element XmlSecureResolver lub wartość null.
pt_br: Usar XmlTextReader.Load(), criar uma instância XmlReaderSettings não segura ao invocar XmlReader.Create(), definir a propriedade InnerXml do XmlDocument e habilitar o processamento DTD usando XmlUrlResolver de maneira insegura pode levar à divulgação de informações. Substitua-o por uma chamada à sobrecarga do método Load() que usa uma instância XmlReader, use XmlReader.Create() para aceitar os argumentos XmlReaderSettings ou considere definir explicitamente valores seguros. A propriedade DataViewSettingCollectionString de DataViewManager sempre deve ser atribuída de uma fonte confiável, a propriedade DtdProcessing deve ser definida como false e a propriedade XmlResolver deve ser alterada para XmlSecureResolver ou null.
ru: Использование XmlTextReader.Load(), создание небезопасного экземпляра XmlReaderSettings при вызове XmlReader.Create(), задание свойства InnerXml для XmlDocument и включение обработки DTD путем небезопасного использования XmlUrlResolver могут привести к раскрытию информации. Замените его на вызов перегрузки метода Load(), которая принимает экземпляр XmlReader, используйте XmlReader.Create(), чтобы принять аргументы XmlReaderSettings, либо рассмотрите возможность явного задания безопасных значений. Свойство DataViewSettingCollectionString для DataViewManager должно всегда назначаться из доверенного источника, свойство DtdProcessing должно иметь значение false, а свойство XmlResolver нужно изменить на XmlSecureResolver или Null.
tr: XmlTextReader.Load() kullanarak XmlReader.Create() çağrılırken güvenli olmayan bir XmlReaderSettings örneğinin oluşturulması, XmlDocument’in InnerXml özelliğini ayarlamak ve XmlUrlResolver’ı güvenli olmayan bir şekilde kullanarak DTD işlemeyi etkinleştirmek bilgilerin açığa çıkmasına neden olabilir. Bunu bir XmlReader örneği alan bir Load() yöntemi aşırı yüküne bir çağrıyla değiştirin, XmlReaderSettings bağımsız değişkenlerini kabul etmek için XmlReader.Create() kullanın veya açıkça güvenli değerler ayarlamayı düşünün. DataViewManager’ın DataViewSettingCollectionString özelliği her zaman güvenilir bir kaynaktan atanmalıdır, DtdProcessing özelliği false olarak ayarlanmalıdır ve XmlResolver özelliği XmlSecureResolver veya null olarak değiştirilmelidir.
zh_hans: 使用 XmlTextReader.Load()，在调用 XmlReader.Create() 时创建不安全的 XmlReaderSettings 实例，设置 XmlDocument 的 InnerXml 属性以及使用 XmlUrlResolver 按非安全方式启用 DTD 处理，这些情况都会导致信息泄露。请将其替换为对采用 XmlReader 实例的 Load() 方法重载的调用，使用 XmlReader.Create() 接受 XmlReaderSettings 参数，或者考虑对安全值进行显式设置。应始终从可靠来源分配 DataViewManager 的 DataViewSettingCollectionString 属性，将 DtdProcessing 属性设置为 false，并将 XmlResolver 属性更改为 XmlSecureResolver 或 null。
zh_hant: 使用 XmlTextReader.Load()、叫用 XmlReader.Create() 時建立不安全的 XmlReaderSettings 執行個體、設定 XmlDocument 的 InnerXml 屬性，以及用不安全的方式使用 XmlUrlResolver 啟用 DTD 處理，都可能會造成資訊外洩。以採用 XmlReader 執行個體的呼叫 Load() 方法多載取代它、使用 XmlReader.Create() 接受 XmlReaderSettings 引數或明確地考慮設定安全的值。DataViewManager 的 DataViewSettingCollectionString 屬性應一律從信任的來源指派，DtdProcessing 屬性應設為 false，而 XmlResolver 屬性則應變更為 XmlSecureResolver 或 Null。

# DoNotUseDtdProcessingOverloadsMessage
source: Unsafe overload of '{0}' method
cs: Nebezpečné přetížení metody {0}
de: Unsichere Überladung der Methode "{0}"
es: Sobrecarga no segura del método "{0}"
fr: Surcharge unsafe de la méthode '{0}'
it: Overload non sicuro del metodo '{0}'
ja: '{0}' メソッドの安全でないオーバーロード
ko: '{0}' 메서드의 안전하지 않은 오버로드
pl: Niebezpieczne przeciążenie metody {0}
pt_br: Sobrecarga não segura do método '{0}'
ru: Небезопасная перегрузка метода "{0}"
tr: '{0}' yönteminin güvenli olmayan aşırı yükü
zh_hans: “{0}”方法的不安全重载
zh_hant: '{0}' 方法的不安全多載

# DoNotUseDtdProcessingOverloads
source: Insecure DTD Processing
cs: Nezabezpečené zpracování DTD
de: Unsichere DTD-Verarbeitung
es: Procesamiento de DTD no seguro
fr: Traitement DTD non sécurisé
it: Elaborazione DTD non sicura
ja: DTD 処理が安全ではありません
ko: 안전하지 않은 DTD 처리
pl: Niezabezpieczone przetwarzanie elementu DTD
pt_br: Processamento DTD não seguro
ru: Небезопасная обработка DTD
tr: Güvenli Olmayan DTD İşleme
zh_hans: 不安全的 DTD 处理
zh_hant: 不安全的 DTD 處理

# DoNotUseSetInnerXmlMessage
source: Uses the unsafe setter of InnerXml property of System.Xml.XmlDocument.
cs: Používá nebezpečnou metodu setter vlastnosti InnerXml třídy System.Xml.XmlDocument.
de: Verwendet den unsicheren Setter der InnerXml-Eigenschaft von "System.Xml.XmlDocument".
es: Usa el establecedor no seguro de la propiedad InnerXml de System.Xml.XmlDocument.
fr: Utilise la méthode setter unsafe de la propriété InnerXml de System.Xml.XmlDocument.
it: Usa il setter non sicuro della proprietà InnerXml di System.Xml.XmlDocument.
ja: System.Xml.XmlDocument の InnerXml プロパティの安全でないセッターを使用します。
ko: System.Xml.XmlDocument의 InnerXml 속성에 대한 안전하지 않은 setter를 사용합니다.
pl: Używa niebezpiecznej metody ustawiającej właściwości InnerXml elementu System.Xml.XmlDocument.
pt_br: Usa o setter não seguro da propriedade InnerXml de System.Xml.XmlDocument.
ru: Использует небезопасный метод задания свойства InnerXml для System.Xml.XmlDocument.
tr: System.Xml.XmlDocument’in güvenli olmayan InnerXml özellik ayarlayıcısını kullanır.
zh_hans: 使用 System.Xml.XmlDocument 的 InnerXml 属性的不安全资源库。
zh_hant: 使用 System.Xml.XmlDocument 的 InnerXml 屬性之不安全 setter。

# InsecureXmlDtdProcessing
source: Insecure DTD processing in XML
cs: Nezabezpečené zpracování DTD v XML
de: Unsichere DTD-Verarbeitung in XML
es: Procesamiento de DTD no seguro en XML
fr: Traitement DTD non sécurisé dans le code XML
it: Elaborazione DTD non sicura nel codice XML
ja: XML での DTD 処理が安全ではありません
ko: XML의 안전하지 않은 DTD 처리
pl: Niezabezpieczone przetwarzanie elementu DTD w pliku XML
pt_br: Processamento DTD não seguro em XML
ru: Небезопасная обработка DTD в формате XML
tr: XML içinde güvenli olmayan DTD işleme
zh_hans: XML 中不安全的 DTD 处理
zh_hant: XML 中不安全的 DTD 處理

# ReviewDtdProcessingPropertiesMessage
source: Property in {0} might be set from an untrusted source.
cs: Vlastnost v {0} se mohla nastavit z nedůvěryhodného zdroje.
de: Die Eigenschaft in "{0}" wird möglicherweise von einer nicht vertrauenswürdigen Quelle aus festgelegt.
es: La propiedad de {0} puede establecerse a partir de un origen que no es de confianza.
fr: La propriété présente dans {0} est peut-être définie à partir d'une source non approuvée.
it: La proprietà in {0} potrebbe essere impostata da un'origine non attendibile.
ja: {0} のプロパティが、信頼できない発行元から設定されている可能性があります。
ko: {0}의 속성이 신뢰할 수 없는 출처에서 설정되었을 수 있습니다.
pl: Właściwość w elemencie {0} może być ustawiona z niezaufanego źródła.
pt_br: A propriedade no {0} pode ser definida de uma fonte não confiável.
ru: Возможно, свойство {0} задано из ненадежного источника.
tr: {0} içindeki özellik güvenilmeyen bir kaynaktan olabilir.
zh_hans: {0} 中的属性可能是根据不受信任的源设置的。
zh_hant: {0} 中的屬性可從不受信任的來源設定。

# XmlDocumentWithNoSecureResolverMessage
source: An XmlDocument instance is created without setting its XmlResolver property to a secure value.
cs: Instance XmlDocument se vytvořila bez toho, aby se vlastnost XmlResolver nastavila na bezpečnou hodnotu.
de: Eine XmlDocument-Instanz wird erstellt, ohne dass die zugehörige XmlResolver-Eigenschaft auf einen sicheren Wert festgelegt wird.
es: Una instancia de XmlDocument se crea sin configurar su propiedad XmlResolver en un valor seguro.
fr: Une instance de XmlDocument est créée sans qu'une valeur sécurisée ait été affectée à sa propriété XmlResolver.
it: Viene creata un'istanza di XmlDocument senza impostarne la proprietà XmlResolver su un valore sicuro.
ja: XmlDocument インスタンスの作成で、XmlResolver プロパティが安全な値に設定されていません。
ko: XmlResolver 속성이 보안 값으로 설정되지 않은 상태에서 XmlDocument 인스턴스가 만들어졌습니다.
pl: Wystąpienie elementu XmlDocument zostało utworzone bez ustawienia jego właściwości XmlResolver na bezpieczną wartość.
pt_br: Uma instância XmlDocument é criada sem definir sua propriedade XmlResolver para um valor seguro.
ru: При создании экземпляра XmlDocument для его свойства XmlResolver не было задано безопасное значение.
tr: Bir XmlDocument örneği, XmlResolver özelliği güvenli bir değere ayarlanmadan oluşturuldu.
zh_hans: 在未将其 XmlResolver 属性设置为安全值的情况下创建了 XmlDocument 实例。
zh_hant: 建立 XmlDocument 執行個體時，未將其 XmlResolver 屬性設為安全的值。

# XmlReaderCreateInsecureConstructedMessage
source: An insecure XmlReaderSettings instance is provided to XmlReader.Create method.
cs: Metodě XmlReader.Create se poskytla nezabezpečená instance XmlReaderSettings.
de: Der XmlReader.Create-Methode wird eine unsichere XmlReaderSettings-Instanz bereitgestellt.
es: Se proporciona una instancia XmlReaderSettings no segura al método XmlReader.Create.
fr: Une instance non sécurisée de XmlReaderSettings est fournie à la méthode XmlReader.Create.
it: Viene fornita un'istanza non sicura di XmlReaderSettings al metodo XmlReader.Create.
ja: XmlReader.Create メソッドに安全でない XmlReaderSettings インスタンスが指定されます。
ko: 안전하지 않은 XmlReaderSettings 인스턴스가 XmlReader.Create 메서드에 제공되었습니다.
pl: Dostarczono niezabezpieczone wystąpienie XmlReaderSettings do metody XmlReader.Create.
pt_br: Uma instância XmlReaderSettings não segura é fornecida para o método XmlReader.Create.
ru: Методу XmlReader.Create предоставлен небезопасный экземпляр XmlReaderSettings.
tr: XmlReader.Create yöntemine güvenli olmayan bir XmlReaderSettings örneği sağlandı.
zh_hans: 向 XmlReader.Create 方法提供了不安全的 XmlReaderSettings 实例。
zh_hant: 對 XmlReader.Create 方法提供的 XmlReaderSettings 執行個體不安全。

# XmlReaderCreateInsecureInputMessage
source: A potentially insecure XmlReaderSettings instance is provided to XmlReader.Create method.
cs: Metodě XmlReader.Create se poskytla potenciálně nezabezpečená instance XmlReaderSettings.
de: Der XmlReader.Create-Methode wird eine möglicherweise unsichere XmlReaderSettings-Instanz bereitgestellt.
es: Se proporciona una instancia XmlReaderSettings potencialmente no segura al método XmlReader.Create.
fr: Une instance potentiellement non sécurisée de XmlReaderSettings est fournie à la méthode XmlReader.Create.
it: Viene fornita un'istanza potenzialmente non sicura di XmlReaderSettings al metodo XmlReader.Create.
ja: XmlReader.Create メソッドに安全でない可能性がある XmlReaderSettings インスタンスが指定されます。
ko: 잠재적으로 안전하지 않은 XmlReaderSettings 인스턴스가 XmlReader.Create 메서드에 제공되었습니다.
pl: Dostarczono potencjalnie niezabezpieczone wystąpienie XmlReaderSettings do metody XmlReader.Create.
pt_br: Uma instância XmlReaderSettings potencialmente não segura é fornecida para o método XmlReader.Create.
ru: Методу XmlReader.Create предоставлен потенциально небезопасный экземпляр XmlReaderSettings.
tr: XmlReader.Create yöntemine güvenli olmayabilecek bir XmlReaderSettings örneği sağlandı.
zh_hans: 向 XmlReader.Create 方法提供了可能不安全的 XmlReaderSettings 实例。
zh_hant: 對 XmlReader.Create 方法提供了可能不安全的 XmlReaderSettings 執行個體。

# XmlReaderCreateWrongOverloadMessage
source: An insecure overload of XmlReader.Create which does not accept an XmlReaderSettings argument.
cs: Nezabezpečené přetížení metody XmlReader.Create, která nepřijímá argument XmlReaderSettings
de: Eine unsichere Überladung von "XmlReader.Create", die kein XmlReaderSettings-Argument akzeptiert.
es: Una sobrecarga no segura de XmlReader.Create que no acepta un argumento XmlReaderSettings.
fr: Surcharge non sécurisée de XmlReader.Create qui n'accepte pas d'argument de XmlReaderSettings.
it: Overload non sicuro di XmlReader.Create che non accetta un argomento di XmlReaderSettings.
ja: XmlReaderSettings 引数を受け付けない XmlReader.Create のオーバーロードは安全ではありません。
ko: XmlReaderSettings 인수를 사용하지 않는 XmlReader.Create의 안전하지 않은 오버로드입니다.
pl: Niezabezpieczone przeciążenie metody XmlReader.Create, która nie akceptuje argumentu XmlReaderSettings.
pt_br: Uma sobrecarga não segura de XmlReader.Create que não aceita um argumento XmlReaderSettings.
ru: Небезопасная перегрузка XmlReader.Create, которая не принимает аргумент XmlReaderSettings.
tr: XmlReaderSettings bağımsız değişkenini kabul etmeyen güvenli olmayan bir XmlReader.Create aşırı yükü.
zh_hans: XmlReader 的不安全重载，它不接受 XmlReaderSettings 参数。
zh_hant: 不接受 XmlReaderSettings 引數的 XmlReader.Create 之非安全多載。

# XmlTextReaderConstructedWithNoSecureResolutionMessage
source: XmlTextReader instance created with insecure default settings.
cs: Instance XmlTextReader se vytvořila s nezabezpečenými výchozími nastaveními.
de: Eine XmlTextReader-Instanz wurde mit unsicheren Standardeinstellungen erstellt.
es: Instancia XmlTextReader creada con una configuración predeterminada no segura.
fr: Instance de XmlTextReader créée avec des paramètres par défaut non sécurisés.
it: Istanza di XmlTextReader creata con impostazioni predefinite non sicure.
ja: XmlTextReader インスタンスが安全でない既定の設定で作成されました。
ko: 안전하지 않은 기본 설정을 사용하여 XmlTextReader 인스턴스가 만들어졌습니다.
pl: Wystąpienie XmlTextReader utworzone przy użyciu niezabezpieczonych ustawień domyślnych.
pt_br: Instância de XmlTextReader criada com configurações padrão não seguras.
ru: Экземпляр XmlTextReader создан с небезопасными параметрами по умолчанию.
tr: XmlTextReader örneği, güvenli olmayan varsayılan ayarlarla oluşturuldu.
zh_hans: 使用不安全的默认设置创建的 XmlTextReader 实例。
zh_hant: 建立 XmlTextReader 執行個體時使用了不安全的預設設定。

# XmlTextReaderSetInsecureResolutionMessage
source: XmlTextReader instance is set with insecure values.
cs: Instance XmlTextReader má nastavené nezabezpečené hodnoty.
de: Eine XmlTextReader-Instanz wurde mit unsicheren Werte festgelegt.
es: La instancia XmlTextReader se establece con valores no seguros.
fr: L'instance de XmlTextReader est définie avec des valeurs non sécurisées.
it: L'istanza di XmlTextReader è impostata con valori non sicuri.
ja: XmlTextReader インスタンスに安全でない値が設定されています。
ko: 안전하지 않은 값을 사용하여 XmlTextReader 인스턴스가 설정되었습니다.
pl: Wystąpienie XmlTextReader zostało ustawione przy użyciu niezabezpieczonych wartości.
pt_br: A instância de XmlTextReader está definida com valores não seguros.
ru: Для экземпляра XmlTextReader заданы небезопасные значения.
tr: XmlTextReader örneği, güvenli olmayan değerler ile ayarlandı.
zh_hans: 使用不安全的值设置 XmlTextReader 实例。
zh_hant: 設定 XmlTextReader 執行個體時使用了不安全的值。

# InsecureDtdProcessingInApiDesign
source: Insecure Processing in API Design, XmlDocument and XmlTextReader
cs: Nezabezpečené zpracování v návrhu rozhraní API a třídách XmlDocument a XmlTextReader
de: Unsichere Verarbeitung in API-Design, XmlDocument und XmlTextReader
es: Procesamiento no seguro en API Design, XmlDocument y XmlTextReader
fr: Traitement non sécurisé dans le design d'API, XmlDocument et XmlTextReader
it: Elaborazione non sicura nella progettazione API, XmlDocument e XmlTextReader
ja: API の設計 XmlDocument および XmlTextReader で処理が安全ではありません
ko: API 디자인, XmlDocument 및 XmlTextReader의 안전하지 않은 처리
pl: Niezabezpieczone przetwarzanie w projektowaniu interfejsu API, elemencie XmlDocument oraz elemencie XmlTextReader
pt_br: Processamento não seguro no Design de API, XmlDocument e XmlTextReader
ru: Небезопасная обработка в структуре API, XmlDocument и XmlTextReader
tr: API Design, XmlDocument ve XmlTextReader içinde güvenli olmayan İşleme
zh_hans: API 设计、XmlDocument 和 XmlTextReader 中不安全的处理
zh_hant: API 設計、XmlDocument 及 XmlTextReader 中的不安全處理
