Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetFramework.Analyzers/xlf/MicrosoftNetFrameworkAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ReviewDataViewCollectionStringDescription
source: Review code to insure that usage of System.Data.DataViewManager.DataViewSettingCollectionString input is sanitized to not contain DTD. Enabling DTD processing on the XML reader and using UrlResolver for resolving external XML entities may lead to information disclosure. Content from file system or network shares for the machine processing the XML can be exposed to attacker. In addition, an attacker can use this as a DoS vector.
cs: Zkontrolujte kód a ujistěte se, že vstup System.Data.DataViewManager.DataViewSettingCollectionString se upravil tak, aby neobsahoval DTD. Když se ve čtečce XML povolí zpracování DTD a k překladu externích entit XML se použije UrlResolver, může dojít k odhalení informací. Obsah systému souborů nebo sdílených síťových složek počítače, který zpracovává kód XML, může zjistit útočník. Kromě toho může toto útočník využít jako místo pro útok DoS.
de: Prüfen Sie den Code, um sicherzustellen, dass die Syntax der Eingabe für "System.Data.DataViewManager.DataViewSettingCollectionString" so bereinigt wurde, dass keine DTD enthalten ist. Das Aktivieren der DTD´-Verarbeitung im XML-Reader und die Verwendung von UrlResolver zum Auflösen externer XML-Entitäten können zur Veröffentlichung von Informationen führen. Inhalte aus dem Dateisystem oder aus Netzwerkfreigaben für den Computer, auf dem das XML verarbeitet wird, können einem Angreifer verfügbar gemacht werden. Außerdem kann ein Angreifer dies als DoS-Vektor verwenden.
es: Revise el código para asegurarse de que el uso de la entrada de System.Data.DataViewManager.DataViewSettingCollectionString está saneada para no contener DTD. La habilitación del procesamiento de DTD en el lector XML y el uso de UrlResolver para resolver las entidades XML externas puede provocar una revelación de información. El contenido del sistema de archivos o los recursos compartidos de red de la máquina que procesa el XML pueden resultar expuestos al atacante. Además, un atacante puede usar esto como vector de denegación de servicio.
fr: Passer en revue le code pour vérifier que l'utilisation de l'entrée de System.Data.DataViewManager.DataViewSettingCollectionString ne contient aucun DTD. L'activation du traitement DTD sur le lecteur XML et l'utilisation de UrlResolver pour résoudre les entités XML externes peuvent entraîner une divulgation d'informations. Le contenu du système de fichiers ou des partages réseau de la machine qui traite le code XML peut être exposé à des attaques de pirates. En outre, un pirate peut l'utiliser comme vecteur d'attaque DoS.
it: Esaminare il codice per assicurarsi che l'utilizzo dell'input di System.Data.DataViewManager.DataViewSettingCollectionString sia stato bonificato in modo da non contenere DTD. L'abilitazione dell'elaborazione DTD sul lettore XML e l'uso di UrlResolver per risolvere entità XML esterne potrebbero causare la diffusione di informazioni. Il contenuto di file system o condivisioni di rete per il computer che elabora il codice XML può essere esposto a utenti malintenzionati. Un utente malintenzionato può inoltre usarlo come vettore DoS.
ja: コードをレビューして、System.Data.DataViewManager.DataViewSettingCollectionString 入力の使用が DTD を含まないように校正されていることを確認してください。XML リーダーで DTD 処理を有効にし、外部 XML エンティティの解決に UrlResolver を使用すると、情報漏えいにつながる可能性があります。XML を処理しているコンピューターのファイル システムまたはネットワーク共有のコンテンツは、攻撃者にさらされる可能性があります。また、攻撃者はこれを DoS ベクトルとして使用する可能性があります。
ko: DTD를 포함하지 않도록 System.Data.DataViewManager.DataViewSettingCollectionString 입력의 사용이 삭제되었는지 코드를 검토하세요. XML 판독기에서 DTD 처리를 사용하고 외부 XML 엔터티를 확인하기 위해 UrlResolver를 사용하면 정보가 공개될 수 있습니다. 파일 시스템의 콘텐츠 또는 XML을 처리하는 컴퓨터의 네트워크 공유가 공격자에 노출될 수 있습니다. 또한 공격자는 이를 DoS 벡터로 사용할 수 있습니다.
pl: Przejrzyj kod, aby upewnić się, że użycie danych wejściowych System.Data.DataViewManager.DataViewSettingCollectionString zostało oczyszczone i nie zawiera elementu DTD. Włączenie przetwarzania elementu DTD w obiekcie odczytującym XML i używanie elementu UrlResolver do rozpoznawania zewnętrznych jednostek XML może prowadzić do ujawnienia informacji. Zawartość systemu plików lub udziałów sieciowych w przypadku maszynowego przetwarzania elementu XML może być narażona na atak. Ponadto atakujący może użyć tego jako wektora ataku DoS.
pt_br: Examine o código para garantir que o uso da entrada System.Data.DataViewManager.DataViewSettingCollectionString seja corrigido para não conter DTD. Habilitar o processamento DTD no leitor XML e usar UrlResolver para resolver entidades XML externas pode levar à divulgação de informações. O conteúdo do sistema de arquivos ou dos compartilhamentos de rede para o computador que está processando o XML pode ser exposto ao invasor. Além disso, um invasor pode usar isso como um vetor DoS.
ru: Проверьте, что используемые входные данные System.Data.DataViewManager.DataViewSettingCollectionString очищены от DTD. Разрешение обработки DTD в модуле чтения XML и использование UrlResolver для разрешения внешних XML-сущностей может привести к раскрытию информации. Содержимое из файловой системы или сетевых папок для компьютера, обрабатывающего XML, может попасть к злоумышленнику. Кроме того, злоумышленник может использовать это в качестве вектора для атаки типа "отказ в обслуживании".
tr: System.Data.DataViewManager.DataViewSettingCollectionString girişi kullanımının DTD içermeyecek şekilde temizlendiğinden emin olmak için kodu gözden geçirin. XML okuyucusu üzerinde DTD’yi etkinleştirmek ve dış XML varlıklarını çözümlemek için UrlResolver kullanmak bilgilerin açığa çıkarılmasına neden olabilir. XML’i işleyen makine için dosya sistemi veya ağ paylaşımlarından içerikler saldırgan için açığa çıkarılabilir. Ayrıca, bir saldırgan bunu bir DoS vektörü olarak kullanabilir.
zh_hans: 请评审代码，确保已清理 System.Data.DataViewManager.DataViewSettingCollectionString 输入的使用情况，使其不含 DTD。如果在 XML 读取器中启用 DTD 处理并使用 UrlResolver 解析外部 XML 实体，这可能会导致信息泄露。供计算机处理 XML 的文件系统或网络共享内容可能会暴露给攻击者。另外，攻击者可能会将其用作 DoS 矢量。
zh_hant: 檢閱程式碼以確保 System.Data.DataViewManager.DataViewSettingCollectionString 輸入的使用經過處理，以排除 DTD。在 XML 讀取器上啟用 DTD 處理，並使用 UrlResolver 解析外部 XML 實體，可能會造成資訊外洩。攻擊者有可能會看到為處理 XML 的電腦所提供之檔案系統或網路共用內容。此外，攻擊者還可以使用它作為 DoS 向量。

# ReviewDataViewCollectionStringMessage
source: Review DataView CollectionString
cs: Zkontrolujte DataView CollectionString
de: DataView CollectionString prüfen
es: Revisar DataView CollectionString
fr: Passer en revue le CollectionString de DataView
it: Esaminare DataView CollectionString
ja: DataView CollectionString を確認します
ko: DataView CollectionString을 검토하세요.
pl: Przejrzyj element DataView CollectionString
pt_br: Examinar DataView CollectionString
ru: Проверьте DataView CollectionString
tr: DataView CollectionString’i gözden geçirin
zh_hans: 评审 DataView CollectionString
zh_hant: 檢閱 DataView CollectionString

# UseXmlReaderForDataTableReadXmlTitle
source: Use XmlReader for DataTable ReadXml
cs: Pro DataTable ReadXml použijte XmlReader
de: XmlReader für DataTable ReadXml verwenden
es: Usar XmlReader para DataTable ReadXml
fr: Utiliser XmlReader pour le ReadXml de DataTable
it: Usare XmlReader per ReadXml di DataTable
ja: DataTable ReadXml に XmlReader を使用します
ko: DataTable ReadXml에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataTable ReadXml
pt_br: Usar XmlReader para DataTable ReadXml
ru: Используйте XmlReader для DataTable ReadXml
tr: DataTable ReadXml için XmlReader kullanın
zh_hans: 使用 DataTable ReadXml 的 XmlReader
zh_hant: 為 DataTable ReadXml 使用 XmlReader

# UseXmlReaderForDataTableReadXmlDescription
source: Do not use unsafe overloads of System.Data.DataTable.ReadXml. This API internally enables DTD processing on the XML reader instance used, and uses UrlResolver for resolving external XML entities. The outcome is information disclosure. Content from file system or network shares for the machine processing the XML can be exposed to attacker. In addition, an attacker can use this as a DoS vector.
cs: Nepoužívejte nebezpečná přetížení metody System.Data.DataTable.ReadXml. Toto rozhraní API umožňuje zpracovávat DTD v instanci používané čtečky XML a pomocí UrlResolveru překládá externí entity XML. Výsledkem je odhalení informací. Obsah systému souborů nebo sdílených síťových složek počítače, který zpracovává kód XML, může zjistit útočník. Kromě toho může toto útočník využít jako místo pro útok DoS.
de: Verwenden Sie keine unsicheren Überladungen von "System.Data.DataTable.ReadXml". Diese API aktiviert intern die DTD-Verarbeitung für die verwendete XML-Readerinstanz und verwendet den UrlResolver zum Auflösen externer XML-Entitäten. Das Ergebnis ist die Veröffentlichung von Informationen. Inhalte aus dem Dateisystem oder aus Netzwerkfreigaben für den Computer, auf dem das XML verarbeitet wird, können einem Angreifer verfügbar gemacht werden. Außerdem kann ein Angreifer dies als DoS-Vektor verwenden.
es: No utilice sobrecargas no seguras de System.Data.DataTable.ReadXml. Esta API habilita internamente el procesado de DTD en la instancia utilizada del lector XML, y utiliza UrlResolver para resolver entidades XML externas. El resultado es la revelación de información. El contenido del sistema de archivos o los recursos compartidos de red de la máquina que procesa el XML pueden resultar expuestos al atacante. Además, un atacante puede usar esto como vector de denegación de servicio.
fr: Ne pas utiliser de surcharges unsafe de System.Data.DataTable.ReadXml. Cette API active de manière interne le traitement DTD sur l'instance de lecteur XML utilisée, puis utilise UrlResolver pour résoudre les entités XML externes. Il en résulte une divulgation d'informations. Le contenu du système de fichiers ou des partages réseau de la machine qui traite le code XML peut être exposé à des attaques de pirates. En outre, un pirate peut l'utiliser comme vecteur d'attaque DoS.
it: Non usare overload non sicuri di System.Data.DataTable.ReadXml. Questa API abilita internamente l'elaborazione della DTD sull'istanza usata del lettore XML e usa UrlResolver per risolvere le entità XML esterne. Il risultato implica la diffusione di informazioni. Il contenuto di file system o condivisioni di rete per il computer che elabora il codice XML può essere esposto a utenti malintenzionati. Un utente malintenzionato può inoltre usarlo come vettore DoS.
ja: System.Data.DataTable.ReadXml の安全でないオーバーロードを使用しないでください。この API により、使用されている XML リーダー インスタンスでの DTD 処理が内部で有効になり、外部 XML エンティティの解決に UrlResolver が使用されます。その結果は情報漏えいです。XML を処理しているコンピューターのファイル システムまたはネットワーク共有のコンテンツは、攻撃者にさらされる可能性があります。また、攻撃者はこれを DoS ベクトルとして使用する可能性があります。
ko: System.Data.DataTable.ReadXml의 안전하지 않은 오버로드를 사용하지 마세요. 이 API는 인스턴스가 사용된 XML 판독기에서 내부적으로 DTD 처리를 사용하며 외부 XML 엔터티를 확인하기 위해 UrlResolver를 사용합니다. 그 결과, 정보가 공개됩니다. 파일 시스템의 콘텐츠 또는 XML을 처리하는 컴퓨터의 네트워크 공유가 공격자에 노출될 수 있습니다. 또한 공격자는 이를 DoS 벡터로 사용할 수 있습니다.
pl: Nie używaj niebezpiecznych przeciążeń elementu System.Data.DataTable.ReadXml. Ten interfejs API wewnętrznie umożliwia przetwarzanie elementu DTD w używanym wystąpieniu obiektu odczytującego XML i używa elementu UrlResolver do rozpoznawania zewnętrznych jednostek XML. Wynikiem jest ujawnienie informacji. Zawartość systemu plików lub udziałów sieciowych w przypadku maszynowego przetwarzania elementu XML może być narażona na atak. Ponadto atakujący może użyć tego jako wektora ataku DoS.
pt_br: Não use sobrecargas não seguras de System.Data.DataTable.ReadXml. Esta API habilita internamente o processamento DTD na instância do leitor de XML usada e usa o UrlResolver para resolver entidades XML externas. O resultado é a divulgação de informações. O conteúdo do sistema de arquivos ou dos compartilhamentos de rede para o computador que está processando o XML pode ser exposto ao invasor. Além disso, um invasor pode usar isso como um vetor DoS.
ru: Не используйте небезопасные перегрузки System.Data.DataTable.ReadXml. Этот API допускает внутреннюю обработку DTD в используемом экземпляре модуля чтения XML, а также использует UrlResolver для разрешения внешних XML-сущностей. Результатом является раскрытие информации. Содержимое из файловой системы или сетевых папок для компьютера, обрабатывающего XML, может попасть к злоумышленнику. Кроме того, злоумышленник может использовать это в качестве вектора для атаки типа "отказ в обслуживании".
tr: Güvenli olmayan System.Data.DataTable.ReadXml aşırı yükleri kullanmayın. Bu API kullanılan XML okuyucusu örneği üzerinde iç DTD işlemeyi etkinleştirir ve dış XML varlıkları için UrlResolver kullanır. Sonuç, bilgilerin açığa çıkmasıdır. XML’i işleyen makine için dosya sistemi veya ağ paylaşımlarından içerikler saldırgan için açığa çıkarılabilir. Ayrıca, bir saldırgan bunu bir DoS vektörü olarak kullanabilir.
zh_hans: 不要使用 System.Data.DataTable.ReadXml 的不安全重载。此 API 在内部对所用的 XML 读取器实例启用了 DTD 处理，并使用 UrlResolver 解析外部 XML 实体。这导致了信息泄漏。供计算机处理 XML 的文件系统或网络共享内容可能会暴露给攻击者。另外，攻击者可能会将其用作 DoS 矢量。
zh_hant: 請勿使用 System.Data.DataTable.ReadXml 的不安全多載。此 API 會在執行個體使用的 XML 讀取器上，於內部啟用 DTD 處理，並使用 UrlResolver 解析外部 XML 實體。結果會造成資訊外洩。攻擊者有可能會看到為處理 XML 的電腦所提供之檔案系統或網路共用內容。此外，攻擊者還可以使用它作為 DoS 向量。

# UseXmlReaderForDataTableReadXmlMessage
source: Use XmlReader for DataTable ReadXml
cs: Pro DataTable ReadXml použijte XmlReader
de: XmlReader für DataTable ReadXml verwenden
es: Usar XmlReader para DataTable ReadXml
fr: Utiliser XmlReader pour le ReadXml de DataTable
it: Usare XmlReader per ReadXml di DataTable
ja: DataTable ReadXml に XmlReader を使用します
ko: DataTable ReadXml에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataTable ReadXml
pt_br: Usar XmlReader para DataTable ReadXml
ru: Используйте XmlReader для DataTable ReadXml
tr: DataTable ReadXml için XmlReader kullanın
zh_hans: 使用 DataTable ReadXml 的 XmlReader
zh_hant: 為 DataTable ReadXml 使用 XmlReader

# UseXmlReaderForDataTableReadXmlSchemaTitle
source: Use XmlReader for DataTable ReadXmlSchema
cs: Pro DataTable ReadXmlSchema použijte XmlReader
de: XmlReader für DataTable ReadXmlSchema verwenden
es: Usar XmlReader para DataTable ReadXmlSchema
fr: Utiliser XmlReader pour le ReadXmlSchema de DataTable
it: Usare XmlReader per ReadXmlSchema di DataTable
ja: DataTable ReadXmlSchema に XmlReader を使用します
ko: DataTable ReadXmlSchema에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataTable ReadXmlSchema
pt_br: Usar XmlReader para DataTable ReadXmlSchema
ru: Используйте XmlReader для DataTable ReadXmlSchema
tr: DataTable ReadXmlSchema için XmlReader kullanın
zh_hans: 使用 DataTable ReadXmlSchema 的 XmlReader
zh_hant: 為 DataTable ReadXmlSchema 使用 XmlReader

# UseXmlReaderForDataTableReadXmlSchemaDescription
source: Checks for usage of an unsafe overload of System.Data.DataTable.ReadXmlSchema. This API internally enables DTD processing on the XML reader instance used, and uses UrlResolver for resolving external XML entities. The outcome is information disclosure. Content from file system or network shares for the machine processing the XML can be exposed to attacker. In addition, an attacker can use this as a DoS vector.
cs: Zkontroluje, jestli se nepoužilo nebezpečné přetížení metody System.Data.DataTable.ReadXmlSchema. Toto rozhraní API umožňuje zpracovávat DTD v instanci používané čtečky XML a pomocí UrlResolveru překládá externí entity XML. Výsledkem je odhalení informací. Obsah systému souborů nebo sdílených síťových složek počítače, který zpracovává kód XML, může zjistit útočník. Kromě toho může toto útočník využít jako místo pro útok DoS.
de: Prüft auf die Nutzung einer unsicheren Überladung von "System.Data.DataTable.ReadXmlSchema". Diese API aktiviert intern die DTD-Verarbeitung für die verwendete XML-Readerinstanz und verwendet den UrlResolver zum Auflösen externer XML-Entitäten. Das Ergebnis ist die Veröffentlichung von Informationen. Inhalte aus dem Dateisystem oder aus Netzwerkfreigaben für den Computer, auf dem das XML verarbeitet wird, können einem Angreifer verfügbar gemacht werden. Außerdem kann ein Angreifer dies als DoS-Vektor verwenden.
es: Comprobaciones para el uso de una sobrecarga no segura de System.Data.DataTable.ReadXmlSchema. Esta API habilita internamente el procesado de DTD en la instancia utilizada del lector XML, y utiliza UrlResolver para resolver entidades XML externas. El resultado es la revelación de información. El contenido del sistema de archivos o los recursos compartidos de red de la máquina que procesa el XML pueden resultar expuestos al atacante. Además, un atacante puede usar esto como vector de denegación de servicio.
fr: Vérifie si une surcharge unsafe de System.Data.DataTable.ReadXmlSchema est utilisée. Cette API active de manière interne le traitement DTD sur l'instance de lecteur XML utilisée, puis utilise UrlResolver pour résoudre les entités XML externes. Il en résulte une divulgation d'informations. Le contenu du système de fichiers ou des partages réseau de la machine qui traite le code XML peut être exposé à des attaques de pirates. En outre, un pirate peut l'utiliser comme vecteur d'attaque DoS.
it: Verifica se è stato usato un overload non sicuro di System.Data.DataTable.ReadXmlSchema. Questa API abilita internamente l'elaborazione della DTD sull'istanza usata del lettore XML e usa UrlResolver per risolvere le entità XML esterne. Il risultato implica la diffusione di informazioni. Il contenuto di file system o condivisioni di rete per il computer che elabora il codice XML può essere esposto a utenti malintenzionati. Un utente malintenzionato può inoltre usarlo come vettore DoS.
ja: System.Data.DataTable.ReadXmlSchema の安全でないオーバーロードの使用状況を確認します。この API により、使用されている XML リーダー インスタンスでの DTD 処理が内部で有効になり、外部 XML エンティティの解決に UrlResolver が使用されます。その結果は情報漏えいです。XML を処理しているコンピューターのファイル システムまたはネットワーク共有のコンテンツは、攻撃者にさらされる可能性があります。また、攻撃者はこれを DoS ベクトルとして使用する可能性があります。
ko: System.Data.DataTable.ReadXmlSchema의 안전하지 않은 오버로드 사용을 확인합니다. 이 API는 인스턴스가 사용된 XML 판독기에서 내부적으로 DTD 처리를 사용하며 외부 XML 엔터티를 확인하기 위해 UrlResolver를 사용합니다. 그 결과, 정보가 공개됩니다. 파일 시스템의 콘텐츠 또는 XML을 처리하는 컴퓨터의 네트워크 공유가 공격자에 노출될 수 있습니다. 또한 공격자는 이를 DoS 벡터로 사용할 수 있습니다.
pl: Sprawdza, czy używane jest niebezpieczne przeciążenie elementu System.Data.DataTable.ReadXmlSchema. Ten interfejs API wewnętrznie umożliwia przetwarzanie elementu DTD w używanym wystąpieniu obiektu odczytującego XML i używa elementu UrlResolver do rozpoznawania zewnętrznych jednostek XML. Wynikiem jest ujawnienie informacji. Zawartość systemu plików lub udziałów sieciowych w przypadku maszynowego przetwarzania elementu XML może być narażona na atak. Ponadto atakujący może użyć tego jako wektora ataku DoS.
pt_br: Verifique se há uso de uma sobrecarga não segura de System.Data.DataTable.ReadXmlSchema. Esta API habilita internamente o processamento DTD na instância do leitor de XML usada e usa o UrlResolver para resolver entidades XML externas. O resultado é a divulgação de informações. O conteúdo do sistema de arquivos ou dos compartilhamentos de rede para o computador que está processando o XML pode ser exposto ao invasor. Além disso, um invasor pode usar isso como um vetor DoS.
ru: Проверки использования небезопасной перегрузки System.Data.DataTable.ReadXmlSchema. Этот API допускает внутреннюю обработку DTD в используемом экземпляре модуля чтения XML, а также использует UrlResolver для разрешения внешних XML-сущностей. Результатом является раскрытие информации. Содержимое из файловой системы или сетевых папок для компьютера, обрабатывающего XML, может попасть к злоумышленнику. Кроме того, злоумышленник может использовать это в качестве вектора для атаки типа "отказ в обслуживании".
tr: Güvenli olmayan System.Data.DataTable.ReadXmlSchema aşırı yüklerinin kullanımını denetler. Bu API kullanılan XML okuyucusu örneği üzerinde iç DTD işlemeyi etkinleştirir ve dış XML varlıkları için UrlResolver kullanır. Sonuç, bilgilerin açığa çıkmasıdır. XML’i işleyen makine için dosya sistemi veya ağ paylaşımlarından içerikler saldırgan için açığa çıkarılabilir. Ayrıca, bir saldırgan bunu bir DoS vektörü olarak kullanabilir.
zh_hans: 检查 System.Data.DataTable.ReadXmlSchema 的不安全重载的使用情况。此 API 在内部对所用的 XML 读取器实例启用了 DTD 处理，并使用 UrlResolver 解析外部 XML 实体。这导致了信息泄漏。供计算机处理 XML 的文件系统或网络共享内容可能会暴露给攻击者。另外，攻击者可能会将其用作 DoS 矢量。
zh_hant: 檢查 System.Data.DataTable.ReadXmlSchema 不安全多載的使用方式。此 API 會在執行個體使用的 XML 讀取器上，於內部啟用 DTD 處理，並使用 UrlResolver 解析外部 XML 實體。結果會造成資訊外洩。攻擊者有可能會看到為處理 XML 的電腦所提供之檔案系統或網路共用內容。此外，攻擊者還可以使用它作為 DoS 向量。

# UseXmlReaderForDataTableReadXmlSchemaMessage
source: Use XmlReader for DataTable ReadXmlSchema
cs: Pro DataTable ReadXmlSchema použijte XmlReader
de: XmlReader für DataTable ReadXmlSchema verwenden
es: Usar XmlReader para DataTable ReadXmlSchema
fr: Utiliser XmlReader pour le ReadXmlSchema de DataTable
it: Usare XmlReader per ReadXmlSchema di DataTable
ja: DataTable ReadXmlSchema に XmlReader を使用します
ko: DataTable ReadXmlSchema에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataTable ReadXmlSchema
pt_br: Usar XmlReader para DataTable ReadXmlSchema
ru: Используйте XmlReader для DataTable ReadXmlSchema
tr: DataTable ReadXmlSchema için XmlReader kullanın
zh_hans: 使用 DataTable ReadXmlSchema 的 XmlReader
zh_hant: 為 DataTable ReadXmlSchema 使用 XmlReader

source: Do Not Catch Corrupted State Exceptions
cs: Nezachytávejte výjimky poškozující stav procesu
de: Keine Corrupted State Exceptions abfangen
es: No tomar excepciones de estado dañado
fr: Ne pas intercepter les exceptions état altéré
it: Non rilevare eccezioni di stato danneggiato
ja: 破損状態例外をキャッチしません
ko: 손상된 상태 예외를 catch하지 마세요.
pl: Nie przechwytuj wyjątków stanu uszkodzenia
pt_br: Não capturar exceções de estado corrompido
ru: Не перехватывайте исключения поврежденного состояния
tr: Bozuk Durum Özel Durumlarını Yakalama
zh_hans: 不要捕获损坏状态异常
zh_hant: 請勿擷取損毀狀態例外狀況

# DoNotCatchCorruptedStateExceptionsDescription
source: Catching corrupted state exceptions could mask errors (such as access violations), resulting in inconsistent state of execution or making it easier for attackers to compromise system. Instead, catch and handle a more specific set of exception type(s) or re-throw the exception
cs: Zachytávání výjimek poškozující stav procesu může skrýt chyby (třeba narušení přístupu). To může vést k nekonzistentnímu stavu spuštění, ale taky usnadnit útočníkům průnik do systému. Místo toho zachyťte a zpracujte konkrétnější sadu typů výjimek nebo danou výjimku znovu vyvolejte.
it: Il rilevamento di eccezioni di stato danneggiato potrebbe mascherare errori, ad esempio violazioni di accesso, rendendo incoerente lo stato di esecuzione o consentendo a utenti malintenzionati di compromettere più facilmente il sistema. Rilevare e gestire invece un set più specifico di tipi di eccezione oppure generare di nuovo l'eccezione
tr: Bozuk durum özel durumlarını yakalamak hataları (örneğin erişim ihlalleri) gizleyerek tutarsız yürütme durumuna neden olabilir veya saldırganların sistem gizliliğini bozmasını kolaylaştırabilir. Bunun yerine daha belirli özel durum türlerini yakalayın ve işleyin veya özel durumu yeniden oluşturun

# DoNotCatchCorruptedStateExceptionsMessage
source: {0} is catching corrupted state exception.
cs: {0} zachytává výjimku poškozující stav procesu.
it: {0} sta rilevando l'eccezione stato danneggiato.
tr: {0} bozuk durum özel durumlarını yakalıyor.
