Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetFramework.Analyzers/xlf/MicrosoftNetFrameworkAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseInsecureDtdProcessingInApiDesignDescription
source: Enabling DTD processing on all instances derived from XmlTextReader or XmlDocument and using XmlUrlResolver for resolving external XML entities may lead to information disclosure. Ensure to set the XmlResolver property to null, create an instance of XmlSecureResolver when processing untrusted input, or use XmlReader.Create method with a secure XmlReaderSettings argument. Unless you need to enable it, ensure the DtdProcessing property is set to false.
cs: Když se ve všech instancích odvozených od třídy XmlTextReader nebo XmlDocument povolí zpracování DTD a k překladu externích entit XML se použije XmlUrlResolver, může dojít k odhalení informací. Ujistěte se, že jste nastavili vlastnost XmlResolver na null, při zpracování nedůvěryhodného vstupu vytvořte instanci třídy XmlSecureResolver nebo použijte metodu XmlReader.Create s bezpečným argumentem XmlReaderSettings. Pokud nepotřebujete povolit vlastnost DtdProcessing, ujistěte se, že je nastavená na false.
de: Das Aktivieren der DTD´-Verarbeitung in allen von XmlTextReader oder XmlDocument abgeleiteten Instanzen und die Verwendung von XmlUrlResolver zum Auflösen externer XML-Entitäten können zur Veröffentlichung von Informationen führen. Legen Sie die XmlResolver-Eigenschaft unbedingt auf NULL fest, erstellen Sie eine Instanz von XmlSecureResolver bei der Verarbeitung nicht vertrauenswürdiger Inhalte, oder verwenden Sie die XmlReader.Create-Methode mit einem sicheren XmlReaderSettings-Argument. Wenn Sie sie nicht aktivieren müssen, stellen Sie sicher, dass die DtdProcessing-Eigenschaft auf FALSE festgelegt wird.
es: La habilitación del procesamiento de DTD en todas las instancias derivadas de XmlTextReader o XmlDocument y el uso de UrlResolver para resolver las entidades XML externas puede provocar una revelación de información. Asegúrese de establecer la propiedad XmlResolver en un valor nulo, crear una instancia de XmlSecureResolver al procesar una entrada que no sea de confianza o utilizar el método XmlReader.Create con un argumento XmlReaderSettings seguro. A menos que necesite habilitarla, asegúrese de que la propiedad DtdProcessing se establece en false.
fr: L'activation du traitement DTD sur toutes les instances dérivées de XmlTextReader ou de XmlDocument, et l'utilisation de XmlUrlResolver pour la résolution des entités XML externes peuvent entraîner une divulgation d'informations. Veillez à affecter une valeur null à la propriété XmlResolver, créez une instance de XmlSecureResolver durant le traitement des entrées approuvées, ou utilisez la méthode XmlReader.Create avec un argument XmlReaderSettings sécurisé. À moins que vous ne soyez obligé de l'activer, vérifiez que la propriété DtdProcessing a la valeur false.
it: L'abilitazione dell'elaborazione DTD su tutte le istanze derivate da XmlTextReader o XmlDocument e l'uso di XmlUrlResolver per la risoluzione di entità XML esterne potrebbero causare la diffusione di informazioni. Assicurarsi di impostare la proprietà XmlResolver su Null, creare un'istanza di XmlSecureResolver durante l'elaborazione di input non attendibile oppure usare il metodo XmlReader.Create con un argomento sicuro di XmlReaderSettings. A meno che non sia necessario abilitarla, assicurarsi che la proprietà DtdProcessing sia impostata su false.
ja: XmlTextReader または XmlDocument から派生したすべてのインスタンスで DTD 処理を有効にし、外部 XML エンティティの解決に XmlUrlResolver を使用すると、情報漏えいにつながる可能性があります。XmlResolver プロパティを null に設定するか、信頼できない入力を処理するときに XmlSecureResolver のインスタンスを作成するか、安全な XmlReaderSettings 引数を指定した XmlReader.Create メソッドを使用してください。DtdProcessing プロパティは、有効にする必要がない場合は false に設定してください。
ko: XmlTextReader 또는 XmlDocument에서 파생된 모든 인스턴스에서 DTD 처리를 사용하고, 외부 XML 엔터티를 확인하기 위해 XmlUrlResolver를 사용하면 정보가 공개될 수 있습니다. XmlResolver 속성을 null로 설정하고, 신뢰할 수 없는 입력을 처리할 때 XmlSecureResolver의 인스턴스를 만들거나 안전한 XmlReaderSettings 인수로 XmlReader.Create 메서드를 사용하세요. 사용해야 하는 경우를 제외하고 DtdProcessing 속성을 false로 설정하세요.
pl: Włączenie przetwarzania elementu DTD we wszystkich wystąpieniach pochodzących z elementów XmlTextReader lub XmlDocument i używanie elementu XmlUrlResolver do rozpoznawania zewnętrznych jednostek XML może prowadzić do ujawnienia informacji. Upewnij się, że właściwość XmlResolver jest ustawiona na wartość null, utwórz wystąpienie XmlSecureResolver podczas przetwarzania niezaufanych danych wejściowych lub użyj metody XmlReader.Create z zabezpieczonym argumentem XmlReaderSettings. Upewnij się, że właściwość DtdProcessing jest ustawiona na wartość false, o ile nie musisz jej włączyć.
pt_br: Habilitar o processamento DTD em todas as instâncias derivadas de XmlTextReader ou XmlDocument e usar XmlUrlResolver para resolver entidades XML externas pode levar à divulgação de informações. Certifique-se de definir a propriedade XmlResolver como null, criar uma instância de XmlSecureResolver ao processar a entrada não confiável ou usar o método XmlReader.Create com um argumento XmlReaderSettings seguro. A menos que seja necessário habilitá-la, certifique-se de que a propriedade DtdProcessing está definida como false.
ru: Разрешение обработки DTD для всех экземпляров, производных от XmlTextReader или XmlDocument, и использование XmlUrlResolver для разрешения внешних XML-сущностей может привести к раскрытию информации. Обязательно задайте для свойства XmlResolver значение Null, создайте экземпляр XmlSecureResolver при обработке ненадежных входных данных или используйте метод XmlReader.Create с безопасным аргументом XmlReaderSettings. Все время, пока вы не используете свойство DtdProcessing, оно должно быть равно false.
tr: XmlTextReader veya XmlDocument’tan türetilen tüm örnekler üzerinde DTD’yi etkinleştirmek ve dış XML varlıklarını çözümlemek için XmlUrlResolver kullanmak bilgilerin açığa çıkarılmasına neden olabilir. XmlResolver özelliğini null olarak ayarladığınızdan, güvenilmeyen girişler işlenirken bir XmlSecureResolver örneği oluşturduğunuzdan veya güvenli bir XmlReaderSettings bağımsız değişkeni ile XmlReader.Create yöntemini kullandığınızdan emin olun. Bunu etkinleştirmeniz gerekmiyorsa, DtdProcessing özelliğinin false olarak ayarlandığından emin olun.
zh_hans: 对所有派生自 XmlTextReader 或 XmlDocument 的实例启用 DTD 处理，以及使用 XmlUrlResolver 解析外部 XML 实体，这些情况都可能导致信息泄露。请确保将 XmlResolver 属性设置为 null，在处理不受信任的输入时创建 XmlSecureResolver 实例，或者使用具有安全的 XmlReaderSettings 参数的 XmlReader.Create 方法。除非需要启用它，否则请确保将 DtdProcessing 属性设置为 false。
zh_hant: 在所有衍生自 XmlTextReader 或 XmlDocument 的執行個體上啟用 DTD 處理，並使用 XmlUrlResolver 解析外部 XML 實體，可能會造成資訊外洩。請務必將 XmlResolver 屬性設為 Null，在處理不受信任的輸入時建立 XmlSecureResolver 執行個體，或使用具有安全 XmlReaderSettings 引數的 XmlReader.Create 方法。除非需要將其啟用，否則請務必將 DtdProcessing 屬性設為 false。

# XmlDocumentDerivedClassConstructorNoSecureXmlResolverMessage
source: Constructor of XmlDocument derived class {0} implicitly uses insecure default value for DTD processing.
cs: Konstruktor odvozené třídy XmlDocument {0} implicitně používá pro zpracování DTD nezabezpečenou výchozí hodnotu.
de: Der Konstruktor der von XmlDocument abgeleiteten Klasse "{0}" verwendet implizit einen unsicheren Standardwert für die DTD-Verarbeitung.
es: El constructor de la clase derivada de XmlDocument {0} usa de manera implícita el valor predeterminado no seguro para el procesamiento de DTD.
fr: Le constructeur de la classe dérivée {0} de XmlDocument utilise implicitement une valeur par défaut non sécurisée pour le traitement DTD.
it: Il costruttore della classe {0} derivata da XmlDocument usa in modo implicito un valore predefinito non sicuro per l'elaborazione DTD.
ja: XmlDocument の派生クラス {0} のコンストラクターが、DTD 処理に安全でない既定値を暗黙的に使用しています。
ko: XmlDocument 파생 클래스 {0}의 생성자가 DTD 처리의 안전하지 않은 기본값을 암시적으로 사용합니다.
pl: Konstruktor klasy pochodnej {0} elementu XmlDocument niejawnie używa niezabezpieczonej wartości domyślnej do przetwarzania elementu DTD.
pt_br: O construtor da classe derivada XmlDocument {0} usa implicitamente o valor padrão não seguro para processamento DTD.
ru: Конструктор производного класса XmlDocument {0} неявно использует небезопасное значение по умолчанию для обработки DTD.
tr: XmlDocument’tan türetilen sınıf {0} oluşturucusu DTD işleme için örtülü olarak güvenli olmayan varsayılan değeri kullanıyor.
zh_hans: XmlDocument 派生类 {0} 的构造函数隐式使用不安全的默认值进行 DTD 处理。
zh_hant: XmlDocument 衍生類別 {0} 的建構函式，會以隱含方式使用 DTD 處理的不安全預設值。

# XmlDocumentDerivedClassNoConstructorMessage
source: XmlDocument derived class {0} doesn't explictily define a constructor.
cs: Odvozená třída XmlDocument {0} nedefinuje explicitně konstruktor.
de: Die von XmlDocument abgeleitete Klasse "{0}" definiert explizit keinen Konstruktor.
es: La clase derivada de XmlDocument {0} no define explícitamente un constructor.
fr: La classe dérivée {0} de XmlDocument ne définit pas explicitement un constructeur.
it: La classe {0} derivata da XmlDocument non definisce un costruttore in modo esplicito.
ko: XmlDocument 파생 클래스 {0}이(가) 명시적으로 생성자를 정의하지 않습니다.
tr: XmlDocument’tan türetilen sınıf {0} bir oluşturucuyu açıkça tanımlamıyor.

# XmlDocumentDerivedClassSetInsecureXmlResolverInMethodMessage
source: Method {0} of XmlDocument derived class sets XmlResolver property to an insecure value.
cs: Metoda {0} odvozené třídy XmlDocument nastavuje vlastnost XmlResolver na nezabezpečenou hodnotu.
de: Die Methode "{0}" der von XmlDocument abgeleiteten Klasse legt die XmlResolver-Eigenschaft auf einen unsicheren Wert fest.
es: El método {0} de la clase derivada de XmlDocument establece una propiedad XmlResolver en un valor no seguro.
fr: La méthode {0} de la classe dérivée de XmlDocument affecte une valeur non sécurisée à la propriété XmlResolver.
it: Il metodo {0} della classe derivata da XmlDocument imposta la proprietà XmlResolver su un valore non sicuro.
ja: XmlDocument の派生クラスのメソッド {0} が、XmlResolver プロパティを安全でない値に設定しています。
ko: XmlDocument 파생 클래스의 {0} 메서드가 XmlResolver 속성을 안전하지 않은 값으로 설정합니다.
pl: Metoda {0} klasy pochodnej XmlDocument ustawia wartość XmlResolver na wartość niezabezpieczoną.
pt_br: O método {0} da classe derivada XmlDocument define a propriedade XmlResolver para um valor não seguro.
ru: Метод {0} производного класса XmlDocument задает для свойства XmlResolver небезопасное значение.
tr: XmlDocument’tan türetilen sınıfın {0} yöntemi, XmlResolver özelliğini güvenli olmayan bir değere ayarlıyor.
zh_hans: XmlDocument 派生类的方法 {0} 将 XmlResolver 属性设置为不安全的值。
zh_hant: XmlDocument 衍生類別的方法 {0}，會將 XmlResolver 屬性設為不安全的值。

# XmlTextReaderDerivedClassConstructorNoSecureSettingsMessage
source: Constructor of XmlTextReader derived class {0} uses insecure default values for DTD processing.
cs: Konstruktor odvozené třídy XmlTextReader {0} používá pro zpracování DTD nezabezpečené výchozí hodnoty.
de: Der Konstruktor der von XmlTextReader abgeleiteten Klasse "{0}" verwendet unsichere Standardwerte für die DTD-Verarbeitung.
es: El constructor de la clase derivada de XmlTextReader {0} usa valores predeterminados no seguros para el procesamiento de DTD.
fr: Le constructeur de la classe dérivée {0} de XmlTextReader utilise des valeurs par défaut non sécurisées pour le traitement DTD.
it: Il costruttore della classe {0} derivata da XmlTextReader usa valori predefiniti non sicuri per l'elaborazione DTD.
ja: XmlTextReader の派生クラス {0} のコンストラクターが、DTD 処理に安全でない既定値を使用しています。
ko: XmlTextReader 파생 클래스 {0}의 생성자가 DTD 처리의 안전하지 않은 기본값을 사용합니다.
pl: Konstruktor klasy pochodnej {0} elementu XmlTextReader używa niezabezpieczonej wartości domyślnej do przetwarzania elementu DTD.
pt_br: O construtor da classe derivada XmlTextReader {0} usa valores padrão não seguros para processamento DTD.
ru: Конструктор производного класса XmlTextReader {0} использует небезопасные значения по умолчанию для обработки DTD.
tr: XmlTextReader’dan türetilen sınıf {0} oluşturucusu DTD işleme için güvenli olmayan varsayılan değerleri kullanıyor.
zh_hans: XmlTextReader 派生类 {0} 的构造函数使用不安全的默认值进行 DTD 处理。
zh_hant: XmlTextReader 衍生類別 {0} 的建構函式，會使用 DTD 處理的不安全預設值。

# XmlTextReaderDerivedClassNoConstructorMessage
source: XmlTextReader derived class {0} doesn't explictily define a constructor.
cs: Odvozená třída XmlTextReader {0} nedefinuje explicitně konstruktor.
de: Die von XmlTextReader abgeleitete Klasse "{0}" definiert explizit keinen Konstruktor.
es: La clase derivada de XmlTextReader {0} no define explícitamente un constructor.
fr: La classe dérivée {0} de XmlTextReader ne définit pas explicitement un constructeur.
it: La classe {0} derivata da XmlTextReader non definisce un costruttore in modo esplicito.
ko: XmlTextReader 파생 클래스 {0}이(가) 명시적으로 생성자를 정의하지 않습니다.
tr: XmlTextReader’dan türetilen sınıf {0} bir oluşturucuyu açıkça tanımlamıyor.

# XmlTextReaderDerivedClassSetInsecureSettingsInMethodMessage
source: {0} method of XmlTextReader derived class sets XmlResolver and/or DtdProcessing property to insecure value.
cs: Metoda {0} odvozené třídy XmlTextReader nastavuje vlastnosti XmlResolver a/nebo DtdProcessing na nezabezpečenou hodnotu.
de: Die Methode "{0}" der von XmlTextReader abgeleiteten Klasse legt die XmlResolver- und/oder DtdProcessing-Eigenschaft auf einen unsicheren Wert fest.
es: El método {0} de la clase derivada de XmlTextReader establece la propiedad XmlResolver o DtdProcessing en un valor no seguro.
fr: La méthode {0} de la classe dérivée de XmlTextReader affecte une valeur non sécurisée à la propriété XmlResolver et/ou la propriété DtdProcessing.
it: Il metodo {0} della classe derivata da XmlTextReader imposta XmlResolver e/o la proprietà DtdProcessing su un valore non sicuro.
ja: XmlTextReader の派生クラスの {0} メソッドが、XmlResolver プロパティおよび DtdProcessing プロパティまたはそのいずれかを安全でない値に設定します。
ko: XmlTextReader 파생 클래스의 {0} 메서드가 XmlResolver 및/또는 DtdProcessing 속성을 안전하지 않은 값으로 설정합니다.
pl: Metoda {0} klasy pochodnej XmlTextReader ustawia właściwości XmlResolver i/lub DtdProcessing na niezabezpieczoną wartość.
pt_br: O método {0} da classe derivada XmlTextReader define a propriedade XmlResolver e/ou DtdProcessing como um valor não seguro.
ru: Метод {0} производного класса XmlTextReader задает для свойства XmlResolver и/или DtdProcessing небезопасное значение.
tr: XmlTextReader’dan türetilen sınıfın {0} yöntemi XmlResolver ve/veya DtdProcessing özelliğini güvenli olmayan bir değere ayarlıyor.
zh_hans: XmlTextReader 派生类的方法 {0} 将 XmlResolver 和/或 DtdProcessing 属性设置为不安全的值。
zh_hant: XmlTextReader 衍生類別的 {0} 方法，會將 XmlResolver 及 (或) DtdProcessing 屬性設為不安全的值。

# InsecureXsltScriptProcessingMessage
source: Insecure XSLT script processing.
cs: Nezabezpečené zpracování skriptu XSLT
de: Unsichere XSLT-Skriptverarbeitung.
es: Procesamiento no seguro de script de XSLT.
fr: Traitement de script XSLT non sécurisé.
it: Elaborazione dello script XSLT non sicura.
ja: XSLT スクリプト処理が安全ではありません。
ko: 안전하지 않은 XSLT 스크립트 처리입니다.
pl: Niezabezpieczone przetwarzanie skryptu XSLT.
pt_br: Processamento de script XSLT não seguro.
ru: Небезопасная обработка скрипта XSLT.
tr: Güvenli olmayan XSLT betik işlemesi.
zh_hans: 不安全的 XSLT 脚本处理。
zh_hant: 不安全的 XSLT 指令碼處理。

# DoNotUseInsecureXSLTScriptExecutionDescription
source: Providing an insecure XsltSettings instance and an insecure XmlResolver instance to XslCompiledTransform.Load method is potentially unsafe as it allows processing script within XSL, which on an untrusted XSL input may lead to malicious code execution. Either replace the insecure XsltSettings argument with XsltSettings.Default or an instance that has disabled document function and script execution, or replace the XmlResolver argurment with null or an XmlSecureResolver instance. This message may be suppressed if the input is known to be from a trusted source and external resource resolution from locations that are not known in advance must be supported.
cs: Poskytnutí nezabezpečených instancí XsltSettings a XmlResolver metodě XslCompiledTransform.Load je potenciálně nebezpečné, protože to umožňuje zpracovat skript v šabloně stylů XSL, který při zpracování nedůvěryhodného vstupu XSL může vést ke spuštění škodlivého kódu. Buď nahraďte nezabezpečený argument XsltSettings hodnotou XsltSettings.Default nebo instancí, která má zakázané funkce dokumentů a spouštění skriptů, nebo nahraďte argument XmlResolver hodnotou null nebo instancí XmlSecureResolver. Pokud víte, že vstup pochází z důvěryhodného zdroje, a musíte podporovat překlad externích prostředků z umístění, která předem neznáte, dá se tato zpráva potlačit.
de: Das Bereitstellen einer unsicheren XsltSettings-Instanz und einer unsicheren XmlResolver-Instanz für die Methode "XslCompiledTransform.Load" ist möglicherweise unsicher, weil dadurch die Verarbeitung von Skript innerhalb von XSL ermöglicht wird. Dies kann in einer nicht vertrauenswürdigen XSL-Eingabe zur Ausführung von Malware führen. Ersetzen Sie entweder das unsichere XsltSettings-Argument durch "XsltSettings.Default" oder eine Instanz, bei der die Ausführung von Dokumentfunktionen und Skripts deaktiviert wurde, oder ersetzen Sie das XmlResolver-Argument durch NULL oder eine XmlSecureResolver-Instanz. Diese Meldung kann unterdrückt werden, wenn die Eingabe bekanntermaßen von einer vertrauenswürdigen Quelle stammt und die Auflösung externer Ressourcen von Standorten, die nicht im Voraus bekannt sind, unterstützt werden muss.
es: Provisión de una instancia de XsltSettings no segura y una instancia de XmlResolver no segura a XslCompiledTransform. El método de carga es potencialmente no seguro porque permite el procesamiento del script en XSL, sobre el que una entrada de XSL que no sea de confianza podría conducir a la ejecución de código malintencionado. Reemplace el argumento XsltSettings no seguro por XsltSettings.Default o una instancia que tenga deshabilitada la función de documento y la ejecución de script, o reemplace el argumento XmlResolver por un valor nulo o una instancia de XmlSecureResolver. Este mensaje se puede eliminar si se sabe que la entrada procede de un origen de confianza y debe admitirse la resolución de recursos externos procedentes de ubicaciones que no se conocen previamente.
fr: La mise à disposition d'une instance non sécurisée de XsltSettings et d'une instance non sécurisée de XmlResolver pour la méthode XslCompiledTransform.Load représente un problème de sécurité potentiel, car cela permet de traiter un script XSL et peut entraîner l'exécution de code malveillant via une entrée XSL non approuvée. Remplacez l'argument non sécurisé de XsltSettings par XsltSettings.Default ou une instance ayant désactivé la fonction document et l'exécution de script, ou remplacez l'argument de XmlResolver par une valeur null ou une instance de XmlSecureResolver. Ce message peut être supprimé si l'entrée provient avec certitude d'une source approuvée, et si la résolution de ressources externes à partir d'emplacements non connus à l'avance est prise en charge.
it: L'uso di un'istanza non sicura di XsltSettings e di un'istanza non sicura di XmlResolver nel metodo XslCompiledTransform.Load è potenzialmente non sicura perché consente l'elaborazione di script in XSL, che in un input XSL non attendibile potrebbe causare l'esecuzione di codice dannoso. Sostituire l'argomento XsltSettings non sicuro con XsltSettings.Default oppure con un'istanza in cui la funzione di documentazione e l'esecuzione di script siano disabilitate oppure sostituire l'argomento XmlResolver con Null o con un'istanza di XmlSecureResolver. È possibile eliminare questo messaggio se si sa che l'input proviene da un'origine attendibile e deve essere supportata la risoluzione di risorse esterne da percorso non noti in anticipo.
ko: 안전하지 않은 XsltSettings 인스턴스와 XmlResolver 인스턴스를 XslCompiledTransform.Load 메서드에 제공하면 XSL 내에서 스크립트를 처리할 수 있게 되며 신뢰할 수 없는 XSL 입력에서 스크립트를 처리하면 악의적인 코드가 실행될 수 있으므로 잠재적으로 위험합니다. 안전하지 않은 XsltSettings 인수를 XsltSettings.Default 또는 문서 기능과 스크립트 실행을 사용할 수 없는 인스턴스로 바꾸거나, XmlResolver 인수를 null 또는 XmlSecureResolver 인스턴스로 바꾸세요. 신뢰할 수 있는 출처의 입력임이 알려지면 이 메시지가 표시되지 않을 수 있으며, 미리 알려지지 않은 위치의 외부 리소스 해결 방법이 지원되어야 합니다.
tr: XslCompiledTransform.Load yöntemine güvenli olmayan bir XsltSettings örneği ve güvenli olmayan bir XmlResolver örneğinin sağlanması, XSL içinde betik işlemeye ve güvenilmeyen bir XSL girişi üzerinde kötü amaçlı kod yürütmeye neden olabileceğinden potansiyel olarak güvenli değildir. Güvenli olmayan XsltSettings bağımsız değişkenini XsltSettings.Default ile veya belge işlevi ve betik yürütme devre dışı bırakılmış bir örnekle değiştirin ya da XmlResolver bağımsız değişkenini null veya bir XmlSecureResolver örneğiyle değiştirin. Giriş güvenilir olduğu bilinen bir kaynaktan geliyorsa ve önceden bilinmeyen konumlardan gelen dış kaynak çözümlemelerinin desteklenmesi gerekiyorsa bu ileti gizlenebilir.

# XslCompiledTransformLoadInsecureConstructedMessage
source: In {0} an insecure combination of XsltSettings and XmlResolver instances are provided to XslCompiledTransfor.Load as arguments.
cs: V argumentech metody XslCompiledTransfor.Load v {0} se předala nezabezpečená kombinace instancí XsltSettings a XmlResolver.
de: In "{0}" wird XslCompiledTransfor.Load eine unsichere Kombination aus XsltSettings- und XmlResolver-Instanzen als Argumente bereitgestellt.
es: En {0}, se proporciona una combinación no segura de instancias de XsltSettings y XmlResolver a XslCompiledTransfor.Load como argumento.
fr: Dans {0}, une combinaison non sécurisée d'instances de XsltSettings et de XmlResolver est fournie à XslCompiledTransfor.Load sous forme d'arguments.
it: In {0} viene fornita una combinazione non sicura di istanze di XsltSettings e XmlResolver come argomenti di XslCompiledTransfor.Load.
ja: {0} で、XsltSettings と XmlResolver インスタンスの安全でない組み合わせが XslCompiledTransfor.Load に引数として渡されています。
ko: {0}에서 XsltSettings와 XmlResolver 인스턴스의 안전하지 않은 조합이 XslCompiledTransfor.Load에 인수로 제공되었습니다.
pl: W metodzie {0} niezabezpieczona kombinacja wystąpień XsltSettings i XmlResolver jest dostarczana do metody XslCompiledTransfor.Load jako argumenty.
pt_br: No {0}, uma combinação não segura de instâncias XsltSettings e XmlResolver é fornecida a XslCompiledTransfor.Load como argumentos.
ru: В {0} небезопасные сочетания экземпляров XsltSettings и XmlResolver предоставляются для XslCompiledTransfor.Load в качестве аргументов.
tr: {0} içinde XsltSettings ve XmlResolver örneklerinin güvenli olmayan bir birleşimi XslCompiledTransfor.Load’a bağımsız değişken olarak sağlanır.
zh_hans: 在 {0} 中，将 XsltSettings 和 XmlResolver 实例的非安全组合提供给 XslCompiledTransfor.Load 作为参数。
zh_hant: 在 {0} 中，為 XslCompiledTransfor.Load 提供了不安全的 XsltSettings 與 XmlResolver 執行個體組合作為引數。
