Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetFramework.Analyzers/xlf/MicrosoftNetFrameworkAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TypesShouldNotExtendCertainBaseTypesTitle
source: Types should not extend certain base types
cs: Typy by neměly rozšiřovat určité základní typy
de: Typen dürfen bestimmte Basistypen nicht erweitern
es: Los tipos no deben extender ciertos tipos base
fr: Les types ne doivent pas étendre certains types de base
it: I tipi non devono estendere determinati tipi di base
ja: 型は、一定の基本型を拡張することはできません
ko: 형식은 특정 기본 형식을 확장할 수 없습니다.
pl: Typy nie powinny rozszerzać niektórych typów podstawowych
pt_br: Tipos não devem estender certos tipos base
ru: Типы не должны расширять определенные базовые типы
tr: Türler belirli temel türleri genişletmemelidir
zh_hans: 类型不应扩展某些基类型
zh_hant: 類型不應擴充特定的基底類型

# TypesShouldNotExtendCertainBaseTypesDescription
source: An externally visible type extends certain base types. Use one of the alternatives.
cs: Externě viditelný typ rozšiřuje určité základní typy. Použijte jednu z alternativ.
de: Ein extern sichtbarer Typ erweitert bestimmte Basistypen. Verwenden Sie eine der Alternativen.
es: Un tipo visible externamente extiende algunos tipos base. Use una de las alternativas.
fr: Un type visible de manière externe étend certains types de base. Utilisez l'une de ces solutions de remplacement.
it: Un tipo visibile esternamente estende determinati tipi di base. Usare una delle alternative.
ja: 外部から参照可能な型が、特定の基本型を拡張します。いずれかの代替策を使用してください。
ko: 외부에 표시되는 형식이 특정 기본 형식을 확장합니다. 대체 형식 중 하나를 사용하세요.
pl: Zewnętrznie widoczny typ rozszerza niektóre typy podstawowe. Użyj alternatywnego rozwiązania.
pt_br: Um tipo visível externamente estende determinados tipos base. Use uma das alternativas.
ru: Видимый снаружи тип расширяет определенные базовые типы. Используйте один из альтернативных вариантов.
tr: Dışarıdan görülebilir bir tür, belirli temel türleri genişletiyor. Alternatiflerden birini kullanın.
zh_hans: 对外部可见的类型扩展某些基类型。使用其他替代项。
zh_hant: 外部可見的類型，擴充了特定的基底類型。使用其中一個替代項。

# TypesShouldNotExtendCertainBaseTypesMessageSystemXmlXmlDocument
source: Change the base type of {0} so that it no longer extends {1}. The preferred design is to decouple the underlying XmlDocument representation from the type's interface by using containment instead of inheritance.
cs: Změňte základní typ {0} tak, aby už nerozšiřoval {1}. Při návrhu se dává přednost tomu, že se základní reprezentace XmlDocument oddělí od rozhraní typu pomocí zahrnutí místo dědičnosti.
de: Ändern Sie den Basistyp "{0}" so, dass "{1}" nicht mehr erweitert wird. Das bevorzugte Design sieht vor, die zugrunde liegende XmlDocument-Darstellung von der Schnittstelle des Typs durch Eigenständigkeit anstelle von Vererbung zu entkoppeln.
es: Cambie el tipo base de {0} de manera que deje de extender {1}. El diseño preferido es desasociar la representación de XmlDocument subyacente de la interfaz del tipo usando independencia en lugar de herencia.
fr: Changez le type de base de {0} pour qu'il n'étende plus {1}. Le design à privilégier consiste à découpler la représentation sous-jacente de XmlDocument de l'interface du type en utilisant l'autonomie à la place de l'héritage.
it: Modificare il tipo di base di {0} in modo che non estenda più {1}. La progettazione adatta consiste nel decuplicare la rappresentazione di XmlDocument sottostante dall'interfaccia del tipo usando l'indipendenza invece dell'ereditarietà.
ja: {0} が {1} をこれ以上拡張しないように、その基本型を変更します。推奨されるデザインは、継承ではなくコンテインメイトを使用して、基になる XmlDocument 表現を型のインターフェイスから切り離すことです。
ko: 더 이상 {1}을(를) 확장하지 않도록 {0}의 기본 형식을 변경하세요. 상속 대신 포함을 사용하여 형식의 인터페이스에서 내부 XmlDocument 표현을 분리하는 것이 좋습니다.
pl: Zmień typ podstawowy elementu {0} tak, aby nie rozszerzał już typu {1}. Preferowane podejście projektowe polega na odłączeniu bazowej reprezentacji XmlDocument od interfejsu typu przy użyciu zawierania zamiast dziedziczenia.
pt_br: Altere o tipo base de {0} para que ele não estenda mais {1}. O design preferencial é desacoplar a representação XmlDocument subjacente da interface do tipo usando contenção em vez de herança.
ru: Измените базовый тип {0}, чтобы он не расширял {1}. Предпочтительнее отделить используемое представление XmlDocument от интерфейса типа, используя вложение вместо наследования.
tr: {0} öğesinin temel türünü artık {1} öğesini genişletmeyecek şekilde değiştirin. Tercih edilen tasarım, arka plandaki XmlDocument gösterimini, devralma yerine bağımlılık kullanarak türün arabiriminden ayırmaktır.
zh_hans: 更改 {0} 的基类型，使其不再扩展 {1}。首选设计是使用包含而不是继承将基础 XmlDocument 表示形式与类型的接口分离。
zh_hant: 變更 {0} 的基底類型，讓其無法再擴充 {1}。慣用的設計為使用內含項目而非繼承，將基礎 XmlDocument 表示法與類型的介面脫勾。

# TypesShouldNotExtendCertainBaseTypesMessageSystemApplicationException
source: Change the base type of {0} so that it no longer extends {1}. This base exception type does not provide any additional value for framework classes. Extend 'System.Exception' or an existing unsealed exception type instead. Do not create a new exception base type unless there is specific value in enabling the creation of a catch handler for an entire class of exceptions.
cs: Změňte základní typ {0} tak, aby už nerozšiřoval {1}. Tento základní typ výjimky neposkytuje třídám architektury žádnou další hodnotu. Rozšiřte místo toho System.Exception nebo existující nezapečetěný typ výjimky. Nevytvářejte nový základní typ výjimky, pokud pro to, abyste umožnili vytváření zachytávacího bloku pro celou třídu výjimky, nemáte konkrétní důvod.
de: Ändern Sie den Basistyp "{0}" so, dass "{1}" nicht mehr erweitert wird. Dieser Basisausnahmetyp bietet keinen zusätzlichen Wert für Framework-Klassen. Erweitern Sie stattdessen "System.Exception" oder einen vorhandenen nicht versiegelten Ausnahmetyp. Erstellen Sie nur dann einen neuen Ausnahmebasistyp, wenn sich durch das Aktivieren der Erstellung eines catch-Handlers für eine ganze Klasse von Ausnahmen ein bestimmter Vorteil ergibt.
es: Cambie el tipo base de {0} de manera que deje de extender {1}. Este tipo de excepción base no proporciona ningún valor adicional para las clases de marco. Extienda "System.Exception" o un tipo de excepción no sellada existente en su lugar. No cree un nuevo tipo de base de excepción a menos que haya un valor específico al permitir la creación de un controlador de catch para una clase completa de excepciones.
fr: Changez le type de base de {0} pour qu'il n'étende plus {1}. Ce type d'exception de base ne fournit aucune valeur supplémentaire pour les classes de framework. Étendez 'System.Exception' ou un type d'exception unsealed existant, à la place. Ne créez pas de type de base d'exception à moins qu'il existe une valeur spécifique liée à la création d'un gestionnaire d'interceptions pour une classe entière d'exceptions.
it: Modificare il tipo di base di {0} in modo che non estenda più {1}. Questo tipo di eccezione di base non fornisce alcun valore aggiuntivo per le classi framework. Estendere invece 'System.Exception' o un tipo esistente di eccezione unsealed. Non creare un nuovo tipo di eccezione di base se non esiste un valore specifico che abiliti la creazione di un gestore catch per un'intera classe di eccezioni.
ja: {0} が {1} をこれ以上拡張しないように、その基本型を変更します。この基本例外型は、追加の値を Framework クラスに対して指定しません。代わりに、'System.Exception' または既存のアンシールド例外型を拡張してください。キャッチ ハンドラーの作成を例外のクラス全体に対して有効にする特定の値がない場合は、新しい例外基本型を作成しないでください。
ko: 더 이상 {1}을(를) 확장하지 않도록 {0}의 기본 형식을 변경하세요. 이 기본 예외 형식은 Framework 클래스에 대한 추가 값을 제공하지 않습니다. 'System.Exception'을 확장하거나 기존 unsealed 예외 형식을 대신 확장하세요. 전체 예외 클래스에 대해 catch 처리기를 만들 수 있는 특정 값이 없는 경우 새로운 예외 기본 형식을 만들지 마세요.
pl: Zmień typ podstawowy elementu {0} tak, aby nie rozszerzał już typu {1}. Ten podstawowy typ wyjątku nie zapewnia żadnych dodatkowych wartości dla klas struktury. Zamiast niego rozszerz typ System.Exception lub istniejący, niezapieczętowany typ wyjątku. Nie twórz nowego typu podstawowego wyjątku, o ile włączenie tworzenia procedury obsługi przechwytywania nie wnosi konkretnej wartości dla całej klasy wyjątków.
pt_br: Altere o tipo base de {0} para que ele não estenda mais {1}. Esse tipo de exceção base não fornece nenhum valor adicional para as classes de estrutura. Estenda 'System.Exception' ou um tipo de exceção não selada existente. Não crie um novo tipo base de exceção a menos que haja valor específico em se habilitar a criação de um manipulador catch para uma classe inteira de exceções.
ru: Измените базовый тип {0}, чтобы он не расширял {1}. Этот базовый тип исключения не предоставляет дополнительных преимуществ для структурных классов. Вместо этого расширьте "System.Exception" или существующий незапечатанный тип исключения. Не следует создавать новый базовый тип исключения, если не существует потребности разрешить создание обработчика catch для всего класса исключений.
tr: {0} öğesinin temel türünü artık {1} öğesini genişletmeyecek şekilde değiştirin. Bu temel özel durum türü, çerçeve sınıfları için ek bir değer sağlamıyor. Bunun yerine 'System.Exception' veya mevcut bir mühürsüz özel durum türünü genişletin. Özel durumlar topluluğunun tamamı için bir yakalama işleyici oluşturmayı olanaklı kılmanın özel bir değeri yoksa, yeni bir özel durum temel sınıfı oluşturmayın.
zh_hans: 更改 {0} 的基类型，使其不再扩展 {1}。此异常基类型不为框架类提供任何附加值。请改为扩展 "System.Exception" 或现有非密封异常类型。不要新建异常基类型，除非在创建整个异常类的 catch 处理程序时存在特定的值。
zh_hant: 變更 {0} 的基底類型，讓其無法再擴充 {1}。此基底例外狀況類型不會為架構類別提供任何額外的值。請改為擴充 'System.Exception' 或現有的非密封例外狀況類型。除非有特定的值能夠建立整個例外狀況類別的 catch 處理常式，否則，請勿建立新的例外狀況基底類型。

# TypesShouldNotExtendCertainBaseTypesMessageSystemCollectionsCollectionBase
source: Change the base type of {0} from {1} to its generic equivalent 'System.Collections.ObjectModel.Collection'.
cs: Změňte základní typ {0} z {1} na obecný ekvivalent System.Collections.ObjectModel.Collection.
de: Ändern Sie den Basistyp von "{0}" von "{1}" in das generische Äquivalent "System.Collections.ObjectModel.Collection".
es: Cambie el tipo base de {0} de {1} a su equivalente genérico "System.Collections.ObjectModel.Collection".
fr: Changez le type de base de {0} en remplaçant {1} par son équivalent générique 'System.Collections.ObjectModel.Collection'.
it: Modificare il tipo di base di {0} da {1} al rispettivo equivalente generico 'System.Collections.ObjectModel.Collection'.
ja: {0} の基本型を {1} から同等のジェネリック型 'System.Collections.ObjectModel.Collection' に変更します。
ko: {0}의 기본 형식을 {1}에서 해당 제네릭 형식인 'System.Collections.ObjectModel.Collection'으로 변경하세요.
pl: Zmień typ podstawowy elementu {0} z {1} na jego ogólny odpowiednik System.Collections.ObjectModel.Collection.
pt_br: Altere o tipo base de {0} de {1} para seu equivalente genérico 'System.Collections.ObjectModel.Collection'.
ru: Измените базовый тип {0} с {1} на его универсальный эквивалент "System.Collections.ObjectModel.Collection".
tr: {0} temel türünü {1} yerine, genel eş değeri olan 'System.Collections.ObjectModel.Collection' olarak değiştirin.
zh_hans: 将 {0} 的基类型从 {1} 更改为等效的泛型 "System.Collections.ObjectModel.Collection"。
zh_hant: 將 {0} 的基底類型從 {1} 變更為其泛型對應項 'System.Collections.ObjectModel.Collection'。

# TypesShouldNotExtendCertainBaseTypesMessageSystemCollectionsDictionaryBase
source: Change the base type of {0} from {1} to its generic equivalent 'System.Collections.ObjectModel.KeyedCollection'.
cs: Změňte základní typ {0} z {1} na obecný ekvivalent System.Collections.ObjectModel.KeyedCollection.
de: Ändern Sie den Basistyp von "{0}" von "{1}" in das generische Äquivalent "System.Collections.ObjectModel.KeyedCollection".
es: Cambie el tipo base de {0} de {1} a su equivalente genérico "System.Collections.ObjectModel.KeyedCollection".
fr: Changez le type de base de {0} en remplaçant {1} par son équivalent générique 'System.Collections.ObjectModel.KeyedCollection'.
it: Modificare il tipo di base di {0} da {1} al rispettivo equivalente generico 'System.Collections.ObjectModel.KeyedCollection'.
ja: {0} の基本型を {1} から同等のジェネリック型 'System.Collections.ObjectModel.KeyedCollection' に変更します。
ko: {0}의 기본 형식을 {1}에서 해당 제네릭 형식인 'System.Collections.ObjectModel.KeyedCollection'으로 변경하세요.
pl: Zmień typ podstawowy elementu {0} z {1} na jego ogólny odpowiednik System.Collections.ObjectModel.KeyedCollection.
pt_br: Altere o tipo base de {0} de {1} para seu equivalente genérico 'System.Collections.ObjectModel.KeyedCollection'.
ru: Измените базовый тип {0} с {1} на его универсальный эквивалент "System.Collections.ObjectModel.KeyedCollection".
tr: {0} temel türünü {1} yerine, genel eş değeri olan 'System.Collections.ObjectModel.KeyedCollection' olarak değiştirin.
zh_hans: 将 {0} 的基类型从 {1} 更改为等效的泛型 "System.Collections.ObjectModel.KeyedCollection"。
zh_hant: 將 {0} 的基底類型從 {1} 變更為其泛型對應項 'System.Collections.ObjectModel.KeyedCollection'。

# TypesShouldNotExtendCertainBaseTypesMessageSystemCollectionsQueue
source: Change the base type of {0} from {1} to its generic equivalent 'System.Collections.Generic.Queue'.
cs: Změňte základní typ {0} z {1} na obecný ekvivalent System.Collections.Generic.Queue.
de: Ändern Sie den Basistyp von "{0}" von "{1}" in das generische Äquivalent "System.Collections.Generic.Queue".
es: Cambie el tipo base de {0} de {1} a su equivalente genérico "System.Collections.Generic.Queue".
fr: Changez le type de base de {0} en remplaçant {1} par son équivalent générique 'System.Collections.Generic.Queue'.
it: Modificare il tipo di base di {0} da {1} al rispettivo equivalente generico 'System.Collections.Generic.Queue'.
ja: {0} の基本型を {1} から同等のジェネリック型 'System.Collections.Generic.Queue' に変更します。
ko: {0}의 기본 형식을 {1}에서 해당 제네릭 형식인 'System.Collections.Generic.Queue'로 변경하세요.
pl: Zmień typ podstawowy elementu {0} z {1} na jego ogólny odpowiednik System.Collections.Generic.Queue.
pt_br: Altere o tipo base de {0} de {1} para seu equivalente genérico 'System.Collections.Generic.Queue'.
ru: Измените базовый тип {0} с {1} на его универсальный эквивалент "System.Collections.Generic.Queue".
tr: {0} temel türünü {1} yerine, genel eş değeri olan 'System.Collections.Generic.Queue' olarak değiştirin.
zh_hans: 将 {0} 的基类型从 {1} 更改为等效的泛型 "System.Collections.Generic.Queue"。
zh_hant: 將 {0} 的基底類型從 {1} 變更為其泛型對應項 'System.Collections.Generic.Queue'。

source: Change the base type of {0} from {1} to its generic equivalent 'System.Collections.ObjectModel.ReadOnlyCollection'.
cs: Změňte základní typ {0} z {1} na obecný ekvivalent System.Collections.ObjectModel.ReadOnlyCollection.
de: Ändern Sie den Basistyp von "{0}" von "{1}" in das generische Äquivalent "System.Collections.ObjectModel.ReadOnlyCollection".
es: Cambie el tipo base de {0} de {1} a su equivalente genérico "System.Collections.ObjectModel.ReadOnlyCollection".
fr: Changez le type de base de {0} en remplaçant {1} par son équivalent générique 'System.Collections.ObjectModel.ReadOnlyCollection'.
it: Modificare il tipo di base di {0} da {1} al rispettivo equivalente generico 'System.Collections.ObjectModel.ReadOnlyCollection'.
ja: {0} の基本型を {1} から同等のジェネリック型 'System.Collections.ObjectModel.ReadOnlyCollection' に変更します。
ko: {0}의 기본 형식을 {1}에서 해당 제네릭 형식인 'System.Collections.ObjectModel.ReadOnlyCollection'으로 변경하세요.
pl: Zmień typ podstawowy elementu {0} z {1} na jego ogólny odpowiednik System.Collections.ObjectModel.ReadOnlyCollection.
pt_br: Altere o tipo base de {0} de {1} para seu equivalente genérico 'System.Collections.ObjectModel.ReadOnlyCollection'.
ru: Измените базовый тип {0} с {1} на его универсальный эквивалент "System.Collections.ObjectModel.ReadOnlyCollection".
tr: {0} temel türünü {1} yerine, genel eş değeri olan 'System.Collections.ObjectModel.ReadOnlyCollection' olarak değiştirin.
zh_hans: 将 {0} 的基类型从 {1} 更改为等效的泛型 "System.Collections.ObjectModel.ReadOnlyCollection"。
zh_hant: 將 {0} 的基底類型從 {1} 變更為其泛型對應項 'System.Collections.ObjectModel.ReadOnlyCollection'。

# TypesShouldNotExtendCertainBaseTypesMessageSystemCollectionsSortedList
source: Change the base type of {0} from {1} to its generic equivalent 'System.Collections.Generic.SortedList'.
cs: Změňte základní typ {0} z {1} na obecný ekvivalent System.Collections.Generic.SortedList.
de: Ändern Sie den Basistyp von "{0}" von "{1}" in das generische Äquivalent "System.Collections.Generic.SortedList".
es: Cambie el tipo base de {0} de {1} a su equivalente genérico "System.Collections.Generic.SortedList".
fr: Changez le type de base de {0} en remplaçant {1} par son équivalent générique 'System.Collections.Generic.SortedList'.
it: Modificare il tipo di base di {0} da {1} al rispettivo equivalente generico 'System.Collections.Generic.SortedList'.
ja: {0} の基本型を {1} から同等のジェネリック型 'System.Collections.Generic.SortedList' に変更します。
ko: {0}의 기본 형식을 {1}에서 해당 제네릭 형식인 'System.Collections.Generic.SortedList'로 변경하세요.
pl: Zmień typ podstawowy elementu {0} z {1} na jego ogólny odpowiednik System.Collections.Generic.SortedList.
pt_br: Altere o tipo base de {0} de {1} para seu equivalente genérico 'System.Collections.Generic.SortedList'.
ru: Измените базовый тип {0} с {1} на его универсальный эквивалент "System.Collections.Generic.SortedList".
tr: {0} temel türünü {1} yerine, genel eş değeri olan 'System.Collections.Generic.SortedList' olarak değiştirin.
zh_hans: 将 {0} 的基类型从 {1} 更改为等效的泛型 "System.Collections.Generic.SortedList"。
zh_hant: 將 {0} 的基底類型從 {1} 變更為其泛型對應項 'System.Collections.Generic.SortedList'。

# TypesShouldNotExtendCertainBaseTypesMessageSystemCollectionsStack
source: Change the base type of {0} from {1} to its generic equivalent 'System.Collections.Generic.Stack'.
cs: Změňte základní typ {0} z {1} na obecný ekvivalent System.Collections.Generic.Stack.
de: Ändern Sie den Basistyp von "{0}" von "{1}" in das generische Äquivalent "System.Collections.Generic.Stack".
es: Cambie el tipo base de {0} de {1} a su equivalente genérico "System.Collections.Generic.Stack".
fr: Changez le type de base de {0} en remplaçant {1} par son équivalent générique 'System.Collections.Generic.Stack'.
it: Modificare il tipo di base di {0} da {1} al rispettivo equivalente generico 'System.Collections.Generic.Stack'.
ja: {0} の基本型を {1} から同等のジェネリック型 'System.Collections.Generic.Stack' に変更します。
ko: {0}의 기본 형식을 {1}에서 해당 제네릭 형식인 'System.Collections.Generic.Stack'으로 변경하세요.
pl: Zmień typ podstawowy elementu {0} z {1} na jego ogólny odpowiednik System.Collections.Generic.Stack.
pt_br: Altere o tipo base de {0} de {1} para seu equivalente genérico 'System.Collections.Generic.Stack'.
ru: Измените базовый тип {0} с {1} на его универсальный эквивалент "System.Collections.Generic.Stack".
tr: {0} temel türünü {1} yerine, genel eş değeri olan 'System.Collections.Generic.Stack' olarak değiştirin.
zh_hans: 将 {0} 的基类型从 {1} 更改为等效的泛型 "System.Collections.Generic.Stack"。
zh_hant: 將 {0} 的基底類型從 {1} 變更為其泛型對應項 'System.Collections.Generic.Stack'。
