Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetFramework.Analyzers/xlf/MicrosoftNetFrameworkAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XslCompiledTransformLoadInsecureInputMessage
source: In {0} an insecure combination of XsltSettings and XmlResolver instances are provided to XslCompiledTransfor.Load as arguments.
cs: V argumentech metody XslCompiledTransfor.Load v {0} se předala nezabezpečená kombinace instancí XsltSettings a XmlResolver.
de: In "{0}" wird XslCompiledTransfor.Load eine unsichere Kombination aus XsltSettings- und XmlResolver-Instanzen als Argumente bereitgestellt.
es: En {0}, se proporciona una combinación no segura de instancias de XsltSettings y XmlResolver a XslCompiledTransfor.Load como argumento.
fr: Dans {0}, une combinaison non sécurisée d'instances de XsltSettings et de XmlResolver est fournie à XslCompiledTransfor.Load sous forme d'arguments.
it: In {0} viene fornita una combinazione non sicura di istanze di XsltSettings e XmlResolver come argomenti di XslCompiledTransfor.Load.
ja: {0} で、XsltSettings と XmlResolver インスタンスの安全でない組み合わせが XslCompiledTransfor.Load に引数として渡されています。
ko: {0}에서 XsltSettings와 XmlResolver 인스턴스의 안전하지 않은 조합이 XslCompiledTransfor.Load에 인수로 제공되었습니다.
pl: W metodzie {0} niezabezpieczona kombinacja wystąpień XsltSettings i XmlResolver jest dostarczana do metody XslCompiledTransfor.Load jako argumenty.
pt_br: No {0}, uma combinação não segura de instâncias XsltSettings e XmlResolver é fornecida a XslCompiledTransfor.Load como argumentos.
ru: В {0} небезопасные сочетания экземпляров XsltSettings и XmlResolver предоставляются для XslCompiledTransfor.Load в качестве аргументов.
tr: {0} içinde XsltSettings ve XmlResolver örneklerinin güvenli olmayan bir birleşimi XslCompiledTransfor.Load’a bağımsız değişken olarak sağlanır.
zh_hans: 在 {0} 中，将 XsltSettings 和 XmlResolver 实例的非安全组合提供给 XslCompiledTransfor.Load 作为参数。
zh_hant: 在 {0} 中，為 XslCompiledTransfor.Load 提供了不安全的 XsltSettings 與 XmlResolver 執行個體組合作為引數。

# MarkVerbHandlersWithValidateAntiforgeryTokenGetAndOtherAndTokenMessage
source: The ValidateAntiForgeryAttribute is defined with HttpVerbs.Get and at least one of HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete, or HttpVerbs.Patch on controller action {0}. The attribute will not be used when GET verb is used.
cs: Pro akci kontroleru {0} je definovaný ValidateAntiForgeryAttribute pro příkaz HttpVerbs.Get a nejméně jeden z těchto příkazů: HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete nebo HttpVerbs.Patch. Při použití příkazu GET se atribut nepoužije.
de: "ValidateAntiForgeryAttribute" wird mit "HttpVerbs.Get" und mindestens einem der folgenden Elemente für die Controlleraktion {0} definiert: HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete oder HttpVerbs.Patch. Das Attribut wird nicht verwendet, wenn ein GET-Verb verwendet wird.
es: El valor ValidateAntiForgeryAttribute se define con HttpVerbs.Get y al menos uno de HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete o HttpVerbs.Patch en la acción del controlador {0}. El atributo no se utilizará cuando se use el verbo GET.
fr: ValidateAntiForgeryAttribute est défini par HttpVerbs.Get et au moins un des éléments HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete ou HttpVerbs.Patch sur l'action de contrôleur {0}. L'attribut n'est pas utilisé quand le verbe GET est utilisé.
it: ValidateAntiForgeryAttribute è definito con HttpVerbs.Get e almeno uno tra HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete o HttpVerbs.Patch nell'azione {0} del controller. L'attributo non verrà usato se si usa il verbo GET.
ja: コントローラー アクション {0} で ValidateAntiForgeryAttribute が HttpVerbs.Get と、HttpVerbs.Post、HttpVerbs.Put、HttpVerbs.Delete、HttpVerbs.Patch の少なくとも 1 つと共に定義されています。この属性は、GET 動詞が使用されている場合は使用されません。
ko: ValidateAntiForgeryAttribute가 HttpVerbs.Get으로 정의되었고 하나 이상의 HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete 또는 HttpVerbs.Patch가 컨트롤러 작업 {0}에 있습니다. 이 특성은 GET 동사를 사용하는 경우 사용되지 않습니다.
pl: Atrybut ValidateAntiForgeryAttribute jest zdefiniowany dla czasownika HttpVerbs.Get i co najmniej jednego z czasowników HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete lub HttpVerbs.Patch w akcji kontrolera {0}. Atrybut nie będzie używany w przypadku użycia czasownika GET.
pt_br: O ValidateAntiForgeryAttribute é definido com HttpVerbs.Get e pelo menos um dos HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete ou HttpVerbs.Patch na ação do controlador {0}. O atributo não será usado quando o verbo GET for usado.
ru: Атрибут ValidateAntiForgeryAttribute определен с HttpVerbs.Get и как минимум с одним из атрибутов HttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete или HttpVerbs.Patch в действии контроллера {0}. Атрибут не будет использоваться, если используется GET.
tr: {0} denetleyici eyleminde ValidateAntiForgeryAttribute, HttpVerbs.Get'in yanı sıraHttpVerbs.Post, HttpVerbs.Put, HttpVerbs.Delete veya HttpVerbs.Patch'ten en az biriyle tanımlanmış. GET fiili kullanılırken öznitelik kullanılmayacak.
zh_hans: ValidateAntiForgeryAttribute 是使用 HttpVerbs.Get 以及控制器操作 {0} 中的 HttpVerbs.Post、HttpVerbs.Put、HttpVerbs.Delete 或 HttpVerbs.Patch (至少其中之一)进行定义的。使用 GET 谓词时将不使用该属性。
zh_hant: ValidateAntiForgeryAttribute 在控制器動作 {0} 上會使用 HttpVerbs.Get，以及至少一個 HttpVerbs.Post、HttpVerbs.Put、HttpVerbs.Delete 或 HttpVerbs.Patch 來定義。當使用 GET 動詞時，不會使用該屬性。

# MarkVerbHandlersWithValidateAntiforgeryTokenGetAndTokenMessage
source: Using HttpVerbs.GET and ValidateAntiForgeryTokenAttribute is not supported by MVC on controller action {0}.
cs: MVC nepodporuje použití HttpVerbs.GET a ValidateAntiForgeryTokenAttribute pro akci kontroleru {0}.
it: MVC non supporta l'uso di HttpVerbs.GET e ValidateAntiForgeryTokenAttribute sull'azione {0} del controller.
tr: {0} denetieyici eyleminde HttpVerbs.GET ve ValidateAntiForgeryTokenAttribute kullanılması MVC tarafından desteklenmez.

# MarkVerbHandlersWithValidateAntiforgeryTokenNoVerbsMessage
source: HTTP verb attributes attributes are missing on controller action {0}. The ValidateAntiForgeryTokenAttribute will not be used when GET verb is used.
cs: Chybí atributy příkazu HTTP pro akci kontroleru {0}. Při použití příkazu GET se nepoužije ValidateAntiForgeryTokenAttribute.
de: Für die Controlleraktion {0} fehlen HTTP-Verbattribute. Das ValidateAntiForgeryTokenAttribute wird nicht verwendet, wenn das GET-Verb verwendet wird.
es: Los atributos de verbo HTTP faltan en la acción del controlador {0}. El valor ValidateAntiForgeryTokenAttribute no se utilizará cuando se utilice el verbo GET.
fr: Des attributs d'attributs de verbe HTTP sont manquants sur l'action de contrôleur {0}. ValidateAntiForgeryTokenAttribute n'est pas utilisé quand le verbe GET est utilisé.
it: Nell'azione {0} del controller mancano gli attributi del verbo HTTP. Se si usa il verbo GET, ValidateAntiForgeryTokenAttribute non verrà usato.
ja: HTTP 動詞属性がコントローラー アクション {0} で欠落しています。GET 動詞を使用する場合、ValidateAntiForgeryTokenAttribute は使用されません。
ko: 컨트롤러 동작 {0}에 HTTP 동사 특성이 없습니다. GET 동사를 사용할 때 ValidateAntiForgeryTokenAttribute가 사용되지 않습니다.
pl: Brak atrybutów czasowników HTTP w akcji kontrolera {0}. Atrybut ValidateAntiForgeryTokenAttribute nie będzie używany w przypadku użycia czasownika GET.
pt_br: Os atributos de atributos de verbo HTTP estão ausentes na ação do controlador {0}. O ValidateAntiForgeryTokenAttribute não será usado quando o verbo GET for usado.
ru: Атрибуты команды HTTP отсутствуют в действии контроллера {0}. Атрибут ValidateAntiForgeryTokenAttribute не будет использоваться, если используется команда GET.
tr: {0} denetleyici eyleminde HTTP fiili öznitelikleri eksik. GET fiili kullanılırken ValidateAntiForgeryTokenAttribute kullanılmayacak.
zh_hans: 控制器操作 {0} 上缺少 HTTP 谓词属性。使用 GET 谓词时将不使用 ValidateAntiForgeryTokenAttribute。
zh_hant: 控制器動作 {0} 上缺少 HTTP 動詞屬性。當使用 GET 動詞時，不會使用 ValidateAntiForgeryTokenAttribute。

# MarkVerbHandlersWithValidateAntiforgeryTokenNoVerbsNoTokenMessage
source: Missing ValidateAntiForgeryTokenAttribute on MVC controller action {0} which by default accepts POST requests.
cs: Chybí ValidateAntiForgeryTokenAttribute pro akci kontroleru MVC {0}, která ve výchozím nastavení přijímá požadavky POST.
it: Nell'azione {0} del controller MVC, che per impostazione predefinita accetta richieste POST, manca l'elemento ValidateAntiForgeryTokenAttribute.
tr: POST isteklerini varsayılan olarak kabul eden {0} adlı MVC denetleyici eyleminde ValidateAntiForgeryTokenAttribute eksik.

# MarkVerbHandlersWithValidateAntiforgeryTokenTitle
source: Mark Verb Handlers With Validate Antiforgery Token
cs: Označit obslužné rutiny příkazu ověřovacím tokenem proti padělkům
de: Kennzeichnen Sie Verbhandler mit einem ValidateAntiForgeryToken-Attribut
es: Marcar los controladores de verbos con validación de token antifalsificación
fr: Marquer les gestionnaires de verbes avec le jeton de validation antifalsification
it: Contrassegna gestori di verbi con token antifalsificazione di convalida
ja: 偽造防止トークンの検証での動詞ハンドラーのマーク
ko: 위조 방지 유효성 검사 토큰을 사용하여 동사 처리기 표시
pl: Oznacz procedury obsługi czasownika za pomocą tokenu walidacji przeciwdziałania fałszerstwom
pt_br: Marcar Manipuladores de Verbos com Token Antiforgery de Validação
ru: Пометьте обработчики команд маркером проверки на подлинность
tr: Fiil İşleyicilerini ValidateAntiforgeryToken ile İşaretleyin
zh_hans: 具有验证防伪标记的标记谓词处理程序
zh_hant: 使用驗證 Antiforgery 權杖標記動詞命令處理常式

# MarkVerbHandlersWithValidateAntiforgeryTokenVerbsAndNoTokenMessage
source: Missing ValidateAntiForgeryTokenAttribute on controller action {0}.
cs: Chybí ValidateAntiForgeryTokenAttribute pro akci kontroleru {0}.
it: ValidateAntiForgeryTokenAttribute mancante nell'azione del controller {0}.
tr: {0} denetleyici eyleminde ValidateAntiForgeryTokenAttribute eksik.

# DoNotCatchCorruptedStateExceptionsDescription
source: Catching corrupted state exceptions could mask errors (such as access violations), resulting in inconsistent state of execution or making it easier for attackers to compromise system. Instead, catch and handle a more specific set of exception type(s) or re-throw the exception.
de: Durch das Abfangen von Corrupted State Exceptions können Fehler (beispielsweise Zugriffsverletzungen) verdeckt werden. Dadurch wird möglicherweise ein inkonsistenter Ausführungsstatus verursacht oder das Kompromittieren des Systems für Angreifer vereinfacht. Fangen Sie stattdessen eine spezifischere Menge von Ausnahmetypen ab, und verarbeiten Sie sie, oder lösen Sie die Ausnahme erneut aus.
es: La toma de excepciones de estado dañado podría enmascarar errores (como las infracciones de acceso), lo que podría originar un estado incoherente de ejecución o que los atacantes tuvieran más fácil poner el sistema en peligro. Lo que debe hacer es tomar y controlar un conjunto más específico de tipos de excepción o iniciar de nuevo la excepción.
fr: L'interception des exceptions état altéré peut masquer les erreurs (par exemple les violations d'accès) et entraîner un état incohérent de l'exécution ou faciliter la tâche des attaquants qui tentent de compromettre un système. À la place, interceptez et prenez en charge un ensemble plus spécifique de types d'exception, ou levez à nouveau l'exception.
ja: 破損状態例外をキャッチすると、エラー (アクセス違反など) がマスクされ、実行の状態に一貫性がなくなったり、攻撃者がシステムを侵害しやすくなったりする可能性があります。代わりに、より具体的な一連の例外の種類をキャッチして処理するか、例外を再スローします。
ko: 손상된 상태 예외를 catch하면 오류(예: 액세스 위반)가 숨겨질 수 있으며 이로 인해 실행 상태가 일관되지 않거나 공격자가 더 쉽게 시스템을 손상할 수 있습니다. 대신 더 구체적인 예외 형식 집합을 catch하고 처리하거나 예외를 다시 throw하세요.
pl: Przechwytywanie wyjątków stanu uszkodzenia może zamaskować błędy (takie jak naruszenie dostępu), czego wynikiem może być niespójny stan wykonywania lub ułatwienie atakującym narażenia systemu na niebezpieczeństwo. Zamiast tego przechwytuj i obsługuj bardziej konkretny zestaw typów wyjątków lub ponownie zgłoś wyjątek.
pt_br: A captura de exceções de estado corrompido poderia mascarar erros (como violações de acesso), resultando em um estado de execução inconsistente ou tornando fácil para invasores comprometerem o sistema. Em vez disso, capture e manipule um conjunto mais específico de tipos de exceção ou gere novamente a exceção.
ru: Перехват исключений поврежденного состояния может скрывать ошибки (такие как нарушение прав доступа), что приведет к несогласованному состоянию выполнения или упростит злоумышленникам задачу по компрометации системы. Вместо этого перехватывайте и обрабатывайте более конкретные типы исключений, после чего порождайте исключение повторно.
zh_hans: 捕获损坏状态异常可能会掩盖错误(例如访问冲突)，从而导致执行状态不一致或使攻击者更轻易地危害系统安全。相反，请捕获并处理一组更具体的异常类型或重新引发异常。
zh_hant: 擷取損毀狀態例外狀況有可能會遮罩錯誤 (例如存取違規)，而造成例外狀況的狀態不一致，或是利於攻擊者危害系統。請改為擷取並處理更精確的例外狀況型別集，或是重新擲回例外狀況。

# DoNotCatchCorruptedStateExceptionsMessage
source: {0} is catching corrupted state exception
de: "{0}" fängt eine Corrupted State Exception ab.
es: {0} está tomando una excepción de estado dañado.
fr: {0} intercepte l'exception état altéré
ja: {0} が破損状態例外をキャッチしています
ko: {0}이(가) 손상된 상태 예외를 catch하고 있습니다.
pl: Element {0} przechwytuje wyjątek stanu uszkodzenia
pt_br: {0} está capturando uma exceção de estado corrompido
ru: {0} перехватывает исключение поврежденного состояния.
zh_hans: {0} 正在捕获损坏状态异常
zh_hant: {0} 正在擷取損毀狀態例外狀況

# MarkVerbHandlersWithValidateAntiforgeryTokenGetAndTokenMessage
source: Using HttpVerbs.GET and ValidateAntiForgeryTokenAttribute is not supported by MVC on controller action {0}
de: Die Verwendung von "HttpVerbs.GET" und "ValidateAntiForgeryTokenAttribute" wird von MVC bei der Controlleraktion "{0}" nicht unterstützt.
es: El uso de HttpVerbs.GET y ValidateAntiForgeryTokenAttribute no es compatible con MVC en la acción del controlador {0}.
fr: L'utilisation de HttpVerbs.GET et ValidateAntiForgeryTokenAttribute n'est pas prise en charge par MVC sur l'action de contrôleur {0}
ja: コントローラー アクション {0} では MVC による HttpVerbs.GET と ValidateAntiForgeryTokenAttribute の使用はサポートされていません
ko: 컨트롤러 작업 {0}의 MVC에서는 HttpVerbs.GET 및 ValidateAntiForgeryTokenAttribute를 사용할 수 없습니다.
pl: Używanie czasownika HttpVerbs.GET i atrybutu ValidateAntiForgeryTokenAttribute nie jest obsługiwane przez wzorzec MVC w akcji kontrolera {0}
pt_br: Não há suporte do MVC para o uso de HttpVerbs.GET e ValidateAntiForgeryTokenAttribute na ação do controlador {0}
ru: Использование HttpVerbs.GET и ValidateAntiForgeryTokenAttribute не поддерживается MVC в действии контроллера {0}.
zh_hans: 在控制器操作 {0} 上, MVC 不支持使用 HttpVerbs.GET 和 ValidateAntiForgeryTokenAttribute
zh_hant: 控制器動作 {0} 上的 MVC 不支援使用 HttpVerbs.GET 和 ValidateAntiForgeryTokenAttribute

# MarkVerbHandlersWithValidateAntiforgeryTokenNoVerbsNoTokenMessage
source: Missing ValidateAntiForgeryTokenAttribute on MVC controller action {0} which by default accepts POST requests
de: Für die MVC-Controlleraktion "{0}", die standardmäßig POST-Anforderungen akzeptiert, fehlt "ValidateAntiForgeryTokenAttribute".
es: Falta ValidateAntiForgeryTokenAttribute en la acción {0} del controlador de MVC, que de manera predeterminada acepta solicitudes POST.
fr: ValidateAntiForgeryTokenAttribute est manquant sur l'action de contrôleur MVC {0} qui accepte par défaut les demandes POST
ja: 既定で POST 要求を受け入れる ValidateAntiForgeryTokenAttribute が MVC コントローラー アクション {0} にありません
ko: 기본적으로 POST 요청을 승인하는 MVC 컨트롤러 작업 {0}에 ValidateAntiForgeryTokenAttribute가 없습니다.
pl: Brak atrybutu ValidateAntiForgeryTokenAttribute w akcji kontrolera MVC {0}, która domyślnie akceptuje żądania POST
pt_br: ValidateAntiForgeryTokenAttribute ausente da ação do controlador MVC {0} que por padrão aceita solicitações POST
ru: Отсутствует атрибут ValidateAntiForgeryTokenAttribute в действии контроллера MVC {0}, который по умолчанию обрабатывает запросы POST.
zh_hans: MVC 控制器操作 {0} 上缺少默认接受 POST 请求的 ValidateAntiForgeryTokenAttribute
zh_hant: MVC 控制器動作 {0} 上缺少 ValidateAntiForgeryTokenAttribute，該動作根據預設接受 POST 要求

# MarkVerbHandlersWithValidateAntiforgeryTokenVerbsAndNoTokenMessage
source: Missing ValidateAntiForgeryTokenAttribute on controller action {0}
de: Für die Controlleraktion "{0}" fehlt "ValidateAntiForgeryTokenAttribute".
es: Falta ValidateAntiForgeryTokenAttribute en la acción del controlador {0}.
fr: ValidateAntiForgeryTokenAttribute manquant sur l'action de contrôleur {0}
ja: コントローラー アクション {0} に ValidateAntiForgeryTokenAttribute がありません
ko: 컨트롤러 작업 {0}에 ValidateAntiForgeryTokenAttribute가 없습니다.
pl: Brak atrybutu ValidateAntiForgeryTokenAttribute w akcji kontrolera {0}
pt_br: ValidateAntiForgeryTokenAttribute ausente na ação do controlador {0}
ru: Отсутствует атрибут ValidateAntiForgeryTokenAttribute в действии контроллера {0}.
zh_hans: 控制器操作 {0} 上缺少 ValidateAntiForgeryTokenAttribute
zh_hant: 控制器動作 {0} 上缺少 ValidateAntiForgeryTokenAttribute

# XmlDocumentDerivedClassNoConstructorMessage
source: XmlDocument derived class {0} doesn't explicitly define a constructor.
ja: XmlDocument の派生クラス {0} が、コンストラクターを明示的に定義していません。
pl: Klasa pochodna {0} elementu XmlDocument nie określa jawnie konstruktora.
pt_br: A classe derivada XmlDocument {0} não define explicitamente um construtor.
ru: Производный класс XmlDocument {0} не определяет конструктор явным образом.
zh_hans: XmlDocument 派生类 {0} 没有显式定义构造函数。
zh_hant: XmlDocument 衍生類別 {0} 並未明確地定義建構函式。

# XmlTextReaderDerivedClassNoConstructorMessage
source: XmlTextReader derived class {0} doesn't explicitly define a constructor.
ja: XmlTextReader の派生クラス {0} が、コンストラクターを明示的に定義していません。
pl: Klasa pochodna {0} elementu XmlTextReader nie określa jawnie konstruktora.
pt_br: A classe derivada XmlTextReader {0} não define explicitamente um construtor.
ru: Производный класс XmlTextReader {0} не определяет конструктор явным образом.
zh_hans: XmlTextReader 派生类 {0} 没有显式定义构造函数。
zh_hant: XmlTextReader 衍生類別 {0} 並未明確地定義建構函式。

# DoNotUseInsecureXSLTScriptExecutionDescription
source: Providing an insecure XsltSettings instance and an insecure XmlResolver instance to XslCompiledTransform.Load method is potentially unsafe as it allows processing script within XSL, which on an untrusted XSL input may lead to malicious code execution. Either replace the insecure XsltSettings argument with XsltSettings.Default or an instance that has disabled document function and script execution, or replace the XmlResolver argument with null or an XmlSecureResolver instance. This message may be suppressed if the input is known to be from a trusted source and external resource resolution from locations that are not known in advance must be supported.
ja: セキュリティで保護されていない XsltSettings インスタンスとセキュリティで保護されていない XmlResolver インスタンスを XslCompiledTransform.Load メソッドに指定すると、XSL 内でのスクリプトの処理が許可されるため、安全でない可能性があります。信頼できない XSL 入力では、悪意のあるコードが実行される場合があります。セキュリティで保護されていない XsltSettings 引数を XsltSettings.Default、または document 関数とスクリプトの実行が無効になっているインスタンスに置き換えるか、XmlResolver 引数を null または XmlSecureResolver インスタンスに置き換えます。このメッセージは、信頼できるソースからの入力であることがわかっていて、事前にはわからない場所からの外部リソース解決が必ずサポートされている場合には表示されないことがあります。
pl: Dostarczanie niezabezpieczonego wystąpienia XsltSettings i niezabezpieczonego wystąpienia XmlResolver do metody XslCompiledTransform.Load jest potencjalnie niebezpieczne, ponieważ umożliwia przetwarzanie skryptu w elemencie XSL, co w przypadku niezaufanych danych wejściowych XSL może prowadzić do uruchomienia złośliwego kodu. Zastąp niezabezpieczony argument XsltSettings elementem XsltSettings.Default lub wystąpieniem, które wyłączyło funkcję dokumentu i wykonywanie skryptu, albo zastąp argument XmlResolver wartością null lub wystąpieniem elementu XmlSecureResolver. Ten komunikat może zostać pominięty, jeśli wiadomo, że dane wejściowe pochodzą z zaufanego źródła, i jest wymagana obsługa rozpoznawania zasobów zewnętrznych pochodzących z lokalizacji, które nie są wcześniej znane.
pt_br: Fornecer uma instância de XsltSettings não segura e uma instância XmlResolver não segura ao método XslCompiledTransform.Load é potencialmente não seguro, pois permite o processamento de um script dentro do XSL, o que em uma entrada XSL não confiável pode levar à execução de código mal-intencionado. Substitua o argumento XsltSettings não seguro por XsltSettings.Default ou uma instância que desabilitou a função de documento e a execução de script ou substitua o argumento XmlResolver por null ou por uma instância de XmlSecureResolver. Essa mensagem poderá ser suprimida se a entrada for conhecida como sendo de uma fonte confiável e deverá haver suporte à resolução de recurso externo de locais que não são conhecidos com antecedência.
ru: Предоставлять небезопасные экземпляры XsltSettings и XmlResolver методу XslCompiledTransform.Load рискованно, так как позволяет обработать скрипт в XSL, что при ненадежных входных данных может запустить вредоносный код. Замените небезопасный аргумент XsltSettings на XsltSettings.Default или экземпляр, в котором отключены функции документирования и выполнения скриптов, либо замените аргумент XmlResolver на Null или экземпляр XmlSecureResolver. Это сообщение можно скрыть, если известно, что входные данные получены из надежного источника, при этом должно поддерживаться разрешение внешних ресурсов из неизвестных заранее расположений.
zh_hans: 向 XslCompiledTransform.Load 方法提供不安全的 XsltSettings 实例和 XmlResolver 实例可能存在危害，因为它允许在 XSL 内处理脚本，这可能导致在不受信任的 XSL 输入上执行恶意代码。请将不安全的 XsltSettings 参数替换为 XsltSettings.Default 或已禁用文档函数和脚本执行的实例，或者将 XmlResolver 参数替换为 null 或 XmlSecureResolver 实例。如果已知该输入来自可靠来源，且必须支持来自事先未知位置的外部资源解析，则可能会禁止该消息。
zh_hant: 將不安全的 XsltSettings 執行個體以及不安全的 XmlResolver 執行個體提供給 XslCompiledTransform.Load 方法，可能不安全。因為其會允許在 XSL 內處理指令碼，而若在不受信任的 XSL 輸入上進行，可能會導致惡意程式碼的執行。請以 XsltSettings.Default 或已停用文件功能和指令碼執行的執行個體，取代不安全的 XsltSettings 引數，或是以 Null 或 XmlSecureResolver 執行個體取代 XmlResolver 引數。如果已知輸入來自受信任的來源，可能不會出現此訊息，且必須支援來自事先未知位置的外部資源解析。
