Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetFramework.Analyzers/xlf/MicrosoftNetFrameworkAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CallBaseClassMethodsOnISerializableTypesTitle
source: Call base class methods on ISerializable types
cs: Zavolejte metody základních tříd pro typy ISerializable
de: Basisklassenmethoden bei ISerializable-Typen aufrufen
es: Llamar a métodos de clase base en tipos ISerializable
fr: Appeler les méthodes de classe de base sur les types ISerializable
it: Chiamare metodi della classe di base su tipi ISerializable
ja: ISerializable 型で基底クラス メソッドを呼び出します
ko: ISerializable 형식에서 기본 클래스 메서드를 호출하세요.
pl: Wywołuj metody klasy podstawowej dla typów ISerializable
pt_br: Chamar métodos da classe base em tipos ISerializable
ru: Вызывайте методы базового класса для типов ISerializable
tr: ISerializable türleri üzerinde temel sınıf yöntemlerini çağırın
zh_hans: 对 ISerializable 类型调用基类方法
zh_hant: 呼叫 ISerializable 類型上的基底類別方法

# CallBaseClassMethodsOnISerializableTypesDescription
source: To fix a violation of this rule, call the base type GetObjectData method or serialization constructor from the corresponding derived type method or constructor.
cs: Pokud chcete napravit porušení tohoto pravidla, zavolejte metodu GetObjectData základního typu nebo serializační konstruktor z metody odpovídajícího odvozeného typu nebo konstruktoru.
de: Um einen Verstoß gegen diese Regel zu korrigieren, rufen Sie die GetObjectData-Methode oder den Serialisierungskonstruktor des Basistyps aus der entsprechenden abgeleiteten Typenmethode oder dem entsprechenden Konstruktor auf.
es: Para corregir una infracción de esta regla, llame al método del tipo base GetObjectData o al constructor de serialización desde el constructor o el método del tipo derivado correspondiente.
fr: Pour corriger une violation de cette règle, appelez la méthode GetObjectData ou le constructeur de sérialisation du type de base à partir du constructeur ou de la méthode du type dérivé correspondant.
it: Per correggere una violazione di questa regola, chiamare il costruttore di serializzazione o il metodo GetObjectData del tipo di base dal costruttore o dal metodo del tipo derivato corrispondente.
ja: この規則の違反を修正するには、対応する派生型のメソッドまたはコンストラクターから基本型の GetObjectData メソッドまたはシリアル化コンストラクターを呼び出します。
ko: 이 규칙 위반 문제를 해결하려면 해당 파생 형식 메서드 또는 생성자에서 기본 형식 GetObjectData 메서드 또는 serialization 생성자를 호출하세요.
pl: Aby naprawić naruszenie tej reguły, wywołaj podstawowy typ metody GetObjectData lub konstruktor serializacji z odpowiedniej metody albo konstruktora typu pochodnego.
pt_br: Para corrigir uma violação dessa regra, chame o método GetObjectData do tipo base ou o construtor de serialização do construtor ou método de tipo derivado correspondente.
ru: Чтобы устранить нарушение этого правила, вызовите метод GetObjectData базового типа или конструктор сериализации из соответствующего конструктора или метода производного типа.
tr: Bu kurala yönelik bir ihlali düzeltmek için, karşılık gelen türetilmiş tür yöntemi veya oluşturucusundan GetObjectData yöntemi veya seri duruma getirme oluşturucusu temel türünü çağırın.
zh_hans: 要解决与该规则的冲突，请从相应的派生类型方法或构造函数调用基类型 GetObjectData 方法或序列化构造函数。
zh_hant: 若要修正此規則的違規，請從相對應的衍生類型方法或建構函式，呼叫基底類型 GetObjectData 方法或序列化建構函式。

# CallBaseClassMethodsOnISerializableTypesMessage
source: Call base class methods on ISerializable types
cs: Zavolejte metody základních tříd pro typy ISerializable
de: Basisklassenmethoden bei ISerializable-Typen aufrufen
es: Llamar a métodos de clase base en tipos ISerializable
fr: Appeler les méthodes de classe de base sur les types ISerializable
it: Chiamare metodi della classe di base su tipi ISerializable
ja: ISerializable 型で基底クラス メソッドを呼び出します
ko: ISerializable 형식에서 기본 클래스 메서드를 호출하세요.
pl: Wywołuj metody klasy podstawowej dla typów ISerializable
pt_br: Chamar métodos da classe base em tipos ISerializable
ru: Вызывайте методы базового класса для типов ISerializable
tr: ISerializable türleri üzerinde temel sınıf yöntemlerini çağırın
zh_hans: 对 ISerializable 类型调用基类方法
zh_hant: 呼叫 ISerializable 類型上的基底類別方法

# UseXmlReaderForDataSetReadXmlTitle
source: Use XmlReader for DataSet ReadXml
cs: Pro DataSet ReadXml použijte XmlReader
de: XmlReader für DataSet ReadXml verwenden
es: Usar XmlReader para DataSet ReadXml
fr: Utiliser XmlReader pour le ReadXml de DataSet
it: Usare XmlReader per ReadXml di DataSet
ja: DataSet ReadXml に XmlReader を使用します
ko: DataSet ReadXml에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataSet ReadXml
pt_br: Usar XmlReader para DataSet ReadXml
ru: Используйте XmlReader для DataSet ReadXml
tr: DataSet ReadXml için XmlReader kullanın
zh_hans: 使用 DataSet ReadXml 的 XmlReader
zh_hant: 為 DataSet ReadXml 使用 XmlReader

# UseXmlReaderForDataSetReadXmlDescription
source: Do not use unsafe overloads of System.Data.DataSet.ReadXml. This API internally enables DTD processing on the XML reader instance used, and uses UrlResolver for resolving external XML entities. The outcome is information disclosure. Content from file system or network shares for the machine processing the XML can be exposed to attacker. In addition, an attacker can use this as a DoS vector.
cs: Nepoužívejte nebezpečná přetížení metody System.Data.DataSet.ReadXml. Toto rozhraní API umožňuje zpracovávat DTD v instanci používané čtečky XML a pomocí UrlResolveru překládá externí entity XML. Výsledkem je odhalení informací. Obsah systému souborů nebo sdílených síťových složek počítače, který zpracovává kód XML, může zjistit útočník. Kromě toho může toto útočník využít jako místo pro útok DoS.
de: Verwenden Sie keine unsicheren Überladungen von "System.Data.DataSet.ReadXml". Diese API aktiviert intern die DTD-Verarbeitung für die verwendete XML-Readerinstanz und verwendet den UrlResolver zum Auflösen externer XML-Entitäten. Das Ergebnis ist die Veröffentlichung von Informationen. Inhalte aus dem Dateisystem oder aus Netzwerkfreigaben für den Computer, auf dem das XML verarbeitet wird, können einem Angreifer verfügbar gemacht werden. Außerdem kann ein Angreifer dies als DoS-Vektor verwenden.
es: No utilice sobrecargas no seguras de System.Data.DataSet.ReadXml. Esta API habilita internamente el procesado de DTD en la instancia utilizada del lector XML, y utiliza UrlResolver para resolver entidades XML externas. El resultado es la revelación de información. El contenido del sistema de archivos o los recursos compartidos de red de la máquina que procesa el XML pueden resultar expuestos al atacante. Además, un atacante puede usar esto como vector de denegación de servicio.
fr: Ne pas utiliser de surcharges unsafe de System.Data.DataSet.ReadXml. Cette API active de manière interne le traitement DTD sur l'instance de lecteur XML utilisée, puis utilise UrlResolver pour résoudre les entités XML externes. Il en résulte une divulgation d'informations. Le contenu du système de fichiers ou des partages réseau de la machine qui traite le code XML peut être exposé à des attaques de pirates. En outre, un pirate peut l'utiliser comme vecteur d'attaque DoS.
it: Non usare overload non sicuri di System.Data.DataSet.ReadXml. Questa API abilita internamente l'elaborazione della DTD sull'istanza usata del lettore XML e usa UrlResolver per risolvere le entità XML esterne. Il risultato implica la diffusione di informazioni. Il contenuto di file system o condivisioni di rete per il computer che elabora il codice XML può essere esposto a utenti malintenzionati. Un utente malintenzionato può inoltre usarlo come vettore DoS.
ja: System.Data.DataSet.ReadXml の安全でないオーバーロードを使用しないでください。この API により、使用されている XML リーダー インスタンスでの DTD 処理が内部で有効になり、外部 XML エンティティの解決に UrlResolver が使用されます。その結果は情報漏えいです。XML を処理しているコンピューターのファイル システムまたはネットワーク共有のコンテンツは、攻撃者にさらされる可能性があります。また、攻撃者はこれを DoS ベクトルとして使用する可能性があります。
ko: System.Data.DataSet.ReadXml의 안전하지 않은 오버로드를 사용하지 마세요. 이 API는 사용하는 XML 판독기 인스턴스에서 DTD 처리를 내부적으로 활성화하고, UrlResolver를 사용하여 외부 XML 엔터티를 확인합니다. 이에 따른 결과는 정보 공개입니다. XML을 처리하는 머신의 파일 시스템 또는 네트워크 공유 콘텐츠는 공격자에게 노출될 수 있습니다. 또한, 공격자는 이러한 콘텐츠를 DoS 벡터로 사용할 수 있습니다.
pl: Nie używaj niebezpiecznych przeciążeń elementu System.Data.DataSet.ReadXml. Ten interfejs API wewnętrznie umożliwia przetwarzanie elementu DTD w używanym wystąpieniu obiektu odczytującego XML i używa elementu UrlResolver do rozpoznawania zewnętrznych jednostek XML. Wynikiem jest ujawnienie informacji. Zawartość systemu plików lub udziałów sieciowych w przypadku maszynowego przetwarzania elementu XML może być narażona na atak. Ponadto atakujący może użyć tego jako wektora ataku DoS.
pt_br: Não use sobrecargas não seguras de System.Data.DataSet.ReadXml. Esta API habilita internamente o processamento DTD na instância do leitor de XML usada e usa o UrlResolver para resolver entidades XML externas. O resultado é a divulgação de informações. O conteúdo do sistema de arquivos ou dos compartilhamentos de rede para o computador que está processando o XML pode ser exposto ao invasor. Além disso, um invasor pode usar isso como um vetor DoS.
ru: Не используйте небезопасные перегрузки System.Data.DataSet.ReadXml. Этот API допускает внутреннюю обработку DTD в используемом экземпляре модуля чтения XML, а также использует UrlResolver для разрешения внешних XML-сущностей. Результатом является раскрытие информации. Содержимое из файловой системы или сетевых папок для компьютера, обрабатывающего XML, может попасть к злоумышленнику. Кроме того, злоумышленник может использовать это в качестве вектора для атаки типа "отказ в обслуживании".
tr: Güvenli olmayan System.Data.DataSet.ReadXml aşırı yükleri kullanmayın. Bu API kullanılan XML okuyucusu örneği üzerinde iç DTD işlemeyi etkinleştirir ve dış XML varlıkları için UrlResolver kullanır. Sonuç, bilgilerin açığa çıkmasıdır. XML’i işleyen makine için dosya sistemi veya ağ paylaşımlarından içerikler saldırgan için açığa çıkarılabilir. Ayrıca, bir saldırgan bunu bir DoS vektörü olarak kullanabilir.
zh_hans: 不要使用 System.Data.DataSet.ReadXml 的不安全重载。此 API 在内部对所用的 XML 读取器实例启用了 DTD 处理，并使用 UrlResolver 解析外部 XML 实体。这导致了信息泄漏。供计算机处理 XML 的文件系统或网络共享内容可能会暴露给攻击者。另外，攻击者可能会将其用作 DoS 矢量。
zh_hant: 請勿使用 System.Data.DataSet.ReadXml 的不安全多載。此 API 會在執行個體使用的 XML 讀取器上，於內部啟用 DTD 處理，並使用 UrlResolver 解析外部 XML 實體。結果會造成資訊外洩。攻擊者有可能會看到為處理 XML 的電腦所提供之檔案系統或網路共用內容。此外，攻擊者還可以使用它作為 DoS 向量。

# UseXmlReaderForDataSetReadXmlMessage
source: Use XmlReader for DataSet ReadXml
cs: Pro DataSet ReadXml použijte XmlReader
de: XmlReader für DataSet ReadXml verwenden
es: Usar XmlReader para DataSet ReadXml
fr: Utiliser XmlReader pour le ReadXml de DataSet
it: Usare XmlReader per ReadXml di DataSet
ja: DataSet ReadXml に XmlReader を使用します
ko: DataSet ReadXml에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataSet ReadXml
pt_br: Usar XmlReader para DataSet ReadXml
ru: Используйте XmlReader для DataSet ReadXml
tr: DataSet ReadXml için XmlReader kullanın
zh_hans: 使用 DataSet ReadXml 的 XmlReader
zh_hant: 為 DataSet ReadXml 使用 XmlReader

# UseXmlReaderForDataSetReadXmlSchemaTitle
source: Use XmlReader for DataSet ReadXmlSchema
cs: Pro DataSet ReadXmlSchema použijte XmlReader
de: XmlReader für DataSet ReadXmlSchema verwenden
es: Usar XmlReader para DataSet ReadXmlSchema
fr: Utiliser XmlReader pour le ReadXmlSchema de DataSet
it: Usare XmlReader per ReadXmlSchema di DataSet
ja: DataSet ReadXmlSchema に XmlReader を使用します
ko: DataSet ReadXmlSchema에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataSet ReadXmlSchema
pt_br: Usar o XmlReader para DataSet ReadXmlSchema
ru: Используйте XmlReader для DataSet ReadXmlSchema
tr: DataSet ReadXmlSchema için XmlReader kullanın
zh_hans: 使用 DataSet ReadXmlSchema 的 XmlReader
zh_hant: 為 DataSet ReadXmlSchema 使用 XmlReader

# UseXmlReaderForDataSetReadXmlSchemaDescription
source: Do not use unsafe overloads of System.Data.DataSet.ReadXmlSchema. This API internally enables DTD processing on the XML reader instance used, and uses UrlResolver for resolving external XML entities. The outcome is information disclosure. Content from file system or network shares for the machine processing the XML can be exposed to attacker. In addition, an attacker can use this as a DoS vector.
cs: Nepoužívejte nebezpečná přetížení metody System.Data.DataSet.ReadXmlSchema. Toto rozhraní API umožňuje zpracovávat DTD v instanci používané čtečky XML a pomocí UrlResolveru překládá externí entity XML. Výsledkem je odhalení informací. Obsah systému souborů nebo sdílených síťových složek počítače, který zpracovává kód XML, může zjistit útočník. Kromě toho může toto útočník využít jako místo pro útok DoS.
de: Verwenden Sie keine unsicheren Überladungen von "System.Data.DataSet.ReadXmlSchema". Diese API aktiviert intern die DTD-Verarbeitung für die verwendete XML-Readerinstanz und verwendet den UrlResolver zum Auflösen externer XML-Entitäten. Das Ergebnis ist die Veröffentlichung von Informationen. Inhalte aus dem Dateisystem oder aus Netzwerkfreigaben für den Computer, auf dem das XML verarbeitet wird, können einem Angreifer verfügbar gemacht werden. Außerdem kann ein Angreifer dies als DoS-Vektor verwenden.
es: No utilice sobrecargas no seguras de System.Data.DataSet.ReadXmlSchema. Esta API habilita internamente el procesado de DTD en la instancia utilizada del lector XML, y utiliza UrlResolver para resolver entidades XML externas. El resultado es la revelación de información. El contenido del sistema de archivos o los recursos compartidos de red de la máquina que procesa el XML pueden resultar expuestos al atacante. Además, un atacante puede usar esto como vector de denegación de servicio.
fr: Ne pas utiliser de surcharges unsafe de System.Data.DataSet.ReadXmlSchema. Cette API active de manière interne le traitement DTD sur l'instance de lecteur XML utilisée, puis utilise UrlResolver pour résoudre les entités XML externes. Il en résulte une divulgation d'informations. Le contenu du système de fichiers ou des partages réseau de la machine qui traite le code XML peut être exposé à des attaques de pirates. En outre, un pirate peut l'utiliser comme vecteur d'attaque DoS.
it: Non usare overload non sicuri di System.Data.DataSet.ReadXmlSchema. Questa API abilita internamente l'elaborazione della DTD sull'istanza usata del lettore XML e usa UrlResolver per risolvere le entità XML esterne. Il risultato implica la diffusione di informazioni. Il contenuto di file system o condivisioni di rete per il computer che elabora il codice XML può essere esposto a utenti malintenzionati. Un utente malintenzionato può inoltre usarlo come vettore DoS.
ja: System.Data.DataSet.ReadXmlSchema の安全でないオーバーロードを使用しないでください。この API により、使用されている XML リーダー インスタンスでの DTD 処理が内部で有効になり、外部 XML エンティティの解決に UrlResolver が使用されます。その結果は情報漏えいです。XML を処理しているコンピューターのファイル システムまたはネットワーク共有のコンテンツは、攻撃者にさらされる可能性があります。また、攻撃者はこれを DoS ベクトルとして使用する可能性があります。
ko: System.Data.DataSet.ReadXmlSchema의 안전하지 않은 오버로드를 사용하지 마세요. 이 API는 사용하는 XML 판독기 인스턴스에서 DTD 처리를 내부적으로 활성화하고, UrlResolver를 사용하여 외부 XML 엔터티를 확인합니다. 이에 따른 결과는 정보 공개입니다. XML을 처리하는 머신의 파일 시스템 또는 네트워크 공유 콘텐츠는 공격자에게 노출될 수 있습니다. 또한, 공격자는 이러한 콘텐츠를 DoS 벡터로 사용할 수 있습니다.
pl: Nie używaj niebezpiecznych przeciążeń elementu System.Data.DataSet.ReadXmlSchema. Ten interfejs API wewnętrznie umożliwia przetwarzanie elementu DTD w używanym wystąpieniu obiektu odczytującego XML i używa elementu UrlResolver do rozpoznawania zewnętrznych jednostek XML. Wynikiem jest ujawnienie informacji. Zawartość systemu plików lub udziałów sieciowych w przypadku maszynowego przetwarzania elementu XML może być narażona na atak. Ponadto atakujący może użyć tego jako wektora ataku DoS.
pt_br: Não use sobrecargas não seguras de System.Data.DataSet.ReadXmlSchema. Esta API habilita internamente o processamento DTD na instância do leitor de XML usada e usa o UrlResolver para resolver entidades XML externas. O resultado é a divulgação de informações. O conteúdo do sistema de arquivos ou dos compartilhamentos de rede para o computador que está processando o XML pode ser exposto ao invasor. Além disso, um invasor pode usar isso como um vetor DoS.
ru: Не используйте небезопасные перегрузки System.Data.DataSet.ReadXmlSchema. Этот API допускает внутреннюю обработку DTD в используемом экземпляре модуля чтения XML, а также использует UrlResolver для разрешения внешних XML-сущностей. Результатом является раскрытие информации. Содержимое из файловой системы или сетевых папок для компьютера, обрабатывающего XML, может попасть к злоумышленнику. Кроме того, злоумышленник может использовать это в качестве вектора для атаки типа "отказ в обслуживании".
tr: Güvenli olmayan System.Data.DataSet.ReadXmlSchema aşırı yükleri kullanmayın. Bu API kullanılan XML okuyucusu örneği üzerinde iç DTD işlemeyi etkinleştirir ve dış XML varlıkları için UrlResolver kullanır. Sonuç, bilgilerin açığa çıkmasıdır. XML’i işleyen makine için dosya sistemi veya ağ paylaşımlarından içerikler saldırgan için açığa çıkarılabilir. Ayrıca, bir saldırgan bunu bir DoS vektörü olarak kullanabilir.
zh_hans: 不要使用 System.Data.DataSet.ReadXmlSchema 的不安全重载。此 API 在内部对所用的 XML 读取器实例启用了 DTD 处理，并使用 UrlResolver 解析外部 XML 实体。这导致了信息泄漏。供计算机处理 XML 的文件系统或网络共享内容可能会暴露给攻击者。另外，攻击者可能会将其用作 DoS 矢量。
zh_hant: 請勿使用 System.Data.DataSet.ReadXmlSchema 的不安全多載。此 API 會在執行個體使用的 XML 讀取器上，於內部啟用 DTD 處理，並使用 UrlResolver 解析外部 XML 實體。結果會造成資訊外洩。攻擊者有可能會看到為處理 XML 的電腦所提供之檔案系統或網路共用內容。此外，攻擊者還可以使用它作為 DoS 向量。

# UseXmlReaderForDataSetReadXmlSchemaMessage
source: Use XmlReader for DataSet ReadXmlSchema
cs: Pro DataSet ReadXmlSchema použijte XmlReader
de: XmlReader für DataSet ReadXmlSchema verwenden
es: Usar XmlReader para DataSet ReadXmlSchema
fr: Utiliser XmlReader pour le ReadXmlSchema de DataSet
it: Usare XmlReader per ReadXmlSchema di DataSet
ja: DataSet ReadXmlSchema に XmlReader を使用します
ko: DataSet ReadXmlSchema에 대해 XmlReader를 사용하세요.
pl: Użyj elementu XmlReader dla elementu DataSet ReadXmlSchema
pt_br: Usar o XmlReader para DataSet ReadXmlSchema
ru: Используйте XmlReader для DataSet ReadXmlSchema
tr: DataSet ReadXmlSchema için XmlReader kullanın
zh_hans: 使用 DataSet ReadXmlSchema 的 XmlReader
zh_hant: 為 DataSet ReadXmlSchema 使用 XmlReader

# ReviewDataViewCollectionStringTitle
source: Review DataView CollectionString
cs: Zkontrolujte DataView CollectionString
de: DataView CollectionString prüfen
es: Revisar DataView CollectionString
fr: Passer en revue le CollectionString de DataView
it: Esaminare DataView CollectionString
ja: DataView CollectionString を確認します
ko: DataView CollectionString을 검토하세요.
pl: Przejrzyj element DataView CollectionString
pt_br: Examinar DataView CollectionString
ru: Проверьте DataView CollectionString
tr: DataView CollectionString’i gözden geçirin
zh_hans: 评审 DataView CollectionString
zh_hant: 檢閱 DataView CollectionString
