Repository: dotnet/sdk
Catalog: src/Microsoft.CodeAnalysis.NetAnalyzers/src/Microsoft.CodeAnalysis.NetAnalyzers/Microsoft.NetFramework.Analyzers/xlf/MicrosoftNetFrameworkAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SpecifyMessageBoxOptionsTitle
source: Specify MessageBoxOptions
cs: Zadejte MessageBoxOptions
de: MessageBoxOptions angeben
es: Especificar MessageBoxOptions
fr: Spécifier MessageBoxOptions
it: Specificare MessageBoxOptions
ja: MessageBoxOptions を指定します
ko: MessageBoxOptions를 지정하세요.
pl: Określ argument MessageBoxOptions
pt_br: Especificar MessageBoxOptions
ru: Укажите MessageBoxOptions
tr: MessageBoxOptions belirtin
zh_hans: 指定 MessageBoxOptions
zh_hant: 指定 MessageBoxOptions

# SpecifyMessageBoxOptionsDescription
source: To correctly display a message box for cultures that use a right-to-left reading order, the RightAlign and RtlReading members of the MessageBoxOptions enumeration must be passed to the Show method.
cs: Aby se okno se zprávou zobrazovalo správně pro jazykové verze, jejichž text se čte zprava doleva, musí se metodě Show předat členy RightAlign a RtlReading výčtu MessageBoxOptions.
de: Um ein Meldungsfeld für Kulturen mit Leserichtung von rechts nach links ordnungsgemäß anzuzeigen, müssen die Member "RightAlign" und "RtlReading" der Enumeration "MessageBoxOptions" an die Show-Methode übergeben werden.
es: Para mostrar correctamente un cuadro de mensaje para las referencias culturales con escritura de derecha a izquierda, se deben pasar al método Show los miembros RightAlign y RtlReading de la enumeración MessageBoxOptions.
fr: Pour afficher correctement une boîte de message pour les cultures qui utilisent un sens de lecture de droite à gauche, les membres RightAlign et RtlReading de l'énumération MessageBoxOptions doivent être passés à la méthode Show.
it: Per visualizzare correttamente una finestra di messaggio per le impostazioni cultura che usano un ordine di lettura da destra a sinistra, è necessario passare i membri RightAlign e RtlReading dell'enumerazione MessageBoxOptions al metodo Show.
ja: 右から左に読む言語を使用するカルチャのメッセージ ボックスを正しく表示するには、MessageBoxOptions 列挙型の RightAlign メンバーと RtlReading メンバーを Show メソッドに渡す必要があります。
ko: 오른쪽에서 왼쪽 방향의 읽기 순서를 사용하는 문화권에 맞는 메시지 상자를 올바르게 표시하려면 MessageBoxOptions 열거형의 RightAlign 및 RtlReading 멤버가 Show 메서드로 전달되어야 합니다.
pl: Aby prawidłowo wyświetlać okna komunikatów w krajach, w których tekst jest czytany od prawej do lewej strony, elementy członkowskie RightAlign oraz RtlReading wyliczenia MessageBoxOptions muszą zostać przekazane do metody Show.
pt_br: Para exibir corretamente uma caixa de mensagens para culturas cujo sentido de leitura é da direita para a esquerda, os membros RightAlign e RtlReading da enumeração MessageBoxOptions devem ser passados para o método Show.
ru: Чтобы правильно отобразить окно сообщения для языков и региональных параметров, где используется порядок чтения справа налево, нужно передать члены RightAlign и RtlReading перечисления MessageBoxOptions в метод Show.
tr: Sağdan sola doğru okuma düzeni kullanan kültürler için bir ileti kutusunu doğru şekilde görüntülemek için, MessageBoxOptions sıralamasının RightAlign ve RtlReading üyelerinin Show yöntemine geçirilmesi gerekir.
zh_hans: 要为使用从右到左阅读顺序的区域性正确显示消息框，必须将 MessageBoxOptions 枚举的 RightAlign 和 RtlReading 成员传递给 Show 方法。
zh_hant: 為正確顯示由右至左閱讀順序文化特性 (Culture) 的訊息方塊，必須將 MessageBoxOptions 列舉的 RightAlign 與 RtlReading 成員傳遞到 Show 方法。

# SpecifyMessageBoxOptionsMessage
source: Specify MessageBoxOptions
cs: Zadejte MessageBoxOptions
de: MessageBoxOptions angeben
es: Especificar MessageBoxOptions
fr: Spécifier MessageBoxOptions
it: Specificare MessageBoxOptions
ja: MessageBoxOptions を指定します
ko: MessageBoxOptions를 지정하세요.
pl: Określ argument MessageBoxOptions
pt_br: Especificar MessageBoxOptions
ru: Укажите MessageBoxOptions
tr: MessageBoxOptions belirtin
zh_hans: 指定 MessageBoxOptions
zh_hant: 指定 MessageBoxOptions

# AvoidDuplicateAcceleratorsTitle
source: Avoid duplicate accelerators
cs: Vyhněte se duplicitním klávesovým zkratkám
de: Doppelte Zugriffstasten vermeiden
es: Evitar aceleradores duplicados
fr: Éviter les accélérateurs en double
it: Evitare tasti di scelta rapida duplicati
ja: 重複するアクセラレータを使用しません
ko: 중복 액셀러레이터 키를 사용하지 마세요.
pl: Unikaj duplikowania akceleratorów
pt_br: Evitar aceleradores duplicados
ru: Избегайте повторяющихся сочетаний клавиш
tr: Yinelenen hızlandırıcılardan kaçının
zh_hans: 避免快捷键重复
zh_hant: 避免重複的快速鍵

# AvoidDuplicateAcceleratorsDescription
source: An access key, also known as an accelerator, enables keyboard access to a control by using the ALT key. When multiple controls have duplicate access keys, the behavior of the access key is not well defined.
cs: Přístupová klávesa, které se říká taky klávesová zkratka, umožňuje používat ovládací prvek pomocí klávesy ALT. Když několik ovládacích prvků má duplicitní klávesové zkratky, chování přístupové klávesy není dostatečně definované.
de: Eine Zugriffstaste, auch als Accelerator bezeichnet, ermöglicht den Tastaturzugriff auf ein Steuerelement über die ALT-Taste. Wenn mehrere Steuerelemente doppelte Zugriffstasten aufweisen, ist das Verhalten der Zugriffstaste nicht gut definiert.
es: Una tecla de acceso, también denominada acelerador, permite el acceso mediante teclado a un control utilizando la tecla ALT. Cuando varios controles tienen teclas de acceso duplicadas, no se define correctamente el comportamiento de la tecla de acceso.
fr: Une touche d'accès rapide (également appelée accélérateur) autorise l'accès à un contrôle via le clavier, à l'aide de la touche ALT. Quand plusieurs contrôles ont des touches d'accès rapide en double, le comportement de ces dernières n'est pas correctement défini.
it: Un tasto di scelta, noto anche come tasto di scelta rapida, consente di accedere a un controllo dalla tastiera premendo ALT. Quando più controlli presentano tasti di scelta duplicati, il comportamento del tasto di scelta non è ben definito.
ja: アクセラレータとも呼ばれるアクセス キーを使用すると、キーボードから Alt キーを使用してコントロールにアクセスできます。複数のコントロールでアクセス キーが重複している場合、アクセス キーの動作は適切に定義されていません。
ko: 액셀러레이터 키라고도 알려진 액세스 키는 &lt;ALT&gt; 키를 사용하여 컨트롤에 대한 키보드 액세스를 사용합니다. 여러 컨트롤에 중복되는 선택키가 있는 경우 선택키의 동작이 잘 정의되지 않습니다.
pl: Klawisz dostępu, znany także jako akcelerator, umożliwia dostęp do kontrolki za pomocą klawiatury przy użyciu klawisza ALT. Jeśli klawisze dostępu są zduplikowane dla wielu kontrolek, zachowanie klawisza dostępu nie jest poprawnie określone.
pt_br: Uma chave de acesso, também conhecida como um acelerador, permite o acesso do teclado a um controle usando a tecla ALT. Quando vários controles têm chaves de acesso duplicadas, o comportamento da chave de acesso não fica bem definido.
ru: Клавиша доступа, которая используется в сочетаниях клавиш, позволяет получить доступ к элементу управления с помощью клавиши ALT на клавиатуре. Если несколько элементов управления имеют повторяющие сочетания клавиш, поведение клавиши доступа не является однозначным.
tr: Hızlandırıcı olarak da bilinen bir erişim anahtarı ALT tuşunu kullanarak bir denetimde klavye erişimini etkinleştirir. Birden çok denetim anahtarda yinelenen erişime sahip olduğunda, erişim anahtarı iyi tanımlı değildir.
zh_hans: 访问键也称为快捷键，它通过使用 Alt 键来实现对控件的键盘访问。如果多个控件具有重复的访问键，表示访问键的行为定义不正确。
zh_hant: 便捷鍵也稱為快速鍵，讓您可使用 ALT 鍵，利用鍵盤存取控制項。當多個控制項使用重複的存取金鑰時，會無法完善地定義存取金鑰行為。

# AvoidDuplicateAcceleratorsMessage
source: Avoid duplicate accelerators
cs: Vyhněte se duplicitním klávesovým zkratkám
de: Doppelte Zugriffstasten vermeiden
es: Evitar aceleradores duplicados
fr: Éviter les accélérateurs en double
it: Evitare tasti di scelta rapida duplicati
ja: 重複するアクセラレータを使用しません
ko: 중복 액셀러레이터 키를 사용하지 마세요.
pl: Unikaj duplikowania akceleratorów
pt_br: Evitar aceleradores duplicados
ru: Избегайте повторяющихся сочетаний клавиш
tr: Yinelenen hızlandırıcılardan kaçının
zh_hans: 避免快捷键重复
zh_hant: 避免重複的快速鍵

# SetLocaleForDataTypesTitle
source: Set locale for data types
cs: Nastavte národní prostředí pro datové typy
de: Gebietsschema für Datentypen festlegen
es: Establecer la configuración regional para tipos de datos
fr: Définir les paramètres régionaux pour les types de données
it: Specificare le impostazioni locali per i tipi di dati
ja: データ型のロケールを設定します
ko: 데이터 형식에 맞는 로캘을 설정하세요.
pl: Ustaw ustawienia regionalne dla wszystkich typów danych
pt_br: Definir localidade para tipos de dados
ru: Задавайте языковой стандарт для типов данных
tr: Veri türleri için yerel ayarı belirtin
zh_hans: 设置数据类型的区域设置
zh_hant: 設定資料類型的地區設定

# SetLocaleForDataTypesDescription
source: The locale determines culture-specific presentation elements for data, such as formatting that is used for numeric values, currency symbols, and sort order. When you create a DataTable or DataSet, you should explicitly set the locale.
cs: Národní prostředí určuje elementy prezentace dat specifické pro určitou jazykovou verzi, třeba formátování číselných hodnot, symboly měn a pořadí řazení. Když vytváříte DataTable nebo DataSet, měli byste národní prostředí zadat explicitně.
de: Das Gebietsschema legt kulturspezifische Darstellungselemente für Daten fest, beispielsweise Formatierungen, die für numerische Werte, Währungssymbole und Sortierreihenfolgen verwendet werden. Wenn Sie eine DataTable oder ein DataSet erstellen, müssen Sie das Gebietsschema explizit festlegen.
es: La configuración regional determina los elementos de presentación específicos de la referencia cultural para los datos, como el formato para los valores numéricos, símbolos de moneda y criterio de ordenación. Cuando se crea DataTable o DataSet debe establecerse explícitamente la configuración regional.
fr: Les paramètres régionaux déterminent les éléments de présentation des données spécifiques à la culture, par exemple la mise en forme utilisée pour les valeurs numériques, les symboles monétaires et l'ordre de tri. Quand vous créez un DataTable ou un DataSet, vous devez définir les paramètres régionaux explicitement.
it: Le impostazioni locali determinano elementi di presentazione specifici delle impostazioni cultura per i dati, ad esempio la formattazione usata per valori numerici, simboli di valuta e ordinamento. Quando si crea un elemento DataTable o DataSet, è opportuno definire in modo esplicito le impostazioni locali.
ja: ロケールにより、データのカルチャ固有の表示要素が決まります。たとえば、数値、通貨記号、並べ替え順序に使用される形式です。DataTable または DataSet を作成する際は、ロケールを明示的に設定する必要があります。
ko: 로캘은 데이터에 대해 숫자 값에 사용하는 서식, 통화 기호, 정렬 순서와 같은 문화권별 프레젠테이션 요소를 결정합니다. DataTable 또는 DataSet를 만드는 경우 로캘을 명시적으로 설정해야 합니다.
pl: Ustawienia regionalne określają specyficzne dla danej kultury elementy przedstawiania danych, jak na przykład formatowanie używane w przypadku wartości liczbowych, symbole walut i kolejność sortowania. Podczas tworzenia elementu DataTable lub DataSet należy jawnie określić ustawienia regionalne.
pt_br: A localidade determina elementos de apresentação específicos a uma cultura para dados, como a formatação usada para valores numéricos, símbolos de moeda e ordem de classificação. Quando você cria um DataTable ou DataSet, você deve definir a localidade explicitamente.
ru: Языковой стандарт определяет языковые особенности для отображения данных, например форматирование для числовых значений, обозначения денежных единиц и порядок сортировки. При создании DataTable или DataSet вам нужно явно задать языковой стандарт.
tr: Veriler için sayısal değerler, para birimi sembolleri ve sıralama düzeni için kullanılan biçimlendirme gibi kültüre özgü sunu öğeleri yerel ayar tarafından belirlenir. Bir DataTable veya DataSet oluşturduğunuzda, yerel ayarı açıkça ayarlamanız gerekir.
zh_hans: 区域设置决定数据的区域性特定显示元素，例如，数值、货币符号和排序顺序所用的格式。在创建 DataTable 或 DataSet 时，应显式设置区域设置。
zh_hant: 地區設定會決定資料的文化特性 (Culture) 專屬之呈現元素，例如為數值、貨幣符號及排序次序所用的格式。當您建立 DataTable 或 DataSet 時，應要明確設定地區設定。

# SetLocaleForDataTypesMessage
source: Set locale for data types
cs: Nastavte národní prostředí pro datové typy
de: Gebietsschema für Datentypen festlegen
es: Establecer la configuración regional para tipos de datos
fr: Définir les paramètres régionaux pour les types de données
it: Specificare le impostazioni locali per i tipi di dati
ja: データ型のロケールを設定します
ko: 데이터 형식에 맞는 로캘을 설정하세요.
pl: Ustaw ustawienia regionalne dla wszystkich typów danych
pt_br: Definir localidade para tipos de dados
ru: Задавайте языковой стандарт для типов данных
tr: Veri türleri için yerel ayarı belirtin
zh_hans: 设置数据类型的区域设置
zh_hant: 設定資料類型的地區設定

# DoNotMarkServicedComponentsWithWebMethodTitle
source: Do not mark serviced components with WebMethod
cs: Neoznačujte komponenty služeb jako WebMethod
de: ServicedComponents nicht mit WebMethod markieren
es: No marcar los componentes con servicio como WebMethod
fr: Ne pas marquer les composants pris en charge avec WebMethod
it: Non contrassegnare componenti serviti con WebMethod
ja: サービス コンポーネントを WebMethod に設定しません
ko: 서비스 구성 요소를 WebMethod를 사용하여 표시하지 마세요.
pl: Nie oznaczaj usługowych składników atrybutem WebMethod
pt_br: Não marcar componentes atendidos com WebMethod
ru: Не помечайте обслуживаемые компоненты атрибутом WebMethod
tr: Hizmet verilen bileşenleri WebMethod ile işaretlemeyin
zh_hans: 不要使用 WebMethod 标记服务组件
zh_hant: 請勿將 Serviced 元件標記為 WebMethod

# DoNotMarkServicedComponentsWithWebMethodDescription
source: A method in a type that inherits from System.EnterpriseServices.ServicedComponent is marked by using System.Web.Services.WebMethodAttribute. Because WebMethodAttribute and a ServicedComponent method have conflicting behavior and requirements for context and transaction flow, the behavior of the method will be incorrect in some scenarios.
cs: Metoda v typu, která dědí ze System.EnterpriseServices.ServicedComponent, se označuje atributem System.Web.Services.WebMethodAttribute. Vzhledem k tomu, že WebMethodAttribute a ServicedComponent mají konfliktní chování a požadavky na kontext a tok transakcí, metoda se v některých případech nebude chovat správně.
de: Eine Methode in einem Typ, der von System.EnterpriseServices.ServicedComponent erbt, wird mit System.Web.Services.WebMethodAttribute markiert. Da das Verhalten und die Anforderungen für Kontext- und Transaktionsfluss bei WebMethodAttribute und einer ServicedComponent-Methode zueinander in Konflikt stehen, ist das Verhalten der Methode in einigen Szenarien falsch.
es: Un método de un tipo que hereda de System.EnterpriseServices.ServicedComponent se marca con System.Web.Services.WebMethodAttribute. Dado que un método ServicedComponent y WebMethodAttribute tienen comportamientos y requisitos en conflicto para el flujo de transacción y el contexto, el comportamiento del método es incorrecto en algunas situaciones.
fr: Une méthode dans un type qui hérite de System.EnterpriseServices.ServicedComponent est marquée avec System.Web.Services.WebMethodAttribute. Dans la mesure où WebMethodAttribute et une méthode ServicedComponent ont des comportements et des exigences incompatibles au niveau du contexte et du flux de transactions, le comportement de la méthode est incorrect dans certains scénarios.
it: Per contrassegnare un metodo in un tipo che eredita da System.EnterpriseServices.ServicedComponent, si usa System.Web.Services.WebMethodAttribute. Dal momento che WebMethodAttribute e un metodo ServicedComponent presentano comportamenti e requisiti di contesto e flusso di transazioni in conflitto tra loro, il comportamento del metodo non sarà corretto in determinati scenari.
ja: System.EnterpriseServices.ServicedComponent から継承された型のメソッドは、System.Web.Services.WebMethodAttribute を使用してマークされています。WebMethodAttribute と ServicedComponent メソッドは、コンテキストとトランザクション フローの動作および要件が競合するため、状況によってはメソッドの動作が正しくありません。
ko: System.EnterpriseServices.ServicedComponent에서 상속된 형식의 메서드는 System.Web.Services.WebMethodAttribute를 사용하여 표시됩니다. WebMethodAttribute와 ServicedComponent 메서드에 컨텍스트 및 트랜잭션 흐름에 대해 충돌하는 동작과 요구 사항이 있으므로 메서드 동작이 일부 시나리오에서 올바르지 않을 수 있습니다.
pl: Metoda w typie dziedziczącym z elementu System.EnterpriseServices.ServicedComponent jest oznaczona za pomocą elementu System.Web.Services.WebMethodAttribute. Ponieważ metody WebMethodAttribute oraz ServicedComponent mają będące w konflikcie zachowania i wymagania dotyczące kontekstu i przepływu transakcji, zachowanie metody w niektórych scenariuszach będzie niepoprawne.
pt_br: Um método em um tipo herdado de System.EnterpriseServices.ServicedComponent é marcado usando System.Web.Services.WebMethodAttribute. Já que WebMethodAttribute e um método ServicedComponent têm um comportamento e requisitos conflitantes para fluxo de transação e de contexto, o comportamento do método será incorreto em alguns cenários.
ru: Метод в типе, производный от System.EnterpriseServices.ServicedComponent, помечается с помощью атрибута System.Web.Services.WebMethodAttribute. Так как WebMethodAttribute и метод ServicedComponent конфликтуют с точки зрения поведения и требований к контексту и потоку транзакций, в некоторых ситуациях этот метод может работать неправильно.
tr: System.EnterpriseServices.ServicedComponent üzerinden devralan bir tür içindeki bir yöntem, System.Web.Services.WebMethodAttribute kullanılarak işaretlenir. WebMethodAttribute ve bir ServicedComponent yöntemi kapsam ve işlem akışı için çakışan davranış ve gereksinimlere sahip olduğundan, yöntemin davranışı bazı senaryolarda yanlış olacaktır.
zh_hans: 某类型中从 System.EnterpriseServices.ServicedComponent 继承的方法是使用 System.Web.Services.WebMethodAttribute 标记的。由于 WebMethodAttribute 和 ServicedComponent 方法在上下文和事务流方面的行为和要求有冲突，因此该方法的行为在某些情况下不正确。
zh_hant: 其類型為繼承自 System.EnterpriseServices.ServicedComponent 的方法，會標記為 System.Web.Services.WebMethodAttribute。因為 WebMethodAttribute 與 ServicedComponent 方法在內容以及交易流程中發生行為及需求的衝突，所以此方法在某些情況下的行為會不正確。

# DoNotMarkServicedComponentsWithWebMethodMessage
source: Do not mark serviced components with WebMethod
cs: Neoznačujte komponenty služeb jako WebMethod
de: ServicedComponents nicht mit WebMethod markieren
es: No marcar los componentes con servicio como WebMethod
fr: Ne pas marquer les composants pris en charge avec WebMethod
it: Non contrassegnare componenti serviti con WebMethod
ja: サービス コンポーネントを WebMethod に設定しません
ko: 서비스 구성 요소를 WebMethod를 사용하여 표시하지 마세요.
pl: Nie oznaczaj usługowych składników atrybutem WebMethod
pt_br: Não marcar componentes atendidos com WebMethod
ru: Не помечайте обслуживаемые компоненты атрибутом WebMethod
tr: Hizmet verilen bileşenleri WebMethod ile işaretlemeyin
zh_hans: 不要使用 WebMethod 标记服务组件
zh_hant: 請勿將 Serviced 元件標記為 WebMethod

# MarkWindowsFormsEntryPointsWithStaThreadTitle
source: Mark Windows Forms entry points with STAThread
cs: Označte vstupní body Windows Forms jako STAThread
de: Windows Forms-Einstiegspunkte mit STAThread markieren
es: Marcar puntos de entrada de Windows Forms con STAThread
fr: Marquez les points d'entrée Windows Forms avec STAThread
it: Contrassegnare i punti di ingresso di Windows Forms con STAThread
ja: Windows フォームのエントリ ポイントを STAThread に設定します
ko: Windows Forms 진입점을 STAThread를 사용하여 표시하세요.
pl: Oznacz punkty wejścia modelu Windows Forms atrybutem STAThread
pt_br: Marcar pontos de entrada do Windows Forms com STAThread
ru: Пометьте точки входа Windows Forms с помощью STAThread
tr: Windows Forms giriş noktalarını STAThread ile işaretleyin
zh_hans: 使用 STAThread 标记 Windows 窗体的入口点
zh_hant: 將 Windows Forms 進入點標記為 STAThread

# MarkWindowsFormsEntryPointsWithStaThreadDescription
source: STAThreadAttribute indicates that the COM threading model for the application is a single-threaded apartment. This attribute must be present on the entry point of any application that uses Windows Forms; if it is omitted, the Windows components might not work correctly.
cs: STAThreadAttribute označuje, že podprocesový model COM pro aplikaci je STA (single-threaded apartment). Tento atribut se musí zadat na vstupní bod každé aplikace, která používá Windows Forms. Pokud se vynechá, komponenty Windows nemusí fungovat správně.
de: STAThreadAttribute weist darauf hin, dass es sich bei dem COM-Threadingmodell für die Anwendung um ein Singlethread-Apartment handelt. Dieses Attribut muss am Einstiegspunkt jeder Anwendung vorhanden sein, die Windows Forms verwendet. Wenn es ausgelassen wird, funktionieren die Windows-Komponenten möglicherweise nicht ordnungsgemäß.
es: STAThreadAttribute indica que el modelo de subprocesos de COM para la aplicación es un contenedor uniproceso. Este atributo debe estar presente en el punto de entrada de cualquier aplicación que utilice Windows Forms; si se omite, los componentes de Windows podrían no funcionar correctamente.
fr: STAThreadAttribute indique que le modèle de thread COM pour l'application est un thread unique cloisonné. Cet attribut doit être présent au point d'entrée de l'application qui utilise des Windows Forms. S'il est omis, les composants Windows risquent de ne pas fonctionner correctement.
it: STAThreadAttribute indica che il modello di threading COM per l'applicazione è un apartment a thread singolo. Questo attributo deve essere presente sul punto di ingresso di qualsiasi applicazione che usa Windows Forms. Se viene omesso, i componenti Windows potrebbero non funzionare correttamente.
ja: STAThreadAttribute は、アプリケーションの COM スレッド モデルがシングルスレッド アパートメントであることを示します。この属性は、Windows フォームを使用する任意のアプリケーションのエントリ ポイントに存在する必要があります。省略した場合は、Windows コンポーネントが正常に動作しない可能性があります。
ko: STAThreadAttribute는 이 애플리케이션에 대한 COM 스레딩 모델이 단일 스레드 아파트임을 나타냅니다. 이 특성은 Windows Forms를 사용하는 애플리케이션의 진입점에 있어야 하며 이 특성이 생략된 경우 Windows 구성 요소가 올바르게 작동하지 않을 수 있습니다.
pl: Atrybut STAThreadAttribute wskazuje, że model wątków COM dla aplikacji jest komórką jednowątkową. Ten atrybut musi być obecny w punkcie wejścia każdej aplikacji, która używa modelu Windows Forms. Jeśli zostanie pominięty, komponenty systemu Windows mogą funkcjonować nieprawidłowo.
pt_br: STAThreadAttribute indica que o modelo de threading COM para o aplicativo é um single-threaded apartment. Esse atributo pode estar presente no ponto de entrada de qualquer aplicativo que usa o Windows Forms; se omitido, talvez os componentes do Windows não funcionem corretamente.
ru: STAThreadAttribute указывает, что потоковая модель COM для приложения является однопотоковым подразделением. Этот атрибут должен присутствовать в точке входа любого приложения, использующего Windows Forms. Если он пропущен, компоненты Windows могут работать неправильно.
tr: STAThreadAttribute, uygulama için COM iş parçacığı modelinin tek iş parçacıklı bölme olduğunu gösterir. Bu özniteliğin Windows Forms kullanan tüm uygulamaların giriş noktasında bulunması gerekir; bulunmazsa, Windows bileşenleri doğru çalışmayabilir.
zh_hans: STAThreadAttribute 指示该应用程序的 COM 线程模型是一个单线程单元。使用 Windows 窗体的任何应用程序的入口点上均必须存在此特性；如果没有，则 Windows 组件可能无法正常工作。
zh_hant: STAThreadAttribute 表示應用程式的 COM 執行緒模式是單一執行緒 Apartment。所有使用 Windows Forms 的應用程式之進入點上，都必須要有此屬性，如果省略此屬性，Windows 元件可能會無法正確運作。

# MarkWindowsFormsEntryPointsWithStaThreadMessage
source: Mark Windows Forms entry points with STAThread
cs: Označte vstupní body Windows Forms jako STAThread
de: Windows Forms-Einstiegspunkte mit STAThread markieren
es: Marcar puntos de entrada de Windows Forms con STAThread
fr: Marquez les points d'entrée Windows Forms avec STAThread
it: Contrassegnare i punti di ingresso di Windows Forms con STAThread
ja: Windows フォームのエントリ ポイントを STAThread に設定します
ko: Windows Forms 진입점을 STAThread를 사용하여 표시하세요.
pl: Oznacz punkty wejścia modelu Windows Forms atrybutem STAThread
pt_br: Marcar pontos de entrada do Windows Forms com STAThread
ru: Пометьте точки входа Windows Forms с помощью STAThread
tr: Windows Forms giriş noktalarını STAThread ile işaretleyin
zh_hans: 使用 STAThread 标记 Windows 窗体的入口点
zh_hant: 將 Windows Forms 進入點標記為 STAThread
