Repository: dotnet/sdk
Catalog: src/System.CommandLine.StaticCompletions/Resources/xlf/Strings.*.xlf
Languages: cs, de, fr, it, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# BashShellProvider.HelpDescription
source: Generates a completion script for the Bourne Again SHell (bash).
cs: Vygeneruje skript pro dokončování pro prostředí Bourne Again SHell (bash).
de: Generiert ein Vervollständigungsskript für die Bourne Again SHell (bash).
fr: Génère un script d’achèvement pour le Bourne Again SHell (bash).
it: Genera uno script di completamento per il Bourne Again SHell (bash).
ja: Bourne Again SHell (bash) の完了スクリプトを生成します。
ko: Bourne Again SHell (bash)용 완료 스크립트를 생성합니다.
pt_br: Gera um script de conclusão para o Bourne Again SHell (bash).
ru: Создает сценарий завершения для Bourne Again SHell (bash).
tr: Bourne Again SHell (bash) için bir tamamlama betiği oluşturur.
zh_hans: 生成 Bourne Again SHell (bash)的完成脚本。
zh_hant: 產生 Bourne Again SHell (bash) 的完成指令碼。

# CompletionsCommand.Description
source: Commands for generating and registering completions for supported shells
cs: Příkazy pro generování a registraci dokončení pro podporovaná prostředí
de: Befehle zum Generieren und Registrieren von Vervollständigungen für unterstützte Shells
fr: Commandes pour générer et enregistrer des complétions pour les shells pris en charge.
it: Comandi per la generazione e la registrazione di completamenti per le shell supportate
ja: サポートされているシェルの入力候補を生成および登録するためのコマンドです
ko: 지원되는 셸에 대한 완성을 생성하고 등록하기 위한 명령
pt_br: Comandos para gerar e registrar autocompletar para shells suportados
ru: Команды создания и регистрации завершений для поддерживаемых оболочек
tr: Desteklenen kabuklar için tamamlama oluşturma ve kaydetme komutları
zh_hans: 用于为支持的 shell 生成和注册完成项的命令
zh_hant: 用於為支援的殼層產生及登錄完成的命令

# CompletionsCommand.ShellArgument.Description
source: The shell for which to generate or register completions
cs: Prostředí, pro které se mají vygenerovat nebo zaregistrovat dokončení
de: Die Shell, für die Vervollständigungen generiert oder registriert werden sollen
fr: Interpréteur de commandes pour lequel générer ou enregistrer les complétions
it: La shell per cui generare o registrare i completamenti
ja: 入力候補を生成または登録するシェルです
ko: 완성을 생성하거나 등록할 셸
pt_br: O shell para o qual gerar ou registrar as conclusões
ru: Оболочка, для которой необходимо создать или зарегистрировать завершения
tr: Tamamlamaların oluşturulacağı veya kaydedileceği kabuk
zh_hans: 要为其生成或注册完成项的 shell
zh_hant: 要產生或登錄完成的殼層

# FishShellProvider.HelpDescription
source: Generates a completion script for the Fish shell.
cs: Vygeneruje skript pro dokončování pro prostředí Fish.
de: Generiert ein Vervollständigungsskript für die Fish Shell.
fr: Génère un script d’achèvement pour l’interpréteur de commandes Fish.
it: Genera uno script di completamento per la shell Fish.
ja: Fish シェルの完了スクリプトを生成します。
ko: Fish 셸에 대한 완성 스크립트를 생성합니다.
pt_br: Gera um script de conclusão para o shell Fish.
ru: Создает сценарий завершения для оболочки Fish.
tr: Fish kabuğu için bir tamamlama betiği oluşturur.
zh_hans: 生成 Fish shell 的完成脚本。
zh_hant: 產生 Fish 殼層的完成指令碼。

# GenerateCommand.Description
source: Generate the completion script for a supported shell
cs: Vygenerovat skript pro dokončování pro podporované prostředí
de: Generieren Sie das Vervollständigungsskript für eine unterstützte Shell
fr: Générez le script d’achèvement pour un shell pris en charge
it: Genera lo script di completamento per una shell supportata
ja: サポートされているシェルの入力候補スクリプトを生成します
ko: 지원되는 셸에 대한 완료 스크립트 생성
pt_br: Gere o script de conclusão para um shell suportado
ru: Создать сценарий завершения для поддерживаемой оболочки
tr: Desteklenen bir kabuk için tamamlama betiği oluştur
zh_hans: 生成受支持的 shell 的完成脚本
zh_hant: 為支援的殼層產生完成指令碼

# NuShellShellProvider.HelpDescription
source: Generates a completion script for the NuShell shell.
cs: Vygeneruje skript pro dokončování pro prostředí NuShell.
de: Generiert ein Vervollständigungsskript für die NuShell Shell.
fr: Génère un script d’achèvement pour l’interpréteur de commandes NuShell.
it: Genera uno script di completamento per la shell NuShell.
ja: NuShell シェルの入力候補スクリプトを生成します。
ko: NuShell 셸에 대한 완성 스크립트를 생성합니다.
pt_br: Gera um script de conclusão para o shell NuShell.
ru: Создает сценарий завершения для оболочки NuShell.
tr: NuShell kabuğu için bir tamamlama betiği oluşturur.
zh_hans: 生成 NuShell shell 的完成脚本。
zh_hant: 產生 NuShell 殼層的完成指令碼。

# PowershellShellProvider.HelpDescription
source: Generates a completion script for PowerShell Core. These scripts will not work on Windows PowerShell.
cs: Vygeneruje skript pro dokončování pro PowerShell Core. Tyto skripty nebudou fungovat v prostředí Windows PowerShell.
de: Generiert ein Vervollständigungsskript für PowerShell Core. Diese Skripte funktionieren nicht mit Windows PowerShell.
fr: Génère un script d’achèvement pour PowerShell Core. Ces scripts ne fonctionneront pas sur Windows PowerShell.
it: Genera uno script di completamento per PowerShell Core. Questi script non funzioneranno in Windows PowerShell.
ja: PowerShell Core の完了スクリプトを生成します。これらのスクリプトは、Windows PowerShell では機能しません。
ko: PowerShell Core에 대한 완성 스크립트를 생성합니다. 이러한 스크립트는 Windows PowerShell에서는 작동하지 않습니다.
pt_br: Gera um script de conclusão para PowerShell Core. Esses scripts não funcionarão em Windows PowerShell.
ru: Создает сценарий завершения для PowerShell Core. Эти сценарии не будут работать в Windows PowerShell.
tr: PowerShell Core için bir tamamlama betiği oluşturur. Bu betikler Windows PowerShell'de çalışmaz.
zh_hans: 生成 PowerShell Core 的完成脚本。这些脚本在 Windows PowerShell 上不起作用。
zh_hant: 產生 PowerShell Core 的完成指令碼。這些指令碼將無法在 Windows PowerShell 上運作。

# ShellDiscovery.ShellEnvironmentNotSet
source: Could not determine the shell from the environment - the SHELL environment variable was not set.
cs: Nepovedlo se určit prostředí (shell) z daného prostředí – nebyla nastavena proměnná prostředí SHELL.
de: Die Shell aus der Umgebung konnte nicht ermittelt werden – die SHELL-Umgebungsvariable wurde nicht festgelegt.
fr: Impossible de déterminer l’interpréteur de commandes à partir de l’environnement – la variable d’environnement SHELL n’a pas été définie.
it: Non è possibile determinare la shell dall'ambiente: la variabile di ambiente SHELL non è stata impostata.
ja: 環境からシェルを特定できませんでした - SHELL 環境変数が設定されていませんでした。
ko: 환경에서 셸을 확인할 수 없습니다. SHELL 환경 변수가 설정되지 않았습니다.
pt_br: Não foi possível determinar o shell pelo ambiente - a variável de ambiente SHELL não estava definida.
ru: Не удалось определить оболочку из среды — переменная среды SHELL не задана.
tr: Ortamdan kabuk belirlenemedi - SHELL ortam değişkeni ayarlanmamış.
zh_hans: 无法根据环境确定 shell - 未设置 SHELL 环境变量。
zh_hant: 無法從環境判斷殼層 - 未設定 SHELL 環境變數。

# ShellDiscovery.ShellNotSupported
source: The shell application '{0}' is not supported. The following shells are supported by this application: {1}
cs: Aplikace prostředí {0} není podporována. Tato aplikace podporuje následující prostředí: {1}
de: Die Shell-Anwendung „{0}“ wird nicht unterstützt. Die folgenden Shells werden von dieser Anwendung unterstützt: {1}
fr: L’application « {0} » n’est pas prise en charge. Les shells suivants sont pris en charge par cette application : {1}
it: L'applicazione shell '{0}' non è supportata. Le shell seguenti sono supportate da questa applicazione: {1}
ja: シェル アプリケーション '{0}' はサポートされていません。このアプリケーションでは、次のシェルがサポートされています: {1}
ko: 셸 애플리케이션 '{0}'은(는) 지원되지 않습니다. 이 애플리케이션에서 지원되는 셸은 다음과 같습니다. {1}
pt_br: O aplicativo de shell '{0}' não é suportado. Os seguintes shells são suportados por este aplicativo: {1}
ru: Приложение оболочки "{0}" не поддерживается. Это приложение поддерживает следующие оболочки: {1}
tr: '{0}' kabuk uygulaması desteklenmiyor. Bu uygulama tarafından desteklenen kabuklar: {1}
zh_hans: 不支持 shell 应用程序“{0}”。此应用程序支持以下 shell: {1}
zh_hant: 不支援殼層應用程式 '{0}'。此應用程式支援下列殼層: {1}

# ZshShellProvider.HelpDescription
source: Generates a completion script for the Zsh shell.
cs: Vygeneruje skript pro dokončování pro prostředí Zsh.
de: Generiert ein Vervollständigungsskript für die Zsh Shell.
fr: Génère un script d’achèvement pour l’interpréteur de commandes Zsh.
it: Genera uno script di completamento per la shell Zsh.
ja: Zsh シェルの入力候補スクリプトを生成します。
ko: Zsh 셸에 대한 완성 스크립트를 생성합니다.
pt_br: Gera um script de conclusão para o shell Zsh.
ru: Создает сценарий завершения для оболочки Zsh.
tr: Zsh kabuğu için bir tamamlama betiği oluşturur.
zh_hans: 生成 Zsh shell 的完成脚本。
zh_hant: 產生 Zsh 殼層的完成指令碼。
