Repository: dotnet/sdk
Catalog: src/Tasks/Common/Resources/xlf/Strings.*.xlf
Languages: it, pl, tr

# UnsupportedRuntimeIdentifier
source: NETSDK1056: Project is targeting runtime '{0}' but did not resolve any runtime-specific packages. This runtime may not be supported by the target framework.
it: NETSDK1056: il progetto è destinato al runtime '{0}' ma non ha risolto pacchetti specifici del runtime. È possibile che questo runtime non sia supportato dal framework di destinazione.
pl: NETSDK1056: Projekt jest przeznaczony dla środowiska uruchomieniowego „{0}”, ale nie rozpoznaje żadnych pakietów specyficznych dla tego środowiska. To środowisko uruchomieniowe nie może być obsługiwane przez platformę docelową.
tr: NETSDK1056: Proje '{0}' çalışma zamanını hedefliyor ancak çalışma zamanına özgü herhangi bir paketi çözümlemedi. Bu çalışma zamanı hedef çerçeve tarafından desteklenmiyor olabilir.

# UnsupportedSDKVersionForNetStandard20
source: NETSDK1050: The version of Microsoft.NET.Sdk used by this project is insufficient to support references to libraries targeting .NET Standard 1.5 or higher. Please install version 2.0 or higher of the .NET Core SDK.
it: NETSDK1050: la versione di Microsoft.NET.Sdk usata da questo progetto non è sufficiente per supportare i riferimenti alle librerie destinate a .NET Standard 1.5 o versione successiva. Installare la versione 2.0 o successiva di .NET Core SDK.
pl: NETSDK1050: Używana przez ten projekt wersja zestawu Microsoft.NET.Sdk jest niewystarczająca do zapewnienia obsługi odwołań do bibliotek przeznaczonych dla platformy .NET Standard 1.5 lub nowszych. Zainstaluj zestaw .NET Core SDK w wersji co najmniej 2.0.
tr: NETSDK1050: Bu proje tarafından kullanılan Microsoft.NET.Sdk, .NET Standard 1.5 veya üzeri kitaplıkları desteklemek için yeterli değil. Lütfen .NET Core SDK 2.0 veya sonraki bir sürümü yükleyin.

# UnsupportedTargetFrameworkVersion
source: NETSDK1045: The current .NET SDK does not support targeting {0} {1}. Either target {0} {2} or lower, or use a version of the .NET SDK that supports {0} {1}. Download the .NET SDK from https://aka.ms/dotnet/download
tr: NETSDK1045: Geçerli .NET SDK’sı {0} {1} sürümünü hedeflemeyi desteklemiyor. {0} {2} veya daha düşük bir sürümü hedefleyin ya da {0} {1} destekleyen bir .NET SDK’sı kullanın. .NET SDK’yı https://aka.ms/dotnet/download sayfasından indirebilirsiniz

# UnsupportedTargetPlatformIdentifier
source: NETSDK1139: The target platform identifier {0} was not recognized.
it: NETSDK1139: l'identificatore di piattaforma di destinazione {0} non è stato riconosciuto.
tr: NETSDK1139: {0} hedef platform tanımlayıcısı tanınmadı.

# UseArtifactsOutputRequiresDirectoryBuildProps
source: NETSDK1200: If UseArtifactsPath is set to true and ArtifactsPath is not set, there must be a Directory.Build.props file in order to determine where the artifacts folder should be located.
tr: NETSDK1200: UseArtifactsPath true olarak ayarlanırsa ve ArtifactsPath ayarlanmazsa, yapıtlar klasörünün nerede bulunacağını belirlemek için bir Directory.Build.props dosyası olmalıdır.

# UnsupportedVisualStudioVersion
source: NETSDK1209: The current Visual Studio version does not support targeting {0} {1}. Either target {0} {2} or lower, or use Visual Studio version {3} or higher
tr: NETSDK1209: Geçerli Visual Studio sürümü {0} {1} sürümünü hedeflemeyi desteklemiyor. {0} {2} veya daha düşük bir sürümü hedefleyin ya da Visual Studio sürümü {3} veya daha üzerini kullanın

# UnsupportedTargetPlatformIdentifierWithWorkloadsDisabled
source: NETSDK1208: The target platform identifier {0} was not recognized. This is because MSBuildEnableWorkloadResolver is set to false which disables .NET SDK Workloads which is required for this identifer. Unset this environment variable or MSBuild property to enable workloads.
tr: NETSDK1208: Hedef {0} platform tanımlayıcısı tanınmadı. Bunun nedeni, MSBuildEnableWorkloadResolver'ın false olarak ayarlanmasıdır ve bu işlem bu tanımlayıcı için gerekli olan .NET SDK İş Yüklerini devre dışı bırakır. İş yüklerini etkinleştirmek için bu ortam değişkeninin veya MSBuild özelliğinin ayarını kaldırın.

# UseWpfOrUseWindowsFormsRequiresWindowsDesktopFramework
source: NETSDK1107: Microsoft.NET.Sdk.WindowsDesktop is required to build Windows desktop applications. 'UseWpf' and 'UseWindowsForms' are not supported by the current SDK.
it: NETSDK1107: per compilare applicazioni desktop di Windows, è necessario Microsoft.NET.Sdk.WindowsDesktop. 'UseWpf' e 'UseWindowsForms' non sono supportati dall'SDK corrente.
tr: NETSDK1107: Windows Masaüstü uygulamalarını derlemek için Microsoft.NET.Sdk.WindowsDesktop gereklidir. 'UseWpf' ve 'UseWindowsForms' geçerli SDK tarafından desteklenmiyor.

# UsingPreviewSdk
source: NETSDK1057: You are using a preview version of .NET. See: https://aka.ms/dotnet-support-policy
tr: NETSDK1057: Bir .NET önizleme sürümü kullanıyorsunuz. Bkz. https://aka.ms/dotnet-support-policy

# UsingPreviewUseUwpFeature
source: NETSDK1219: UseUwp and all associated functionality are currently experimental and not officially supported.
tr: NETSDK1219: UseUwp ve ilişkili tüm işlevler şu anda deneyseldir ve resmi olarak desteklenmez.

# WinMDObjNotSupportedOnTargetFramework
source: NETSDK1131: Producing a managed Windows Metadata component with WinMDExp is not supported when targeting {0}.
it: NETSDK1131: la produzione di un componente Metadati Windows gestito con WinMDExp non è supportata quando la destinazione è {0}.
tr: NETSDK1131: {0} hedeflenirken, WinMDExp ile yönetilen bir Windows Meta Veri bileşeninin üretilmesi desteklenmiyor.

# WinMDReferenceNotSupportedOnTargetFramework
source: NETSDK1130: {1} cannot be referenced. Referencing a Windows Metadata component directly when targeting .NET 5 or higher is not supported. For more information, see https://aka.ms/netsdk1130
it: NETSDK1130: non è possibile fare riferimento a {1}. Il riferimento diretto a un componente di Metadati Windows quando la destinazione è .NET 5 o versione successiva non è supportato. Per altre informazioni, vedere https://aka.ms/netsdk1130
tr: NETSDK1130: {1} öğesine başvurulamaz. .NET 5 veya üzeri hedeflendiğinde doğrudan bir Windows Meta veriler bileşenine başvurma desteklenmez. Daha fazla bilgi için bkz. https://aka.ms/netsdk1130

# WinMDTransitiveReferenceNotSupported
source: NETSDK1149: {0} cannot be referenced because it uses built-in support for WinRT, which is no longer supported in .NET 5 and higher. An updated version of the component supporting .NET 5 is needed. For more information, see https://aka.ms/netsdk1149
it: NETSDK1149: non è possibile fare riferimento a {0} perché usa il supporto incorporato per WinRT, che non è più supportato in .NET 5 e versioni successive. È necessaria una versione aggiornata del componente che supporta .NET 5. Per altre informazioni, vedere https://aka.ms/netsdk1149
tr: NETSDK1149: {0} başvurusu yapılamaz çünkü .NET 5 ve üzeri sürümlerde artık desteklenmeyen WinRT için yerleşik destek kullanıyor. .NET 5’i destekleyen bir bileşenin güncelleştirilmiş sürümü gereklidir. Daha fazla bilgi için bkz. https://aka.ms/netsdk1149

# WindowsDesktopFrameworkRequiresUseWpfOrUseWindowsForms
source: NETSDK1106: Microsoft.NET.Sdk.WindowsDesktop requires 'UseWpf' or 'UseWindowsForms' to be set to 'true'
it: NETSDK1106: con Microsoft.NET.Sdk.WindowsDesktop 'UseWpf' o 'UseWindowsForms' deve essere impostato su 'true'
tr: NETSDK1106: Microsoft.NET.Sdk.WindowsDesktop için 'UseWpf' veya 'UseWindowsForms' değerinin 'true' olarak ayarlanması gerekiyor

# WindowsDesktopFrameworkRequiresVersion30
source: NETSDK1105: Windows desktop applications are only supported on .NET Core 3.0 or higher.
it: NETSDK1105: le applicazioni desktop di Windows sono supportate solo in .NET Core 3.0 o versioni successive.
tr: NETSDK1105: Windows Masaüstü uygulamaları yalnızca .NET Core 3.0 veya üzeri sürümlerde desteklenir.

# WindowsDesktopFrameworkRequiresWindows
source: NETSDK1100: To build a project targeting Windows on this operating system, set the EnableWindowsTargeting property to true.
it: NETSDK1100: per compilare un progetto destinato a Windows in questo sistema operativo, impostare la proprietà EnableWindowsTargeting su true.
tr: NETSDK1100: Bu işletim sisteminde Windows'u hedefleyen bir proje derlemek için EnableWindowsTargeting özelliğini true olarak ayarlayın.

# WindowsDesktopTargetPlatformMustBeWindows
source: NETSDK1136: The target platform must be set to Windows (usually by including '-windows' in the TargetFramework property) when using Windows Forms or WPF, or referencing projects or packages that do so.
it: NETSDK1136: la piattaforma di destinazione deve essere impostata su Windows, in genere includendo '-windows ' nella proprietà TargetFramework, quando si usa Windows Forms o WPF oppure si fa riferimento a progetti o pacchetti che lo usano.
tr: NETSDK1136: Hedef platform, Windows Forms veya WPF kullanılırken veya kullanan projelere veya paketlere başvurulurken Windows olarak ayarlanmalıdır (genellikle TargetFramework özelliğine '-windows' öğesini dahil ederek).

# WindowsSDKVersionConflicts
source: NETSDK1148: A referenced assembly was compiled using a newer version of Microsoft.Windows.SDK.NET.dll. Please update to a newer .NET SDK in order to reference this assembly.
it: NETSDK1148: un assembly di riferimento è stato compilato con una versione più recente di Microsoft.Windows.SDK.NET.dll. Eseguire l'aggiornamento a un SDK .NET più recente per fare riferimento a questo assembly.
tr: NETSDK1148: Başvurulan bütünleştirilmiş kod, Microsoft.Windows.SDK.NET.dll'nin daha yeni bir sürümü kullanılarak derlendi. Bu bütünleştirilmiş koda başvurmak için lütfen daha yeni bir .NET SDK'ya güncelleştirin.

# WindowsSDKXamlInvalidTfm
source: NETSDK1220: UseUwp and all associated functionality require using a TFM of 'net8.0-windows' or greater.
tr: NETSDK1220: UseUwp ve ilişkili tüm işlevler 'net8.0-windows' veya daha yüksek bir TFM gerektirir.

# WindowsSDKXamlMissingUseUwpProperty
source: NETSDK1218: This project has a transitive dependency on the full Windows SDK projections (including Windows.UI.Xaml.* types), but does not specify the UseUwp property. That must be enabled to ensure that .NET types are projected and marshalled correctly for interop scenarios with these XAML types.
tr: NETSDK1218: Bu projenin tam Windows SDK projeksiyonları (Windows.UI.Xaml.* türleri dahil) üzerinde geçişli bir bağımlılığı var ancak UseUwp özelliğini belirtmiyor. Bu XAML türlerini içeren birlikte çalışma senaryoları için .NET türlerinin doğru şekilde projelendiğinden ve sıraya alındığından emin olmak için bu etkinleştirilmelidir.

# WorkloadIsEol
source: NETSDK1202: The workload '{0}' is out of support and will not receive security updates in the future. Please refer to {1} for more information about the support policy.
tr: NETSDK1202: '{0}' iş yükü destek kapsamı dışında olduğu için gelecekte güvenlik güncelleştirmeleri almayacak. Destek ilkesi hakkında daha fazla bilgi edinmek için lütfen şuraya bakın: {1}.

# WorkloadNotAvailable
source: NETSDK1178: The project depends on the following workload packs that do not exist in any of the workloads available in this installation: {0} You may need to build the project on another operating system or architecture, or update the .NET SDK.
it: NETSDK1178: il progetto dipende dai pacchetti di carico di lavoro seguenti che non esistono in nessuno dei carichi di lavoro disponibili in questa installazione: {0} Potrebbe essere necessario compilare il progetto in un altro sistema operativo o architettura oppure aggiornare .NET SDK.
tr: NETSDK1178: Proje, bu yüklemede kullanılabilen iş yüklerinin hiçbirinde bulunmayan şu iş yükü paketlerine bağımlıdır: {0} Projeyi başka bir işletim sisteminde veya mimaride oluşturmanız veya .NET SDK'sını güncelleştirmeniz gerekebilir.

# WorkloadNotInstalled
source: NETSDK1147: To build this project, the following workloads must be installed: {0} To install these workloads, run the following command: dotnet workload restore
it: NETSDK1147: per compilare questo progetto devono essere installati i seguenti carichi di lavoro: {0} Per installare questi carichi di lavoro, eseguire il seguente comando: dotnet workload restore
tr: NETSDK1147: Bu projeyi oluşturmak için şu iş yüklerinin yüklenmesi gerekiyor: {0} Bu iş yüklerini yüklemek için şu komutu çalıştırın: dotnet workload restore

# AotNoValidRuntimePackageError
source: NETSDK1183: Unable to optimize assemblies for ahead-of-time compilation: a valid runtime package was not found. Either set the PublishAot property to false, or use a supported runtime identifier when publishing. When targeting .NET 7 or higher, make sure to restore packages with the PublishAot property set to true.
it: NETSDK1183: non è possibile ottimizzare gli assembly per la compilazione Ahead Of Time perché non è stato trovato alcun pacchetto di runtime valido. Impostare la proprietà PublishAot su false oppure usare un identificatore di runtime supportato durante la pubblicazione. Quando si usa .NET 7 o versioni successive, assicurarsi di ripristinare i pacchetti con la proprietà PublishAot impostata su true.

# CannotEmbedClsidMapIntoComhost
source: NETSDK1092: The CLSIDMap cannot be embedded on the COM host because adding resources requires that the build be performed on Windows (excluding Nano Server).
it: NETSDK1092: non è possibile incorporare l'elemento CLSIDMap nell'host COM perché per aggiungere risorse è necessario eseguire la compilazione in Windows (escluso Nano Server).
pl: NETSDK1092: Nie można osadzić elementu CLSIDMap w ramach hosta modelu COM, ponieważ dodawanie zasobów wymaga, aby kompilacja została wykonana w systemie Windows (z wyjątkiem systemu Nano Server).

# ILLinkFailed
source: NETSDK1144: Optimizing assemblies for size failed. Optimization can be disabled by setting the PublishTrimmed property to false.
it: NETSDK1144: l'ottimizzazione degli assembly per le dimensioni non è riuscita. È possibile disabilitare l'ottimizzazione impostando la proprietà PublishTrimmed su false.

# Net6NotCompatibleWithDev16
source: NETSDK1182: Targeting .NET 6.0 or higher in Visual Studio 2019 is not supported.
it: NETSDK1182: la destinazione .NET 6.0 o versione successiva in Visual Studio 2019 non è supportata.

# Net7NotCompatibleWithDev173
source: NETSDK1192: Targeting .NET 7.0 or higher in Visual Studio 2022 17.3 is not supported.
it: NETSDK1192: la destinazione .NET 7.0 o versione successiva in Visual Studio 2022 17.3 non è supportata.

# RuntimeIdentifierNotRecognized
source: NETSDK1083: The specified RuntimeIdentifier '{0}' is not recognized.
it: NETSDK1083: l'elemento RuntimeIdentifier '{0}' specificato non è riconosciuto.
pl: NETSDK1083: Wybrany element RuntimeIdentifier „{0}” nie został rozpoznany.

# UnsupportedTargetFrameworkVersion
source: NETSDK1045: The current .NET SDK does not support targeting {0} {1}. Either target {0} {2} or lower, or use a version of the .NET SDK that supports {0} {1}.
it: NETSDK1045: la versione corrente di .NET SDK non supporta {0} {1} come destinazione. Impostare come destinazione {0} {2} o una versione precedente oppure usare una versione di .NET SDK che supporta {0} {1}.
pl: NETSDK1045: Bieżący zestaw .NET SDK nie obsługuje używania środowiska docelowego {0} {1}. Użyj jako środowiska docelowego wersji {0} {2} lub starszej albo użyj wersji zestawu .NET SDK obsługującej środowisko {0} {1}.

# UsingPreviewSdk_Info
source: NETSDK1057: You are using a preview version of .NET. See: https://aka.ms/dotnet-support-policy
it: NETSDK1057: si sta usando una versione in anteprima di .NET. Vedere https://aka.ms/dotnet-support-policy

# CannotHaveSelfContainedWithoutRuntimeIdentifier
source: NETSDK1031: It is not supported to build or publish a self-contained application without specifying a RuntimeIdentifier. Please either specify a RuntimeIdentifier or set SelfContained to false.
pl: NETSDK1031: Kompilowanie i publikowanie aplikacji autonomicznej bez określania elementu RuntimeIdentifier nie jest obsługiwane. Określ element RuntimeIdentifier lub ustaw wartość false dla elementu SelfContained.

# CannotHaveSingleFileWithoutRuntimeIdentifier
source: NETSDK1097: It is not supported to publish an application to a single-file without specifying a RuntimeIdentifier. Please either specify a RuntimeIdentifier or set PublishSingleFile to false.
pl: NETSDK1097: Publikowanie aplikacji w pojedynczym pliku bez określania elementu RuntimeIdentifier nie jest obsługiwane. Określ element RuntimeIdentifier lub ustaw wartość false dla elementu PublishSingleFile.

# CannotHaveSingleFileWithoutAppHost
source: NETSDK1098: Applications published to a single-file are required to use the application host. Please either set PublishSingleFile to false or set UseAppHost to true.
pl: NETSDK1098: Aplikacje opublikowane w pojedynczym pliku muszą używać hosta aplikacji. Ustaw element PublishSingleFile na wartość false lub ustaw element UseAppHost na wartość true.

# ProjectContainsObsoleteDotNetCliTool
source: NETSDK1059: The tool '{0}' is now included in the .NET Core SDK. Information on resolving this warning is available at (https://aka.ms/dotnetclitools-in-box).
pl: NETSDK1059: Narzędzie „{0}” jest teraz dołączone do zestawu .NET Core SDK. Informacje dotyczące sposobu rozwiązania problemu wskazanego w ostrzeżeniu można znaleźć na stronie https://aka.ms/dotnetclitools-in-box.

# ProjectToolOnlySupportTFMLowerThanNetcoreapp22
source: NETSDK1093: NETSDK1093: Project tools (DotnetCliTool) only support targeting .NET Core 2.2 and lower.
pl: NETSDK1093: Narzędzia projektu (DotnetCliTool) obsługują tylko ukierunkowanie na program .NET Core w wersji 2.2 lub niższej.

# ReadyToRunNoValidRuntimePackageError
source: NETSDK1094: Unable to optimize assemblies for performance: a valid runtime package was not found. Either set the PublishReadyToRun property to false, or use a supported runtime identifier when publishing.
pl: NETSDK1094: Nie można zoptymalizować zestawów pod kątem wydajności — nie odnaleziono prawidłowego pakietu środowiska wykonawczego. Ustaw właściwość PublishReadyToRun na wartość false lub użyj obsługiwanego identyfikatora środowiska uruchomieniowego podczas publikowania.

# WindowsDesktopFrameworkRequiresWindows
source: NETSDK1100: Windows is required to build Windows desktop applications.
pl: NETSDK1100: Do tworzenia aplikacji klasycznych systemu Windows wymagany jest system Windows.
