Repository: dotnet/sdk
Catalog: src/Tasks/Common/Resources/xlf/Strings.*.xlf
Languages: it, pl, tr

# AddResourceWithNonIntegerResource
source: NETSDK1076: AddResource can only be used with integer resource types.
it: NETSDK1076: è possibile usare AddResource solo con tipi di risorsa integer.
pl: NETSDK1076: Element AddResource może być używany tylko z typami zasobów o wartości całkowitej.
tr: NETSDK1076: AddResource yalnızca tamsayı kaynak türleri ile kullanılabilir.

# AotNotSupported
source: NETSDK1196: The SDK does not support ahead-of-time compilation. Set the PublishAot property to false.
it: NETSDK1196: l'SDK non supporta la compilazione in anticipo. Imposta la proprietà PublishAot su false.
tr: NETSDK1196: SDK önceden derlemeyi desteklemez. PublishAot özelliğini false olarak ayarlayın.

# AotUnsupportedHostRuntimeIdentifier
source: NETSDK1204: Ahead-of-time compilation is not supported on the current platform '{0}'.
tr: NETSDK1204: Geçerli '{0}' platformunda önceden derleme desteklenmiyor.

# AotUnsupportedTargetFramework
source: NETSDK1207: Ahead-of-time compilation is not supported for the target framework.
tr: NETSDK1207: Hedef altyapı için önceden derleme desteklenmiyor.

# AotUnsupportedTargetRuntimeIdentifier
source: NETSDK1203: Ahead-of-time compilation is not supported for the target runtime identifier '{0}'.
tr: NETSDK1203: Önceden derleme '{0}' hedef çalışma zamanı tanımlayıcısı için desteklenmiyor.

# AppConfigRequiresRootConfiguration
source: NETSDK1070: The application configuration file must have root configuration element.
it: NETSDK1070: il file di configurazione dell'applicazione deve avere un elemento di configurazione radice.
pl: NETSDK1070: Plik konfiguracji aplikacji musi mieć główny element konfiguracji.
tr: NETSDK1070: Uygulama yapılandırma dosyasının kök yapılandırma öğesi olmalıdır.

# AppHostCreationFailedWithRetry
source: NETSDK1113: Failed to create apphost (attempt {0} out of {1}): {2}
it: NETSDK1113: non è stato possibile creare apphost (tentativo {0} di {1}): {2}
tr: NETSDK1113: apphost oluşturulamadı ({1} deneme içinden {0}. deneme): {2}

# AppHostCustomizationRequiresWindowsHostWarning
source: NETSDK1074: The application host executable will not be customized because adding resources requires that the build be performed on Windows (excluding Nano Server).
it: NETSDK1074: l'eseguibile dell'host applicazione non verrà personalizzato perché per aggiungere risorse è necessario eseguire la compilazione in Windows (escluso Nano Server).
pl: NETSDK1074: Plik wykonywalny hosta aplikacji nie zostanie dostosowany, ponieważ dodawanie zasobów wymaga, aby kompilacja została wykonana w systemie Windows (z wyjątkiem systemu Nano Server).
tr: NETSDK1074: Kaynak eklemek derleme işleminin (Nano Server hariç) Windows'da gerçekleştirilmesini gerektirdiğinden uygulama konağının yürütülebilir dosyası özelleştirilmeyecek.

# AppHostHasBeenModified
source: NETSDK1029: Unable to use '{0}' as application host executable as it does not contain the expected placeholder byte sequence '{1}' that would mark where the application name would be written.
it: NETSDK1029: non è possibile usare '{0}' come eseguibile host dell'applicazione perché non contiene la sequenza di byte segnaposto prevista '{1}' che indica dove verrà scritto il nome dell'applicazione.
pl: NETSDK1029: Nie można użyć elementu „{0}” jako pliku wykonywalnego hosta aplikacji, ponieważ nie zawiera on oczekiwanej sekwencji bajtów symbolu zastępczego „{1}”, która wskazuje lokalizację zapisu nazwy aplikacji.
tr: NETSDK1029: '{0}', uygulama adının yazılacağı yeri işaretlemesi için beklenen yer tutucu bayt dizisini ('{1}') içermediğinden uygulama konak yürütülebilir dosyası olarak kullanılamıyor.

# AppHostNotWindows
source: NETSDK1078: Unable to use '{0}' as application host executable because it's not a Windows PE file.
it: NETSDK1078: non è possibile usare '{0}' come eseguibile dell'host applicazione perché non è un file di Windows PE.
pl: NETSDK1078: Nie można użyć pliku „{0}” jako pliku wykonywalnego hosta aplikacji, ponieważ nie jest to plik systemu Windows PE.
tr: NETSDK1078: '{0}', bir Windows PE dosyası olmadığından uygulama konağının yürütülebilir dosyası olarak kullanılamıyor.

# AppHostNotWindowsCLI
source: NETSDK1072: Unable to use '{0}' as application host executable because it's not a Windows executable for the CUI (Console) subsystem.
it: NETSDK1072: non è possibile usare '{0}' come eseguibile dell'host applicazione perché non è un eseguibile Windows per il sottosistema CUI (Console).
pl: NETSDK1072: Nie można użyć pliku „{0}” jako pliku wykonywalnego hosta aplikacji, ponieważ nie jest to plik wykonywalny systemu Windows dla podsystemu CUI (konsola).
tr: NETSDK1072: '{0}', CUI (Konsol) alt sistemi için yürütülebilir bir Windows dosyası olmadığından uygulama konağının yürütülebilir dosyası olarak kullanılamıyor.

# AppHostSigningFailed
source: NETSDK1177: Failed to sign apphost with error code {1}: {0}
it: NETSDK1177: impossibile firmare apphost con codice di errore {1}: {0}
tr: NETSDK1177: apphost şu hata koduyla imzalanamadı: {1}: {0}

# ArtifactsPathCannotBeSetInProject
source: NETSDK1199: The ArtifactsPath and UseArtifactsOutput properties cannot be set in a project file, due to MSBuild ordering constraints. They must be set in a Directory.Build.props file or from the command line. See https://aka.ms/netsdk1199 for more information.
tr: NETSDK1199: ArtifactsPath ve UseArtifactsOutput özellikleri, MSBuild sıralama kısıtlamaları nedeniyle bir proje dosyasında ayarlanamaz. Bir Directory.Build.props dosyasında veya komut satırından ayarlanmalıdır. Daha fazla için bkz. https://aka.ms/netsdk1199

# AspNetCoreAllNotSupported
source: NETSDK1079: The Microsoft.AspNetCore.All package is not supported when targeting .NET Core 3.0 or higher. A FrameworkReference to Microsoft.AspNetCore.App should be used instead, and will be implicitly included by Microsoft.NET.Sdk.Web.
it: NETSDK1079: il pacchetto Microsoft.AspNetCore.All non è supportato quando la destinazione è .NET Core 3.0 o versione successiva. È necessario un elemento FrameworkReference per Microsoft.AspNetCore.App, che verrà incluso in modo implicito da Microsoft.NET.Sdk.Web.
pl: NETSDK1079: Pakiet Microsoft.AspNetCore.All nie jest obsługiwany w przypadku ukierunkowania na program .NET Core w wersji 3.0 lub wyższej. Zamiast tego powinien zostać użyty element FrameworkReference dla pakietu Microsoft.AspNetCore.App, który zostanie niejawnie uwzględniony przez pakiet Microsoft.NET.Sdk.Web.
tr: NETSDK1079: Microsoft.AspNetCore.All paketi .NET Core 3.0 veya üzeri hedeflenirken desteklenmez. Bunun yerine Microsoft.AspNetCore.App için bir FrameworkReference kullanılmalıdır. Bu, Microsoft.NET.Sdk.Web tarafından örtük olarak eklenecektir.

# AspNetCoreUsesFrameworkReference
source: NETSDK1080: A PackageReference to Microsoft.AspNetCore.App is not necessary when targeting .NET Core 3.0 or higher. If Microsoft.NET.Sdk.Web is used, the shared framework will be referenced automatically. Otherwise, the PackageReference should be replaced with a FrameworkReference.
it: NETSDK1080: non è necessario alcun elemento PackageReference per Microsoft.AspNetCore.App quando la destinazione è .NET Core 3.0 o versione successiva. Se si usa Microsoft.NET.Sdk.Web, il riferimento al framework condiviso verrà inserito automaticamente; in caso contrario, l'elemento PackageReference deve essere sostituito da un elemento FrameworkReference.
pl: NETSDK1080: Element PackageReference dla pakietu Microsoft.AspNetCore.App nie jest konieczny w przypadku ukierunkowania na program .NET Core w wersji 3.0 lub wyższej. Jeśli używany jest pakiet Microsoft.NET.Sdk.Web, odwołanie do udostępnionej struktury zostanie utworzone automatycznie. W przeciwnym razie element PackageReference powinien zostać zastąpiony elementem FrameworkReference.
tr: NETSDK1080: .NET Core 3.0 veya üzeri hedeflenirken Microsoft.AspNetCore.App için bir PackageReference gerekmez. Microsoft.NET.Sdk.Web kullanılırsa, paylaşılan çerçeveye otomatik olarak başvurulur. Aksi halde PackageReference FrameworkReference ile değiştirilmelidir.

# AssetPreprocessorMustBeConfigured
source: NETSDK1017: Asset preprocessor must be configured before assets are processed.
it: NETSDK1017: prima di elaborare le risorse, è necessario configurare il preprocessore di risorse.
pl: NETSDK1017: Preprocesor zasobów musi być skonfigurowany przed przetworzeniem zasobów.
tr: NETSDK1017: Varlıkların işlenebilmesi için varlık ön işlemcisi yapılandırılmalıdır.

# AssetsFileMissingRuntimeIdentifier
source: NETSDK1047: Assets file '{0}' doesn't have a target for '{1}'. Ensure that restore has run and that you have included '{2}' in the TargetFrameworks for your project. You may also need to include '{3}' in your project's RuntimeIdentifiers.
it: NETSDK1047: il file di risorse '{0}' non contiene una destinazione per '{1}'. Assicurarsi che il ripristino sia stato eseguito e che '{2}' sia stato incluso negli elementi TargetFramework del progetto. Potrebbe anche essere necessario includere '{3}' negli elementi RuntimeIdentifier del progetto.
pl: NETSDK1047: Plik zasobów „{0}” nie ma obiektu docelowego dla „{1}”. Upewnij się, że uruchomiono przywracanie i że w elemencie TargetFrameworks dla projektu uwzględniono element „{2}”. Może być też konieczne uwzględnienie elementu „{3}” w obszarze RuntimeIdentifiers projektu.
tr: NETSDK1047: '{0}' varlık dosyasında '{1}' için hedef yok. Geri yüklemenin çalıştırıldığından ve '{2}' öğesinin projeniz için TargetFrameworks’e eklendiğinden emin olun. Ayrıca '{3}' öğesini projenizin RuntimeIdentifiers’ına eklemeniz gerekebilir.

# AssetsFileMissingTarget
source: NETSDK1005: Assets file '{0}' doesn't have a target for '{1}'. Ensure that restore has run and that you have included '{2}' in the TargetFrameworks for your project.
it: NETSDK1005: il file di risorse '{0}' non contiene una destinazione per '{1}'. Assicurarsi che il ripristino sia stato eseguito e che '{2}' sia stato incluso negli elementi TargetFramework del progetto.
pl: NETSDK1005: Plik zasobów „{0}” nie ma obiektu docelowego dla „{1}”. Upewnij się, że uruchomiono przywracanie i że w elemencie TargetFrameworks dla projektu uwzględniono element „{2}”.
tr: NETSDK1005: '{0}' varlık dosyasında '{1}' için hedef yok. Geri yüklemenin çalıştırıldığından ve '{2}' öğesinin projeniz için TargetFrameworks’e eklendiğinden emin olun.

# AssetsFileNotFound
source: NETSDK1004: Assets file '{0}' not found. Run a NuGet package restore to generate this file.
it: NETSDK1004: il file di risorse '{0}' non è stato trovato. Per generare questo file, eseguire un ripristino del pacchetto NuGet.
pl: NETSDK1004: Nie odnaleziono pliku zasobów „{0}”. Uruchom przywracanie pakietu NuGet, aby wygenerować ten plik.
tr: NETSDK1004: '{0}' varlık dosyası bulunamadı. Bu dosyayı oluşturmak için, NuGet paketi geri yükleme işlemi gerçekleştirin.

# AssetsFileNotSet
source: NETSDK1063: The path to the project assets file was not set. Run a NuGet package restore to generate this file.
it: NETSDK1063: il percorso del file di risorse del progetto non è stato impostato. Per generare questo file, eseguire un ripristino del pacchetto NuGet.
pl: NETSDK1063: Nie ustawiono ścieżki do pliku zasobów projektu. Uruchom przywracanie pakietu NuGet, aby wygenerować ten plik.
tr: NETSDK1063: Proje varlıkları dosyasının yolu ayarlanmadı. Bu dosyayı oluşturmak için, NuGet paketi geri yükleme işlemi gerçekleştirin.

# AssetsFilePathNotRooted
source: NETSDK1006: Assets file path '{0}' is not rooted. Only full paths are supported.
it: NETSDK1006: il percorso dei file di risorse '{0}' non contiene una radice. Sono supportati solo percorsi completi.
pl: NETSDK1006: Ścieżka pliku zasobów „{0}” nie prowadzi do katalogu głównego. Tylko pełne ścieżki są obsługiwane.
tr: NETSDK1006: '{0}' varlık dosyası yolunun kökü belirtilmemiş. Yalnızca tam yollar desteklenir.

# AtLeastOneTargetFrameworkMustBeSpecified
source: NETSDK1001: At least one possible target framework must be specified.
it: NETSDK1001: è necessario specificare almeno un framework di destinazione possibile.
pl: NETSDK1001: Należy określić co najmniej jedną możliwą platformę docelową.
tr: NETSDK1001: En az bir olası hedef çerçeve belirtilmelidir.

# CannotDirectlyReferenceMicrosoftNetCompilersToolsetFramework
source: NETSDK1205: The Microsoft.Net.Compilers.Toolset.Framework package should not be set directly. Set the property 'BuildWithNetFrameworkHostedCompiler' to 'true' instead if you need it.
tr: NETSDK1205: Microsoft.Net.Compilers.Toolset.Framework paketi doğrudan ayarlanamaz. Gerekirse bunun yerine, 'BuildWithNetFrameworkHostedCompiler' özelliğini 'true' olarak ayarlayın.

# CannotFindApphostForRid
source: NETSDK1065: Cannot find app host for {0}. {0} could be an invalid runtime identifier (RID). For more information about RID, see https://aka.ms/rid-catalog.
it: NETSDK1065: non è possibile trovare l'host delle app per {0}. {0} potrebbe essere un identificatore di runtime (RID) non valido. Per altre informazioni sul RID, vedere https://aka.ms/rid-catalog.
pl: NETSDK1065: Nie można odnaleźć hosta aplikacji dla elementu {0}. {0} może być nieprawidłowym identyfikatorem środowiska uruchomieniowego. Aby uzyskać więcej informacji na temat identyfikatora środowiska uruchomieniowego, zobacz https://aka.ms/rid-catalog.
tr: NETSDK1065: {0} için uygulama konağı bulunamıyor. {0} geçersiz bir çalışma zamanı tanımlayıcısı (RID) olabilir. RID hakkında daha fazla bilgi için bkz. https://aka.ms/rid-catalog.

# CannotFindComhost
source: NETSDK1091: Unable to find a .NET Core COM host. The .NET Core COM host is only available on .NET Core 3.0 or higher when targeting Windows.
it: NETSDK1091: non è possibile trovare un host COM .NET Core. L'host COM .NET Core è disponibile solo in .NET Core 3.0 o versioni successive quando è destinato a Windows.
pl: NETSDK1091: Nie można odnaleźć hosta COM programu .NET Core. Host COM programu .NET Core jest dostępny tylko w programie .NET Core w wersji 3.0 lub wyższej w przypadku ukierunkowania na system Windows.
tr: NETSDK1091: Bir .NET Core COM konağı bulunamıyor. .NET Core COM konağı, Windows hedeflenirken yalnızca .NET Core 3.0 veya üzerinde bulunur.

# CannotFindIjwhost
source: NETSDK1114: Unable to find a .NET Core IJW host. The .NET Core IJW host is only available on .NET Core 3.1 or higher when targeting Windows.
it: NETSDK1114: non è possibile trovare un host IJW .NET Core. L'host IJW .NET Core è disponibile solo in .NET Core 3.1 o versioni successive quando la destinazione è Windows.
tr: NETSDK1114: .NET Core IJW konağı bulunamıyor. .NET Core IJW konağı, Windows hedeflenirken yalnızca .NET Core 3.1 veya üzerinde kullanılabilir.

# CannotFindProjectInfo
source: NETSDK1007: Cannot find project info for '{0}'. This can indicate a missing project reference.
it: NETSDK1007: le informazioni del progetto per '{0}' non sono state trovate. Questo errore può indicare la mancanza di un riferimento al progetto.
pl: NETSDK1007: Nie odnaleziono informacji o projekcie dla elementu „{0}”. Może to wskazywać na brakujące odwołanie do projektu.
tr: NETSDK1007: '{0}' için proje bilgisi bulunamıyor. Bu durum, bir proje başvurusunun eksik olduğunu gösteriyor olabilir.

# CannotHaveRuntimeIdentifierPlatformMismatchPlatformTarget
source: NETSDK1032: The RuntimeIdentifier platform '{0}' and the PlatformTarget '{1}' must be compatible.
it: NETSDK1032: la piattaforma '{0}' di RuntimeIdentifier e quella '{1}' di PlatformTarget devono essere compatibili.
pl: NETSDK1032: Platforma elementu RuntimeIdentifier „{0}” i element PlatformTarget „{1}” muszą być zgodne.
tr: NETSDK1032: RuntimeIdentifier platformu '{0}' ile PlatformTarget '{1}' uyumlu olmalıdır.

# CannotHaveSelfContainedWithoutRuntimeIdentifier
source: NETSDK1031: It is not supported to build or publish a self-contained application without specifying a RuntimeIdentifier. You must either specify a RuntimeIdentifier or set SelfContained to false.
it: NETSDK1031: non è possibile compilare o pubblicare un'applicazione indipendente senza specificare un elemento RuntimeIdentifier. Specificare un elemento RuntimeIdentifier o impostare SelfContained su false.
tr: NETSDK1031: Bir RuntimeIdentifier belirtilmeden bağımsız çalışan uygulamanın derlenmesi veya yayımlanması desteklenmez. Bir RuntimeIdentifier belirtmeniz veya SelfContained değerini false olarak ayarlamanız gerekir.

# CannotHaveSingleFileWithoutRuntimeIdentifier
source: NETSDK1097: It is not supported to publish an application to a single-file without specifying a RuntimeIdentifier. You must either specify a RuntimeIdentifier or set PublishSingleFile to false.
it: NETSDK1097: non è possibile pubblicare un'applicazione in un singolo file senza specificare un elemento RuntimeIdentifier. Specificare un elemento RuntimeIdentifier o impostare PublishSingleFile su false.
tr: NETSDK1097: RuntimeIdentifier belirtilmeden, uygulamanın tek bir dosyaya yayımlanması desteklenmez. Bir RuntimeIdentifier belirtmeniz veya PublishSingleFile değerini false olarak ayarlamanız gerekir.

# CannotHaveSingleFileWithoutAppHost
source: NETSDK1098: Applications published to a single-file are required to use the application host. You must either set PublishSingleFile to false or set UseAppHost to true.
it: NETSDK1098: le applicazioni pubblicate in un singolo file sono necessarie per usare l'host dell'applicazione. Impostare PublishSingleFile su false o UseAppHost su true.
tr: NETSDK1098: Tek bir dosyaya yayımlanan uygulamaların uygulama konağını kullanması gerekir. PublishSingleFile değerini false olarak ayarlamanız ya da UseAppHost değerini true olarak ayarlamanız gerekir.

# CannotHaveSingleFileWithoutExecutable
source: NETSDK1099: Publishing to a single-file is only supported for executable applications.
it: NETSDK1099: la pubblicazione in un singolo file è supportata solo per le applicazioni eseguibili.
pl: NETSDK1099: Publikowanie w pojedynczym pliku jest obsługiwane tylko dla aplikacji wykonywalnych.
tr: NETSDK1099: Tek dosyaya yayımlama, yalnızca yürütülebilir uygulamalar için desteklenir.

# CannotHaveSolutionLevelOutputPath
source: NETSDK1194: The "--output" option isn't supported when building a solution. Specifying a solution-level output path results in all projects copying outputs to the same directory, which can lead to inconsistent builds.
it: NETSDK1194: l'opzione "--output" non è supportata durante la compilazione di una soluzione. Se si specifica un percorso di output a livello di soluzione, tutti i progetti copiano gli output nella stessa directory, con possibili compilazioni incoerenti.
tr: NETSDK1194: Bir çözüm oluşturulurken "--output" seçeneği desteklenmiyor. Çözüm düzeyinde bir çıktı yolu belirtmek, tüm projelerin çıktıları aynı dizine kopyalamasına neden olur ve bu da tutarsız yapılara yol açabilir.

# CannotHaveSolutionLevelRuntimeIdentifier
source: NETSDK1134: Building a solution with a specific RuntimeIdentifier is not supported. If you would like to publish for a single RID, specify the RID at the individual project level instead.
it: NETSDK1134: non è supportata la compilazione di una soluzione con un parametro RuntimeIdentifier specifico. Se si desidera pubblicare per un singolo RID, specificare il RID a livello di singolo progetto.
tr: NETSDK1134: Belirli bir RuntimeIdentifier ile bir çözüm oluşturma desteklenmiyor. Tek bir RID için yayımlamak istiyorsanız, bunun yerine ilgili proje düzeyindeki RID'yi belirtin.

# CannotHaveSupportedOSPlatformVersionHigherThanTargetPlatformVersion
source: NETSDK1135: SupportedOSPlatformVersion {0} cannot be higher than TargetPlatformVersion {1}.
it: NETSDK1135: il valore di SupportedOSPlatformVersion {0} non può essere maggiore di quello di TargetPlatformVersion {1}.
tr: NETSDK1135: {0} SupportedOSPlatformVersion, {1} TargetPlatformVersion değerinden yüksek olamaz.

# CannotIncludeAllContentButNotNativeLibrariesInSingleFile
source: NETSDK1143: Including all content in a single file bundle also includes native libraries. If IncludeAllContentForSelfExtract is true, IncludeNativeLibrariesForSelfExtract must not be false.
it: NETSDK1143: se si include tutto il contenuto in un unico bundle di file, verranno incluse anche le librerie native. Se IncludeAllContentForSelfExtract è true, IncludeNativeLibrariesForSelfExtract non deve essere false.
tr: NETSDK1143: Tüm içerikler tek bir dosya paket grubuna dahil edildiğinde yerel kitaplıklar da buna dahil edilir. IncludeAllContentForSelfExtract true ise, IncludeNativeLibrariesForSelfExtract false olmamalıdır.

# CannotIncludeSymbolsInSingleFile
source: NETSDK1142: Including symbols in a single file bundle is not supported when publishing for .NET5 or higher.
it: NETSDK1142: l'inclusione dei simboli in un unico bundle di file non è supportata quando si esegue la pubblicazione per .NET 5 o versioni successive.
tr: NETSDK1142: Sembollerin tek bir dosya paket grubuna dahil edilmesi, .NET5 veya üzeri için yayımlanırken desteklenmez.

# CannotInferTargetFrameworkIdentifierAndVersion
source: NETSDK1013: The TargetFramework value '{0}' was not recognized. It may be misspelled. If not, then the TargetFrameworkIdentifier and/or TargetFrameworkVersion properties must be specified explicitly.
it: NETSDK1013: il valore {0}' di TargetFramework non è stato riconosciuto. È possibile che sia stato digitato in modo errato. In caso contrario, le proprietà TargetFrameworkIdentifier e/o TargetFrameworkVersion devono essere specificate in modo esplicito.
pl: NETSDK1013: Nie rozpoznano wartości „{0}” elementu TargetFramework. Być może wpisano ją niepoprawnie. Jeśli nie, należy jawnie określić właściwości TargetFrameworkIdentifier i/lub TargetFrameworkVersion.
tr: NETSDK1013: '{0}' TargetFramework değeri tanınmadı. Yanlış yazılmış olabilir. Sorun bundan kaynaklanmıyorsa, TargetFrameworkIdentifier ve/veya TargetFrameworkVersion özelliklerinin açık bir şekilde belirtilmesi gerekir.

# CannotUseSelfContainedWithoutAppHost
source: NETSDK1067: Self-contained applications are required to use the application host. Either set SelfContained to false or set UseAppHost to true.
it: NETSDK1067: con le applicazioni complete è necessario usare l'host applicazione. Impostare SelfContained su false o UseAppHost su true.
pl: NETSDK1067: Aplikacje autonomiczne muszą korzystać z hosta aplikacji. Ustaw parametr SelfContained na wartość false lub parametr UseAppHost na wartość true.
tr: NETSDK1067: Kendi başına kapsanan uygulamaların uygulama konağını kullanması gerekir. SelfContained değerini false olarak ya da UseAppHost değerini true olarak ayarlayın.

# CanOnlyHaveSingleFileWithNetCoreApp
source: NETSDK1125: Publishing to a single-file is only supported for netcoreapp target.
it: NETSDK1125: la pubblicazione in un file singolo è supportata solo per la destinazione netcoreapp.
tr: NETSDK1125: Tek dosyada yayımlama yalnızca netcoreapp hedefi için desteklenir.

# ChoosingAssemblyVersion_Info
source: Choosing '{0}' because AssemblyVersion '{1}' is greater than '{2}'.
it: Verrà scelto '{0}' perché il valore di AssemblyVersion '{1}' è maggiore di '{2}'.
tr: '{1}' AssemblyVersion değeri '{2}' değerinden büyük olduğundan '{0}' seçiliyor.

# ChoosingCopyLocalArbitrarily_Info
source: Choosing '{0}' arbitrarily as both items are copy-local and have equal file and assembly versions.
it: Verrà scelto '{0}' in modo arbitrario perché entrambi gli elementi sono una copia locale e contengono versioni di file e assembly uguali.
tr: Öğeler hem yereli kopyalama hem de eşit dosya ve bütünleştirilmiş kod sürümlerine sahip olduğundan '{0}' öğesi rastgele seçiliyor.

# ChoosingFileVersion_Info
source: Choosing '{0}' because file version '{1}' is greater than '{2}'.
it: Verrà scelto '{0}' perché la versione del file '{1}' è maggiore di '{2}'.
tr: '{1}' dosya sürümü '{2}' değerinden büyük olduğundan '{0}' seçiliyor.
