Repository: dotnet/sdk
Catalog: src/Tasks/Common/Resources/xlf/Strings.*.xlf
Languages: it, pl, tr

# IncorrectTargetFormat
source: NETSDK1025: The target manifest {0} provided is of not the correct format
it: NETSDK1025: il formato del manifesto di destinazione specificato {0} non è corretto
pl: NETSDK1025: Podany manifest docelowy {0} ma niepoprawny format
tr: NETSDK1025: Belirtilen {0} hedef bildirimi doğru biçimde değil

# InputAssemblyNotFound
source: NETSDK1163: Input assembly '{0}' not found.
it: NETSDK1163: l'assembly di input '{0}' non è stato trovato.
tr: NETSDK1163: '{0}' giriş bütünleştirilmiş kodu bulunamadı.

# InvalidAppHostDotNetSearch
source: NETSDK1217: Invalid value in AppHostDotNetSearch: '{0}'.
tr: NETSDK1217: AppHostDotNetSearch içinde geçersiz değer: '{0}'.

# InvalidFrameworkName
source: NETSDK1003: Invalid framework name: '{0}'.
it: NETSDK1003: nome di framework non valido: '{0}'.
pl: NETSDK1003: Nieprawidłowa nazwa platformy: „{0}”.
tr: NETSDK1003: Geçersiz çerçeve adı: '{0}'.

# InvalidItemSpecToUse
source: NETSDK1058: Invalid value for ItemSpecToUse parameter: '{0}'. This property must be blank or set to 'Left' or 'Right'
it: NETSDK1058: valore non valido per il parametro ItemSpecToUse: '{0}'. Questa proprietà deve essere vuota o impostata su 'Left' o 'Right'
pl: NETSDK1058: Nieprawidłowa wartość parametru ItemSpecToUse: „{0}”. Ta właściwość musi być pusta lub ustawiona na wartość „Left” albo „Right”
tr: NETSDK1058: ItemSpecToUse parametresi için geçersiz değer: '{0}'. Bu özellik boş olmalı veya 'Left' veya 'Right' olarak ayarlanmalıdır

# InvalidNuGetVersionString
source: NETSDK1018: Invalid NuGet version string: '{0}'.
it: NETSDK1018: la stringa di versione '{0}' di NuGet non è valida.
pl: NETSDK1018: Nieprawidłowy ciąg wersji NuGet: „{0}”.
tr: NETSDK1018: Geçersiz NuGet sürüm dizesi: '{0}'.

# InvalidResourceUpdate
source: NETSDK1075: Update handle is invalid. This instance may not be used for further updates.
it: NETSDK1075: il punto di controllo dell'aggiornamento non è valido. Non è possibile usare questa istanza per ulteriori aggiornamenti.
pl: NETSDK1075: Dojście aktualizacji jest nieprawidłowe. Tego wystąpienia nie można użyć na potrzeby dalszych aktualizacji.
tr: NETSDK1075: Güncelleştirme tanıtıcısı geçersiz. Bu örnek başka güncelleştirmeler için kullanılamaz.

# InvalidRollForwardValue
source: NETSDK1104: RollForward value '{0}' is invalid. Allowed values are {1}.
it: NETSDK1104: il valore '{0}' di RollForward non è valido. I valori consentiti sono {1}.
tr: NETSDK1104: '{0}' RollForward değeri geçersiz. İzin verilen değerler {1}.

# InvalidTargetPlatformVersion
source: NETSDK1140: {0} is not a valid TargetPlatformVersion for {1}. Valid versions include: {2}
it: NETSDK1140: {0} non è un valore valido di TargetPlatformVersion per or {1}. Le versioni valide includono: {2}
tr: NETSDK1140: {0}, {1} için geçerli bir TargetPlatformVersion değil. Geçerli sürümler şunlardır: {2}

# InvalidTypeLibrary
source: NETSDK1173: The provided type library '{0}' is in an invalid format.
it: NETSDK1173: il formato della libreria dei tipi specificata '{0}' non è valido.
tr: NETSDK1173: Sağlanan tür kitaplığı ' {0} ' geçersiz bir biçimde.

# InvalidTypeLibraryId
source: NETSDK1170: The provided type library ID '{0}' for type library '{1}' is invalid. The ID must be a positive integer less than 65536.
it: NETSDK1170: l'ID '{0}' per la libreria dei tipi specificato '{1}' non è valido. L'ID deve essere un numero positivo intero inferiore a 65536.
tr: NETSDK1170: '{1}' tür kitaplığı için '{0} ' sağlanan tür kitaplığı kimliği geçersiz. Kimlik 65536’dan küçük bir pozitif tamsayı olmalıdır.

# IsAotCompatibleUnsupported
source: NETSDK1210: IsAotCompatible and EnableAotAnalyzer are not supported for the target framework. Consider multi-targeting to a supported framework to enable ahead-of-time compilation analysis, and set IsAotCompatible only for the supported frameworks. For example: <IsAotCompatible Condition="$([MSBuild]::IsTargetFrameworkCompatible('$(TargetFramework)', '{0}'))">true</IsAotCompatible>
tr: NETSDK1210: IsAotCompatible ve EnableAotAnalyzer hedef altyapı için desteklenmiyor. Önceden derleme analizini etkinleştirmek için desteklenen bir altyapıya çoklu hedefleme uygulayabilir ve IsAotCompatible ayarını yalnızca desteklenen altyapılar için yapabilirsiniz. Örneğin: <IsAotCompatible Condition="$([MSBuild]::IsTargetFrameworkCompatible('$(TargetFramework)', '{0}'))">true</IsAotCompatible>

# IsTrimmableUnsupported
source: NETSDK1212: IsTrimmable and EnableTrimAnalyzer are not supported for the target framework. Consider multi-targeting to a supported framework to enable trimming, and set IsTrimmable only for the supported frameworks. For example: <IsTrimmable Condition="$([MSBuild]::IsTargetFrameworkCompatible('$(TargetFramework)', '{0}'))">true</IsTrimmable>
tr: NETSDK1212: IsTrimmable ve EnableTrimAnalyzer hedef altyapı için desteklenmiyor. Kırpmayı etkinleştirmek için desteklenen bir altyapıya çoklu hedefleme uygulayabilir ve IsTrimmable ayarını yalnızca desteklenen altyapılar için yapabilirsiniz. Örneğin: <IsTrimmable Condition="$([MSBuild]::IsTargetFrameworkCompatible('$(TargetFramework)', '{0}'))">true</IsTrimmable>

# JitLibraryNotFound
source: NETSDK1157: JIT library '{0}' not found.
it: NETSDK1157: la libreria '{0}' di JIT non è stata trovata.
tr: NETSDK1157: JIT kitaplığı '{0}' bulunamadı.

# MicrosoftNetSdkCompilersToolsetNotFound
source: NETSDK1216: Package Microsoft.Net.Sdk.Compilers.Toolset is not downloaded but it is needed because your MSBuild and SDK versions are mismatched. Ensure version {0} of the package is available in your NuGet source feeds and then run NuGet package restore from Visual Studio or MSBuild.
tr: NETSDK1216: Microsoft.Net.Sdk.Compilers.Toolset paketi indirilmedi, ancak MSBuild ve SDK sürümleriniz eşleşmediğinden bu paket gereklidir. Paketin {0} sürümünün NuGet kaynak akışlarınız içinde kullanılabilir olduğundan emin olun ve ardından NuGet paketi geri yüklemesini Visual Studio veya MSBuild'den çalıştırın.

# MicrosoftNetSdkCompilersToolsetRootEmpty
source: NETSDK1221: NuGetPackageRoot property is empty so package Microsoft.Net.Sdk.Compilers.Toolset cannot be used but it is recommended because your MSBuild and SDK versions are mismatched. Ensure you are building with '/restore /t:Build' and not '/t:Restore;Build'.
tr: NETSDK1221: NuGetPackageRoot özelliği boş olduğundan Microsoft.Net.Sdk.Compilers.Toolset paketi kullanılamaz ancak MSBuild ve SDK sürümleriniz eşleşmediğinden bu paketin kullanılması önerilir. '/t:Restore;Build' değil '/restore /t:Build' ile derlediğinizden emin olun.

# MismatchedPlatformPackageVersion
source: NETSDK1061: The project was restored using {0} version {1}, but with current settings, version {2} would be used instead. To resolve this issue, make sure the same settings are used for restore and for subsequent operations such as build or publish. Typically this issue can occur if the RuntimeIdentifier property is set during build or publish but not during restore. For more information, see https://aka.ms/dotnet-runtime-patch-selection.
it: NETSDK1061: per il ripristino del progetto è stato usato {0} versione {1}, ma con le impostazioni correnti viene usata la versione {2}. Per risolvere il problema, assicurarsi di usare le stesse impostazioni per il ripristino e per le operazioni successive, quali compilazione o pubblicazione. In genere questo problema può verificarsi se la proprietà RuntimeIdentifier viene impostata durante la compilazione o la pubblicazione, ma non durante il ripristino. Per altre informazioni, vedere https://aka.ms/dotnet-runtime-patch-selection.
pl: NETSDK1061: Projekt został przywrócony przy użyciu pakietu {0} w wersji {1}, ale w przypadku bieżących ustawień zamiast niej zostałaby użyta wersja {2}. Aby rozwiązać ten problem, upewnij się, że te same ustawienia są używane do przywracania i dla kolejnych operacji, takich jak kompilacja lub publikowanie. Ten problem zazwyczaj występuje, gdy właściwość RuntimeIdentifier jest ustawiona podczas kompilacji lub publikowania, ale nie podczas przywracania. Aby uzyskać więcej informacji, zobacz https://aka.ms/dotnet-runtime-patch-selection.
tr: NETSDK1061: Proje, {0} sürüm {1} kullanılarak geri yüklendi, ancak geçerli ayarlarla, bunun yerine sürüm {2} kullanılması gerekiyordu. Bu sorunu çözmek amacıyla, geri yükleme için ve derleme veya yayımlama gibi sonraki işlemler için aynı ayarların kullanıldığından emin olun. Bu sorun genellikle RuntimeIdentifier özelliği derleme veya yayımlama sırasında ayarlandığında ancak geri yükleme sırasında ayarlanmadığında oluşur. Daha fazla bilgi için bkz. https://aka.ms/dotnet-runtime-patch-selection.

# MissingItemMetadata
source: NETSDK1008: Missing '{0}' metadata on '{1}' item '{2}'.
it: NETSDK1008: mancano i metadati di '{0}' sull'elemento '{2}' di '{1}'.
pl: NETSDK1008: Brak metadanych „{0}” w elemencie „{1}” „{2}”.
tr: NETSDK1008: '{1}' öğesi '{2}' üzerinde '{0}' meta verileri eksik.

# MissingOutputPDBImagePath
source: NETSDK1164: Missing output PDB path in PDB generation mode (OutputPDBImage metadata).
it: NETSDK1164: il percorso PDB di output non è presente nella modalità di generazione PDB (metadati di OutputPDBImage).
tr: NETSDK1164: PDB oluşturma modunda çıkış PDB yolu eksik (OutputPDBImage meta verileri).

# MissingOutputR2RImageFileName
source: NETSDK1165: Missing output R2R image path (OutputR2RImage metadata).
it: NETSDK1165: il percorso dell'immagine R2R di output non è presente (metadati di OutputR2RImage).
tr: NETSDK1165: Çıkış R2R görüntü yolu eksik (OutputR2RImage meta verisi).

# MissingTypeLibraryId
source: NETSDK1171: An integer ID less than 65536 must be provided for type library '{0}' because more than one type library is specified.
it: NETSDK1171: un ID intero inferiore a 65536 deve essere fornito per la libreria dei tipi '{0}' perché è specificata più di una libreria dei tipi.
tr: NETSDK1171: Birden fazla tür kitaplığı belirtildiğinden, '{0}' tür kitaplığı için 65536'dan küçük bir tamsayı kimliği sağlanmalıdır.

# MultipleFilesResolved
source: NETSDK1021: More than one file found for {0}
it: NETSDK1021: è stato trovato più di un file per {0}
pl: NETSDK1021: Znaleziono więcej niż jeden plik dla elementu {0}
tr: NETSDK1021: {0} için birden fazla dosya bulundu

# NETFrameworkToNonBuiltInNETStandard
source: NETSDK1069: This project uses a library that targets .NET Standard 1.5 or higher, and the project targets a version of .NET Framework that doesn't have built-in support for that version of .NET Standard. Visit https://aka.ms/net-standard-known-issues for a set of known issues. Consider retargeting to .NET Framework 4.7.2.
it: NETSDK1069: questo progetto usa una libreria destinata a .NET Standard 1.5 o versione successiva ed è destinato a una versione di .NET Framework che non include il supporto predefinito per tale versione di .NET Standard. Per un serie di problemi noti, visitare https://aka.ms/net-standard-known-issues. Provare a impostare come destinazione .NET Framework 4.7.2.
pl: NETSDK1069: Projekt korzysta z biblioteki przeznaczonej dla platformy .NET Standard 1.5 lub nowszej, a projekt jest przeznaczony dla wersji programu .NET Framework, która nie ma wbudowanej obsługi tej wersji platformy .NET Standard. Odwiedź witrynę https://aka.ms/net-standard-known-issues, aby zapoznać się z zestawem znanych problemów. Rozważ zmianę elementu docelowego na program .NET Framework 4.7.2.
tr: NETSDK1069: Bu proje, .NET Standard 1.5 veya üzerini hedefleyen bir kitaplık kullanıyor ve proje .NET Framework’ün bu .NET Standard sürümü için yerleşik destek sunmayan bir sürümünü hedefliyor. Bilinen sorunları görmek için https://aka.ms/net-standard-known-issues adresini ziyaret edin. Hedeflenen sürümü .NET Framework 4.7.2 olarak değiştirmeyi göz önünde bulundurun.

# NETFrameworkWithoutUsingNETSdkDefaults
source: NETSDK1115: The current .NET SDK does not support .NET Framework without using .NET SDK Defaults. It is likely due to a mismatch between C++/CLI project CLRSupport property and TargetFramework.
it: NETSDK1115: l'istanza corrente di .NET SDK non supporta .NET Framework senza usare le impostazioni predefinite di .NET SDK. Il problema dipende probabilmente da una mancata corrispondenza tra la proprietà CLRSupport del progetto C++/CLI e TargetFramework.
tr: NETSDK1115: Geçerli .NET SDK, .NET SDK Varsayılanlarını kullanmadan .NET Framework'ü desteklemiyor. C++/CLI projesi CLRSupport özelliği ve TargetFramework arasındaki uyuşmazlık bu duruma neden olabilir.

# Net9NotCompatibleWithDev1711
source: NETSDK1223: Targeting .NET 9.0 or higher in Visual Studio 2022 17.11 is not supported.
tr: NETSDK1223: Visual Studio 2022 17.11'de .NET 9.0 veya daha üst sürümünü hedefleme desteklenmiyor.

# NoAppHostAvailable
source: NETSDK1084: There is no application host available for the specified RuntimeIdentifier '{0}'.
it: NETSDK1084: non è disponibile alcun host applicazione per l'elemento RuntimeIdentifier specificato '{0}'.
pl: NETSDK1084: Brak dostępnej aplikacji hosta dla określonego elementu RuntimeIdentifier „{0}”.
tr: NETSDK1084: Belirtilen RuntimeIdentifier '{0}' için kullanılabilecek bir uygulama konağı yok.

# NoBuildRequested
source: NETSDK1085: The 'NoBuild' property was set to true but the 'Build' target was invoked.
it: NETSDK1085: non è stata impostata alcuna proprietà 'NoBuild' su true, ma è stata chiamata la destinazione 'Build'.
pl: NETSDK1085: Właściwość „NoBuild” została ustawiona na wartość true, ale wywołano element docelowy „Build”.
tr: NETSDK1085: 'NoBuild' özelliği true olarak ayarlanmıştı ancak 'Build' hedefi çağrıldı.

# NoCompatibleTargetFramework
source: NETSDK1002: Project '{0}' targets '{2}'. It cannot be referenced by a project that targets '{1}'.
it: NETSDK1002: il progetto '{0}' è destinato a '{2}'. Non può essere usato come riferimento in un progetto destinato a '{1}'.
pl: NETSDK1002: Projekt „{0}” ma platformę docelową „{2}”. Nie może on być przywoływany przez projekt z platformą docelową „{1}”.
tr: NETSDK1002: '{0}' projesi, '{2}' çerçevesini hedefliyor. Bu projeye '{1}' çerçevesini hedefleyen bir proje tarafından başvurulamaz.

# NoRuntimePackAvailable
source: NETSDK1082: There was no runtime pack for {0} available for the specified RuntimeIdentifier '{1}'.
it: NETSDK1082: non è disponibile alcun pacchetto di runtime per {0} per l'elemento RuntimeIdentifier specificato '{1}'.
pl: NETSDK1082: Brak dostępnego pakietu środowiska uruchomieniowego {0} dla określonego elementu RuntimeIdentifier „{1}”.
tr: NETSDK1082: {0} için, belirtilen RuntimeIdentifier '{1}' için kullanılabilecek bir çalışma zamanı paketi yoktu.

# NoRuntimePackInformation
source: NETSDK1132: No runtime pack information was available for {0}.
it: NETSDK1132: non sono disponibili informazioni sui pacchetti di runtime per {0}.
tr: NETSDK1132: {0} için kullanılabilir çalışma zamanı paketi bilgisi yoktu.

# NoSupportComSelfContained
source: NETSDK1128: COM hosting does not support self-contained deployments.
it: NETSDK1128: l'hosting COM non supporta le distribuzioni complete.
tr: NETSDK1128: COM barındırma, kendi içinde dağıtımları desteklemez.

# NoSupportCppEnableComHosting
source: NETSDK1119: C++/CLI projects targeting .NET Core cannot use EnableComHosting=true.
it: NETSDK1119: i progetti C++/CLI destinati a .NET Core non possono usare EnableComHosting=true.
tr: NETSDK1119: .NET Core'u hedefleyen C++/CLI projeleri EnableComHosting=true kullanamaz.

# NoSupportCppNonDynamicLibraryDotnetCore
source: NETSDK1116: C++/CLI projects targeting .NET Core must be dynamic libraries.
it: NETSDK1116: i progetti C++/CLI destinati a .NET Core devono essere librerie dinamiche.
tr: NETSDK1116: .NET Core'u hedefleyen C++/CLI projeleri dinamik kitaplıklar olmalıdır.

# NoSupportCppPackDotnetCore
source: NETSDK1118: C++/CLI projects targeting .NET Core cannot be packed.
it: NETSDK1118: i progetti C++/CLI destinati a .NET Core non possono essere compressi.
tr: NETSDK1118: .NET Core'u hedefleyen C++/CLI projeleri paketlenemez.

# NoSupportCppPublishDotnetCore
source: NETSDK1117: Does not support publish of C++/CLI project targeting dotnet core.
it: NETSDK1117: la pubblicazione di progetti C++/CLI destinati a .NET Core non è supportata.
tr: NETSDK1117: dotnet core'u hedefleyen C++/CLI projesinin yayımlanması desteklenmez.

# NoSupportCppSelfContained
source: NETSDK1121: C++/CLI projects targeting .NET Core cannot use SelfContained=true.
it: NETSDK1121: i progetti C++/CLI destinati a .NET Core non possono usare SelfContained=true.
tr: NETSDK1121: .NET Core'u hedefleyen C++/CLI projelerinde SelfContained=true kullanılamaz.

# NonPortableRuntimeIdentifierDetected
source: NETSDK1206: Found version-specific or distribution-specific runtime identifier(s): {0}. Affected libraries: {1}. In .NET 8.0 and higher, assets for version-specific and distribution-specific runtime identifiers will not be found by default. See https://aka.ms/dotnet/rid-usage for details.
tr: NETSDK1206: Sürüme özgü veya dağıtıma özgü çalışma zamanı tanımlayıcıları bulundu: {0}. Etkilenen kitaplıklar: {1}. .NET 8.0 ve üzeri sürümlerde, sürüme özgü ve dağıtıma özgü çalışma zamanı tanımlayıcıları için varlıklar varsayılan olarak bulunamıyor. Ayrıntılar için bkz. https://aka.ms/dotnet/rid-usage

# NonSelfContainedExeCannotReferenceSelfContained
source: NETSDK1151: The referenced project '{0}' is a self-contained executable. A self-contained executable cannot be referenced by a non self-contained executable. For more information, see https://aka.ms/netsdk1151
it: NETSDK1151: il progetto '{0}' a cui viene fatto riferimento è un eseguibile autonomo. Non è possibile fare riferimento a un eseguibile autonomo da un eseguibile non autonomo. Per altre informazioni, vedere https://aka.ms/netsdk1151
tr: NETSDK1151: Başvurulan '{0}' projesi bağımsız bir yürütülebilir dosyadır. Bağımsız bir yürütülebilir dosyaya, bağımsız olmayan bir yürütülebilir dosya tarafından başvurulamaz. Daha fazla bilgi için bkz. https://aka.ms/netsdk1151

# PDBGeneratorInputExecutableNotFound
source: NETSDK1162: PDB generation: R2R executable '{0}' not found.
it: NETSDK1162: generazione PDB: l'eseguibile '{0}' di R2R non è stato trovato.
tr: NETSDK1162: PDB üretme: R2R ile çalıştırılabilir '{0}' bulunamadı.

# PackAsToolCannotSupportSelfContained
source: NETSDK1053: Pack as tool does not support self contained.
it: NETSDK1053: la creazione di pacchetti come strumenti non prevede elementi autonomi.
pl: NETSDK1053: Funkcja pakowania jako narzędzie nie obsługuje elementów autonomicznych.
tr: NETSDK1053: Araç olarak paketleme kendi kendini kapsamayı desteklemiyor.

# PackAsToolCannotSupportTargetPlatformIdentifier
source: NETSDK1146: PackAsTool does not support TargetPlatformIdentifier being set. For example, TargetFramework cannot be net5.0-windows, only net5.0. PackAsTool also does not support UseWPF or UseWindowsForms when targeting .NET 5 and higher.
it: NETSDK1146: PackAsTool non supporta l'impostazione di TargetPlatformIdentifier. Ad esempio, TargetFramework non può essere essere impostato su net5.0-windows, ma solo su net5.0. PackAsTool non supporta neanche UseWPF o UseWindowsForms quando la destinazione è .NET 5 e versioni successive.
tr: NETSDK1146: PackAsTool, ayarlanan TargetPlatformIdentifier'ı desteklemez. Örneğin, TargetFramework net5.0-windows olamaz, yalnızca net5.0 olabilir. PackAsTool ayrıca .NET 5 ve üzeri hedeflenirken UseWPF veya UseWindowsForms'u da desteklemez.

# PackageContainsIncorrectlyCasedLocale
source: NETSDK1187: Package {0} {1} has a resource with the locale '{2}'. This locale has been normalized to the standard format '{3}' to prevent casing issues in the build. Consider notifying the package author about this casing issue.
it: NETSDK1187: il pacchetto {0} {1} include una risorsa con le impostazioni locali '{2}'. Queste impostazioni locali sono state normalizzate nel formato standard '{3}' per evitare problemi di maiuscole e minuscole nella compilazione. È consigliabile informare l'autore del pacchetto in merito a questo problema di maiuscole e minuscole.
tr: NETSDK1187: {0} {1} paketi, '{2}' yerel ayarına sahip bir kaynağa sahip. Bu yerel ayar, yapıdaki büyük/küçük harf sorunlarını önlemek için standart '{3}' biçimine normalleştirildi. Bu büyük/küçük harf sorunu hakkında paket yazarını bilgilendirmeyi düşünün.

# PackageContainsUnknownLocale
source: NETSDK1188: Package {0} {1} has a resource with the locale '{2}'. This locale is not recognized by .NET. Consider notifying the package author that it appears to be using an invalid locale.
it: NETSDK1188: il pacchetto {0} {1} include una risorsa con le impostazioni locali '{2}'. Queste impostazioni locali non sono riconosciute da .NET. È consigliabile notificare all'autore del pacchetto che sembra usare impostazioni locali non valide.
tr: NETSDK1188: {0} {1} paketi, '{2}' yerel ayarına sahip bir kaynağa sahip. Bu yerel ayar .NET tarafından tanınmıyor. Paket yazarına geçersiz bir yerel ayar kullanıyor gibi göründüğünü bildirmeyi düşünün.

# PackageNotFound
source: NETSDK1064: Package {0}, version {1} was not found. It might have been deleted since NuGet restore. Otherwise, NuGet restore might have only partially completed, which might have been due to maximum path length restrictions.
it: NETSDK1064: il pacchetto {0} versione {1} non è stato trovato. Potrebbe essere stato eliminato dopo il ripristino di NuGet. In caso contrario, il ripristino di NuGet potrebbe essere stato completato solo parzialmente, a causa delle restrizioni relative alla lunghezza massima del percorso.
pl: NETSDK1064: Nie odnaleziono pakietu {0} w wersji {1}. Mógł on zostać usunięty po przywróceniu pakietu NuGet. W innym przypadku przywrócenie pakietu NuGet mogło zostać ukończone tylko częściowo, co mogło być spowodowane ograniczeniami wynikającymi z maksymalnej długości ścieżki.
tr: NETSDK1064: {0} paketinin {1} sürümü bulunamadı. NuGet geri yükleme işleminden sonra silinmiş olabilir. Silinmediyse, NuGet geri yükleme işlemi muhtemelen en fazla yol uzunluğu kısıtlamaları nedeniyle yalnızca kısmen başarılı olmuş olabilir.

# PackageReferenceOverrideWarning
source: NETSDK1023: A PackageReference for '{0}' was included in your project. This package is implicitly referenced by the .NET SDK and you do not typically need to reference it from your project. For more information, see {1}
it: NETSDK1023: nel progetto è stato incluso un riferimento al pacchetto per '{0}'. Questo pacchetto viene usato come riferimento implicito da .NET SDK e non è in genere necessario farvi riferimento dal progetto. Per altre informazioni, vedere {1}
pl: NETSDK1023: Odwołanie do pakietu dla „{0}” zostało uwzględnione w projekcie. Ten pakiet jest jawnie przywoływany przez zestaw .NET SDK i zwykle nie ma potrzeby tworzenia odwołania do niego z projektu. Aby uzyskać więcej informacji, zobacz {1}
tr: NETSDK1023: Projenize '{0}' için bir PackageReference eklendi. .NET SDK bu pakete örtük olarak başvuruyor; buna projenizden başvurmanız genellikle gerekli değildir. Daha fazla bilgi için bkz. {1}
