Repository: dotnet/sdk
Catalog: src/Tasks/Common/Resources/xlf/Strings.*.xlf
Languages: it, pl, tr

# PackageReferenceVersionNotRecommended
source: NETSDK1071: A PackageReference to '{0}' specified a Version of `{1}`. Specifying the version of this package is not recommended. For more information, see https://aka.ms/sdkimplicitrefs
it: NETSDK1071: in un elemento PackageReference che fa riferimento a '{0}' è specificata la versione di `{1}`. È consigliabile non specificare la versione di questo pacchetto. Per altre informazioni, vedere https://aka.ms/sdkimplicitrefs
pl: NETSDK1071: Odwołanie PackageReference do pakietu „{0}” określiło wersję „{1}”. Określanie wersji tego pakietu nie jest zalecane. Aby uzyskać więcej informacji, zobacz https://aka.ms/sdkimplicitrefs
tr: NETSDK1071: '{0}' öğesine yönelik bir PackageReference, bir `{1}` Sürümünü belirtti. Bu paketin sürümünün belirtilmesi önerilmez. Daha fazla bilgi edinmek için bkz. https://aka.ms/sdkimplicitrefs

# PlaceholderRunCommandProjectAbbreviationDeprecated
source: NETSDK1174: Placeholder
tr: NETSDK1174: Yer tutucu

# Prefer32BitIgnoredForNetCoreApp
source: NETSDK1189: Prefer32Bit is not supported and has no effect for netcoreapp target.
it: NETSDK1189: Prefer32Bit non è supportato e non ha alcun effetto per la destinazione netcoreapp.
tr: NETSDK1189: Prefer32Bit desteklenmez ve netcoreapp hedefi için hiçbir etkisi yoktur.

# PreferNativeArm64IgnoredForNetCoreApp
source: NETSDK1222: PreferNativeArm64 applies only to .NET Framework targets. It is not supported and has no effect for when targeting .NET Core.
tr: NETSDK1222: PreferNativeArm64 yalnızca .NET Framework hedefleri için geçerlidir. .NET Core hedeflenirken desteklenmez ve herhangi bir etkisi yoktur.

# ProjectAssetsConsumedWithoutMSBuildProjectPath
source: NETSDK1011: Assets are consumed from project '{0}', but no corresponding MSBuild project path was found in '{1}'.
it: NETSDK1011: le risorse vengono utilizzate dal progetto '{0}', ma non è stato trovato alcun percorso di progetto MSBuild corrispondente in '{1}'.
pl: NETSDK1011: Zasoby są używane z projektu „{0}”, ale w elemencie „{1}” nie odnaleziono odpowiadającej ścieżki projektu MSBuild.
tr: NETSDK1011: '{0}' projesindeki varlıklar kullanılıyor, ancak '{1}' içinde karşılık gelen bir MSBuild proje yolu bulunamadı.

# ProjectContainsObsoleteDotNetCliTool
source: NETSDK1059: The tool '{0}' is now included in the .NET SDK. Information on resolving this warning is available at (https://aka.ms/dotnetclitools-in-box).
it: NETSDK1059: lo strumento '{0}' è ora incluso in .NET SDK. Per informazioni sulla risoluzione di questo avviso, vedere (https://aka.ms/dotnetclitools-in-box).
tr: NETSDK1059: '{0}' aracı .NET SDK’ya eklendi. Bu uyarının çözümlenmesiyle ilgili bilgi edinmek için bkz. (https://aka.ms/dotnetclitools-in-box).

# ProjectToolOnlySupportTFMLowerThanNetcoreapp22
source: NETSDK1093: Project tools (DotnetCliTool) only support targeting .NET Core 2.2 and lower.
it: NETSDK1093: gli strumenti del progetto (DotnetCliTool) supportano come destinazione solo .NET Core 2.2 e versioni precedenti.
tr: NETSDK1093: Proje araçları (DotnetCliTool) yalnızca .NET Core 2.2 veya daha düşük sürümünü hedeflemeyi destekliyor.

# PublishProfileNotPresent
source: NETSDK1198: A publish profile with the name '{0}' was not found in the project. Set the PublishProfile property to a valid file name.
it: NETSDK1198: un profilo di pubblicazione denominato '{0}' non è stato trovato nel progetto. Impostare la proprietà PublishProfile su un nome file valido.
tr: NETSDK1198: Projede '{0}' adlı bir yayınlama profili bulunamadı. PublishProfile özelliğini geçerli bir dosya adına ayarlayın.

# PublishReadyToRunRequiresVersion30
source: NETSDK1122: ReadyToRun compilation will be skipped because it is only supported for .NET Core 3.0 or higher.
it: NETSDK1122: la compilazione eseguita con ReadyToRun verrà ignorata perché è supportata solo per .NET Core 3.0 o versioni successive.
tr: NETSDK1122: ReadyToRun derlemesi, yalnızca .NET Core 3.0 veya üzeri için desteklendiğinden atlanacak.

# PublishSelfContainedMustBeBool
source: NETSDK1193: If PublishSelfContained is set, it must be either true or false. The value given was '{0}'.
it: NETSDK1193: se PublishSelfContained è impostato, deve essere true o false. Il valore specificato è '{0}'.
tr: NETSDK1193: PublishSelfContained ayarlanmışsa değeri true veya false olmalıdır. Verilen değer '{0}'.

# PublishSingleFileRequiresVersion30
source: NETSDK1123: Publishing an application to a single-file requires .NET Core 3.0 or higher.
it: NETSDK1123: per la pubblicazione di un'applicazione in un file singolo è richiesto .NET Core 3.0 o versioni successive.
tr: NETSDK1123: Bir uygulamayı tek bir dosyada yayımlamak için .NET Core 3.0 veya üzeri gerekir.

# PublishTrimmedRequiresVersion30
source: NETSDK1124: Trimming assemblies requires .NET Core 3.0 or higher.
it: NETSDK1124: per il trimming degli assembly è richiesto .NET Core 3.0 o versioni successive.
tr: NETSDK1124: Bütünleştirilmiş kodları bölmek için .NET Core 3.0 veya üzeri gerekir.

# PublishUnsupportedWithoutTargetFramework
source: NETSDK1129: The 'Publish' target is not supported without specifying a target framework. The current project targets multiple frameworks, you must specify one of the following frameworks in order to publish: {0}
tr: NETSDK1129: Hedef altyapı belirtilmeden 'Publish' hedefi desteklenmez. Geçerli proje birden çok altyapıyı hedefliyor, yayımlamak için şu altyapılardan birini belirtmeniz gerekiyor: {0}

# ReadyToRunCompilationFailed
source: NETSDK1096: Optimizing assemblies for performance failed. You can either exclude the failing assemblies from being optimized, or set the PublishReadyToRun property to false.
it: NETSDK1096: l'ottimizzazione degli assembly per le prestazioni non è riuscita. È possibile escludere gli assembly in errore dall'ottimizzazione oppure impostare la proprietà PublishReadyToRun su false.
pl: NETSDK1096: Optymalizacja zestawów pod kątem wydajności nie powiodła się. Możesz wykluczyć błędne zestawy z procesu optymalizacji lub ustawić właściwość PublishReadyToRun na wartość false.
tr: NETSDK1096: Derlemeler performans için iyileştirilemedi. Başarısız olan derlemeleri iyileştirmenin dışında tutabilir veya PublishReadyToRun özelliğini false olarak ayarlayabilirsiniz.

# ReadyToRunCompilationHasWarnings_Info
source: Some ReadyToRun compilations emitted warnings, indicating potential missing dependencies. Missing dependencies could potentially cause runtime failures. To show the warnings, set the PublishReadyToRunShowWarnings property to true.
it: Alcune compilazioni eseguite con la proprietà ReadyToRun hanno restituito avvisi per indicare potenziali dipendenze mancanti. Le dipendenze mancanti potrebbero causare errori di runtime. Per visualizzare gli avvisi, impostare la proprietà PublishReadyToRunShowWarnings su true.
tr: Bazı ReadyToRun derlemeleri, olası eksik bağımlılıkları gösteren uyarılar verdi. Eksik bağımlılıklar, çalışma zamanı hatalarına neden olabilir. Uyarıları göstermek için, PublishReadyToRunShowWarnings özelliğini true olarak ayarlayın.

# ReadyToRunNoValidRuntimePackageError
source: NETSDK1094: Unable to optimize assemblies for performance: a valid runtime package was not found. Either set the PublishReadyToRun property to false, or use a supported runtime identifier when publishing. When targeting .NET 6 or higher, make sure to restore packages with the PublishReadyToRun property set to true.
it: NETSDK1094: non è possibile ottimizzare gli assembly per le prestazioni perché non è stato trovato alcun pacchetto di runtime valido. Impostare la proprietà PublishReadyToRun su false oppure usare un identificatore di runtime supportato durante la pubblicazione. Quando si usa .NET 6 o versioni successive, assicurarsi di ripristinare i pacchetti con la proprietà PublishReadyToRun impostata su true.
tr: NETSDK1094: Derlemeler performans için iyileştirilemedi: geçerli bir çalışma zamanı paketi bulunamadı. PublishReadyToRun özelliğini false olarak ayarlayın veya yayımlarken desteklenen bir çalışma zamanı tanımlayıcısı kullanın. .NET 6 veya üzerini hedeflerken PublishReadyToRun özelliği true olarak ayarlanmış paketleri geri yüklediğinizden emin olun.

# ReadyToRunTargetNotSupportedError
source: NETSDK1095: Optimizing assemblies for performance is not supported for the selected target platform or architecture. Please verify you are using a supported runtime identifier, or set the PublishReadyToRun property to false.
it: NETSDK1095: l'ottimizzazione degli assembly per le prestazioni non è supportata per la piattaforma o l'architettura di destinazione selezionata. Verificare di usare un identificatore di runtime supportato oppure impostare la proprietà PublishReadyToRun su false.
tr: NETSDK1095: Bütünleştirilmiş kodların performansının iyileştirilmesi, seçilen hedef platform veya mimaride desteklenmiyor. Lütfen desteklenen bir çalışma zamanı tanımlayıcısı kullandığınızı doğrulayın ya da PublishReadyToRun özelliğini false olarak ayarlayın.

# RollForwardRequiresVersion30
source: NETSDK1103: RollForward setting is only supported on .NET Core 3.0 or higher.
it: NETSDK1103: l'impostazione RollForward è supportata solo in .NET Core 3.0 o versione successiva.
tr: NETSDK1103: RollForward ayarı yalnızca .NET Core 3.0 veya üzeri sürümlerde desteklenir.

# RuntimeIdentifierNotRecognized
source: NETSDK1083: The specified RuntimeIdentifier '{0}' is not recognized. See https://aka.ms/netsdk1083 for more information.
tr: NETSDK1083: Belirtilen RuntimeIdentifier '{0}' tanınmıyor. Daha fazla bilgi için https://aka.ms/netsdk1083 adresini ziyaret edin.

# RuntimeIdentifierWasNotSpecified
source: NETSDK1028: Specify a RuntimeIdentifier
it: NETSDK1028: specificare un elemento RuntimeIdentifier
pl: NETSDK1028: Określ element RuntimeIdentifier
tr: NETSDK1028: Bir RuntimeIdentifier belirtin

# RuntimeIdentifierWillNoLongerImplySelfContained
source: NETSDK1201: For projects targeting .NET 8.0 and higher, specifying a RuntimeIdentifier will no longer produce a self contained app by default. To continue building self-contained apps, set the SelfContained property to true or use the --self-contained argument.
tr: NETSDK1201: .NET 8.0 ve üzerini hedefleyen projeler için, RuntimeIdentifier belirtmek artık varsayılan olarak kendi içinde barındırılan bir uygulama üretmez. Kendi içinde barındırılan uygulamalar oluşturmaya devam etmek için SelfContained özelliğini true olarak ayarlayın veya --self-contained bağımsız değişkenini kullanın.

# RuntimeListNotFound
source: NETSDK1109: Runtime list file '{0}' was not found. Report this error to the .NET team here: https://aka.ms/dotnet-sdk-issue.
it: NETSDK1109: il file di elenco di runtime '{0}' non è stato trovato. Segnalare questo errore al team di .NET all'indirizzo: https://aka.ms/dotnet-sdk-issue.
tr: NETSDK1109: '{0}' çalışma zamanı listesi dosyası bulunamadı. Bu hatayı https://aka.ms/dotnet-sdk-issue adresinden .NET ekibine bildirin.

# RuntimePackNotDownloaded
source: NETSDK1112: The runtime pack for {0} was not downloaded. Try running a NuGet restore with the RuntimeIdentifier '{1}'.
it: NETSDK1112: il pacchetto di runtime per {0} non è stato scaricato. Provare a eseguire un ripristino NuGet con RuntimeIdentifier '{1}'.
tr: NETSDK1112: {0} için çalışma zamanı paketi indirilmedi. '{1}' RuntimeIdentifier ile bir NuGet geri yüklemesi çalıştırmayı deneyin.

# RuntimePackNotRestored_TransitiveDisabled
source: NETSDK1185: The Runtime Pack for FrameworkReference '{0}' was not available. This may be because DisableTransitiveFrameworkReferenceDownloads was set to true.
it: NETSDK1185: il Runtime Pack per FrameworkReference '{0}' non è disponibile. È possibile che DisableTransitiveFrameworkReferenceDownloads sia stato impostato su true.
tr: NETSDK1185: FrameworkReference '{0}' için Çalışma Zamanı Paketi bulunamadı. Bunun nedeni DisableTransitiveFrameworkReferenceDownloads değerinin true olarak ayarlanmış olması olabilir.

# SelfContainedExeCannotReferenceNonSelfContained
source: NETSDK1150: The referenced project '{0}' is a non self-contained executable. A non self-contained executable cannot be referenced by a self-contained executable. For more information, see https://aka.ms/netsdk1150
it: NETSDK1150: il progetto '{0}' a cui viene fatto riferimento è un eseguibile non autonomo. Non è possibile fare riferimento a un eseguibile non autonomo da un eseguibile autonomo. Per altre informazioni, vedere https://aka.ms/netsdk1150
tr: NETSDK1150: Başvurulan '{0}' projesi bağımsız olmayan bir yürütülebilir dosyadır. Bağımsız olmayan bir yürütülebilir dosyaya, bağımsız bir yürütülebilir dosya tarafından başvurulamaz. Daha fazla bilgi için bkz. https://aka.ms/netsdk1150

# SelfContainedOptionShouldBeUsedWithRuntime
source: NETSDK1179: One of '--self-contained' or '--no-self-contained' options are required when '--runtime' is used.
it: NETSDK1179: quando si usa '--runtime' è necessaria una delle opzioni '--self-contained' o '--no-self-contained'.
tr: NETSDK1179: '--runtime' kullanıldığında '--self-contained' veya '--no-self-contained' seçeneklerinden biri gerekir.

# SkippingAdditionalProbingPaths
source: NETSDK1048: 'AdditionalProbingPaths' were specified for GenerateRuntimeConfigurationFiles, but are being skipped because 'RuntimeConfigDevPath' is empty.
it: NETSDK1048: per GenerateRuntimeConfigurationFiles è stato specificato 'AdditionalProbingPaths', ma questo valore verrà ignorato perché 'RuntimeConfigDevPath' è vuoto.
pl: NETSDK1048: Dla elementu GenerateRuntimeConfigurationFiles określono ścieżki AdditionalProbingPaths, ale są one pomijane, ponieważ element „RuntimeConfigDevPath” jest pusty.
tr: NETSDK1048: GenerateRuntimeConfigurationFiles için 'AdditionalProbingPaths' belirtildi ancak 'RuntimeConfigDevPath' boş olduğundan atlanıyor.

# SolutionProjectConfigurationsConflict
source: NETSDK1197: Multiple solution project(s) contain conflicting '{0}' values; ensure the values match. Consider using a Directory.build.props file to set the property for all projects. Conflicting projects: {1}
tr: NETSDK1197: Birden çok çözüm projesi çakışan '{0}' değerleri içeriyor; değerlerin eşleştiğinden emin olun. Özelliği tüm projeler için ayarlamak için Directory.build.props dosyası kullanabilirsiniz. Çakışan projeler: {1}

# TargetFrameworkIsEol
source: NETSDK1138: The target framework '{0}' is out of support and will not receive security updates in the future. Please refer to {1} for more information about the support policy.
it: NETSDK1138: il framework di destinazione '{0}' non è più supportato e non riceverà aggiornamenti della sicurezza in futuro. Per altre informazioni sui criteri di supporto, vedere {1}.
tr: NETSDK1138: '{0}' hedef çerçevesi destek kapsamı dışında ve gelecekte güvenlik güncelleştirmeleri almayacak. Lütfen destek ilkesi hakkında daha fazla bilgi için şuraya bakın: {1}.

# TargetFrameworkIsNotRecommended
source: NETSDK1215: Targeting .NET Standard prior to 2.0 is no longer recommended. See {0} for more details.
tr: NETSDK1215: 2.0'dan önceki NET Standard sürümlerinin hedeflenmesi artık önerilmez. Daha fazla ayrıntı için bkz. {0}.

# TargetFrameworkWithSemicolon
source: NETSDK1046: The TargetFramework value '{0}' is not valid. To multi-target, use the 'TargetFrameworks' property instead.
it: NETSDK1046: il valore '{0}' di TargetFramework non è valido. Per impostare più destinazioni, usare la proprietà 'TargetFrameworks'.
pl: NETSDK1046: Wartość „{0}” elementu TargetFramework jest nieprawidłowa. Aby obsługiwać wiele środowisk docelowych, użyj zamiast tego właściwości TargetFrameworks.
tr: NETSDK1046: '{0}' TargetFramework değeri geçerli değil. Çoklu hedefleme için 'TargetFrameworks' özelliğini kullanın.

# TargetingApphostPackMissingCannotRestore
source: NETSDK1145: The {0} pack is not installed and NuGet package restore is not supported. Upgrade Visual Studio, remove global.json if it specifies a certain SDK version, and uninstall the newer SDK. For more options visit https://aka.ms/targeting-apphost-pack-missing Pack Type:{0}, Pack directory: {1}, targetframework: {2}, Pack PackageId: {3}, Pack Package Version: {4}
it: NETSDK1145: il pacchetto {0} non è installato e il ripristino del pacchetto NuGet non è supportato. Aggiornare Visual Studio, rimuovere global.json se specifica una determinata versione dell'SDK e disinstallare l'SDK più recente. Per altre opzioni, vedere https://aka.ms/targeting-apphost-pack-missing. Tipo del pacchetto: {0}. Directory del pacchetto: {1}. Framework di destinazione: {2}. ID pacchetto: {3}. Versione del pacchetto: {4}
tr: NETSDK1145: {0} paketi yüklü olmadığından NuGet paketinin geri yüklenmesi desteklenmiyor. Visual Studio'yu yükseltin, belirli bir SDK sürümünü belirtiyorsa global.json dosyasını kaldırın ve yeni SDK'yi kaldırın. Daha fazla seçenek için https://aka.ms/targeting-apphost-pack-missing adresini ziyaret edin. Paket Türü: {0}, Paket dizini: {1}, targetframework: {2}, Paket Kimliği: {3}, Paket Sürümü: {4}

# TargetingPackNeedsRestore
source: NETSDK1127: The targeting pack {0} is not installed. Please restore and try again.
it: NETSDK1127: il Targeting Pack {0} non è installato. Ripristinare e riprovare.
tr: NETSDK1127: {0} hedefleme paketi yüklü değil. Lütfen geri yükleyip yeniden deneyin.

# TargetingPackNotRestored_TransitiveDisabled
source: NETSDK1184: The Targeting Pack for FrameworkReference '{0}' was not available. This may be because DisableTransitiveFrameworkReferenceDownloads was set to true.
it: NETSDK1184: il Targeting Pack per FrameworkReference '{0}' non è disponibile. È possibile che DisableTransitiveFrameworkReferenceDownloads sia stato impostato su true.
tr: NETSDK1184: FrameworkReference '{0}' için Hedefleme Paketi bulunamadı. Bunun nedeni DisableTransitiveFrameworkReferenceDownloads değerinin true olarak ayarlanmış olması olabilir.

# TrimmingWindowsFormsIsNotSupported
source: NETSDK1175: Windows Forms is not supported or recommended with trimming enabled. Please go to https://aka.ms/dotnet-illink/windows-forms for more details.
it: NETSDK1175: quando il trimming è abilitato, Windows Form non è supportato o consigliato. Per altre informazioni, vedere https://aka.ms/dotnet-illink/windows-forms.
tr: NETSDK1175: Windows Forms, kırpmanın etkinleştirilmesi ile desteklenmiyor veya önerilmiyor. Daha fazla ayrıntı için lütfen https://aka.ms/dotnet-illink/windows-forms adresine gidin.

# TrimmingWpfIsNotSupported
source: NETSDK1168: WPF is not supported or recommended with trimming enabled. Please go to https://aka.ms/dotnet-illink/wpf for more details.
it: NETSDK1168: quando il trimming è abilitato, il WPF non è supportato o consigliato. Per altre informazioni, visitare https://aka.ms/dotnet-illink/wpf.
tr: NETSDK1168: WPF, kırpma etkin olduğunda desteklenmez veya önerilmez. Daha ayrıntılı bilgi için lütfen https://aka.ms/dotnet-illink/wpf adresine gidin.

# TypeLibraryDoesNotExist
source: NETSDK1172: The provided type library '{0}' does not exist.
it: NETSDK1172: la libreria dei tipi specificata '{0}' non esiste.
tr: NETSDK1172: Sağlanan tür kitaplığı '{0}' mevcut değil.

# UnableToFindResolvedPath
source: NETSDK1016: Unable to find resolved path for '{0}'.
it: NETSDK1016: il percorso risolto per '{0}' non è stato trovato.
pl: NETSDK1016: Nie można odnaleźć rozpoznanej ścieżki dla elementu „{0}”.
tr: NETSDK1016: '{0}' için çözümlenmiş yol bulunamıyor.

# UnableToUsePackageAssetsCache_Info
source: Unable to use package assets cache due to I/O error. This can occur when the same project is built more than once in parallel. Performance may be degraded, but the build result will not be impacted.
it: Non è possibile usare la cache delle risorse del pacchetto a causa dell'errore di I/O. Questo problema può verificarsi quando lo stesso progetto viene compilato più volte in parallelo. Può influire sulle prestazioni, ma non sul risultato della compilazione.
tr: G/Ç hatasından dolayı paket varlıkları önbelleği kullanılamıyor. Bu, aynı proje paralel olarak birden fazla kez derlendiği için oluşabilir. Performans düşebilir, ancak derleme sonucu etkilenmez.

# UnexpectedFileType
source: NETSDK1012: Unexpected file type for '{0}'. Type is both '{1}' and '{2}'.
it: NETSDK1012: tipo di file imprevisto per '{0}'. Il tipo è sia '{1}' che '{2}'.
pl: NETSDK1012: Nieoczekiwany typ pliku dla „{0}”. Typ to „{1}” oraz „{2}”.
tr: NETSDK1012: '{0}' için beklenmeyen dosya türü. Tür hem '{1}' hem de '{2}'.

# UnknownFrameworkReference
source: NETSDK1073: The FrameworkReference '{0}' was not recognized
it: NETSDK1073: l'elemento FrameworkReference '{0}' non è stato riconosciuto
pl: NETSDK1073: Nie rozpoznano elementu FrameworkReference „{0}”
tr: NETSDK1073: FrameworkReference '{0}' tanınmadı

# UnknownFrameworkReference_MauiEssentials
source: NETSDK1186: This project depends on Maui Essentials through a project or NuGet package reference, but doesn't declare that dependency explicitly. To build this project, you must set the UseMauiEssentials property to true (and install the Maui workload if necessary).
it: NETSDK1186: questo progetto dipende da Maui Essentials tramite un riferimento al progetto o al pacchetto NuGet, ma non dichiara questa dipendenza in modo esplicito. Per compilare questo progetto, è necessario impostare la proprietà UseMauiEssentials su true e, se necessario, installare il carico di lavoro Maui.
tr: NETSDK1186: Bu proje, bir proje veya bir NuGet paketi başvurusu aracılığıyla Maui Essentials'a bağımlı, ancak bu bağımlılığı açık olarak bildirmiyor. Bu projeyi derlemek için UseMauiEssentials özelliğini true olarak ayarlamalısınız (ve gerekirse Maui iş yükünü yüklemelisiniz).

# UnnecessaryWindowsDesktopSDK
source: NETSDK1137: It is no longer necessary to use the Microsoft.NET.Sdk.WindowsDesktop SDK. Consider changing the Sdk attribute of the root Project element to 'Microsoft.NET.Sdk'.
it: NETSDK1137: non è più necessario usare Microsoft.NET.Sdk.WindowsDesktop SDK. Provare a modificare l'attributo Sdk dell'elemento Project radice in 'Microsoft.NET.Sdk'.
tr: NETSDK1137: Artık Microsoft.NET.Sdk.WindowsDesktop SDK'sinin kullanılması gerekmiyor. Kök proje öğesinin Sdk özniteliğini 'Microsoft.NET.Sdk' olarak değiştirmeyi düşünün.

# UnrecognizedPreprocessorToken
source: NETSDK1009: Unrecognized preprocessor token '{0}' in '{1}'.
it: NETSDK1009: token di preprocessore '{0}' non riconosciuto in '{1}'.
pl: NETSDK1009: Nierozpoznany token preprocesora „{0}” w elemencie „{1}”.
tr: NETSDK1009: '{1}' içinde tanınmayan '{0}' ön işlemci belirteci.

# UnresolvedTargetingPack
source: NETSDK1081: The targeting pack for {0} was not found. You may be able to resolve this by running a NuGet restore on the project.
it: NETSDK1081: il pacchetto di destinazione per {0} non è stato trovato. Per risolvere il problema, eseguire un ripristino NuGet sul progetto.
pl: NETSDK1081: Nie odnaleziono pakietu Targeting Pack dla elementu {0}. Uruchomienie przywracania w rozwiązaniu NuGet w projekcie może rozwiązać ten problem.
tr: NETSDK1081: {0} için hedefleme paketi bulunamadı. Bunu çözmek için projede bir NuGet geri yüklemesi çalıştırmayı deneyebilirsiniz.

# UnsupportedFramework
source: NETSDK1019: {0} is an unsupported framework.
it: NETSDK1019: {0} è un framework non supportato.
pl: NETSDK1019: {0} to nieobsługiwana platforma.
tr: NETSDK1019: {0} çerçevesi desteklenmiyor.
