Repository: dotnet/sdk
Catalog: src/Tasks/Common/Resources/xlf/Strings.*.xlf
Languages: it, pl, tr

# ChoosingPlatformItem_Info
source: Choosing '{0}' because it is a platform item.
it: Verrà scelto '{0}' perché è un elemento della piattaforma.
tr: Platform öğesi olduğundan '{0}' seçiliyor.

# ChoosingPreferredPackage_Info
source: Choosing '{0}' because it comes from a package that is preferred.
it: Verrà scelto '{0}' perché proviene da un pacchetto preferito.
tr: Tercih edilen bir paketten geldiğinden '{0}' seçiliyor.

# ClsidMapConflictingGuids
source: NETSDK1089: The '{0}' and '{1}' types have the same CLSID '{2}' set in their GuidAttribute. Each COMVisible class needs to have a distinct guid for their CLSID.
it: NETSDK1089: per i tipi '{0}' e '{1}' è impostato lo stesso CLSID '{2}' nel relativo elemento GuidAttribute. Ogni classe COMVisible deve includere un GUID distinto per il CLSID.
pl: NETSDK1089: Typy „{0}” i „{1}” mają ustawiony ten sam identyfikator CLSID „{2}” w ich atrybucie GuidAttribute. Każda klasa COMVisible musi mieć unikatowe identyfikatory GUID dla swojego identyfikatora CLSID.
tr: NETSDK1089: '{0}' ve '{1}' türlerinin GuidAttribute özniteliğinde aynı CLSID '{2}' değeri ayarlı. Her COMVisible sınıfının kendi CLSID'si için özgün bir GUID değeri olmalıdır.

# ClsidMapExportedTypesRequireExplicitGuid
source: NETSDK1088: The COMVisible class '{0}' must have a GuidAttribute with the CLSID of the class to be made visible to COM in .NET Core.
it: NETSDK1088: la classe COMVisible '{0}' deve includere un elemento GuidAttribute con il CLSID della classe da rendere visibile per COM in .NET Core.
pl: NETSDK1088: Klasa COMVisible „{0}” musi mieć atrybut GuidAttribute z identyfikatorem CLSID klasy, aby była widoczna dla hosta COM w programie .NET Core.
tr: NETSDK1088: '{0}' adlı COMVisible sınıfının bir GuidAttribute'u olmalı ve sınıfın CLSID değeri .NET Core'da COM için görünür hale getirilmelidir.

# ClsidMapInvalidAssembly
source: NETSDK1090: The supplied assembly '{0}' is not valid. Cannot generate a CLSIDMap from it.
it: NETSDK1090: l'assembly specificato '{0}' non è valido. Non può essere usato per generare un elemento CLSIDMap.
pl: NETSDK1090: Podany zestaw „{0}” jest nieprawidłowy. Nie można wygenerować elementu CLSIDMap na jego podstawie.
tr: NETSDK1090: Sağlanan '{0}' adlı derleme geçerli değil. Bundan bir CLSIDMap oluşturulamıyor.

# CompressionInSingleFileRequires60
source: NETSDK1167: Compression in a single file bundle is only supported when publishing for .NET6 or higher.
it: NETSDK1167: la compressione in un unico bundle di file è supportata solo quando si esegue la pubblicazione per .NET6 o versioni successive.
tr: NETSDK1167: Tek bir dosya paketi halinde sıkıştırma yalnızca .NET6 veya üzeri sürümler için yayımlanırken desteklenir.

# CompressionInSingleFileRequiresSelfContained
source: NETSDK1176: Compression in a single file bundle is only supported when publishing a self-contained application.
it: NETSDK1176: la compressione in un unico bundle di file è supportata solo quando si esegue la pubblicazione di un'applicazione indipendente.
tr: NETSDK1176: Tek bir dosya paket grubu halinde sıkıştırma yalnızca bağımsız çalışan bir uygulama yayımlanırken desteklenir.

# ConflictingRuntimePackInformation
source: NETSDK1133: There was conflicting information about runtime packs available for {0}: {1}
it: NETSDK1133: sono presenti informazioni in conflitto sui pacchetti di runtime disponibili per {0}: {1}
tr: NETSDK1133: {0} için kullanılabilir çalışma zamanı paketleriyle ilgili çakışan bilgiler vardı: {1}

# ContentItemDoesNotProvideOutputPath
source: NETSDK1014: Content item for '{0}' sets '{1}', but does not provide '{2}' or '{3}'.
it: NETSDK1014: l'elemento di contenuto per '{0}' imposta '{1}', ma non fornisce '{2}' o '{3}'.
pl: NETSDK1014: Element zawartości dla elementu „{0}” ustawia wartość „{1}”, ale nie zapewnia wartości „{2}” ani „{3}”.
tr: NETSDK1014: '{0}' için içerik öğesi, '{1}' değerini ayarlıyor ancak '{2}' veya '{3}' sağlamıyor.

# ContentPreproccessorParameterRequired
source: NETSDK1010: The '{0}' task must be given a value for parameter '{1}' in order to consume preprocessed content.
it: NETSDK1010: per poter utilizzare il contenuto pre-elaborato, è necessario assegnare un valore per il parametro '{1}' nell'attività '{0}'.
pl: NETSDK1010: Dla zadania „{0}” musi zostać podana wartość parametru „{1}” w celu użycia wstępnie przetworzonej zawartości.
tr: NETSDK1010: Önceden işlenen içeriği kullanabilmesi için '{0}' görevine, '{1}' parametresine ilişkin bir değer verilmelidir.

# CouldNotDetermineWinner_DoesNotExist_Info
source: Could not determine winner because '{0}' does not exist.
it: Non è stato possibile determinare la versione da usare perché '{0}' non esiste.
tr: '{0}' mevcut olmadığından kazanan belirlenemedi.

# CouldNotDetermineWinner_EqualVersions_Info
source: Could not determine winner due to equal file and assembly versions.
it: Non è stato possibile determinare la versione da usare perché le versioni dell'assembly e del file sono uguali.
tr: Eşit dosya ve bütünleştirilmiş kod sürümleri nedeniyle kazanan belirlenemedi.

# CouldNotDetermineWinner_NoFileVersion_Info
source: Could not determine a winner because '{0}' has no file version.
it: Non è stato possibile determinare la versione da usare perché non esiste alcuna versione del file per '{0}'.
tr: '{0}' dosya sürümüne sahip olmadığından kazanan belirlenemedi.

# CouldNotDetermineWinner_NotAnAssembly_Info
source: Could not determine a winner because '{0}' is not an assembly.
it: Non è stato possibile determinare la versione da usare perché '{0}' non è un assembly.
tr: '{0}' bütünleştirilmiş kod olmadığından kazanan belirlenemedi.

# CouldNotGetPackVersionFromWorkloadManifests
source: NETSDK1181: Error getting pack version: Pack '{0}' was not present in workload manifests.
it: NETSDK1181: errore durante il recupero della versione del pacchetto: il pacchetto '{0}' non era presente nei manifesti del carico di lavoro.
tr: NETSDK1181: Paket sürümü alınırken hata oluştu. '{0}' paketi iş yükü bildirimlerinde yoktu.

# CouldNotLoadPlatformManifest
source: NETSDK1042: Could not load PlatformManifest from '{0}' because it did not exist.
it: NETSDK1042: non è stato possibile caricare PlatformManifest da '{0}' perché non esiste.
pl: NETSDK1042: Nie można załadować elementu PlatformManifest z lokalizacji „{0}”, ponieważ ta lokalizacja nie istnieje.
tr: NETSDK1042: '{0}' mevcut olmadığından buradan PlatformManifest yüklenemedi.

# CppRequiresTFMVersion31
source: NETSDK1120: C++/CLI projects targeting .NET Core require a target framework of at least 'netcoreapp3.1'.
it: NETSDK1120: con i progetti C++/CLI destinati a .NET Core è il framework di destinazione deve essere impostato almeno su 'netcoreapp3.1'.
tr: NETSDK1120: .NET Core'u hedefleyen C++/CLI projeleri için hedef Framework en az 'netcoreapp 3.1' olmalıdır.

# Crossgen2MissingRequiredMetadata
source: NETSDK1158: Required '{0}' metadata missing on Crossgen2Tool item.
it: NETSDK1158: nell'elemento Crossgen2Tool mancano i metadati richiesti di '{0}'.
tr: NETSDK1158: Crossgen2Tool öğesinde gerekli '{0}' meta verisi eksik.

# Crossgen2RequiresSelfContained
source: NETSDK1126: Publishing ReadyToRun using Crossgen2 is only supported for self-contained applications.
it: NETSDK1126: la pubblicazione di ReadyToRun tramite Crossgen2 è supportata solo per le applicazioni autonome.
tr: NETSDK1126: Crossgen2 kullanarak ReadyToRun yayımlama, yalnızca kendi içinde uygulamalar için desteklenir.

# Crossgen2ToolExecutableNotFound
source: NETSDK1155: Crossgen2Tool executable '{0}' not found.
it: NETSDK1155: l'eseguibile '{0}' di Crossgen2Tool non è stato trovato.
tr: NETSDK1155: Crossgen2Tool ile çalıştırılabilir '{0}' bulunamadı.

# Crossgen2ToolMissingWhenUseCrossgen2IsSet
source: NETSDK1154: Crossgen2Tool must be specified when UseCrossgen2 is set to true.
it: NETSDK1154: è necessario specificare Crossgen2Tool quando UseCrossgen2 è impostato su true.
tr: NETSDK1154: Crossgen2Tool, UseCrossgen2 true olarak ayarlandığında belirtilmelidir.

# Crossgen5CannotEmitSymbolsInCompositeMode
source: NETSDK1166: Cannot emit symbols when publishing for .NET 5 with Crossgen2 using composite mode.
it: NETSDK1166: non è possibile creare simboli durante la pubblicazione per .NET 5 con Crossgen2 usando la modalità composita.
tr: NETSDK1166: Bileşik modu kullanarak .NET 5 için Crossgen2 ile yayımlanırken semboller yayılamıyor.

# CrossgenToolExecutableNotFound
source: NETSDK1160: CrossgenTool executable '{0}' not found.
it: NETSDK1160: l'eseguibile '{0}' di CrossgenTool non è stato trovato.
tr: NETSDK1160: CrossgenTool ile çalıştırılabilir '{0}' bulunamadı.

# CrossgenToolMissingInPDBCompilationMode
source: NETSDK1153: CrossgenTool not specified in PDB compilation mode.
it: NETSDK1153: CrossgenTool non è stato specificato nella modalità di compilazione PDB.
tr: NETSDK1153: CrossgenTool, PDB derleme modunda belirtilmedi.

# CrossgenToolMissingWhenUseCrossgen2IsNotSet
source: NETSDK1159: CrossgenTool must be specified when UseCrossgen2 is set to false.
it: NETSDK1159: è necessario specificare CrossgenTool quando UseCrossgen2 è impostato su false.
tr: NETSDK1159: UseCrossgen2 false olarak ayarlandığında CrossgenTool belirtilmelidir.

# DiaSymReaderLibraryNotFound
source: NETSDK1161: DiaSymReader library '{0}' not found.
it: NETSDK1161: la libreria '{0}' di DiaSymReader non è stata trovata.
tr: NETSDK1161: DiaSymReader kitaplığı '{0}' bulunamadı.

# DotNetHostExecutableNotFound
source: NETSDK1156: .NET host executable '{0}' not found.
it: NETSDK1156: l'eseguibile '{0}' dell'host .NET non è stato trovato.
tr: NETSDK1156: .NET konak yürütülebilir dosyası '{0}' bulunamadı.

# DotnetToolDoesNotSupportTFMLowerThanNetcoreapp21
source: NETSDK1055: DotnetTool does not support target framework lower than netcoreapp2.1.
it: NETSDK1055: DotnetTool non supporta framework di destinazione di versioni precedenti a netcoreapp2.1.
pl: NETSDK1055: Narzędzie DotnetTool nie obsługuje docelowej struktury w wersji niższej niż netcoreapp2.1.
tr: NETSDK1055: DotnetTool, netcoreapp2.1’den daha düşük hedef çerçeveleri desteklemez.

# DotnetToolOnlySupportNetcoreapp
source: NETSDK1054: only supports .NET Core.
it: NETSDK1054: supporta solo .NET Core.
pl: NETSDK1054: obsługuje tylko platformę .NET Core.
tr: NETSDK1054: Yalnızca .NET Core desteklenir.

# DuplicateItemsError
source: NETSDK1022: Duplicate '{0}' items were included. The .NET SDK includes '{0}' items from your project directory by default. You can either remove these items from your project file, or set the '{1}' property to '{2}' if you want to explicitly include them in your project file. For more information, see {4}. The duplicate items were: {3}
it: NETSDK1022: sono stati inclusi '{0}' elementi duplicati. Per impostazione predefinita, .NET SDK include '{0}' elementi della directory del progetto. È possibile rimuovere tali elementi dal file di progetto oppure impostare la proprietà '{1}' su '{2}' se si vuole includerli implicitamente nel file di progetto. Per altre informazioni, vedere {4}. Gli elementi duplicati sono: {3}
pl: NETSDK1022: Zostały uwzględnione zduplikowane elementy „{0}”. Zestaw .NET SDK dołącza domyślnie elementy „{0}” z katalogu projektu. Możesz usunąć te elementy z pliku projektu lub ustawić dla właściwości „{1}” wartość „{2}”, aby jawnie uwzględnić je w pliku projektu.Aby uzyskać więcej informacji, zobacz {4}. Zduplikowane elementy: {3}
tr: NETSDK1022: Yinelenen '{0}' öğeleri eklendi. .NET SDK, proje dizininizdeki '{0}' öğelerini varsayılan olarak içeriyor. Bu öğeleri proje dosyanızdan kaldırabilir veya bunları proje dosyanıza açıkça dahil etmek istiyorsanız '{1}' özelliğini '{2}' olarak ayarlayabilirsiniz. Daha fazla bilgi için bkz. {4}. Yinelenen öğeler: {3}

# DuplicatePreprocessorToken
source: NETSDK1015: The preprocessor token '{0}' has been given more than one value. Choosing '{1}' as the value.
it: NETSDK1015: al token di preprocessore '{0}' è stato assegnato più di un valore. Come valore verrà scelto '{1}'.
pl: NETSDK1015: Dla tokenu preprocesora „{0}” podano więcej niż jedną wartość. Wybieranie elementu „{1}” jako wartości.
tr: NETSDK1015: '{0}' ön işlemci belirtecine birden fazla değer verildi. Değer olarak '{1}' seçiliyor.

# DuplicatePublishOutputFiles
source: NETSDK1152: Found multiple publish output files with the same relative path: {0}.
it: NETSDK1152: sono stati trovati più file di output di pubblicazione con lo stesso percorso relativo: {0}.
tr: NETSDK1152: Aynı göreli yola sahip birden çok yayımlama çıkış dosyası bulundu: {0}.

# DuplicateRuntimePackAsset
source: NETSDK1110: More than one asset in the runtime pack has the same destination sub-path of '{0}'. Report this error to the .NET team here: https://aka.ms/dotnet-sdk-issue.
it: NETSDK1110: più di un asset nel pacchetto di runtime ha lo stesso percorso secondario di destinazione di '{0}'. Segnalare questo errore al team di .NET all'indirizzo: https://aka.ms/dotnet-sdk-issue.
tr: NETSDK1110: Çalışma zamanı paketindeki birden fazla varlık, aynı '{0}' hedef alt yoluna sahip. Bu hatayı https://aka.ms/dotnet-sdk-issue adresinden .NET ekibine bildirin.

# DuplicateTypeLibraryIds
source: NETSDK1169: The same resource ID {0} was specified for two type libraries '{1}' and '{2}'. Duplicate type library IDs are not allowed.
it: NETSDK1169: è stato specificato lo stesso ID di risorsa {0} per due librerie dei tipi '{1}' e '{2}'. Gli ID della libreria dei tipi duplicati non sono consentiti.
tr: NETSDK1169: '{1}' ve '{2}' tür kitaplıkları için {0} şeklinde aynı kaynak kimliği belirtildi. Yinelenen tür kitaplığı kimliklerine izin verilmez.

# EnableSingleFileAnalyzerUnsupported
source: NETSDK1211: EnableSingleFileAnalyzer is not supported for the target framework. Consider multi-targeting to a supported framework to enable single-file analysis, and set EnableSingleFileAnalyzer only for the supported frameworks. For example: <EnableSingleFileAnalyzer Condition="$([MSBuild]::IsTargetFrameworkCompatible('$(TargetFramework)', '{0}'))">true</EnableSingleFileAnalyzer>
tr: NETSDK1211: EnableSingleFileAnalyzer hedef altyapı için desteklenmiyor. Tek dosya analizini etkinleştirmek için desteklenen bir altyapıya çoklu hedeflemeyi kullanabilir ve EnableSingleFileAnalyzer ayarını yalnızca desteklenen altyapılar için yapabilirsiniz. Örneğin: <EnableSingleFileAnalyzer Condition="$([MSBuild]::IsTargetFrameworkCompatible('$(TargetFramework)', '{0}'))">true</EnableSingleFileAnalyzer>

# EncounteredConflict_Info
source: Encountered conflict between '{0}' and '{1}'.
it: È stato rilevato un conflitto tra '{0}' e '{1}'.
tr: '{0}' ile '{1}' arasında çakışmayla karşılaşıldı.

# ErrorParsingFrameworkListInvalidValue
source: NETSDK1051: Error parsing FrameworkList from '{0}'. {1} '{2}' was invalid.
it: NETSDK1051: si è verificato un errore durante l'analisi di FrameworkList da '{0}'. {1} '{2}' non è valido.
pl: NETSDK1051: Błąd analizowania elementu FrameworkList z elementu „{0}”. Element {1} „{2}” był nieprawidłowy.
tr: NETSDK1051: '{0}' öğesinden FrameworkList ayrıştırılırken hata oluştu. {1} '{2}' geçersizdi.

# ErrorParsingPlatformManifest
source: NETSDK1043: Error parsing PlatformManifest from '{0}' line {1}. Lines must have the format {2}.
it: NETSDK1043: si è verificato un errore durante l'analisi di PlatformManifest da '{0}' a riga {1}. Il formato delle righe deve essere {2}.
pl: NETSDK1043: Wystąpił błąd podczas analizowania elementu PlatformManifest w wierszu „{0}” {1}. Wiersze muszą mieć format {2}.
tr: NETSDK1043: '{0}' içindeki {1}. satırdan PlatformManifest ayrıştırılırken hata oluştu. Satırlar {2} biçiminde olmalıdır.

# ErrorParsingPlatformManifestInvalidValue
source: NETSDK1044: Error parsing PlatformManifest from '{0}' line {1}. {2} '{3}' was invalid.
it: NETSDK1044: si è verificato un errore durante l'analisi di PlatformManifest da '{0}' a riga {1}. Il valore {2} '{3}' non è valido.
pl: NETSDK1044: Wystąpił błąd podczas analizowania elementu PlatformManifest w wierszu „{0}” {1}. Element {2} „{3}” jest nieprawidłowy.
tr: NETSDK1044: '{0}' konumundaki {1}. satırdan PlatformManifest ayrıştırılırken hata oluştu. {2} '{3}' geçersizdi.

# ErrorReadingAssetsFile
source: NETSDK1060: Error reading assets file: {0}
it: NETSDK1060: errore durante la lettura del file di asset: {0}
pl: NETSDK1060: Błąd podczas odczytywania pliku zasobów: {0}
tr: NETSDK1060: Varlıklar dosyası okunurken hata: {0}

# FailedToDeleteApphost
source: NETSDK1111: Failed to delete output apphost: {0}
it: NETSDK1111: non è stato possibile eliminare l'apphost di output: {0}
tr: NETSDK1111: {0} adlı çıkış apphost'u silinemedi

# FailedToLockResource
source: NETSDK1077: Failed to lock resource.
it: NETSDK1077: non è stato possibile bloccare la risorsa.
pl: NETSDK1077: Nie można zablokować zasobu.
tr: NETSDK1077: Kaynak kilitlenemedi.

# FileNameIsTooLong
source: NETSDK1030: Given file name '{0}' is longer than 1024 bytes
it: NETSDK1030: il nome file specificato '{0}' supera 1024 byte
pl: NETSDK1030: Podana nazwa pliku „{0}” jest dłuższa niż 1024 bajty
tr: NETSDK1030: Belirtilen dosya adı ('{0}') 1024 bayttan uzun

# FolderAlreadyExists
source: NETSDK1024: Folder '{0}' already exists either delete it or provide a different ComposeWorkingDir
it: NETSDK1024: la cartella '{0}' esiste già. Eliminarla o specificare un elemento ComposeWorkingDir diverso
pl: NETSDK1024: Folder „{0}” już istnieje. Usuń go lub podaj inny katalog roboczy tworzenia (ComposeWorkingDir)
tr: NETSDK1024: '{0}' klasörü zaten var. Klasörü silin veya farklı bir ComposeWorkingDir değeri belirtin

# FrameworkDependentAppHostRequiresVersion21
source: NETSDK1068: The framework-dependent application host requires a target framework of at least 'netcoreapp2.1'.
it: NETSDK1068: con l'host applicazione dipendente dal framework il framework di destinazione deve essere impostato almeno su 'netcoreapp2.1'.
pl: NETSDK1068: Host aplikacji zależnych od platformy wymaga co najmniej platformy docelowej „netcoreapp2.1”.
tr: NETSDK1068: Çerçeveye bağımlı uygulama konağı, en az 'netcoreapp2.1' sürümünde bir hedef çerçeve gerektirir.

# FrameworkListPathNotRooted
source: NETSDK1052: Framework list file path '{0}' is not rooted. Only full paths are supported.
it: NETSDK1052: il percorso '{0}' del file dell'elenco di framework non contiene una radice. Sono supportati solo percorsi completi.
pl: NETSDK1052: Ścieżka pliku z listą struktur „{0}” nie zaczyna się od katalogu głównego. Obsługiwane są tylko pełne ścieżki.
tr: NETSDK1052: '{0}' çerçeve listesi dosya yolunun kökü belirtilmemiş. Yalnızca tam yollar desteklenir.

# FrameworkReferenceDuplicateError
source: NETSDK1087: Multiple FrameworkReference items for '{0}' were included in the project.
it: NETSDK1087: nel progetto sono stati inclusi più elementi FrameworkReference per '{0}'.
pl: NETSDK1087: Wiele elementów FrameworkReference dla obiektu „{0}” zostało uwzględnionych w projekcie.
tr: NETSDK1087: Projeye '{0}' için birden çok FrameworkReference öğesi dahil edildi.

# FrameworkReferenceOverrideWarning
source: NETSDK1086: A FrameworkReference for '{0}' was included in the project. This is implicitly referenced by the .NET SDK and you do not typically need to reference it from your project. For more information, see {1}
it: NETSDK1086: nel progetto è stato incluso un elemento FrameworkReference per '{0}'. Questo elemento viene usato come riferimento implicito da .NET SDK e non è in genere necessario farvi riferimento dal progetto. Per altre informazioni, vedere {1}
pl: NETSDK1086: Odwołanie FrameworkReference dla elementu „{0}” zostało uwzględnione w projekcie. Jest on jawnie przywoływany przez zestaw .NET SDK i zwykle nie ma potrzeby tworzenia odwołania do niego z projektu. Aby uzyskać więcej informacji, zobacz {1}
tr: NETSDK1086: Projeye '{0}' için bir FrameworkReference dahil edildi. .NET SDK buna örtük olarak başvuruyor, ancak genellikle projenizden buna başvurmanız gerekmez. Daha fazla bilgi için bkz. {1}

# GetDependsOnNETStandardFailedWithException
source: NETSDK1049: Resolved file has a bad image, no metadata, or is otherwise inaccessible. {0} {1}
it: NETSDK1049: il file risolto ha un'immagine danneggiata, non contiene metadati o è inaccessibile per altri motivi. {0} {1}
pl: NETSDK1049: Rozpoznany plik ma nieprawidłowy obraz, nie ma metadanych lub jest w inny sposób niedostępny. {0} {1}
tr: NETSDK1049: Çözümlenen dosyada hatalı görüntü var, meta veri yok veya dosya erişilemez durumda. {0} {1}

# GlobalJsonSDKResolutionFailed
source: NETSDK1141: Unable to resolve the .NET SDK version as specified in the global.json located at {0}.
it: NETSDK1141: non è possibile risolvere la versione di .NET SDK come specificato nel file global.json presente in {0}.
tr: NETSDK1141: {0} konumundaki global.json'da belirtildiği şekilde .NET SDK sürümü çözümlenemiyor.

# ILLinkFailed
source: NETSDK1144: Optimizing assemblies for size failed.
tr: NETSDK1144: Derlemeler boyut için en iyi duruma getirilemedi.

# ILLinkNoValidRuntimePackageError
source: NETSDK1195: Trimming, or code compatibility analysis for trimming, single-file deployment, or ahead-of-time compilation is not supported for the target framework. For more information, see https://aka.ms/netsdk1195
tr: NETSDK1195: Hedef altyapı için kırpma veya kırpma için kod uyumluluk analizi, tek dosya dağıtımı veya önceden derleme desteklenmiyor. Daha fazla bilgi edinmek için bkz. https://aka.ms/netsdk1195

# ILLinkNotSupportedError
source: NETSDK1102: Optimizing assemblies for size is not supported for the selected publish configuration. Please ensure that you are publishing a self-contained app.
it: NETSDK1102: l'ottimizzazione degli assembly per le dimensioni non è supportata per la configurazione di pubblicazione selezionata. Assicurarsi di pubblicare un'app indipendente.
pl: NETSDK1102: Optymalizacja zestawów pod kątem rozmiaru nie jest obsługiwana w przypadku wybranej konfiguracji publikowania. Upewnij się, że publikujesz niezależną aplikację.
tr: NETSDK1102: Derlemeleri boyut için iyileştirme, seçilen yayımlama yapılandırması için desteklenmiyor. Lütfen kendi içinde bulunan bir uygulama yayımladığınızdan emin olun.

# ILLinkOptimizedAssemblies
source: Optimizing assemblies for size may change the behavior of the app. Be sure to test after publishing. See: https://aka.ms/dotnet-illink
it: L'ottimizzazione degli assembly per le dimensioni potrebbe comportare la modifica del comportamento dell'app. Assicurarsi di testarla dopo la pubblicazione. Vedere: https://aka.ms/dotnet-illink
tr: Bütünleştirilmiş kodların boyutunu iyileştirmek uygulamanın davranışını değiştirebilir. Yayımladıktan sonra test etmeyi unutmayın. Bkz. https://aka.ms/dotnet-illink

# ILLinkRunning
source: Optimizing assemblies for size. This process might take a while.
it: Ottimizzazione degli assembly per le dimensioni. Questo processo potrebbe richiedere del tempo.
tr: Derlemelerin boyutu iyileştiriliyor. Bu işlem biraz zaman alabilir.

# ImplicitRuntimeIdentifierResolutionForPublishPropertyFailed
source: NETSDK1191: A runtime identifier for the property '{0}' couldn't be inferred. Specify a rid explicitly.
it: NETSDK1191: non è stato possibile dedurre un identificatore di runtime per la proprietà '{0}'. Specificare un RID in modo esplicito.
tr: NETSDK1191: '{0}' özelliği için bir çalışma zamanı tanımlayıcısı çıkarılamadı. Açıkça bir çıkış belirtin.

# IncorrectPackageRoot
source: NETSDK1020: Package Root {0} was incorrectly given for Resolved library {1}
it: NETSDK1020: la radice {0} del pacchetto specificata per la libreria risolta {1} non è corretta
pl: NETSDK1020: Podano niepoprawny element główny pakietu {0} dla rozpoznanej biblioteki {1}
tr: NETSDK1020: {0} Paket Kökü, Çözümlenmiş {1} kitaplığı için yanlışlıkla verildi
